neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
typedef struct stc_bt_pwc_tmcr2_field
{
        __IO   uint8_t  CKS3                     :1;
        __IO   uint8_t  RESERVED2                :7;
} stc_bt_pwc_tmcr2_field_t;

typedef struct stc_bt_pwm_tmcr2_field
{
        __IO   uint8_t  CKS3                     :1;
        __IO   uint8_t  RESERVED4                :7;
} stc_bt_pwm_tmcr2_field_t;

typedef struct stc_bt_rt_tmcr2_field
{
        __IO   uint8_t  CKS3                     :1;
        __IO   uint8_t  RESERVED6                :6;
        __IO   uint8_t  GATE                     :1;
} stc_bt_rt_tmcr2_field_t;

/******************************************************************************
 ** BTIOSEL03_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_btiosel03_btsel0123_field
{
    union {
        struct {
            __IO   uint8_t  SEL01                :4;
            __IO   uint8_t  SEL23                :4;
        };
        struct {
            __IO   uint8_t  SEL010               :1;
            __IO   uint8_t  SEL011               :1;
            __IO   uint8_t  SEL012               :1;
            __IO   uint8_t  SEL013               :1;
            __IO   uint8_t  SEL230               :1;
            __IO   uint8_t  SEL231               :1;
            __IO   uint8_t  SEL232               :1;
            __IO   uint8_t  SEL233               :1;
        };
    };
} stc_btiosel03_btsel0123_field_t;

/******************************************************************************
 ** BTIOSEL47_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_btiosel47_btsel4567_field
{
    union {
        struct {
            __IO   uint8_t  SEL45                :4;
            __IO   uint8_t  SEL67                :4;
        };
        struct {
            __IO   uint8_t  SEL450               :1;
            __IO   uint8_t  SEL451               :1;
            __IO   uint8_t  SEL452               :1;
            __IO   uint8_t  SEL453               :1;
            __IO   uint8_t  SEL670               :1;
            __IO   uint8_t  SEL671               :1;
            __IO   uint8_t  SEL672               :1;
            __IO   uint8_t  SEL673               :1;
        };
    };
} stc_btiosel47_btsel4567_field_t;

/******************************************************************************
 ** BTIOSEL8B_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_btiosel8b_btsel89ab_field
{
    union {
        struct {
            __IO   uint8_t  SEL89                :4;
            __IO   uint8_t  SELAB                :4;
        };
        struct {
            __IO   uint8_t  SEL890               :1;
            __IO   uint8_t  SEL891               :1;
            __IO   uint8_t  SEL892               :1;
            __IO   uint8_t  SEL893               :1;
            __IO   uint8_t  SELAB0               :1;
            __IO   uint8_t  SELAB1               :1;
            __IO   uint8_t  SELAB2               :1;
            __IO   uint8_t  SELAB3               :1;
        };
    };
} stc_btiosel8b_btsel89ab_field_t;

/******************************************************************************
 ** BTIOSELCF_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_btioselcf_btselcdef_field
{
    union {
        struct {
            __IO   uint8_t  SELCD                :4;
            __IO   uint8_t  SELEF                :4;
        };
        struct {
            __IO   uint8_t  SELCD0               :1;
            __IO   uint8_t  SELCD1               :1;
            __IO   uint8_t  SELCD2               :1;
            __IO   uint8_t  SELCD3               :1;
            __IO   uint8_t  SELEF0               :1;
            __IO   uint8_t  SELEF1               :1;
            __IO   uint8_t  SELEF2               :1;
            __IO   uint8_t  SELEF3               :1;
        };
    };
} stc_btioselcf_btselcdef_field_t;

/******************************************************************************
 ** CAN_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_can_ctrlr_field
{
        __IO  uint16_t  INIT                     :1;
        __IO  uint16_t  IE                       :1;
        __IO  uint16_t  SIE                      :1;
        __IO  uint16_t  EIE                      :1;
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  DAR                      :1;
        __IO  uint16_t  CCE                      :1;
        __IO  uint16_t  TEST                     :1;
        __IO  uint16_t  RESERVED1                :8;
} stc_can_ctrlr_field_t;

typedef struct stc_can_statr_field
{
    union {
        struct {
            __IO  uint16_t  LEC                  :3;
            __IO  uint16_t  TXOK                 :1;
            __IO  uint16_t  RXOK                 :1;
            __IO  uint16_t  EPASS                :1;
            __IO  uint16_t  EWARN                :1;
            __IO  uint16_t  BOFF                 :1;
            __IO  uint16_t  RESERVED0            :8;
        };
        struct {
            __IO  uint16_t  LEC0                 :1;
            __IO  uint16_t  LEC1                 :1;
            __IO  uint16_t  LEC2                 :1;
            __IO  uint16_t  RESERVED1            :13;
        };
    };
} stc_can_statr_field_t;

typedef struct stc_can_errcnt_field
{
    union {
        struct {
            __IO  uint16_t  TEC                  :8;
            __IO  uint16_t  REC                  :7;
            __IO  uint16_t  RP                   :1;
        };
        struct {
            __IO  uint16_t  TEC0                 :1;
            __IO  uint16_t  TEC1                 :1;
            __IO  uint16_t  TEC2                 :1;
            __IO  uint16_t  TEC3                 :1;
            __IO  uint16_t  TEC4                 :1;
            __IO  uint16_t  TEC5                 :1;
            __IO  uint16_t  TEC6                 :1;
            __IO  uint16_t  TEC7                 :1;
            __IO  uint16_t  REC0                 :1;
            __IO  uint16_t  REC1                 :1;
            __IO  uint16_t  REC2                 :1;
            __IO  uint16_t  REC3                 :1;
            __IO  uint16_t  REC4                 :1;
            __IO  uint16_t  REC5                 :1;
            __IO  uint16_t  REC6                 :1;
            __IO  uint16_t  RESERVED0            :1;
        };
    };
} stc_can_errcnt_field_t;

typedef struct stc_can_btr_field
{
    union {
        struct {
            __IO  uint16_t  BRP                  :6;
            __IO  uint16_t  SJW                  :2;
            __IO  uint16_t  TSEG1                :4;
            __IO  uint16_t  TSEG2                :3;
            __IO  uint16_t  RESERVED0            :1;
        };
        struct {
            __IO  uint16_t  BRP0                 :1;
            __IO  uint16_t  BRP1                 :1;
            __IO  uint16_t  BRP2                 :1;
            __IO  uint16_t  BRP3                 :1;
            __IO  uint16_t  BRP4                 :1;
            __IO  uint16_t  BRP5                 :1;
            __IO  uint16_t  SJW0                 :1;
            __IO  uint16_t  SJW1                 :1;
            __IO  uint16_t  TSEG10               :1;
            __IO  uint16_t  TSEG11               :1;
            __IO  uint16_t  TSEG12               :1;
            __IO  uint16_t  TSEG13               :1;
            __IO  uint16_t  TSEG20               :1;
            __IO  uint16_t  TSEG21               :1;
            __IO  uint16_t  TSEG22               :1;
            __IO  uint16_t  RESERVED1            :1;
        };
    };
} stc_can_btr_field_t;

typedef struct stc_can_intr_field
{
    union {
        struct {
            __IO  uint16_t  INTID                :16;
        };
        struct {
            __IO  uint16_t  INTID0               :1;
            __IO  uint16_t  INTID1               :1;
            __IO  uint16_t  INTID2               :1;
            __IO  uint16_t  INTID3               :1;
            __IO  uint16_t  INTID4               :1;
            __IO  uint16_t  INTID5               :1;
            __IO  uint16_t  INTID6               :1;
            __IO  uint16_t  INTID7               :1;
            __IO  uint16_t  INTID8               :1;
            __IO  uint16_t  INTID9               :1;
            __IO  uint16_t  INTID10              :1;
            __IO  uint16_t  INTID11              :1;
            __IO  uint16_t  INTID12              :1;
            __IO  uint16_t  INTID13              :1;
            __IO  uint16_t  INTID14              :1;
            __IO  uint16_t  INTID15              :1;
        };
    };
} stc_can_intr_field_t;

typedef struct stc_can_testr_field
{
    union {
        struct {
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  BASIC                :1;
            __IO  uint16_t  SILENT               :1;
            __IO  uint16_t  LBACK                :1;
            __IO  uint16_t  TX                   :2;
            __IO  uint16_t  RX                   :1;
            __IO  uint16_t  RESERVED2            :8;
        };
        struct {
            __IO  uint16_t  RESERVED1            :5;
            __IO  uint16_t  TX0                  :1;
            __IO  uint16_t  TX1                  :1;
            __IO  uint16_t  RESERVED3            :9;
        };
    };
} stc_can_testr_field_t;

