neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
typedef struct stc_canfd_sidfc_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  FLSSA                :14;
            __IO  uint32_t  LSS                  :8;
            __IO  uint32_t  RESERVED2            :8;
        };
        struct {
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  FLSSA0               :1;
            __IO  uint32_t  FLSSA1               :1;
            __IO  uint32_t  FLSSA2               :1;
            __IO  uint32_t  FLSSA3               :1;
            __IO  uint32_t  FLSSA4               :1;
            __IO  uint32_t  FLSSA5               :1;
            __IO  uint32_t  FLSSA6               :1;
            __IO  uint32_t  FLSSA7               :1;
            __IO  uint32_t  FLSSA8               :1;
            __IO  uint32_t  FLSSA9               :1;
            __IO  uint32_t  FLSSA10              :1;
            __IO  uint32_t  FLSSA11              :1;
            __IO  uint32_t  FLSSA12              :1;
            __IO  uint32_t  FLSSA13              :1;
            __IO  uint32_t  LSS0                 :1;
            __IO  uint32_t  LSS1                 :1;
            __IO  uint32_t  LSS2                 :1;
            __IO  uint32_t  LSS3                 :1;
            __IO  uint32_t  LSS4                 :1;
            __IO  uint32_t  LSS5                 :1;
            __IO  uint32_t  LSS6                 :1;
            __IO  uint32_t  LSS7                 :1;
            __IO  uint32_t  RESERVED3            :8;
        };
    };
} stc_canfd_sidfc_field_t;

typedef struct stc_canfd_xidfc_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  FLESA                :14;
            __IO  uint32_t  LSE                  :7;
            __IO  uint32_t  RESERVED2            :9;
        };
        struct {
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  FLESA0               :1;
            __IO  uint32_t  FLESA1               :1;
            __IO  uint32_t  FLESA2               :1;
            __IO  uint32_t  FLESA3               :1;
            __IO  uint32_t  FLESA4               :1;
            __IO  uint32_t  FLESA5               :1;
            __IO  uint32_t  FLESA6               :1;
            __IO  uint32_t  FLESA7               :1;
            __IO  uint32_t  FLESA8               :1;
            __IO  uint32_t  FLESA9               :1;
            __IO  uint32_t  FLESA10              :1;
            __IO  uint32_t  FLESA11              :1;
            __IO  uint32_t  FLESA12              :1;
            __IO  uint32_t  FLESA13              :1;
            __IO  uint32_t  LSE0                 :1;
            __IO  uint32_t  LSE1                 :1;
            __IO  uint32_t  LSE2                 :1;
            __IO  uint32_t  LSE3                 :1;
            __IO  uint32_t  LSE4                 :1;
            __IO  uint32_t  LSE5                 :1;
            __IO  uint32_t  LSE6                 :1;
            __IO  uint32_t  RESERVED3            :9;
        };
    };
} stc_canfd_xidfc_field_t;

typedef struct stc_canfd_xidam_field
{
    union {
        struct {
            __IO  uint32_t  EIDM                 :29;
            __IO  uint32_t  RESERVED0            :3;
        };
        struct {
            __IO  uint32_t  EIDM0                :1;
            __IO  uint32_t  EIDM1                :1;
            __IO  uint32_t  EIDM2                :1;
            __IO  uint32_t  EIDM3                :1;
            __IO  uint32_t  EIDM4                :1;
            __IO  uint32_t  EIDM5                :1;
            __IO  uint32_t  EIDM6                :1;
            __IO  uint32_t  EIDM7                :1;
            __IO  uint32_t  EIDM8                :1;
            __IO  uint32_t  EIDM9                :1;
            __IO  uint32_t  EIDM10               :1;
            __IO  uint32_t  EIDM11               :1;
            __IO  uint32_t  EIDM12               :1;
            __IO  uint32_t  EIDM13               :1;
            __IO  uint32_t  EIDM14               :1;
            __IO  uint32_t  EIDM15               :1;
            __IO  uint32_t  EIDM16               :1;
            __IO  uint32_t  EIDM17               :1;
            __IO  uint32_t  EIDM18               :1;
            __IO  uint32_t  EIDM19               :1;
            __IO  uint32_t  EIDM20               :1;
            __IO  uint32_t  EIDM21               :1;
            __IO  uint32_t  EIDM22               :1;
            __IO  uint32_t  EIDM23               :1;
            __IO  uint32_t  EIDM24               :1;
            __IO  uint32_t  EIDM25               :1;
            __IO  uint32_t  EIDM26               :1;
            __IO  uint32_t  EIDM27               :1;
            __IO  uint32_t  EIDM28               :1;
            __IO  uint32_t  RESERVED1            :3;
        };
    };
} stc_canfd_xidam_field_t;

typedef struct stc_canfd_hpms_field
{
    union {
        struct {
            __IO  uint32_t  BIDX                 :6;
            __IO  uint32_t  MSI                  :2;
            __IO  uint32_t  FIDX                 :7;
            __IO  uint32_t  FLST                 :1;
            __IO  uint32_t  RESERVED0            :16;
        };
        struct {
            __IO  uint32_t  BIDX0                :1;
            __IO  uint32_t  BIDX1                :1;
            __IO  uint32_t  BIDX2                :1;
            __IO  uint32_t  BIDX3                :1;
            __IO  uint32_t  BIDX4                :1;
            __IO  uint32_t  BIDX5                :1;
            __IO  uint32_t  MSI0                 :1;
            __IO  uint32_t  MSI1                 :1;
            __IO  uint32_t  FIDX0                :1;
            __IO  uint32_t  FIDX1                :1;
            __IO  uint32_t  FIDX2                :1;
            __IO  uint32_t  FIDX3                :1;
            __IO  uint32_t  FIDX4                :1;
            __IO  uint32_t  FIDX5                :1;
            __IO  uint32_t  FIDX6                :1;
            __IO  uint32_t  RESERVED1            :17;
        };
    };
} stc_canfd_hpms_field_t;

typedef struct stc_canfd_ndat1_field
{
        __IO  uint32_t  ND0                      :1;
        __IO  uint32_t  ND1                      :1;
        __IO  uint32_t  ND2                      :1;
        __IO  uint32_t  ND3                      :1;
        __IO  uint32_t  ND4                      :1;
        __IO  uint32_t  ND5                      :1;
        __IO  uint32_t  ND6                      :1;
        __IO  uint32_t  ND7                      :1;
        __IO  uint32_t  ND8                      :1;
        __IO  uint32_t  ND9                      :1;
        __IO  uint32_t  ND10                     :1;
        __IO  uint32_t  ND11                     :1;
        __IO  uint32_t  ND12                     :1;
        __IO  uint32_t  ND13                     :1;
        __IO  uint32_t  ND14                     :1;
        __IO  uint32_t  ND15                     :1;
        __IO  uint32_t  ND16                     :1;
        __IO  uint32_t  ND17                     :1;
        __IO  uint32_t  ND18                     :1;
        __IO  uint32_t  ND19                     :1;
        __IO  uint32_t  ND20                     :1;
        __IO  uint32_t  ND21                     :1;
        __IO  uint32_t  ND22                     :1;
        __IO  uint32_t  ND23                     :1;
        __IO  uint32_t  ND24                     :1;
        __IO  uint32_t  ND25                     :1;
        __IO  uint32_t  ND26                     :1;
        __IO  uint32_t  ND27                     :1;
        __IO  uint32_t  ND28                     :1;
        __IO  uint32_t  ND29                     :1;
        __IO  uint32_t  ND30                     :1;
        __IO  uint32_t  ND31                     :1;
} stc_canfd_ndat1_field_t;

typedef struct stc_canfd_ndat2_field
{
        __IO  uint32_t  ND32                     :1;
        __IO  uint32_t  ND33                     :1;
        __IO  uint32_t  ND34                     :1;
        __IO  uint32_t  ND35                     :1;
        __IO  uint32_t  ND36                     :1;
        __IO  uint32_t  ND37                     :1;
        __IO  uint32_t  ND38                     :1;
        __IO  uint32_t  ND39                     :1;
        __IO  uint32_t  ND40                     :1;
        __IO  uint32_t  ND41                     :1;
        __IO  uint32_t  ND42                     :1;
        __IO  uint32_t  ND43                     :1;
        __IO  uint32_t  ND44                     :1;
        __IO  uint32_t  ND45                     :1;
        __IO  uint32_t  ND46                     :1;
        __IO  uint32_t  ND47                     :1;
        __IO  uint32_t  ND48                     :1;
        __IO  uint32_t  ND49                     :1;
        __IO  uint32_t  ND50                     :1;
        __IO  uint32_t  ND51                     :1;
        __IO  uint32_t  ND52                     :1;
        __IO  uint32_t  ND53                     :1;
        __IO  uint32_t  ND54                     :1;
        __IO  uint32_t  ND55                     :1;
        __IO  uint32_t  ND56                     :1;
        __IO  uint32_t  ND57                     :1;
        __IO  uint32_t  ND58                     :1;
        __IO  uint32_t  ND59                     :1;
        __IO  uint32_t  ND60                     :1;
        __IO  uint32_t  ND61                     :1;
        __IO  uint32_t  ND62                     :1;
        __IO  uint32_t  ND63                     :1;
} stc_canfd_ndat2_field_t;

typedef struct stc_canfd_rxf0c_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  F0SA                 :14;
            __IO  uint32_t  F0S                  :7;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  F0WM                 :7;
            __IO  uint32_t  F0OM                 :1;
        };
        struct {
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  F0SA0                :1;
            __IO  uint32_t  F0SA1                :1;
            __IO  uint32_t  F0SA2                :1;
            __IO  uint32_t  F0SA3                :1;
            __IO  uint32_t  F0SA4                :1;
            __IO  uint32_t  F0SA5                :1;
            __IO  uint32_t  F0SA6                :1;
            __IO  uint32_t  F0SA7                :1;
            __IO  uint32_t  F0SA8                :1;
            __IO  uint32_t  F0SA9                :1;
            __IO  uint32_t  F0SA10               :1;
            __IO  uint32_t  F0SA11               :1;
            __IO  uint32_t  F0SA12               :1;
            __IO  uint32_t  F0SA13               :1;
            __IO  uint32_t  F0S0                 :1;
            __IO  uint32_t  F0S1                 :1;
            __IO  uint32_t  F0S2                 :1;
            __IO  uint32_t  F0S3                 :1;
            __IO  uint32_t  F0S4                 :1;
            __IO  uint32_t  F0S5                 :1;
            __IO  uint32_t  F0S6                 :1;
            __IO  uint32_t  RESERVED3            :1;
            __IO  uint32_t  F0WM0                :1;
            __IO  uint32_t  F0WM1                :1;
            __IO  uint32_t  F0WM2                :1;
            __IO  uint32_t  F0WM3                :1;
            __IO  uint32_t  F0WM4                :1;
            __IO  uint32_t  F0WM5                :1;
            __IO  uint32_t  F0WM6                :1;
            __IO  uint32_t  RESERVED4            :1;
        };
    };
} stc_canfd_rxf0c_field_t;

typedef struct stc_canfd_rxf0s_field
{
    union {
        struct {
            __IO  uint32_t  F0FL                 :7;
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  F0GI                 :6;
            __IO  uint32_t  RESERVED2            :2;
            __IO  uint32_t  F0PI                 :6;
            __IO  uint32_t  RESERVED4            :2;
            __IO  uint32_t  F0F                  :1;
            __IO  uint32_t  RF0L                 :1;
            __IO  uint32_t  RESERVED5            :6;
        };
        struct {
            __IO  uint32_t  F0FL0                :1;
            __IO  uint32_t  F0FL1                :1;
            __IO  uint32_t  F0FL2                :1;
            __IO  uint32_t  F0FL3                :1;
            __IO  uint32_t  F0FL4                :1;
            __IO  uint32_t  F0FL5                :1;
            __IO  uint32_t  F0FL6                :1;
            __IO  uint32_t  RESERVED1            :1;
            __IO  uint32_t  F0GI0                :1;
            __IO  uint32_t  F0GI1                :1;
            __IO  uint32_t  F0GI2                :1;
            __IO  uint32_t  F0GI3                :1;
            __IO  uint32_t  F0GI4                :1;
            __IO  uint32_t  F0GI5                :1;
            __IO  uint32_t  RESERVED3            :2;
            __IO  uint32_t  F0PI0                :1;
            __IO  uint32_t  F0PI1                :1;
            __IO  uint32_t  F0PI2                :1;
            __IO  uint32_t  F0PI3                :1;
            __IO  uint32_t  F0PI4                :1;
            __IO  uint32_t  F0PI5                :1;
            __IO  uint32_t  RESERVED6            :10;
        };
    };
} stc_canfd_rxf0s_field_t;

