neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** HSSPI_MODULE
 ** 
 ******************************************************************************/
typedef struct stc_hsspi_mctrl_field
{
        __IO  uint32_t  MEN                      :1;
        __IO  uint32_t  CSEN                     :1;
        __IO  uint32_t  RESERVED0                :2;
        __IO  uint32_t  MES                      :1;
        __IO  uint32_t  SYNCON                   :1;
        __IO  uint32_t  RESERVED1                :26;
} stc_hsspi_mctrl_field_t;

typedef struct stc_hsspi_pcc0_field
{
    union {
        struct {
            __IO  uint32_t  CPHA                 :1;
            __IO  uint32_t  CPOL                 :1;
            __IO  uint32_t  ACES                 :1;
            __IO  uint32_t  RTM                  :1;
            __IO  uint32_t  SSPOL                :1;
            __IO  uint32_t  SS2CD                :2;
            __IO  uint32_t  SDIR                 :1;
            __IO  uint32_t  SENDIAN              :1;
            __IO  uint32_t  CDRS                 :7;
            __IO  uint32_t  SAFESYNC             :1;
            __IO  uint32_t  WRDSEL               :4;
            __IO  uint32_t  RDDSEL               :2;
            __IO  uint32_t  RESERVED3            :9;
        };
        struct {
            __IO  uint32_t  RESERVED0            :5;
            __IO  uint32_t  SS2CD0               :1;
            __IO  uint32_t  SS2CD1               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  CDRS0                :1;
            __IO  uint32_t  CDRS1                :1;
            __IO  uint32_t  CDRS2                :1;
            __IO  uint32_t  CDRS3                :1;
            __IO  uint32_t  CDRS4                :1;
            __IO  uint32_t  CDRS5                :1;
            __IO  uint32_t  CDRS6                :1;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  WRDSEL0              :1;
            __IO  uint32_t  WRDSEL1              :1;
            __IO  uint32_t  WRDSEL2              :1;
            __IO  uint32_t  WRDSEL3              :1;
            __IO  uint32_t  RDDSEL0              :1;
            __IO  uint32_t  RDDSEL1              :1;
            __IO  uint32_t  RESERVED4            :9;
        };
    };
} stc_hsspi_pcc0_field_t;

typedef struct stc_hsspi_pcc1_field
{
    union {
        struct {
            __IO  uint32_t  CPHA                 :1;
            __IO  uint32_t  CPOL                 :1;
            __IO  uint32_t  ACES                 :1;
            __IO  uint32_t  RTM                  :1;
            __IO  uint32_t  SSPOL                :1;
            __IO  uint32_t  SS2CD                :2;
            __IO  uint32_t  SDIR                 :1;
            __IO  uint32_t  SENDIAN              :1;
            __IO  uint32_t  CDRS                 :7;
            __IO  uint32_t  SAFESYNC             :1;
            __IO  uint32_t  WRDSEL               :4;
            __IO  uint32_t  RDDSEL               :2;
            __IO  uint32_t  RESERVED3            :9;
        };
        struct {
            __IO  uint32_t  RESERVED0            :5;
            __IO  uint32_t  SS2CD0               :1;
            __IO  uint32_t  SS2CD1               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  CDRS0                :1;
            __IO  uint32_t  CDRS1                :1;
            __IO  uint32_t  CDRS2                :1;
            __IO  uint32_t  CDRS3                :1;
            __IO  uint32_t  CDRS4                :1;
            __IO  uint32_t  CDRS5                :1;
            __IO  uint32_t  CDRS6                :1;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  WRDSEL0              :1;
            __IO  uint32_t  WRDSEL1              :1;
            __IO  uint32_t  WRDSEL2              :1;
            __IO  uint32_t  WRDSEL3              :1;
            __IO  uint32_t  RDDSEL0              :1;
            __IO  uint32_t  RDDSEL1              :1;
            __IO  uint32_t  RESERVED4            :9;
        };
    };
} stc_hsspi_pcc1_field_t;

typedef struct stc_hsspi_pcc2_field
{
    union {
        struct {
            __IO  uint32_t  CPHA                 :1;
            __IO  uint32_t  CPOL                 :1;
            __IO  uint32_t  ACES                 :1;
            __IO  uint32_t  RTM                  :1;
            __IO  uint32_t  SSPOL                :1;
            __IO  uint32_t  SS2CD                :2;
            __IO  uint32_t  SDIR                 :1;
            __IO  uint32_t  SENDIAN              :1;
            __IO  uint32_t  CDRS                 :7;
            __IO  uint32_t  SAFESYNC             :1;
            __IO  uint32_t  WRDSEL               :4;
            __IO  uint32_t  RDDSEL               :2;
            __IO  uint32_t  RESERVED3            :9;
        };
        struct {
            __IO  uint32_t  RESERVED0            :5;
            __IO  uint32_t  SS2CD0               :1;
            __IO  uint32_t  SS2CD1               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  CDRS0                :1;
            __IO  uint32_t  CDRS1                :1;
            __IO  uint32_t  CDRS2                :1;
            __IO  uint32_t  CDRS3                :1;
            __IO  uint32_t  CDRS4                :1;
            __IO  uint32_t  CDRS5                :1;
            __IO  uint32_t  CDRS6                :1;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  WRDSEL0              :1;
            __IO  uint32_t  WRDSEL1              :1;
            __IO  uint32_t  WRDSEL2              :1;
            __IO  uint32_t  WRDSEL3              :1;
            __IO  uint32_t  RDDSEL0              :1;
            __IO  uint32_t  RDDSEL1              :1;
            __IO  uint32_t  RESERVED4            :9;
        };
    };
} stc_hsspi_pcc2_field_t;

typedef struct stc_hsspi_pcc3_field
{
    union {
        struct {
            __IO  uint32_t  CPHA                 :1;
            __IO  uint32_t  CPOL                 :1;
            __IO  uint32_t  ACES                 :1;
            __IO  uint32_t  RTM                  :1;
            __IO  uint32_t  SSPOL                :1;
            __IO  uint32_t  SS2CD                :2;
            __IO  uint32_t  SDIR                 :1;
            __IO  uint32_t  SENDIAN              :1;
            __IO  uint32_t  CDRS                 :7;
            __IO  uint32_t  SAFESYNC             :1;
            __IO  uint32_t  WRDSEL               :4;
            __IO  uint32_t  RDDSEL               :2;
            __IO  uint32_t  RESERVED3            :9;
        };
        struct {
            __IO  uint32_t  RESERVED0            :5;
            __IO  uint32_t  SS2CD0               :1;
            __IO  uint32_t  SS2CD1               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  CDRS0                :1;
            __IO  uint32_t  CDRS1                :1;
            __IO  uint32_t  CDRS2                :1;
            __IO  uint32_t  CDRS3                :1;
            __IO  uint32_t  CDRS4                :1;
            __IO  uint32_t  CDRS5                :1;
            __IO  uint32_t  CDRS6                :1;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  WRDSEL0              :1;
            __IO  uint32_t  WRDSEL1              :1;
            __IO  uint32_t  WRDSEL2              :1;
            __IO  uint32_t  WRDSEL3              :1;
            __IO  uint32_t  RDDSEL0              :1;
            __IO  uint32_t  RDDSEL1              :1;
            __IO  uint32_t  RESERVED4            :9;
        };
    };
} stc_hsspi_pcc3_field_t;

typedef struct stc_hsspi_txf_field
{
        __IO  uint32_t  TFFS                     :1;
        __IO  uint32_t  TFES                     :1;
        __IO  uint32_t  TFOS                     :1;
        __IO  uint32_t  TFUS                     :1;
        __IO  uint32_t  TFLETS                   :1;
        __IO  uint32_t  TFMTS                    :1;
        __IO  uint32_t  TSSRS                    :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_hsspi_txf_field_t;

