neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** I2S_MODULE
 ** 
 **   register structur
 ******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t RXFDAT;
        stc_i2s_rxfdat_field_t RXFDAT_f;
        struct {
          union {
            __IO uint16_t RXFDATL;
            struct {
              __IO uint8_t RXFDATLL;
              __IO uint8_t RXFDATLH;
            };
          };
          union {
            __IO uint16_t RXFDATH;
            struct {
              __IO uint8_t RXFDATHL;
              __IO uint8_t RXFDATHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFDAT;
        stc_i2s_txfdat_field_t TXFDAT_f;
        struct {
          union {
            __IO uint16_t TXFDATL;
            struct {
              __IO uint8_t TXFDATLL;
              __IO uint8_t TXFDATLH;
            };
          };
          union {
            __IO uint16_t TXFDATH;
            struct {
              __IO uint8_t TXFDATHL;
              __IO uint8_t TXFDATHH;
            };
          };
        };
    };
    union {
        __IO uint32_t CNTREG;
        stc_i2s_cntreg_field_t CNTREG_f;
        struct {
          union {
            __IO uint16_t CNTREGL;
            struct {
              __IO uint8_t CNTREGLL;
              __IO uint8_t CNTREGLH;
            };
          };
          union {
            __IO uint16_t CNTREGH;
            struct {
              __IO uint8_t CNTREGHL;
              __IO uint8_t CNTREGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MCR0REG;
        stc_i2s_mcr0reg_field_t MCR0REG_f;
        struct {
          union {
            __IO uint16_t MCR0REGL;
            struct {
              __IO uint8_t MCR0REGLL;
              __IO uint8_t MCR0REGLH;
            };
          };
          union {
            __IO uint16_t MCR0REGH;
            struct {
              __IO uint8_t MCR0REGHL;
              __IO uint8_t MCR0REGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MCR1REG;
        stc_i2s_mcr1reg_field_t MCR1REG_f;
        struct {
          union {
            __IO uint16_t MCR1REGL;
            struct {
              __IO uint8_t MCR1REGLL;
              __IO uint8_t MCR1REGLH;
            };
          };
          union {
            __IO uint16_t MCR1REGH;
            struct {
              __IO uint8_t MCR1REGHL;
              __IO uint8_t MCR1REGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MCR2REG;
        stc_i2s_mcr2reg_field_t MCR2REG_f;
        struct {
          union {
            __IO uint16_t MCR2REGL;
            struct {
              __IO uint8_t MCR2REGLL;
              __IO uint8_t MCR2REGLH;
            };
          };
          union {
            __IO uint16_t MCR2REGH;
            struct {
              __IO uint8_t MCR2REGHL;
              __IO uint8_t MCR2REGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t OPRREG;
        stc_i2s_oprreg_field_t OPRREG_f;
        struct {
          union {
            __IO uint16_t OPRREGL;
            struct {
              __IO uint8_t OPRREGLL;
              __IO uint8_t OPRREGLH;
            };
          };
          union {
            __IO uint16_t OPRREGH;
            struct {
              __IO uint8_t OPRREGHL;
              __IO uint8_t OPRREGHH;
            };
          };
        };
    };
    union {
        __IO uint32_t SRST;
        stc_i2s_srst_field_t SRST_f;
        struct {
          union {
            __IO uint16_t SRSTL;
            struct {
              __IO uint8_t SRSTLL;
              __IO uint8_t SRSTLH;
            };
          };
          union {
            __IO uint16_t SRSTH;
            struct {
              __IO uint8_t SRSTHL;
              __IO uint8_t SRSTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t INTCNT;
        stc_i2s_intcnt_field_t INTCNT_f;
        struct {
          union {
            __IO uint16_t INTCNTL;
            struct {
              __IO uint8_t INTCNTLL;
              __IO uint8_t INTCNTLH;
            };
          };
          union {
            __IO uint16_t INTCNTH;
            struct {
              __IO uint8_t INTCNTHL;
              __IO uint8_t INTCNTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t STATUS;
        stc_i2s_status_field_t STATUS_f;
        struct {
          union {
            __IO uint16_t STATUSL;
            struct {
              __IO uint8_t STATUSLL;
              __IO uint8_t STATUSLH;
            };
          };
          union {
            __IO uint16_t STATUSH;
            struct {
              __IO uint8_t STATUSHL;
              __IO uint8_t STATUSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t DMAACT;
        stc_i2s_dmaact_field_t DMAACT_f;
        struct {
          union {
            __IO uint16_t DMAACTL;
            struct {
              __IO uint8_t DMAACTLL;
              __IO uint8_t DMAACTLH;
            };
          };
          union {
            __IO uint16_t DMAACTH;
            struct {
              __IO uint8_t DMAACTHL;
              __IO uint8_t DMAACTHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TSTREG;
        stc_i2s_tstreg_field_t TSTREG_f;
        struct {
          union {
            __IO uint16_t TSTREGL;
            struct {
              __IO uint8_t TSTREGLL;
              __IO uint8_t TSTREGLH;
            };
          };
          union {
            __IO uint16_t TSTREGH;
            struct {
              __IO uint8_t TSTREGHL;
              __IO uint8_t TSTREGHH;
            };
          };
        };
    };
} FM_I2S_TypeDef, FM4_I2S_TypeDef;

/******************************************************************************
 ** I2SPRE_MODULE
 ** 
 **   register structur
 ******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t ICCR;
        stc_i2spre_iccr_field_t ICCR_f;
        struct {
          union {
            __IO uint16_t ICCRL;
            struct {
              __IO uint8_t ICCRLL;
              __IO uint8_t ICCRLH;
            };
          };
          union {
            __IO uint16_t ICCRH;
            struct {
              __IO uint8_t ICCRHL;
              __IO uint8_t ICCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR1;
        stc_i2spre_ipcr1_field_t IPCR1_f;
        struct {
          union {
            __IO uint16_t IPCR1L;
            struct {
              __IO uint8_t IPCR1LL;
              __IO uint8_t IPCR1LH;
            };
          };
          union {
            __IO uint16_t IPCR1H;
            struct {
              __IO uint8_t IPCR1HL;
              __IO uint8_t IPCR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR2;
        stc_i2spre_ipcr2_field_t IPCR2_f;
        struct {
          union {
            __IO uint16_t IPCR2L;
            struct {
              __IO uint8_t IPCR2LL;
              __IO uint8_t IPCR2LH;
            };
          };
          union {
            __IO uint16_t IPCR2H;
            struct {
              __IO uint8_t IPCR2HL;
              __IO uint8_t IPCR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR3;
        stc_i2spre_ipcr3_field_t IPCR3_f;
        struct {
          union {
            __IO uint16_t IPCR3L;
            struct {
              __IO uint8_t IPCR3LL;
              __IO uint8_t IPCR3LH;
            };
          };
          union {
            __IO uint16_t IPCR3H;
            struct {
              __IO uint8_t IPCR3HL;
              __IO uint8_t IPCR3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR4;
        stc_i2spre_ipcr4_field_t IPCR4_f;
        struct {
          union {
            __IO uint16_t IPCR4L;
            struct {
              __IO uint8_t IPCR4LL;
              __IO uint8_t IPCR4LH;
            };
          };
          union {
            __IO uint16_t IPCR4H;
            struct {
              __IO uint8_t IPCR4HL;
              __IO uint8_t IPCR4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t IP_STR;
        stc_i2spre_ip_str_field_t IP_STR_f;
        struct {
          union {
            __IO uint16_t IP_STRL;
            struct {
              __IO uint8_t IP_STRLL;
              __IO uint8_t IP_STRLH;
            };
          };
          union {
            __IO uint16_t IP_STRH;
            struct {
              __IO uint8_t IP_STRHL;
              __IO uint8_t IP_STRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPINT_ENR;
        stc_i2spre_ipint_enr_field_t IPINT_ENR_f;
        struct {
          union {
            __IO uint16_t IPINT_ENRL;
            struct {
              __IO uint8_t IPINT_ENRLL;
              __IO uint8_t IPINT_ENRLH;
            };
          };
          union {
            __IO uint16_t IPINT_ENRH;
            struct {
              __IO uint8_t IPINT_ENRHL;
              __IO uint8_t IPINT_ENRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPINT_CLR;
        stc_i2spre_ipint_clr_field_t IPINT_CLR_f;
        struct {
          union {
            __IO uint16_t IPINT_CLRL;
            struct {
              __IO uint8_t IPINT_CLRLL;
              __IO uint8_t IPINT_CLRLH;
            };
          };
          union {
            __IO uint16_t IPINT_CLRH;
            struct {
              __IO uint8_t IPINT_CLRHL;
              __IO uint8_t IPINT_CLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPINT_STR;
        stc_i2spre_ipint_str_field_t IPINT_STR_f;
        struct {
          union {
            __IO uint16_t IPINT_STRL;
            struct {
              __IO uint8_t IPINT_STRLL;
              __IO uint8_t IPINT_STRLH;
            };
          };
          union {
            __IO uint16_t IPINT_STRH;
            struct {
              __IO uint8_t IPINT_STRHL;
              __IO uint8_t IPINT_STRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IPCR5;
        stc_i2spre_ipcr5_field_t IPCR5_f;
        struct {
          union {
            __IO uint16_t IPCR5L;
            struct {
              __IO uint8_t IPCR5LL;
              __IO uint8_t IPCR5LH;
            };
          };
          union {
            __IO uint16_t IPCR5H;
            struct {
              __IO uint8_t IPCR5HL;
              __IO uint8_t IPCR5HH;
            };
          };
        };
    };
} FM_I2SPRE_TypeDef, FM4_I2SPRE_TypeDef;

