neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define FM_INTREQ_IRQ091MON                       *((volatile uint32_t*)(0x40031370UL))
#define FM4_INTREQ_IRQ091MON                      *((volatile uint32_t*)(0x40031370UL))
#define FM_INTREQ_IRQ092MON                       *((volatile uint32_t*)(0x40031374UL))
#define FM4_INTREQ_IRQ092MON                      *((volatile uint32_t*)(0x40031374UL))
#define FM_INTREQ_IRQ093MON                       *((volatile uint32_t*)(0x40031378UL))
#define FM4_INTREQ_IRQ093MON                      *((volatile uint32_t*)(0x40031378UL))
#define FM_INTREQ_IRQ094MON                       *((volatile uint32_t*)(0x4003137CUL))
#define FM4_INTREQ_IRQ094MON                      *((volatile uint32_t*)(0x4003137CUL))
#define FM_INTREQ_IRQ095MON                       *((volatile uint32_t*)(0x40031380UL))
#define FM4_INTREQ_IRQ095MON                      *((volatile uint32_t*)(0x40031380UL))
#define FM_INTREQ_IRQ096MON                       *((volatile uint32_t*)(0x40031384UL))
#define FM4_INTREQ_IRQ096MON                      *((volatile uint32_t*)(0x40031384UL))
#define FM_INTREQ_IRQ097MON                       *((volatile uint32_t*)(0x40031388UL))
#define FM4_INTREQ_IRQ097MON                      *((volatile uint32_t*)(0x40031388UL))
#define FM_INTREQ_IRQ098MON                       *((volatile uint32_t*)(0x4003138CUL))
#define FM4_INTREQ_IRQ098MON                      *((volatile uint32_t*)(0x4003138CUL))
#define FM_INTREQ_IRQ099MON                       *((volatile uint32_t*)(0x40031390UL))
#define FM4_INTREQ_IRQ099MON                      *((volatile uint32_t*)(0x40031390UL))
#define FM_INTREQ_IRQ100MON                       *((volatile uint32_t*)(0x40031394UL))
#define FM4_INTREQ_IRQ100MON                      *((volatile uint32_t*)(0x40031394UL))
#define FM_INTREQ_IRQ101MON                       *((volatile uint32_t*)(0x40031398UL))
#define FM4_INTREQ_IRQ101MON                      *((volatile uint32_t*)(0x40031398UL))
#define FM_INTREQ_IRQ102MON                       *((volatile uint32_t*)(0x4003139CUL))
#define FM4_INTREQ_IRQ102MON                      *((volatile uint32_t*)(0x4003139CUL))
#define FM_INTREQ_IRQ103MON                       *((volatile uint32_t*)(0x400313A0UL))
#define FM4_INTREQ_IRQ103MON                      *((volatile uint32_t*)(0x400313A0UL))
#define FM_INTREQ_IRQ104MON                       *((volatile uint32_t*)(0x400313A4UL))
#define FM4_INTREQ_IRQ104MON                      *((volatile uint32_t*)(0x400313A4UL))
#define FM_INTREQ_IRQ105MON                       *((volatile uint32_t*)(0x400313A8UL))
#define FM4_INTREQ_IRQ105MON                      *((volatile uint32_t*)(0x400313A8UL))
#define FM_INTREQ_IRQ106MON                       *((volatile uint32_t*)(0x400313ACUL))
#define FM4_INTREQ_IRQ106MON                      *((volatile uint32_t*)(0x400313ACUL))
#define FM_INTREQ_IRQ107MON                       *((volatile uint32_t*)(0x400313B0UL))
#define FM4_INTREQ_IRQ107MON                      *((volatile uint32_t*)(0x400313B0UL))
#define FM_INTREQ_IRQ108MON                       *((volatile uint32_t*)(0x400313B4UL))
#define FM4_INTREQ_IRQ108MON                      *((volatile uint32_t*)(0x400313B4UL))
#define FM_INTREQ_IRQ109MON                       *((volatile uint32_t*)(0x400313B8UL))
#define FM4_INTREQ_IRQ109MON                      *((volatile uint32_t*)(0x400313B8UL))
#define FM_INTREQ_IRQ110MON                       *((volatile uint32_t*)(0x400313BCUL))
#define FM4_INTREQ_IRQ110MON                      *((volatile uint32_t*)(0x400313BCUL))
#define FM_INTREQ_IRQ111MON                       *((volatile uint32_t*)(0x400313C0UL))
#define FM4_INTREQ_IRQ111MON                      *((volatile uint32_t*)(0x400313C0UL))
#define FM_INTREQ_IRQ112MON                       *((volatile uint32_t*)(0x400313C4UL))
#define FM4_INTREQ_IRQ112MON                      *((volatile uint32_t*)(0x400313C4UL))
#define FM_INTREQ_IRQ113MON                       *((volatile uint32_t*)(0x400313C8UL))
#define FM4_INTREQ_IRQ113MON                      *((volatile uint32_t*)(0x400313C8UL))
#define FM_INTREQ_IRQ114MON                       *((volatile uint32_t*)(0x400313CCUL))
#define FM4_INTREQ_IRQ114MON                      *((volatile uint32_t*)(0x400313CCUL))
#define FM_INTREQ_IRQ115MON                       *((volatile uint32_t*)(0x400313D0UL))
#define FM4_INTREQ_IRQ115MON                      *((volatile uint32_t*)(0x400313D0UL))
#define FM_INTREQ_IRQ116MON                       *((volatile uint32_t*)(0x400313D4UL))
#define FM4_INTREQ_IRQ116MON                      *((volatile uint32_t*)(0x400313D4UL))
#define FM_INTREQ_IRQ117MON                       *((volatile uint32_t*)(0x400313D8UL))
#define FM4_INTREQ_IRQ117MON                      *((volatile uint32_t*)(0x400313D8UL))
#define FM_INTREQ_IRQ118MON                       *((volatile uint32_t*)(0x400313DCUL))
#define FM4_INTREQ_IRQ118MON                      *((volatile uint32_t*)(0x400313DCUL))
#define FM_INTREQ_IRQ119MON                       *((volatile uint32_t*)(0x400313E0UL))
#define FM4_INTREQ_IRQ119MON                      *((volatile uint32_t*)(0x400313E0UL))
#define FM_INTREQ_IRQ120MON                       *((volatile uint32_t*)(0x400313E4UL))
#define FM4_INTREQ_IRQ120MON                      *((volatile uint32_t*)(0x400313E4UL))
#define FM_INTREQ_IRQ121MON                       *((volatile uint32_t*)(0x400313E8UL))
#define FM4_INTREQ_IRQ121MON                      *((volatile uint32_t*)(0x400313E8UL))
#define FM_INTREQ_IRQ122MON                       *((volatile uint32_t*)(0x400313ECUL))
#define FM4_INTREQ_IRQ122MON                      *((volatile uint32_t*)(0x400313ECUL))
#define FM_INTREQ_IRQ123MON                       *((volatile uint32_t*)(0x400313F0UL))
#define FM4_INTREQ_IRQ123MON                      *((volatile uint32_t*)(0x400313F0UL))
#define FM_INTREQ_IRQ124MON                       *((volatile uint32_t*)(0x400313F4UL))
#define FM4_INTREQ_IRQ124MON                      *((volatile uint32_t*)(0x400313F4UL))
#define FM_INTREQ_IRQ125MON                       *((volatile uint32_t*)(0x400313F8UL))
#define FM4_INTREQ_IRQ125MON                      *((volatile uint32_t*)(0x400313F8UL))
#define FM_INTREQ_IRQ126MON                       *((volatile uint32_t*)(0x400313FCUL))
#define FM4_INTREQ_IRQ126MON                      *((volatile uint32_t*)(0x400313FCUL))
#define FM_INTREQ_IRQ127MON                       *((volatile uint32_t*)(0x40031400UL))
#define FM4_INTREQ_IRQ127MON                      *((volatile uint32_t*)(0x40031400UL))

