neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** SBSSR Registers SBSSR
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_SBSSR_BTSSSR                           *((volatile uint16_t*)(0x40025FFCUL))
#define FM4_SBSSR_BTSSSR                          *((volatile uint16_t*)(0x40025FFCUL))

/******************************************************************************
 ** SDIF Registers SDIF
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_SDIF_SSA2                              *((volatile uint32_t*)(0x4006E000UL))
#define FM4_SDIF_SSA2                             *((volatile uint32_t*)(0x4006E000UL))
#define FM_SDIF_SBSIZE                            *((volatile uint16_t*)(0x4006E004UL))
#define FM4_SDIF_SBSIZE                           *((volatile uint16_t*)(0x4006E004UL))
#define FM_SDIF_SBLCNT                            *((volatile uint16_t*)(0x4006E006UL))
#define FM4_SDIF_SBLCNT                           *((volatile uint16_t*)(0x4006E006UL))
#define FM_SDIF_SSA1                              *((volatile uint32_t*)(0x4006E008UL))
#define FM4_SDIF_SSA1                             *((volatile uint32_t*)(0x4006E008UL))
#define FM_SDIF_STRSFMD                           *((volatile uint16_t*)(0x4006E00CUL))
#define FM4_SDIF_STRSFMD                          *((volatile uint16_t*)(0x4006E00CUL))
#define FM_SDIF_SCMMD                             *((volatile uint16_t*)(0x4006E00EUL))
#define FM4_SDIF_SCMMD                            *((volatile uint16_t*)(0x4006E00EUL))
#define FM_SDIF_SRESP0                            *((volatile uint16_t*)(0x4006E010UL))
#define FM4_SDIF_SRESP0                           *((volatile uint16_t*)(0x4006E010UL))
#define FM_SDIF_SRESP1                            *((volatile uint16_t*)(0x4006E012UL))
#define FM4_SDIF_SRESP1                           *((volatile uint16_t*)(0x4006E012UL))
#define FM_SDIF_SRESP2                            *((volatile uint16_t*)(0x4006E014UL))
#define FM4_SDIF_SRESP2                           *((volatile uint16_t*)(0x4006E014UL))
#define FM_SDIF_SRESP3                            *((volatile uint16_t*)(0x4006E016UL))
#define FM4_SDIF_SRESP3                           *((volatile uint16_t*)(0x4006E016UL))
#define FM_SDIF_SRESP4                            *((volatile uint16_t*)(0x4006E018UL))
#define FM4_SDIF_SRESP4                           *((volatile uint16_t*)(0x4006E018UL))
#define FM_SDIF_SRESP5                            *((volatile uint16_t*)(0x4006E01AUL))
#define FM4_SDIF_SRESP5                           *((volatile uint16_t*)(0x4006E01AUL))
#define FM_SDIF_SRESP6                            *((volatile uint16_t*)(0x4006E01CUL))
#define FM4_SDIF_SRESP6                           *((volatile uint16_t*)(0x4006E01CUL))
#define FM_SDIF_SRESP7                            *((volatile uint16_t*)(0x4006E01EUL))
#define FM4_SDIF_SRESP7                           *((volatile uint16_t*)(0x4006E01EUL))
#define FM_SDIF_SBUFDP                            *((volatile uint32_t*)(0x4006E020UL))
#define FM4_SDIF_SBUFDP                           *((volatile uint32_t*)(0x4006E020UL))
#define FM_SDIF_SPRSTAT                           *((volatile uint32_t*)(0x4006E024UL))
#define FM4_SDIF_SPRSTAT                          *((volatile uint32_t*)(0x4006E024UL))
#define FM_SDIF_SHCTL1                            *((volatile  uint8_t*)(0x4006E028UL))
#define FM4_SDIF_SHCTL1                           *((volatile  uint8_t*)(0x4006E028UL))
#define FM_SDIF_SPWRCTL                           *((volatile  uint8_t*)(0x4006E029UL))
#define FM4_SDIF_SPWRCTL                          *((volatile  uint8_t*)(0x4006E029UL))
#define FM_SDIF_SBLKGPCTL                         *((volatile  uint8_t*)(0x4006E02AUL))
#define FM4_SDIF_SBLKGPCTL                        *((volatile  uint8_t*)(0x4006E02AUL))
#define FM_SDIF_SWKUPCTL                          *((volatile  uint8_t*)(0x4006E02BUL))
#define FM4_SDIF_SWKUPCTL                         *((volatile  uint8_t*)(0x4006E02BUL))
#define FM_SDIF_SCLKCTL                           *((volatile uint16_t*)(0x4006E02CUL))
#define FM4_SDIF_SCLKCTL                          *((volatile uint16_t*)(0x4006E02CUL))
#define FM_SDIF_STOCTL                            *((volatile  uint8_t*)(0x4006E02EUL))
#define FM4_SDIF_STOCTL                           *((volatile  uint8_t*)(0x4006E02EUL))
#define FM_SDIF_SSRST                             *((volatile  uint8_t*)(0x4006E02FUL))
#define FM4_SDIF_SSRST                            *((volatile  uint8_t*)(0x4006E02FUL))
#define FM_SDIF_SNINTST                           *((volatile uint16_t*)(0x4006E030UL))
#define FM4_SDIF_SNINTST                          *((volatile uint16_t*)(0x4006E030UL))
#define FM_SDIF_SEINTST                           *((volatile uint16_t*)(0x4006E032UL))
#define FM4_SDIF_SEINTST                          *((volatile uint16_t*)(0x4006E032UL))
#define FM_SDIF_SNINTSTE                          *((volatile uint16_t*)(0x4006E034UL))
#define FM4_SDIF_SNINTSTE                         *((volatile uint16_t*)(0x4006E034UL))
#define FM_SDIF_SEINTSTE                          *((volatile uint16_t*)(0x4006E036UL))
#define FM4_SDIF_SEINTSTE                         *((volatile uint16_t*)(0x4006E036UL))
#define FM_SDIF_SNINTSGE                          *((volatile uint16_t*)(0x4006E038UL))
#define FM4_SDIF_SNINTSGE                         *((volatile uint16_t*)(0x4006E038UL))
#define FM_SDIF_SEINTSGE                          *((volatile uint16_t*)(0x4006E03AUL))
#define FM4_SDIF_SEINTSGE                         *((volatile uint16_t*)(0x4006E03AUL))
#define FM_SDIF_SACMDEST                          *((volatile uint16_t*)(0x4006E03CUL))
#define FM4_SDIF_SACMDEST                         *((volatile uint16_t*)(0x4006E03CUL))
#define FM_SDIF_SHCTL2                            *((volatile uint16_t*)(0x4006E03EUL))
#define FM4_SDIF_SHCTL2                           *((volatile uint16_t*)(0x4006E03EUL))
#define FM_SDIF_CAPBLTY0                          *((volatile uint16_t*)(0x4006E040UL))
#define FM4_SDIF_CAPBLTY0                         *((volatile uint16_t*)(0x4006E040UL))
#define FM_SDIF_CAPBLTY1                          *((volatile uint16_t*)(0x4006E042UL))
#define FM4_SDIF_CAPBLTY1                         *((volatile uint16_t*)(0x4006E042UL))
#define FM_SDIF_CAPBLTY2                          *((volatile uint16_t*)(0x4006E044UL))
#define FM4_SDIF_CAPBLTY2                         *((volatile uint16_t*)(0x4006E044UL))
#define FM_SDIF_CAPBLTY3                          *((volatile uint16_t*)(0x4006E046UL))
#define FM4_SDIF_CAPBLTY3                         *((volatile uint16_t*)(0x4006E046UL))
#define FM_SDIF_MXCCAPY0                          *((volatile uint16_t*)(0x4006E048UL))
#define FM4_SDIF_MXCCAPY0                         *((volatile uint16_t*)(0x4006E048UL))
#define FM_SDIF_MXCCAPY1                          *((volatile uint16_t*)(0x4006E04AUL))
#define FM4_SDIF_MXCCAPY1                         *((volatile uint16_t*)(0x4006E04AUL))
#define FM_SDIF_MXCCAPY2                          *((volatile uint16_t*)(0x4006E04CUL))
#define FM4_SDIF_MXCCAPY2                         *((volatile uint16_t*)(0x4006E04CUL))
#define FM_SDIF_MXCCAPY3                          *((volatile uint16_t*)(0x4006E04EUL))
#define FM4_SDIF_MXCCAPY3                         *((volatile uint16_t*)(0x4006E04EUL))
#define FM_SDIF_FEACEST                           *((volatile uint16_t*)(0x4006E050UL))
#define FM4_SDIF_FEACEST                          *((volatile uint16_t*)(0x4006E050UL))
#define FM_SDIF_SFEEIST                           *((volatile uint16_t*)(0x4006E052UL))
#define FM4_SDIF_SFEEIST                          *((volatile uint16_t*)(0x4006E052UL))
#define FM_SDIF_ADMAEST                           *((volatile  uint8_t*)(0x4006E054UL))
#define FM4_SDIF_ADMAEST                          *((volatile  uint8_t*)(0x4006E054UL))
#define FM_SDIF_SADSA0                            *((volatile uint16_t*)(0x4006E058UL))
#define FM4_SDIF_SADSA0                           *((volatile uint16_t*)(0x4006E058UL))
#define FM_SDIF_SADSA1                            *((volatile uint16_t*)(0x4006E05AUL))
#define FM4_SDIF_SADSA1                           *((volatile uint16_t*)(0x4006E05AUL))
#define FM_SDIF_SADSA2                            *((volatile uint16_t*)(0x4006E05CUL))
#define FM4_SDIF_SADSA2                           *((volatile uint16_t*)(0x4006E05CUL))
#define FM_SDIF_SADSA3                            *((volatile uint16_t*)(0x4006E05EUL))
#define FM4_SDIF_SADSA3                           *((volatile uint16_t*)(0x4006E05EUL))
#define FM_SDIF_SPRVAL0                           *((volatile uint16_t*)(0x4006E060UL))
#define FM4_SDIF_SPRVAL0                          *((volatile uint16_t*)(0x4006E060UL))
#define FM_SDIF_SPRVAL1                           *((volatile uint16_t*)(0x4006E062UL))
#define FM4_SDIF_SPRVAL1                          *((volatile uint16_t*)(0x4006E062UL))
#define FM_SDIF_SPRVAL2                           *((volatile uint16_t*)(0x4006E064UL))
#define FM4_SDIF_SPRVAL2                          *((volatile uint16_t*)(0x4006E064UL))
#define FM_SDIF_SPRVAL3                           *((volatile uint16_t*)(0x4006E066UL))
#define FM4_SDIF_SPRVAL3                          *((volatile uint16_t*)(0x4006E066UL))
#define FM_SDIF_SPRVAL4                           *((volatile uint16_t*)(0x4006E068UL))
#define FM4_SDIF_SPRVAL4                          *((volatile uint16_t*)(0x4006E068UL))
#define FM_SDIF_SPRVAL5                           *((volatile uint16_t*)(0x4006E06AUL))
#define FM4_SDIF_SPRVAL5                          *((volatile uint16_t*)(0x4006E06AUL))
#define FM_SDIF_SPRVAL6                           *((volatile uint16_t*)(0x4006E06CUL))
#define FM4_SDIF_SPRVAL6                          *((volatile uint16_t*)(0x4006E06CUL))
#define FM_SDIF_SPRVAL7                           *((volatile uint16_t*)(0x4006E06EUL))
#define FM4_SDIF_SPRVAL7                          *((volatile uint16_t*)(0x4006E06EUL))
#define FM_SDIF_SSHBCTLL                          *((volatile uint16_t*)(0x4006E0E0UL))
#define FM4_SDIF_SSHBCTLL                         *((volatile uint16_t*)(0x4006E0E0UL))
#define FM_SDIF_SSHBCTLH                          *((volatile uint16_t*)(0x4006E0E2UL))
#define FM4_SDIF_SSHBCTLH                         *((volatile uint16_t*)(0x4006E0E2UL))
#define FM_SDIF_SSLIST                            *((volatile uint16_t*)(0x4006E0FCUL))
#define FM4_SDIF_SSLIST                           *((volatile uint16_t*)(0x4006E0FCUL))
#define FM_SDIF_SHCTLV                            *((volatile uint16_t*)(0x4006E0FEUL))
#define FM4_SDIF_SHCTLV                           *((volatile uint16_t*)(0x4006E0FEUL))
#define FM_SDIF_AHBCFGL                           *((volatile uint16_t*)(0x4006E100UL))
#define FM4_SDIF_AHBCFGL                          *((volatile uint16_t*)(0x4006E100UL))
#define FM_SDIF_AHBCFGH                           *((volatile uint16_t*)(0x4006E102UL))
#define FM4_SDIF_AHBCFGH                          *((volatile uint16_t*)(0x4006E102UL))
#define FM_SDIF_SPWSWCL                           *((volatile uint16_t*)(0x4006E104UL))
#define FM4_SDIF_SPWSWCL                          *((volatile uint16_t*)(0x4006E104UL))
#define FM_SDIF_SPWSWCH                           *((volatile uint16_t*)(0x4006E106UL))
#define FM4_SDIF_SPWSWCH                          *((volatile uint16_t*)(0x4006E106UL))
#define FM_SDIF_STUNSETL                          *((volatile uint16_t*)(0x4006E108UL))
#define FM4_SDIF_STUNSETL                         *((volatile uint16_t*)(0x4006E108UL))
#define FM_SDIF_STUNSETH                          *((volatile uint16_t*)(0x4006E10AUL))
#define FM4_SDIF_STUNSETH                         *((volatile uint16_t*)(0x4006E10AUL))
#define FM_SDIF_STUNSTL                           *((volatile uint16_t*)(0x4006E10CUL))
#define FM4_SDIF_STUNSTL                          *((volatile uint16_t*)(0x4006E10CUL))
#define FM_SDIF_STUNSTH                           *((volatile uint16_t*)(0x4006E10EUL))
#define FM4_SDIF_STUNSTH                          *((volatile uint16_t*)(0x4006E10EUL))
#define FM_SDIF_PSWISTL                           *((volatile uint16_t*)(0x4006E118UL))
#define FM4_SDIF_PSWISTL                          *((volatile uint16_t*)(0x4006E118UL))
#define FM_SDIF_PSWISTH                           *((volatile uint16_t*)(0x4006E11AUL))
#define FM4_SDIF_PSWISTH                          *((volatile uint16_t*)(0x4006E11AUL))
#define FM_SDIF_PSWISTEL                          *((volatile uint16_t*)(0x4006E11CUL))
#define FM4_SDIF_PSWISTEL                         *((volatile uint16_t*)(0x4006E11CUL))
#define FM_SDIF_PSWISTEH                          *((volatile uint16_t*)(0x4006E11EUL))
#define FM4_SDIF_PSWISTEH                         *((volatile uint16_t*)(0x4006E11EUL))
#define FM_SDIF_PSWISGEL                          *((volatile uint16_t*)(0x4006E120UL))
#define FM4_SDIF_PSWISGEL                         *((volatile uint16_t*)(0x4006E120UL))
#define FM_SDIF_PSWISGEH                          *((volatile uint16_t*)(0x4006E122UL))
#define FM4_SDIF_PSWISGEH                         *((volatile uint16_t*)(0x4006E122UL))
#define FM_SDIF_MMCSDCL                           *((volatile uint16_t*)(0x4006E124UL))
#define FM4_SDIF_MMCSDCL                          *((volatile uint16_t*)(0x4006E124UL))
#define FM_SDIF_MMCSDCH                           *((volatile uint16_t*)(0x4006E126UL))
#define FM4_SDIF_MMCSDCH                          *((volatile uint16_t*)(0x4006E126UL))
#define FM_SDIF_MCWIRQC0                          *((volatile uint16_t*)(0x4006E128UL))
#define FM4_SDIF_MCWIRQC0                         *((volatile uint16_t*)(0x4006E128UL))
#define FM_SDIF_MCWIRQC1                          *((volatile uint16_t*)(0x4006E12AUL))
#define FM4_SDIF_MCWIRQC1                         *((volatile uint16_t*)(0x4006E12AUL))
#define FM_SDIF_MCWIRQC2                          *((volatile uint16_t*)(0x4006E12CUL))
#define FM4_SDIF_MCWIRQC2                         *((volatile uint16_t*)(0x4006E12CUL))
#define FM_SDIF_MCWIRQC3                          *((volatile uint16_t*)(0x4006E12EUL))
#define FM4_SDIF_MCWIRQC3                         *((volatile uint16_t*)(0x4006E12EUL))
#define FM_SDIF_MCRPCKBL                          *((volatile uint16_t*)(0x4006E130UL))
#define FM4_SDIF_MCRPCKBL                         *((volatile uint16_t*)(0x4006E130UL))
#define FM_SDIF_MCRPCKBH                          *((volatile uint16_t*)(0x4006E132UL))
#define FM4_SDIF_MCRPCKBH                         *((volatile uint16_t*)(0x4006E132UL))
#define FM_SDIF_SCDETECS                          *((volatile uint16_t*)(0x4006E154UL))
#define FM4_SDIF_SCDETECS                         *((volatile uint16_t*)(0x4006E154UL))

