neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** USB Registers USB1
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_USB1_HCNT                              *((volatile uint16_t*)(0x40052100UL))
#define FM4_USB1_HCNT                             *((volatile uint16_t*)(0x40052100UL))
#define FM_USB1_HIRQ                              *((volatile  uint8_t*)(0x40052104UL))
#define FM4_USB1_HIRQ                             *((volatile  uint8_t*)(0x40052104UL))
#define FM_USB1_HERR                              *((volatile  uint8_t*)(0x40052105UL))
#define FM4_USB1_HERR                             *((volatile  uint8_t*)(0x40052105UL))
#define FM_USB1_HSTATE                            *((volatile  uint8_t*)(0x40052108UL))
#define FM4_USB1_HSTATE                           *((volatile  uint8_t*)(0x40052108UL))
#define FM_USB1_HFCOMP                            *((volatile  uint8_t*)(0x40052109UL))
#define FM4_USB1_HFCOMP                           *((volatile  uint8_t*)(0x40052109UL))
#define FM_USB1_HRTIMER                           *((volatile uint16_t*)(0x4005210CUL))
#define FM4_USB1_HRTIMER                          *((volatile uint16_t*)(0x4005210CUL))
#define FM_USB1_HRTIMER2                          *((volatile  uint8_t*)(0x40052110UL))
#define FM4_USB1_HRTIMER2                         *((volatile  uint8_t*)(0x40052110UL))
#define FM_USB1_HADR                              *((volatile  uint8_t*)(0x40052111UL))
#define FM4_USB1_HADR                             *((volatile  uint8_t*)(0x40052111UL))
#define FM_USB1_HEOF                              *((volatile uint16_t*)(0x40052114UL))
#define FM4_USB1_HEOF                             *((volatile uint16_t*)(0x40052114UL))
#define FM_USB1_HFRAME                            *((volatile uint16_t*)(0x40052118UL))
#define FM4_USB1_HFRAME                           *((volatile uint16_t*)(0x40052118UL))
#define FM_USB1_HTOKEN                            *((volatile  uint8_t*)(0x4005211CUL))
#define FM4_USB1_HTOKEN                           *((volatile  uint8_t*)(0x4005211CUL))
#define FM_USB1_UDCC                              *((volatile uint16_t*)(0x40052120UL))
#define FM4_USB1_UDCC                             *((volatile uint16_t*)(0x40052120UL))
#define FM_USB1_EP0C                              *((volatile uint16_t*)(0x40052124UL))
#define FM4_USB1_EP0C                             *((volatile uint16_t*)(0x40052124UL))
#define FM_USB1_EP1C                              *((volatile uint16_t*)(0x40052128UL))
#define FM4_USB1_EP1C                             *((volatile uint16_t*)(0x40052128UL))
#define FM_USB1_EP2C                              *((volatile uint16_t*)(0x4005212CUL))
#define FM4_USB1_EP2C                             *((volatile uint16_t*)(0x4005212CUL))
#define FM_USB1_EP3C                              *((volatile uint16_t*)(0x40052130UL))
#define FM4_USB1_EP3C                             *((volatile uint16_t*)(0x40052130UL))
#define FM_USB1_EP4C                              *((volatile uint16_t*)(0x40052134UL))
#define FM4_USB1_EP4C                             *((volatile uint16_t*)(0x40052134UL))
#define FM_USB1_EP5C                              *((volatile uint16_t*)(0x40052138UL))
#define FM4_USB1_EP5C                             *((volatile uint16_t*)(0x40052138UL))
#define FM_USB1_TMSP                              *((volatile uint16_t*)(0x4005213CUL))
#define FM4_USB1_TMSP                             *((volatile uint16_t*)(0x4005213CUL))
#define FM_USB1_UDCS                              *((volatile  uint8_t*)(0x40052140UL))
#define FM4_USB1_UDCS                             *((volatile  uint8_t*)(0x40052140UL))
#define FM_USB1_UDCIE                             *((volatile  uint8_t*)(0x40052141UL))
#define FM4_USB1_UDCIE                            *((volatile  uint8_t*)(0x40052141UL))
#define FM_USB1_EP0IS                             *((volatile uint16_t*)(0x40052144UL))
#define FM4_USB1_EP0IS                            *((volatile uint16_t*)(0x40052144UL))
#define FM_USB1_EP0OS                             *((volatile uint16_t*)(0x40052148UL))
#define FM4_USB1_EP0OS                            *((volatile uint16_t*)(0x40052148UL))
#define FM_USB1_EP1S                              *((volatile uint16_t*)(0x4005214CUL))
#define FM4_USB1_EP1S                             *((volatile uint16_t*)(0x4005214CUL))
#define FM_USB1_EP2S                              *((volatile uint16_t*)(0x40052150UL))
#define FM4_USB1_EP2S                             *((volatile uint16_t*)(0x40052150UL))
#define FM_USB1_EP3S                              *((volatile uint16_t*)(0x40052154UL))
#define FM4_USB1_EP3S                             *((volatile uint16_t*)(0x40052154UL))
#define FM_USB1_EP4S                              *((volatile uint16_t*)(0x40052158UL))
#define FM4_USB1_EP4S                             *((volatile uint16_t*)(0x40052158UL))
#define FM_USB1_EP5S                              *((volatile uint16_t*)(0x4005215CUL))
#define FM4_USB1_EP5S                             *((volatile uint16_t*)(0x4005215CUL))
#define FM_USB1_EP0DT                             *((volatile uint16_t*)(0x40052160UL))
#define FM4_USB1_EP0DT                            *((volatile uint16_t*)(0x40052160UL))
#define FM_USB1_EP1DT                             *((volatile uint16_t*)(0x40052164UL))
#define FM4_USB1_EP1DT                            *((volatile uint16_t*)(0x40052164UL))
#define FM_USB1_EP2DT                             *((volatile uint16_t*)(0x40052168UL))
#define FM4_USB1_EP2DT                            *((volatile uint16_t*)(0x40052168UL))
#define FM_USB1_EP3DT                             *((volatile uint16_t*)(0x4005216CUL))
#define FM4_USB1_EP3DT                            *((volatile uint16_t*)(0x4005216CUL))
#define FM_USB1_EP4DT                             *((volatile uint16_t*)(0x40052170UL))
#define FM4_USB1_EP4DT                            *((volatile uint16_t*)(0x40052170UL))
#define FM_USB1_EP5DT                             *((volatile uint16_t*)(0x40052174UL))
#define FM4_USB1_EP5DT                            *((volatile uint16_t*)(0x40052174UL))

