neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** USBETHERCLK Registers USBETHERCLK
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_USBETHERCLK_UCCR                       *((volatile  uint8_t*)(0x40036000UL))
#define FM4_USBETHERCLK_UCCR                      *((volatile  uint8_t*)(0x40036000UL))
#define FM_USBETHERCLK_UPCR1                      *((volatile  uint8_t*)(0x40036004UL))
#define FM4_USBETHERCLK_UPCR1                     *((volatile  uint8_t*)(0x40036004UL))
#define FM_USBETHERCLK_UPCR2                      *((volatile  uint8_t*)(0x40036008UL))
#define FM4_USBETHERCLK_UPCR2                     *((volatile  uint8_t*)(0x40036008UL))
#define FM_USBETHERCLK_UPCR3                      *((volatile  uint8_t*)(0x4003600CUL))
#define FM4_USBETHERCLK_UPCR3                     *((volatile  uint8_t*)(0x4003600CUL))
#define FM_USBETHERCLK_UPCR4                      *((volatile  uint8_t*)(0x40036010UL))
#define FM4_USBETHERCLK_UPCR4                     *((volatile  uint8_t*)(0x40036010UL))
#define FM_USBETHERCLK_UP_STR                     *((volatile  uint8_t*)(0x40036014UL))
#define FM4_USBETHERCLK_UP_STR                    *((volatile  uint8_t*)(0x40036014UL))
#define FM_USBETHERCLK_UPINT_ENR                  *((volatile  uint8_t*)(0x40036018UL))
#define FM4_USBETHERCLK_UPINT_ENR                 *((volatile  uint8_t*)(0x40036018UL))
#define FM_USBETHERCLK_UPINT_CLR                  *((volatile  uint8_t*)(0x4003601CUL))
#define FM4_USBETHERCLK_UPINT_CLR                 *((volatile  uint8_t*)(0x4003601CUL))
#define FM_USBETHERCLK_UPINT_STR                  *((volatile  uint8_t*)(0x40036020UL))
#define FM4_USBETHERCLK_UPINT_STR                 *((volatile  uint8_t*)(0x40036020UL))
#define FM_USBETHERCLK_UPCR5                      *((volatile  uint8_t*)(0x40036024UL))
#define FM4_USBETHERCLK_UPCR5                     *((volatile  uint8_t*)(0x40036024UL))
#define FM_USBETHERCLK_UPCR6                      *((volatile  uint8_t*)(0x40036028UL))
#define FM4_USBETHERCLK_UPCR6                     *((volatile  uint8_t*)(0x40036028UL))
#define FM_USBETHERCLK_UPCR7                      *((volatile  uint8_t*)(0x4003602CUL))
#define FM4_USBETHERCLK_UPCR7                     *((volatile  uint8_t*)(0x4003602CUL))
#define FM_USBETHERCLK_USBEN0                     *((volatile  uint8_t*)(0x40036030UL))
#define FM4_USBETHERCLK_USBEN0                    *((volatile  uint8_t*)(0x40036030UL))
#define FM_USBETHERCLK_USBEN1                     *((volatile  uint8_t*)(0x40036034UL))
#define FM4_USBETHERCLK_USBEN1                    *((volatile  uint8_t*)(0x40036034UL))

/******************************************************************************
 ** WC Registers WC
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_WC_WCRD                                *((volatile  uint8_t*)(0x4003A000UL))
#define FM4_WC_WCRD                               *((volatile  uint8_t*)(0x4003A000UL))
#define FM_WC_WCRL                                *((volatile  uint8_t*)(0x4003A001UL))
#define FM4_WC_WCRL                               *((volatile  uint8_t*)(0x4003A001UL))
#define FM_WC_WCCR                                *((volatile  uint8_t*)(0x4003A002UL))
#define FM4_WC_WCCR                               *((volatile  uint8_t*)(0x4003A002UL))
#define FM_WC_CLK_SEL                             *((volatile uint16_t*)(0x4003A010UL))
#define FM4_WC_CLK_SEL                            *((volatile uint16_t*)(0x4003A010UL))
#define FM_WC_CLK_EN                              *((volatile  uint8_t*)(0x4003A014UL))
#define FM4_WC_CLK_EN                             *((volatile  uint8_t*)(0x4003A014UL))

/******************************************************************************
 ** Available Registers
 ** 
 ******************************************************************************/
/******************************************************************************
 ** ADC0
 ** 
 ******************************************************************************/
#define FM4_ADC0_ADCEN_AVAILABLE                  1
#define FM_ADC0_ADCEN_AVAILABLE                   1
#define FM4_ADC0_ADCR_AVAILABLE                   1
#define FM_ADC0_ADCR_AVAILABLE                    1
#define FM4_ADC0_ADCT_AVAILABLE                   1
#define FM_ADC0_ADCT_AVAILABLE                    1
#define FM4_ADC0_ADSR_AVAILABLE                   1
#define FM_ADC0_ADSR_AVAILABLE                    1
#define FM4_ADC0_ADSS01_AVAILABLE                 1
#define FM_ADC0_ADSS01_AVAILABLE                  1
#define FM4_ADC0_ADSS23_AVAILABLE                 1
#define FM_ADC0_ADSS23_AVAILABLE                  1
#define FM4_ADC0_ADST01_AVAILABLE                 1
#define FM_ADC0_ADST01_AVAILABLE                  1
#define FM4_ADC0_CALSR_AVAILABLE                  1
#define FM_ADC0_CALSR_AVAILABLE                   1
#define FM4_ADC0_CMPCR_AVAILABLE                  1
#define FM_ADC0_CMPCR_AVAILABLE                   1
#define FM4_ADC0_CMPD_AVAILABLE                   1
#define FM_ADC0_CMPD_AVAILABLE                    1
#define FM4_ADC0_PCCR_AVAILABLE                   1
#define FM_ADC0_PCCR_AVAILABLE                    1
#define FM4_ADC0_PCFD_AVAILABLE                   1
#define FM_ADC0_PCFD_AVAILABLE                    1
#define FM4_ADC0_PCIS_AVAILABLE                   1
#define FM_ADC0_PCIS_AVAILABLE                    1
#define FM4_ADC0_PFNS_AVAILABLE                   1
#define FM_ADC0_PFNS_AVAILABLE                    1
#define FM4_ADC0_PRTSL_AVAILABLE                  1
#define FM_ADC0_PRTSL_AVAILABLE                   1
#define FM4_ADC0_SCCR_AVAILABLE                   1
#define FM_ADC0_SCCR_AVAILABLE                    1
#define FM4_ADC0_SCFD_AVAILABLE                   1
#define FM_ADC0_SCFD_AVAILABLE                    1
#define FM4_ADC0_SCIS01_AVAILABLE                 1
#define FM_ADC0_SCIS01_AVAILABLE                  1
#define FM4_ADC0_SCIS23_AVAILABLE                 1
#define FM_ADC0_SCIS23_AVAILABLE                  1
#define FM4_ADC0_SCTSL_AVAILABLE                  1
#define FM_ADC0_SCTSL_AVAILABLE                   1
#define FM4_ADC0_SFNS_AVAILABLE                   1
#define FM_ADC0_SFNS_AVAILABLE                    1
#define FM4_ADC0_WCMPCR_AVAILABLE                 1
#define FM_ADC0_WCMPCR_AVAILABLE                  1
#define FM4_ADC0_WCMPDH_AVAILABLE                 1
#define FM_ADC0_WCMPDH_AVAILABLE                  1
#define FM4_ADC0_WCMPDL_AVAILABLE                 1
#define FM_ADC0_WCMPDL_AVAILABLE                  1
#define FM4_ADC0_WCMPSR_AVAILABLE                 1
#define FM_ADC0_WCMPSR_AVAILABLE                  1
#define FM4_ADC0_WCMRCIF_AVAILABLE                1
#define FM_ADC0_WCMRCIF_AVAILABLE                 1
#define FM4_ADC0_WCMRCOT_AVAILABLE                1
#define FM_ADC0_WCMRCOT_AVAILABLE                 1
/******************************************************************************
 ** BT0
 ** 
 ******************************************************************************/
#define FM4_BT0_PPG_PRLH_AVAILABLE                1
#define FM_BT0_PPG_PRLH_AVAILABLE                 1
#define FM4_BT0_PPG_PRLL_AVAILABLE                1
#define FM_BT0_PPG_PRLL_AVAILABLE                 1
#define FM4_BT0_PPG_STC_AVAILABLE                 1
#define FM_BT0_PPG_STC_AVAILABLE                  1
#define FM4_BT0_PPG_TMCR_AVAILABLE                1
#define FM_BT0_PPG_TMCR_AVAILABLE                 1
#define FM4_BT0_PPG_TMCR2_AVAILABLE               1
#define FM_BT0_PPG_TMCR2_AVAILABLE                1
#define FM4_BT0_PPG_TMR_AVAILABLE                 1
#define FM_BT0_PPG_TMR_AVAILABLE                  1
#define FM4_BT0_PWC_DTBF_AVAILABLE                1
#define FM_BT0_PWC_DTBF_AVAILABLE                 1
#define FM4_BT0_PWC_STC_AVAILABLE                 1
#define FM_BT0_PWC_STC_AVAILABLE                  1
#define FM4_BT0_PWC_TMCR_AVAILABLE                1
#define FM_BT0_PWC_TMCR_AVAILABLE                 1
#define FM4_BT0_PWC_TMCR2_AVAILABLE               1
#define FM_BT0_PWC_TMCR2_AVAILABLE                1
#define FM4_BT0_PWM_PCSR_AVAILABLE                1
#define FM_BT0_PWM_PCSR_AVAILABLE                 1
#define FM4_BT0_PWM_PDUT_AVAILABLE                1
#define FM_BT0_PWM_PDUT_AVAILABLE                 1
#define FM4_BT0_PWM_STC_AVAILABLE                 1
#define FM_BT0_PWM_STC_AVAILABLE                  1
#define FM4_BT0_PWM_TMCR_AVAILABLE                1
#define FM_BT0_PWM_TMCR_AVAILABLE                 1
#define FM4_BT0_PWM_TMCR2_AVAILABLE               1
#define FM_BT0_PWM_TMCR2_AVAILABLE                1
#define FM4_BT0_PWM_TMR_AVAILABLE                 1
#define FM_BT0_PWM_TMR_AVAILABLE                  1
#define FM4_BT0_RT_PCSR_AVAILABLE                 1
#define FM_BT0_RT_PCSR_AVAILABLE                  1
#define FM4_BT0_RT_STC_AVAILABLE                  1
#define FM_BT0_RT_STC_AVAILABLE                   1
#define FM4_BT0_RT_TMCR_AVAILABLE                 1
#define FM_BT0_RT_TMCR_AVAILABLE                  1
#define FM4_BT0_RT_TMCR2_AVAILABLE                1
#define FM_BT0_RT_TMCR2_AVAILABLE                 1
#define FM4_BT0_RT_TMR_AVAILABLE                  1
#define FM_BT0_RT_TMR_AVAILABLE                   1
/******************************************************************************
 ** BTIOSEL03
 ** 
 ******************************************************************************/
#define FM4_BTIOSEL03_BTSEL0123_AVAILABLE         1
#define FM_BTIOSEL03_BTSEL0123_AVAILABLE          1
/******************************************************************************
 ** BTIOSEL47
 ** 
 ******************************************************************************/
#define FM4_BTIOSEL47_BTSEL4567_AVAILABLE         1
#define FM_BTIOSEL47_BTSEL4567_AVAILABLE          1
/******************************************************************************
 ** BTIOSEL8B
 ** 
 ******************************************************************************/
#define FM4_BTIOSEL8B_BTSEL89AB_AVAILABLE         1
#define FM_BTIOSEL8B_BTSEL89AB_AVAILABLE          1
/******************************************************************************
 ** BTIOSELCF
 ** 
 ******************************************************************************/
#define FM4_BTIOSELCF_BTSELCDEF_AVAILABLE         1
#define FM_BTIOSELCF_BTSELCDEF_AVAILABLE          1
/******************************************************************************
 ** CAN0
 ** 
 ******************************************************************************/
#define FM4_CAN0_BRPER_AVAILABLE                  1
#define FM_CAN0_BRPER_AVAILABLE                   1
#define FM4_CAN0_BTR_AVAILABLE                    1
#define FM_CAN0_BTR_AVAILABLE                     1
#define FM4_CAN0_CTRLR_AVAILABLE                  1
#define FM_CAN0_CTRLR_AVAILABLE                   1
#define FM4_CAN0_ERRCNT_AVAILABLE                 1
#define FM_CAN0_ERRCNT_AVAILABLE                  1
#define FM4_CAN0_IF1ARB_AVAILABLE                 1
#define FM_CAN0_IF1ARB_AVAILABLE                  1
#define FM4_CAN0_IF1CMSK_AVAILABLE                1
#define FM_CAN0_IF1CMSK_AVAILABLE                 1
#define FM4_CAN0_IF1CREQ_AVAILABLE                1
#define FM_CAN0_IF1CREQ_AVAILABLE                 1
#define FM4_CAN0_IF1DTA_B_AVAILABLE               1
#define FM_CAN0_IF1DTA_B_AVAILABLE                1
#define FM4_CAN0_IF1DTA_L_AVAILABLE               1
#define FM_CAN0_IF1DTA_L_AVAILABLE                1
#define FM4_CAN0_IF1DTB_B_AVAILABLE               1
#define FM_CAN0_IF1DTB_B_AVAILABLE                1
#define FM4_CAN0_IF1DTB_L_AVAILABLE               1
#define FM_CAN0_IF1DTB_L_AVAILABLE                1
#define FM4_CAN0_IF1MCTR_AVAILABLE                1
#define FM_CAN0_IF1MCTR_AVAILABLE                 1
#define FM4_CAN0_IF1MSK_AVAILABLE                 1
#define FM_CAN0_IF1MSK_AVAILABLE                  1
#define FM4_CAN0_IF2ARB_AVAILABLE                 1
#define FM_CAN0_IF2ARB_AVAILABLE                  1
#define FM4_CAN0_IF2CMSK_AVAILABLE                1
#define FM_CAN0_IF2CMSK_AVAILABLE                 1
#define FM4_CAN0_IF2CREQ_AVAILABLE                1
#define FM_CAN0_IF2CREQ_AVAILABLE                 1
#define FM4_CAN0_IF2DTA_B_AVAILABLE               1
#define FM_CAN0_IF2DTA_B_AVAILABLE                1
#define FM4_CAN0_IF2DTA_L_AVAILABLE               1
#define FM_CAN0_IF2DTA_L_AVAILABLE                1
#define FM4_CAN0_IF2DTB_B_AVAILABLE               1
#define FM_CAN0_IF2DTB_B_AVAILABLE                1
#define FM4_CAN0_IF2DTB_L_AVAILABLE               1
#define FM_CAN0_IF2DTB_L_AVAILABLE                1
#define FM4_CAN0_IF2MCTR_AVAILABLE                1
#define FM_CAN0_IF2MCTR_AVAILABLE                 1
#define FM4_CAN0_IF2MSK_AVAILABLE                 1
#define FM_CAN0_IF2MSK_AVAILABLE                  1
#define FM4_CAN0_INTPND_AVAILABLE                 1
#define FM_CAN0_INTPND_AVAILABLE                  1
#define FM4_CAN0_INTR_AVAILABLE                   1
#define FM_CAN0_INTR_AVAILABLE                    1
#define FM4_CAN0_MSGVAL_AVAILABLE                 1
#define FM_CAN0_MSGVAL_AVAILABLE                  1
#define FM4_CAN0_NEWDT_AVAILABLE                  1
#define FM_CAN0_NEWDT_AVAILABLE                   1
#define FM4_CAN0_STATR_AVAILABLE                  1
#define FM_CAN0_STATR_AVAILABLE                   1
#define FM4_CAN0_TESTR_AVAILABLE                  1
#define FM_CAN0_TESTR_AVAILABLE                   1
#define FM4_CAN0_TREQR_AVAILABLE                  1
#define FM_CAN0_TREQR_AVAILABLE                   1
/******************************************************************************
 ** CANFD0
 ** 
 ******************************************************************************/
#define FM4_CANFD0_BTP_AVAILABLE                  1
#define FM_CANFD0_BTP_AVAILABLE                   1
#define FM4_CANFD0_CCCR_AVAILABLE                 1
#define FM_CANFD0_CCCR_AVAILABLE                  1
#define FM4_CANFD0_CREL_AVAILABLE                 1
#define FM_CANFD0_CREL_AVAILABLE                  1
#define FM4_CANFD0_ECR_AVAILABLE                  1
#define FM_CANFD0_ECR_AVAILABLE                   1
#define FM4_CANFD0_ENDN_AVAILABLE                 1
#define FM_CANFD0_ENDN_AVAILABLE                  1
#define FM4_CANFD0_FBTP_AVAILABLE                 1
#define FM_CANFD0_FBTP_AVAILABLE                  1
#define FM4_CANFD0_FDDEAR_AVAILABLE               1
#define FM_CANFD0_FDDEAR_AVAILABLE                1
#define FM4_CANFD0_FDECR_AVAILABLE                1
#define FM_CANFD0_FDECR_AVAILABLE                 1
#define FM4_CANFD0_FDESCR_AVAILABLE               1
#define FM_CANFD0_FDESCR_AVAILABLE                1
#define FM4_CANFD0_FDESR_AVAILABLE                1
#define FM_CANFD0_FDESR_AVAILABLE                 1
#define FM4_CANFD0_FDSEAR_AVAILABLE               1
#define FM_CANFD0_FDSEAR_AVAILABLE                1
#define FM4_CANFD0_GFC_AVAILABLE                  1
#define FM_CANFD0_GFC_AVAILABLE                   1
#define FM4_CANFD0_HPMS_AVAILABLE                 1
#define FM_CANFD0_HPMS_AVAILABLE                  1
#define FM4_CANFD0_IE_AVAILABLE                   1
#define FM_CANFD0_IE_AVAILABLE                    1
#define FM4_CANFD0_ILE_AVAILABLE                  1
#define FM_CANFD0_ILE_AVAILABLE                   1
#define FM4_CANFD0_ILS_AVAILABLE                  1
#define FM_CANFD0_ILS_AVAILABLE                   1
#define FM4_CANFD0_IR_AVAILABLE                   1
#define FM_CANFD0_IR_AVAILABLE                    1
#define FM4_CANFD0_NDAT1_AVAILABLE                1
#define FM_CANFD0_NDAT1_AVAILABLE                 1
#define FM4_CANFD0_NDAT2_AVAILABLE                1
#define FM_CANFD0_NDAT2_AVAILABLE                 1
#define FM4_CANFD0_PSR_AVAILABLE                  1
#define FM_CANFD0_PSR_AVAILABLE                   1
#define FM4_CANFD0_RWD_AVAILABLE                  1
#define FM_CANFD0_RWD_AVAILABLE                   1
#define FM4_CANFD0_RXBC_AVAILABLE                 1
#define FM_CANFD0_RXBC_AVAILABLE                  1
#define FM4_CANFD0_RXESC_AVAILABLE                1
#define FM_CANFD0_RXESC_AVAILABLE                 1
#define FM4_CANFD0_RXF0A_AVAILABLE                1
#define FM_CANFD0_RXF0A_AVAILABLE                 1
#define FM4_CANFD0_RXF0C_AVAILABLE                1
#define FM_CANFD0_RXF0C_AVAILABLE                 1
#define FM4_CANFD0_RXF0S_AVAILABLE                1
#define FM_CANFD0_RXF0S_AVAILABLE                 1
#define FM4_CANFD0_RXF1A_AVAILABLE                1
#define FM_CANFD0_RXF1A_AVAILABLE                 1
#define FM4_CANFD0_RXF1C_AVAILABLE                1
#define FM_CANFD0_RXF1C_AVAILABLE                 1
#define FM4_CANFD0_RXF1S_AVAILABLE                1
#define FM_CANFD0_RXF1S_AVAILABLE                 1
#define FM4_CANFD0_SIDFC_AVAILABLE                1
#define FM_CANFD0_SIDFC_AVAILABLE                 1
#define FM4_CANFD0_TEST_AVAILABLE                 1
#define FM_CANFD0_TEST_AVAILABLE                  1
#define FM4_CANFD0_TOCC_AVAILABLE                 1
#define FM_CANFD0_TOCC_AVAILABLE                  1
#define FM4_CANFD0_TOCV_AVAILABLE                 1
#define FM_CANFD0_TOCV_AVAILABLE                  1
#define FM4_CANFD0_TSCC_AVAILABLE                 1
#define FM_CANFD0_TSCC_AVAILABLE                  1
#define FM4_CANFD0_TSCDTR_AVAILABLE               1
#define FM_CANFD0_TSCDTR_AVAILABLE                1
#define FM4_CANFD0_TSCNTR_AVAILABLE               1
#define FM_CANFD0_TSCNTR_AVAILABLE                1
#define FM4_CANFD0_TSCPCLR_AVAILABLE              1
#define FM_CANFD0_TSCPCLR_AVAILABLE               1
#define FM4_CANFD0_TSCV_AVAILABLE                 1
#define FM_CANFD0_TSCV_AVAILABLE                  1
#define FM4_CANFD0_TSDIVR_AVAILABLE               1
#define FM_CANFD0_TSDIVR_AVAILABLE                1
#define FM4_CANFD0_TSMDR_AVAILABLE                1
#define FM_CANFD0_TSMDR_AVAILABLE                 1
#define FM4_CANFD0_TXBAR_AVAILABLE                1
#define FM_CANFD0_TXBAR_AVAILABLE                 1
#define FM4_CANFD0_TXBC_AVAILABLE                 1
#define FM_CANFD0_TXBC_AVAILABLE                  1
#define FM4_CANFD0_TXBCF_AVAILABLE                1
#define FM_CANFD0_TXBCF_AVAILABLE                 1
#define FM4_CANFD0_TXBCIE_AVAILABLE               1
#define FM_CANFD0_TXBCIE_AVAILABLE                1
#define FM4_CANFD0_TXBCR_AVAILABLE                1
#define FM_CANFD0_TXBCR_AVAILABLE                 1
#define FM4_CANFD0_TXBRP_AVAILABLE                1
#define FM_CANFD0_TXBRP_AVAILABLE                 1
#define FM4_CANFD0_TXBTIE_AVAILABLE               1
#define FM_CANFD0_TXBTIE_AVAILABLE                1
#define FM4_CANFD0_TXBTO_AVAILABLE                1
#define FM_CANFD0_TXBTO_AVAILABLE                 1
#define FM4_CANFD0_TXEFC_AVAILABLE                1
#define FM_CANFD0_TXEFC_AVAILABLE                 1
#define FM4_CANFD0_TXESC_AVAILABLE                1
#define FM_CANFD0_TXESC_AVAILABLE                 1
#define FM4_CANFD0_TXFA_AVAILABLE                 1
#define FM_CANFD0_TXFA_AVAILABLE                  1
#define FM4_CANFD0_TXFQS_AVAILABLE                1
#define FM_CANFD0_TXFQS_AVAILABLE                 1
#define FM4_CANFD0_TXFS_AVAILABLE                 1
#define FM_CANFD0_TXFS_AVAILABLE                  1
#define FM4_CANFD0_XIDAM_AVAILABLE                1
#define FM_CANFD0_XIDAM_AVAILABLE                 1
#define FM4_CANFD0_XIDFC_AVAILABLE                1
#define FM_CANFD0_XIDFC_AVAILABLE                 1
/******************************************************************************
 ** CANPRES
 ** 
 ******************************************************************************/
#define FM4_CANPRES_CANPRE_AVAILABLE              1
#define FM_CANPRES_CANPRE_AVAILABLE               1
/******************************************************************************
 ** CLK_GATING
 ** 
 ******************************************************************************/
#define FM4_CLK_GATING_CKEN0_AVAILABLE            1
#define FM_CLK_GATING_CKEN0_AVAILABLE             1
#define FM4_CLK_GATING_CKEN1_AVAILABLE            1
#define FM_CLK_GATING_CKEN1_AVAILABLE             1
#define FM4_CLK_GATING_CKEN2_AVAILABLE            1
#define FM_CLK_GATING_CKEN2_AVAILABLE             1
#define FM4_CLK_GATING_MRST0_AVAILABLE            1
#define FM_CLK_GATING_MRST0_AVAILABLE             1
#define FM4_CLK_GATING_MRST1_AVAILABLE            1
#define FM_CLK_GATING_MRST1_AVAILABLE             1
#define FM4_CLK_GATING_MRST2_AVAILABLE            1
#define FM_CLK_GATING_MRST2_AVAILABLE             1
/******************************************************************************
 ** CRC
 ** 
 ******************************************************************************/
#define FM4_CRC_CRCCR_AVAILABLE                   1
#define FM_CRC_CRCCR_AVAILABLE                    1
#define FM4_CRC_CRCIN_AVAILABLE                   1
#define FM_CRC_CRCIN_AVAILABLE                    1
#define FM4_CRC_CRCINIT_AVAILABLE                 1
#define FM_CRC_CRCINIT_AVAILABLE                  1
#define FM4_CRC_CRCR_AVAILABLE                    1
#define FM_CRC_CRCR_AVAILABLE                     1
/******************************************************************************
 ** CRG
 ** 
 ******************************************************************************/
#define FM4_CRG_APBC0_PSR_AVAILABLE               1
#define FM_CRG_APBC0_PSR_AVAILABLE                1
#define FM4_CRG_APBC1_PSR_AVAILABLE               1
#define FM_CRG_APBC1_PSR_AVAILABLE                1
#define FM4_CRG_APBC2_PSR_AVAILABLE               1
#define FM_CRG_APBC2_PSR_AVAILABLE                1
#define FM4_CRG_BSC_PSR_AVAILABLE                 1
#define FM_CRG_BSC_PSR_AVAILABLE                  1
#define FM4_CRG_CSV_CTL_AVAILABLE                 1
#define FM_CRG_CSV_CTL_AVAILABLE                  1
#define FM4_CRG_CSV_STR_AVAILABLE                 1
#define FM_CRG_CSV_STR_AVAILABLE                  1
#define FM4_CRG_CSW_TMR_AVAILABLE                 1
#define FM_CRG_CSW_TMR_AVAILABLE                  1
#define FM4_CRG_DBWDT_CTL_AVAILABLE               1
#define FM_CRG_DBWDT_CTL_AVAILABLE                1
#define FM4_CRG_FCSWD_CTL_AVAILABLE               1
#define FM_CRG_FCSWD_CTL_AVAILABLE                1
#define FM4_CRG_FCSWH_CTL_AVAILABLE               1
#define FM_CRG_FCSWH_CTL_AVAILABLE                1
#define FM4_CRG_FCSWL_CTL_AVAILABLE               1
#define FM_CRG_FCSWL_CTL_AVAILABLE                1
#define FM4_CRG_INT_CLR_AVAILABLE                 1
#define FM_CRG_INT_CLR_AVAILABLE                  1
#define FM4_CRG_INT_ENR_AVAILABLE                 1
#define FM_CRG_INT_ENR_AVAILABLE                  1
#define FM4_CRG_INT_STR_AVAILABLE                 1
#define FM_CRG_INT_STR_AVAILABLE                  1
#define FM4_CRG_PLL_CTL1_AVAILABLE                1
#define FM_CRG_PLL_CTL1_AVAILABLE                 1
#define FM4_CRG_PLL_CTL2_AVAILABLE                1
#define FM_CRG_PLL_CTL2_AVAILABLE                 1
#define FM4_CRG_PLLCG_CTL_AVAILABLE               1
#define FM_CRG_PLLCG_CTL_AVAILABLE                1
#define FM4_CRG_PSW_TMR_AVAILABLE                 1
#define FM_CRG_PSW_TMR_AVAILABLE                  1
#define FM4_CRG_RST_STR_AVAILABLE                 1
#define FM_CRG_RST_STR_AVAILABLE                  1
#define FM4_CRG_SCM_CTL_AVAILABLE                 1
#define FM_CRG_SCM_CTL_AVAILABLE                  1
#define FM4_CRG_SCM_STR_AVAILABLE                 1
#define FM_CRG_SCM_STR_AVAILABLE                  1
#define FM4_CRG_STB_CTL_AVAILABLE                 1
#define FM_CRG_STB_CTL_AVAILABLE                  1
#define FM4_CRG_SWC_PSR_AVAILABLE                 1
#define FM_CRG_SWC_PSR_AVAILABLE                  1
#define FM4_CRG_TTC_PSR_AVAILABLE                 1
#define FM_CRG_TTC_PSR_AVAILABLE                  1
/******************************************************************************
 ** CRTRIM
 ** 
