neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define FM_ETHERNET_MAC0_MMC_INTR_MASK_RX_AVAILABLE 1
#define FM4_ETHERNET_MAC0_MMC_INTR_MASK_TX_AVAILABLE 1
#define FM_ETHERNET_MAC0_MMC_INTR_MASK_TX_AVAILABLE 1
#define FM4_ETHERNET_MAC0_MMC_INTR_RX_AVAILABLE   1
#define FM_ETHERNET_MAC0_MMC_INTR_RX_AVAILABLE    1
#define FM4_ETHERNET_MAC0_MMC_INTR_TX_AVAILABLE   1
#define FM_ETHERNET_MAC0_MMC_INTR_TX_AVAILABLE    1
#define FM4_ETHERNET_MAC0_MMC_IPC_INTR_MASK_RX_AVAILABLE 1
#define FM_ETHERNET_MAC0_MMC_IPC_INTR_MASK_RX_AVAILABLE 1
#define FM4_ETHERNET_MAC0_MMC_IPC_INTR_RX_AVAILABLE 1
#define FM_ETHERNET_MAC0_MMC_IPC_INTR_RX_AVAILABLE 1
#define FM4_ETHERNET_MAC0_OMR_AVAILABLE           1
#define FM_ETHERNET_MAC0_OMR_AVAILABLE            1
#define FM4_ETHERNET_MAC0_PMTR_AVAILABLE          1
#define FM_ETHERNET_MAC0_PMTR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_PPSCR_AVAILABLE         1
#define FM_ETHERNET_MAC0_PPSCR_AVAILABLE          1
#define FM4_ETHERNET_MAC0_RDLAR_AVAILABLE         1
#define FM_ETHERNET_MAC0_RDLAR_AVAILABLE          1
#define FM4_ETHERNET_MAC0_RGSR_AVAILABLE          1
#define FM_ETHERNET_MAC0_RGSR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_RIWTR_AVAILABLE         1
#define FM_ETHERNET_MAC0_RIWTR_AVAILABLE          1
#define FM4_ETHERNET_MAC0_RPDR_AVAILABLE          1
#define FM_ETHERNET_MAC0_RPDR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_RWFFR_AVAILABLE         1
#define FM_ETHERNET_MAC0_RWFFR_AVAILABLE          1
#define FM4_ETHERNET_MAC0_RX1024TOMAXOCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_RX1024TOMAXOCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RX128TO255OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_RX128TO255OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RX256TO511OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_RX256TO511OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RX512TO1023OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_RX512TO1023OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RX64OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_RX64OCTETS_GB_AVAILABLE  1
#define FM4_ETHERNET_MAC0_RX65TO127OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_RX65TO127OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXALLIGNMENTERROR_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXALLIGNMENTERROR_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXBROADCASTFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXBROADCASTFRAMES_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXCRCERROR_AVAILABLE    1
#define FM_ETHERNET_MAC0_RXCRCERROR_AVAILABLE     1
#define FM4_ETHERNET_MAC0_RXFIFOOVERFLOW_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXFIFOOVERFLOW_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXFRAMECOUNT_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXFRAMECOUNT_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXICMP_ERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXICMP_ERR_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXICMP_ERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXICMP_ERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXICMP_GD_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXICMP_GD_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXICMP_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXICMP_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_FRAG_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_FRAG_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_FRAG_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_FRAG_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_GD_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_GD_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_HDRERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_HDRERR_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_HDRERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_HDRERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_NOPAY_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_NOPAY_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_NOPAY_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_NOPAY_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_UDSBL_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_UDSBL_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV4_UDSBL_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV4_UDSBL_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV6_GD_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV6_GD_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV6_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV6_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV6_HDRERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV6_HDRERR_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV6_HDRERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV6_HDRERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV6_NOPAY_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV6_NOPAY_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXIPV6_NOPAY_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXIPV6_NOPAY_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXJABBERERROR_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXJABBERERROR_AVAILABLE  1
#define FM4_ETHERNET_MAC0_RXLENGTHERROR_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXLENGTHERROR_AVAILABLE  1
#define FM4_ETHERNET_MAC0_RXMULTICASTFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXMULTICASTFRAMES_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXOCTETCOUNT_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXOCTETCOUNT_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXOCTETCOUNT_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXOCTETCOUNT_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXOUTOFRANGETYPE_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXOUTOFRANGETYPE_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXOVERSIZE_G_AVAILABLE  1
#define FM_ETHERNET_MAC0_RXOVERSIZE_G_AVAILABLE   1
#define FM4_ETHERNET_MAC0_RXPAUSEFRAMES_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXPAUSEFRAMES_AVAILABLE  1
#define FM4_ETHERNET_MAC0_RXRUNTERROR_AVAILABLE   1
#define FM_ETHERNET_MAC0_RXRUNTERROR_AVAILABLE    1
#define FM4_ETHERNET_MAC0_RXTCP_ERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXTCP_ERR_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXTCP_ERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXTCP_ERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXTCP_GD_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXTCP_GD_FRMS_AVAILABLE  1
#define FM4_ETHERNET_MAC0_RXTCP_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXTCP_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXUDP_ERR_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXUDP_ERR_FRMS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXUDP_ERR_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXUDP_ERR_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXUDP_GD_FRMS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXUDP_GD_FRMS_AVAILABLE  1
#define FM4_ETHERNET_MAC0_RXUDP_GD_OCTETS_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXUDP_GD_OCTETS_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXUNDERSIZE_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXUNDERSIZE_G_AVAILABLE  1
#define FM4_ETHERNET_MAC0_RXUNICASTFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXUNICASTFRAMES_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXVLANFRAMES_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXVLANFRAMES_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_RXWATCHDOGERROR_AVAILABLE 1
#define FM_ETHERNET_MAC0_RXWATCHDOGERROR_AVAILABLE 1
#define FM4_ETHERNET_MAC0_SR_AVAILABLE            1
#define FM_ETHERNET_MAC0_SR_AVAILABLE             1
#define FM4_ETHERNET_MAC0_SSIR_AVAILABLE          1
#define FM_ETHERNET_MAC0_SSIR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_STHWSR_AVAILABLE        1
#define FM_ETHERNET_MAC0_STHWSR_AVAILABLE         1
#define FM4_ETHERNET_MAC0_STNR_AVAILABLE          1
#define FM_ETHERNET_MAC0_STNR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_STNUR_AVAILABLE         1
#define FM_ETHERNET_MAC0_STNUR_AVAILABLE          1
#define FM4_ETHERNET_MAC0_STSR_AVAILABLE          1
#define FM_ETHERNET_MAC0_STSR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_STSUR_AVAILABLE         1
#define FM_ETHERNET_MAC0_STSUR_AVAILABLE          1
#define FM4_ETHERNET_MAC0_TDLAR_AVAILABLE         1
#define FM_ETHERNET_MAC0_TDLAR_AVAILABLE          1
#define FM4_ETHERNET_MAC0_TPDR_AVAILABLE          1
#define FM_ETHERNET_MAC0_TPDR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_TSAR_AVAILABLE          1
#define FM_ETHERNET_MAC0_TSAR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_TSCR_AVAILABLE          1
#define FM_ETHERNET_MAC0_TSCR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_TSR_AVAILABLE           1
#define FM_ETHERNET_MAC0_TSR_AVAILABLE            1
#define FM4_ETHERNET_MAC0_TTNR_AVAILABLE          1
#define FM_ETHERNET_MAC0_TTNR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_TTSR_AVAILABLE          1
#define FM_ETHERNET_MAC0_TTSR_AVAILABLE           1
#define FM4_ETHERNET_MAC0_TX1024TOMAXOCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TX1024TOMAXOCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TX128TO255OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TX128TO255OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TX256TO511OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TX256TO511OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TX512TO1023OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TX512TO1023OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TX64OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TX64OCTETS_GB_AVAILABLE  1
#define FM4_ETHERNET_MAC0_TX65TO127OCTETS_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TX65TO127OCTETS_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXBROADCASTFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXBROADCASTFRAMES_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXBROADCASTFRAMES_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXBROADCASTFRAMES_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXCARRIERERROR_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXCARRIERERROR_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXDEFERRED_AVAILABLE    1
#define FM_ETHERNET_MAC0_TXDEFERRED_AVAILABLE     1
#define FM4_ETHERNET_MAC0_TXEXECESSDEF_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXEXECESSDEF_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXEXESSCOL_AVAILABLE    1
#define FM_ETHERNET_MAC0_TXEXESSCOL_AVAILABLE     1
#define FM4_ETHERNET_MAC0_TXFRAMECOUNT_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXFRAMECOUNT_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXFRAMECOUNT_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXFRAMECOUNT_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXLATECOL_AVAILABLE     1
#define FM_ETHERNET_MAC0_TXLATECOL_AVAILABLE      1
#define FM4_ETHERNET_MAC0_TXMULTICASTFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXMULTICASTFRAMES_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXMULTICASTFRAMES_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXMULTICASTFRAMES_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXMULTICOL_G_AVAILABLE  1
#define FM_ETHERNET_MAC0_TXMULTICOL_G_AVAILABLE   1
#define FM4_ETHERNET_MAC0_TXOCTETCOUNT_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXOCTETCOUNT_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXOCTETCOUNT_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXOCTETCOUNT_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXPAUSEFRAMES_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXPAUSEFRAMES_AVAILABLE  1
#define FM4_ETHERNET_MAC0_TXSINGLECOL_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXSINGLECOL_G_AVAILABLE  1
#define FM4_ETHERNET_MAC0_TXUNDERFLOWERROR_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXUNDERFLOWERROR_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXUNICASTFRAMES_GB_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXUNICASTFRAMES_GB_AVAILABLE 1
#define FM4_ETHERNET_MAC0_TXVLANFRAMES_G_AVAILABLE 1
#define FM_ETHERNET_MAC0_TXVLANFRAMES_G_AVAILABLE 1
#define FM4_ETHERNET_MAC0_VTR_AVAILABLE           1
#define FM_ETHERNET_MAC0_VTR_AVAILABLE            1
/******************************************************************************
 ** EXBUS
 ** 
 ******************************************************************************/
#define FM4_EXBUS_AMODE_AVAILABLE                 1
#define FM_EXBUS_AMODE_AVAILABLE                  1
#define FM4_EXBUS_AREA0_AVAILABLE                 1
#define FM_EXBUS_AREA0_AVAILABLE                  1
#define FM4_EXBUS_AREA1_AVAILABLE                 1
#define FM_EXBUS_AREA1_AVAILABLE                  1
#define FM4_EXBUS_AREA2_AVAILABLE                 1
#define FM_EXBUS_AREA2_AVAILABLE                  1
#define FM4_EXBUS_AREA3_AVAILABLE                 1
#define FM_EXBUS_AREA3_AVAILABLE                  1
#define FM4_EXBUS_AREA4_AVAILABLE                 1
#define FM_EXBUS_AREA4_AVAILABLE                  1
#define FM4_EXBUS_AREA5_AVAILABLE                 1
#define FM_EXBUS_AREA5_AVAILABLE                  1
#define FM4_EXBUS_AREA6_AVAILABLE                 1
#define FM_EXBUS_AREA6_AVAILABLE                  1
#define FM4_EXBUS_AREA7_AVAILABLE                 1
#define FM_EXBUS_AREA7_AVAILABLE                  1
#define FM4_EXBUS_ATIM0_AVAILABLE                 1
#define FM_EXBUS_ATIM0_AVAILABLE                  1
#define FM4_EXBUS_ATIM1_AVAILABLE                 1
#define FM_EXBUS_ATIM1_AVAILABLE                  1
#define FM4_EXBUS_ATIM2_AVAILABLE                 1
#define FM_EXBUS_ATIM2_AVAILABLE                  1
#define FM4_EXBUS_ATIM3_AVAILABLE                 1
#define FM_EXBUS_ATIM3_AVAILABLE                  1
#define FM4_EXBUS_ATIM4_AVAILABLE                 1
#define FM_EXBUS_ATIM4_AVAILABLE                  1
#define FM4_EXBUS_ATIM5_AVAILABLE                 1
#define FM_EXBUS_ATIM5_AVAILABLE                  1
#define FM4_EXBUS_ATIM6_AVAILABLE                 1
#define FM_EXBUS_ATIM6_AVAILABLE                  1
#define FM4_EXBUS_ATIM7_AVAILABLE                 1
#define FM_EXBUS_ATIM7_AVAILABLE                  1
#define FM4_EXBUS_DCLKR_AVAILABLE                 1
#define FM_EXBUS_DCLKR_AVAILABLE                  1
#define FM4_EXBUS_ESCLR_AVAILABLE                 1
#define FM_EXBUS_ESCLR_AVAILABLE                  1
#define FM4_EXBUS_EST_AVAILABLE                   1
#define FM_EXBUS_EST_AVAILABLE                    1
#define FM4_EXBUS_MEMCERR_AVAILABLE               1
#define FM_EXBUS_MEMCERR_AVAILABLE                1
#define FM4_EXBUS_MODE0_AVAILABLE                 1
#define FM_EXBUS_MODE0_AVAILABLE                  1
#define FM4_EXBUS_MODE1_AVAILABLE                 1
#define FM_EXBUS_MODE1_AVAILABLE                  1
#define FM4_EXBUS_MODE2_AVAILABLE                 1
#define FM_EXBUS_MODE2_AVAILABLE                  1
#define FM4_EXBUS_MODE3_AVAILABLE                 1
#define FM_EXBUS_MODE3_AVAILABLE                  1
#define FM4_EXBUS_MODE4_AVAILABLE                 1
#define FM_EXBUS_MODE4_AVAILABLE                  1
#define FM4_EXBUS_MODE5_AVAILABLE                 1
#define FM_EXBUS_MODE5_AVAILABLE                  1
#define FM4_EXBUS_MODE6_AVAILABLE                 1
#define FM_EXBUS_MODE6_AVAILABLE                  1
#define FM4_EXBUS_MODE7_AVAILABLE                 1
#define FM_EXBUS_MODE7_AVAILABLE                  1
#define FM4_EXBUS_PWRDWN_AVAILABLE                1
#define FM_EXBUS_PWRDWN_AVAILABLE                 1
#define FM4_EXBUS_REFTIM_AVAILABLE                1
#define FM_EXBUS_REFTIM_AVAILABLE                 1
#define FM4_EXBUS_SDCMD_AVAILABLE                 1
#define FM_EXBUS_SDCMD_AVAILABLE                  1
#define FM4_EXBUS_SDMODE_AVAILABLE                1
#define FM_EXBUS_SDMODE_AVAILABLE                 1
#define FM4_EXBUS_SDTIM_AVAILABLE                 1
#define FM_EXBUS_SDTIM_AVAILABLE                  1
#define FM4_EXBUS_TIM0_AVAILABLE                  1
#define FM_EXBUS_TIM0_AVAILABLE                   1
#define FM4_EXBUS_TIM1_AVAILABLE                  1
#define FM_EXBUS_TIM1_AVAILABLE                   1
#define FM4_EXBUS_TIM2_AVAILABLE                  1
#define FM_EXBUS_TIM2_AVAILABLE                   1
#define FM4_EXBUS_TIM3_AVAILABLE                  1
#define FM_EXBUS_TIM3_AVAILABLE                   1
#define FM4_EXBUS_TIM4_AVAILABLE                  1
#define FM_EXBUS_TIM4_AVAILABLE                   1
#define FM4_EXBUS_TIM5_AVAILABLE                  1
#define FM_EXBUS_TIM5_AVAILABLE                   1
#define FM4_EXBUS_TIM6_AVAILABLE                  1
#define FM_EXBUS_TIM6_AVAILABLE                   1
#define FM4_EXBUS_TIM7_AVAILABLE                  1
#define FM_EXBUS_TIM7_AVAILABLE                   1
#define FM4_EXBUS_WEAD_AVAILABLE                  1
#define FM_EXBUS_WEAD_AVAILABLE                   1
/******************************************************************************
 ** EXTI
 ** 
 ******************************************************************************/
#define FM4_EXTI_EICL_AVAILABLE                   1
#define FM_EXTI_EICL_AVAILABLE                    1
#define FM4_EXTI_EIRR_AVAILABLE                   1
#define FM_EXTI_EIRR_AVAILABLE                    1
#define FM4_EXTI_ELVR_AVAILABLE                   1
#define FM_EXTI_ELVR_AVAILABLE                    1
#define FM4_EXTI_ELVR1_AVAILABLE                  1
#define FM_EXTI_ELVR1_AVAILABLE                   1
#define FM4_EXTI_ENIR_AVAILABLE                   1
#define FM_EXTI_ENIR_AVAILABLE                    1
#define FM4_EXTI_NMICL_AVAILABLE                  1
#define FM_EXTI_NMICL_AVAILABLE                   1
#define FM4_EXTI_NMIRR_AVAILABLE                  1
#define FM_EXTI_NMIRR_AVAILABLE                   1
/******************************************************************************
 ** FLASH_IF
 ** 
 ******************************************************************************/
#define FM4_FLASH_IF_CRTRMM_AVAILABLE             1
#define FM_FLASH_IF_CRTRMM_AVAILABLE              1
#define FM4_FLASH_IF_DFCTRLR_AVAILABLE            1
#define FM_FLASH_IF_DFCTRLR_AVAILABLE             1
#define FM4_FLASH_IF_FASZR_AVAILABLE              1
#define FM_FLASH_IF_FASZR_AVAILABLE               1
#define FM4_FLASH_IF_FBFCR_AVAILABLE              1
#define FM_FLASH_IF_FBFCR_AVAILABLE               1
#define FM4_FLASH_IF_FGPDM1_AVAILABLE             1
#define FM_FLASH_IF_FGPDM1_AVAILABLE              1
#define FM4_FLASH_IF_FGPDM2_AVAILABLE             1
#define FM_FLASH_IF_FGPDM2_AVAILABLE              1
#define FM4_FLASH_IF_FGPDM3_AVAILABLE             1
#define FM_FLASH_IF_FGPDM3_AVAILABLE              1
#define FM4_FLASH_IF_FGPDM4_AVAILABLE             1
#define FM_FLASH_IF_FGPDM4_AVAILABLE              1
#define FM4_FLASH_IF_FICLR_AVAILABLE              1
#define FM_FLASH_IF_FICLR_AVAILABLE               1
#define FM4_FLASH_IF_FICR_AVAILABLE               1
#define FM_FLASH_IF_FICR_AVAILABLE                1
#define FM4_FLASH_IF_FISR_AVAILABLE               1
#define FM_FLASH_IF_FISR_AVAILABLE                1
#define FM4_FLASH_IF_FRWTR_AVAILABLE              1
#define FM_FLASH_IF_FRWTR_AVAILABLE               1
#define FM4_FLASH_IF_FSTR_AVAILABLE               1
#define FM_FLASH_IF_FSTR_AVAILABLE                1
#define FM4_FLASH_IF_FSYNDN_AVAILABLE             1
#define FM_FLASH_IF_FSYNDN_AVAILABLE              1
/******************************************************************************
 ** GPIO
 ** 
 ******************************************************************************/
#define FM4_GPIO_ADE_AVAILABLE                    1
#define FM_GPIO_ADE_AVAILABLE                     1
#define FM4_GPIO_DDR0_AVAILABLE                   1
#define FM_GPIO_DDR0_AVAILABLE                    1
#define FM4_GPIO_DDR1_AVAILABLE                   1
#define FM_GPIO_DDR1_AVAILABLE                    1
#define FM4_GPIO_DDR2_AVAILABLE                   1
#define FM_GPIO_DDR2_AVAILABLE                    1
#define FM4_GPIO_DDR3_AVAILABLE                   1
#define FM_GPIO_DDR3_AVAILABLE                    1
#define FM4_GPIO_DDR4_AVAILABLE                   1
#define FM_GPIO_DDR4_AVAILABLE                    1
#define FM4_GPIO_DDR5_AVAILABLE                   1
#define FM_GPIO_DDR5_AVAILABLE                    1
#define FM4_GPIO_DDR6_AVAILABLE                   1
#define FM_GPIO_DDR6_AVAILABLE                    1
#define FM4_GPIO_DDR7_AVAILABLE                   1
#define FM_GPIO_DDR7_AVAILABLE                    1
#define FM4_GPIO_DDR8_AVAILABLE                   1
#define FM_GPIO_DDR8_AVAILABLE                    1
#define FM4_GPIO_DDR9_AVAILABLE                   1
#define FM_GPIO_DDR9_AVAILABLE                    1
#define FM4_GPIO_DDRA_AVAILABLE                   1
#define FM_GPIO_DDRA_AVAILABLE                    1
#define FM4_GPIO_DDRB_AVAILABLE                   1
#define FM_GPIO_DDRB_AVAILABLE                    1
#define FM4_GPIO_DDRC_AVAILABLE                   1
#define FM_GPIO_DDRC_AVAILABLE                    1
#define FM4_GPIO_DDRD_AVAILABLE                   1
#define FM_GPIO_DDRD_AVAILABLE                    1
#define FM4_GPIO_DDRE_AVAILABLE                   1
#define FM_GPIO_DDRE_AVAILABLE                    1
#define FM4_GPIO_DDRF_AVAILABLE                   1
#define FM_GPIO_DDRF_AVAILABLE                    1
#define FM4_GPIO_EPFR00_AVAILABLE                 1
#define FM_GPIO_EPFR00_AVAILABLE                  1
#define FM4_GPIO_EPFR01_AVAILABLE                 1
#define FM_GPIO_EPFR01_AVAILABLE                  1
#define FM4_GPIO_EPFR02_AVAILABLE                 1
#define FM_GPIO_EPFR02_AVAILABLE                  1
#define FM4_GPIO_EPFR03_AVAILABLE                 1
#define FM_GPIO_EPFR03_AVAILABLE                  1
#define FM4_GPIO_EPFR04_AVAILABLE                 1
#define FM_GPIO_EPFR04_AVAILABLE                  1
#define FM4_GPIO_EPFR05_AVAILABLE                 1
#define FM_GPIO_EPFR05_AVAILABLE                  1
#define FM4_GPIO_EPFR06_AVAILABLE                 1
#define FM_GPIO_EPFR06_AVAILABLE                  1
#define FM4_GPIO_EPFR07_AVAILABLE                 1
#define FM_GPIO_EPFR07_AVAILABLE                  1
#define FM4_GPIO_EPFR08_AVAILABLE                 1
#define FM_GPIO_EPFR08_AVAILABLE                  1
#define FM4_GPIO_EPFR09_AVAILABLE                 1
#define FM_GPIO_EPFR09_AVAILABLE                  1
#define FM4_GPIO_EPFR10_AVAILABLE                 1
#define FM_GPIO_EPFR10_AVAILABLE                  1
#define FM4_GPIO_EPFR11_AVAILABLE                 1
#define FM_GPIO_EPFR11_AVAILABLE                  1
#define FM4_GPIO_EPFR12_AVAILABLE                 1
#define FM_GPIO_EPFR12_AVAILABLE                  1
#define FM4_GPIO_EPFR13_AVAILABLE                 1
#define FM_GPIO_EPFR13_AVAILABLE                  1
#define FM4_GPIO_EPFR14_AVAILABLE                 1
#define FM_GPIO_EPFR14_AVAILABLE                  1
#define FM4_GPIO_EPFR15_AVAILABLE                 1
#define FM_GPIO_EPFR15_AVAILABLE                  1
#define FM4_GPIO_EPFR16_AVAILABLE                 1
#define FM_GPIO_EPFR16_AVAILABLE                  1
#define FM4_GPIO_EPFR17_AVAILABLE                 1
#define FM_GPIO_EPFR17_AVAILABLE                  1
#define FM4_GPIO_EPFR18_AVAILABLE                 1
#define FM_GPIO_EPFR18_AVAILABLE                  1
#define FM4_GPIO_EPFR19_AVAILABLE                 1
#define FM_GPIO_EPFR19_AVAILABLE                  1
#define FM4_GPIO_EPFR20_AVAILABLE                 1
#define FM_GPIO_EPFR20_AVAILABLE                  1
#define FM4_GPIO_EPFR21_AVAILABLE                 1
#define FM_GPIO_EPFR21_AVAILABLE                  1
#define FM4_GPIO_EPFR22_AVAILABLE                 1
#define FM_GPIO_EPFR22_AVAILABLE                  1
#define FM4_GPIO_EPFR23_AVAILABLE                 1
#define FM_GPIO_EPFR23_AVAILABLE                  1
#define FM4_GPIO_EPFR24_AVAILABLE                 1
#define FM_GPIO_EPFR24_AVAILABLE                  1
#define FM4_GPIO_EPFR25_AVAILABLE                 1
#define FM_GPIO_EPFR25_AVAILABLE                  1
#define FM4_GPIO_EPFR26_AVAILABLE                 1
#define FM_GPIO_EPFR26_AVAILABLE                  1
#define FM4_GPIO_PCR0_AVAILABLE                   1
#define FM_GPIO_PCR0_AVAILABLE                    1
#define FM4_GPIO_PCR1_AVAILABLE                   1
#define FM_GPIO_PCR1_AVAILABLE                    1
#define FM4_GPIO_PCR2_AVAILABLE                   1
#define FM_GPIO_PCR2_AVAILABLE                    1
#define FM4_GPIO_PCR3_AVAILABLE                   1
#define FM_GPIO_PCR3_AVAILABLE                    1
#define FM4_GPIO_PCR4_AVAILABLE                   1
#define FM_GPIO_PCR4_AVAILABLE                    1
#define FM4_GPIO_PCR5_AVAILABLE                   1
#define FM_GPIO_PCR5_AVAILABLE                    1
