neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define FM4_MFT0_ICU_ICFS32_AVAILABLE             1
#define FM_MFT0_ICU_ICFS32_AVAILABLE              1
#define FM4_MFT0_ICU_ICSA10_AVAILABLE             1
#define FM_MFT0_ICU_ICSA10_AVAILABLE              1
#define FM4_MFT0_ICU_ICSA32_AVAILABLE             1
#define FM_MFT0_ICU_ICSA32_AVAILABLE              1
#define FM4_MFT0_ICU_ICSB10_AVAILABLE             1
#define FM_MFT0_ICU_ICSB10_AVAILABLE              1
#define FM4_MFT0_ICU_ICSB32_AVAILABLE             1
#define FM_MFT0_ICU_ICSB32_AVAILABLE              1
#define FM4_MFT0_OCU_OCCP0_AVAILABLE              1
#define FM_MFT0_OCU_OCCP0_AVAILABLE               1
#define FM4_MFT0_OCU_OCCP1_AVAILABLE              1
#define FM_MFT0_OCU_OCCP1_AVAILABLE               1
#define FM4_MFT0_OCU_OCCP2_AVAILABLE              1
#define FM_MFT0_OCU_OCCP2_AVAILABLE               1
#define FM4_MFT0_OCU_OCCP3_AVAILABLE              1
#define FM_MFT0_OCU_OCCP3_AVAILABLE               1
#define FM4_MFT0_OCU_OCCP4_AVAILABLE              1
#define FM_MFT0_OCU_OCCP4_AVAILABLE               1
#define FM4_MFT0_OCU_OCCP5_AVAILABLE              1
#define FM_MFT0_OCU_OCCP5_AVAILABLE               1
#define FM4_MFT0_OCU_OCFS10_AVAILABLE             1
#define FM_MFT0_OCU_OCFS10_AVAILABLE              1
#define FM4_MFT0_OCU_OCFS32_AVAILABLE             1
#define FM_MFT0_OCU_OCFS32_AVAILABLE              1
#define FM4_MFT0_OCU_OCFS54_AVAILABLE             1
#define FM_MFT0_OCU_OCFS54_AVAILABLE              1
#define FM4_MFT0_OCU_OCSA10_AVAILABLE             1
#define FM_MFT0_OCU_OCSA10_AVAILABLE              1
#define FM4_MFT0_OCU_OCSA32_AVAILABLE             1
#define FM_MFT0_OCU_OCSA32_AVAILABLE              1
#define FM4_MFT0_OCU_OCSA54_AVAILABLE             1
#define FM_MFT0_OCU_OCSA54_AVAILABLE              1
#define FM4_MFT0_OCU_OCSB10_AVAILABLE             1
#define FM_MFT0_OCU_OCSB10_AVAILABLE              1
#define FM4_MFT0_OCU_OCSB32_AVAILABLE             1
#define FM_MFT0_OCU_OCSB32_AVAILABLE              1
#define FM4_MFT0_OCU_OCSB54_AVAILABLE             1
#define FM_MFT0_OCU_OCSB54_AVAILABLE              1
#define FM4_MFT0_OCU_OCSC_AVAILABLE               1
#define FM_MFT0_OCU_OCSC_AVAILABLE                1
#define FM4_MFT0_OCU_OCSD10_AVAILABLE             1
#define FM_MFT0_OCU_OCSD10_AVAILABLE              1
#define FM4_MFT0_OCU_OCSD32_AVAILABLE             1
#define FM_MFT0_OCU_OCSD32_AVAILABLE              1
#define FM4_MFT0_OCU_OCSD54_AVAILABLE             1
#define FM_MFT0_OCU_OCSD54_AVAILABLE              1
#define FM4_MFT0_OCU_OCSE0_AVAILABLE              1
#define FM_MFT0_OCU_OCSE0_AVAILABLE               1
#define FM4_MFT0_OCU_OCSE1_AVAILABLE              1
#define FM_MFT0_OCU_OCSE1_AVAILABLE               1
#define FM4_MFT0_OCU_OCSE2_AVAILABLE              1
#define FM_MFT0_OCU_OCSE2_AVAILABLE               1
#define FM4_MFT0_OCU_OCSE3_AVAILABLE              1
#define FM_MFT0_OCU_OCSE3_AVAILABLE               1
#define FM4_MFT0_OCU_OCSE4_AVAILABLE              1
#define FM_MFT0_OCU_OCSE4_AVAILABLE               1
#define FM4_MFT0_OCU_OCSE5_AVAILABLE              1
#define FM_MFT0_OCU_OCSE5_AVAILABLE               1
#define FM4_MFT0_WFG_NZCL_AVAILABLE               1
#define FM_MFT0_WFG_NZCL_AVAILABLE                1
#define FM4_MFT0_WFG_WFIR_AVAILABLE               1
#define FM_MFT0_WFG_WFIR_AVAILABLE                1
#define FM4_MFT0_WFG_WFSA10_AVAILABLE             1
#define FM_MFT0_WFG_WFSA10_AVAILABLE              1
#define FM4_MFT0_WFG_WFSA32_AVAILABLE             1
#define FM_MFT0_WFG_WFSA32_AVAILABLE              1
#define FM4_MFT0_WFG_WFSA54_AVAILABLE             1
#define FM_MFT0_WFG_WFSA54_AVAILABLE              1
#define FM4_MFT0_WFG_WFTA10_AVAILABLE             1
#define FM_MFT0_WFG_WFTA10_AVAILABLE              1
#define FM4_MFT0_WFG_WFTA32_AVAILABLE             1
#define FM_MFT0_WFG_WFTA32_AVAILABLE              1
#define FM4_MFT0_WFG_WFTA54_AVAILABLE             1
#define FM_MFT0_WFG_WFTA54_AVAILABLE              1
#define FM4_MFT0_WFG_WFTB10_AVAILABLE             1
#define FM_MFT0_WFG_WFTB10_AVAILABLE              1
#define FM4_MFT0_WFG_WFTB32_AVAILABLE             1
#define FM_MFT0_WFG_WFTB32_AVAILABLE              1
#define FM4_MFT0_WFG_WFTB54_AVAILABLE             1
#define FM_MFT0_WFG_WFTB54_AVAILABLE              1
#define FM4_MFT0_WFG_WFTF10_AVAILABLE             1
#define FM_MFT0_WFG_WFTF10_AVAILABLE              1
#define FM4_MFT0_WFG_WFTF32_AVAILABLE             1
#define FM_MFT0_WFG_WFTF32_AVAILABLE              1
#define FM4_MFT0_WFG_WFTF54_AVAILABLE             1
#define FM_MFT0_WFG_WFTF54_AVAILABLE              1
/******************************************************************************
 ** MFT_PPG
 ** 
 ******************************************************************************/
#define FM4_MFT_PPG_COMP0_AVAILABLE               1
#define FM_MFT_PPG_COMP0_AVAILABLE                1
#define FM4_MFT_PPG_COMP1_AVAILABLE               1
#define FM_MFT_PPG_COMP1_AVAILABLE                1
#define FM4_MFT_PPG_COMP10_AVAILABLE              1
#define FM_MFT_PPG_COMP10_AVAILABLE               1
#define FM4_MFT_PPG_COMP12_AVAILABLE              1
#define FM_MFT_PPG_COMP12_AVAILABLE               1
#define FM4_MFT_PPG_COMP14_AVAILABLE              1
#define FM_MFT_PPG_COMP14_AVAILABLE               1
#define FM4_MFT_PPG_COMP2_AVAILABLE               1
#define FM_MFT_PPG_COMP2_AVAILABLE                1
#define FM4_MFT_PPG_COMP3_AVAILABLE               1
#define FM_MFT_PPG_COMP3_AVAILABLE                1
#define FM4_MFT_PPG_COMP4_AVAILABLE               1
#define FM_MFT_PPG_COMP4_AVAILABLE                1
#define FM4_MFT_PPG_COMP5_AVAILABLE               1
#define FM_MFT_PPG_COMP5_AVAILABLE                1
#define FM4_MFT_PPG_COMP6_AVAILABLE               1
#define FM_MFT_PPG_COMP6_AVAILABLE                1
#define FM4_MFT_PPG_COMP7_AVAILABLE               1
#define FM_MFT_PPG_COMP7_AVAILABLE                1
#define FM4_MFT_PPG_COMP8_AVAILABLE               1
#define FM_MFT_PPG_COMP8_AVAILABLE                1
#define FM4_MFT_PPG_GATEC0_AVAILABLE              1
#define FM_MFT_PPG_GATEC0_AVAILABLE               1
#define FM4_MFT_PPG_GATEC12_AVAILABLE             1
#define FM_MFT_PPG_GATEC12_AVAILABLE              1
#define FM4_MFT_PPG_GATEC16_AVAILABLE             1
#define FM_MFT_PPG_GATEC16_AVAILABLE              1
#define FM4_MFT_PPG_GATEC20_AVAILABLE             1
#define FM_MFT_PPG_GATEC20_AVAILABLE              1
#define FM4_MFT_PPG_GATEC4_AVAILABLE              1
#define FM_MFT_PPG_GATEC4_AVAILABLE               1
#define FM4_MFT_PPG_GATEC8_AVAILABLE              1
#define FM_MFT_PPG_GATEC8_AVAILABLE               1
#define FM4_MFT_PPG_PPGC0_AVAILABLE               1
#define FM_MFT_PPG_PPGC0_AVAILABLE                1
#define FM4_MFT_PPG_PPGC1_AVAILABLE               1
#define FM_MFT_PPG_PPGC1_AVAILABLE                1
#define FM4_MFT_PPG_PPGC10_AVAILABLE              1
#define FM_MFT_PPG_PPGC10_AVAILABLE               1
#define FM4_MFT_PPG_PPGC11_AVAILABLE              1
#define FM_MFT_PPG_PPGC11_AVAILABLE               1
#define FM4_MFT_PPG_PPGC12_AVAILABLE              1
#define FM_MFT_PPG_PPGC12_AVAILABLE               1
#define FM4_MFT_PPG_PPGC13_AVAILABLE              1
#define FM_MFT_PPG_PPGC13_AVAILABLE               1
#define FM4_MFT_PPG_PPGC14_AVAILABLE              1
#define FM_MFT_PPG_PPGC14_AVAILABLE               1
#define FM4_MFT_PPG_PPGC15_AVAILABLE              1
#define FM_MFT_PPG_PPGC15_AVAILABLE               1
#define FM4_MFT_PPG_PPGC16_AVAILABLE              1
#define FM_MFT_PPG_PPGC16_AVAILABLE               1
#define FM4_MFT_PPG_PPGC17_AVAILABLE              1
#define FM_MFT_PPG_PPGC17_AVAILABLE               1
#define FM4_MFT_PPG_PPGC18_AVAILABLE              1
#define FM_MFT_PPG_PPGC18_AVAILABLE               1
#define FM4_MFT_PPG_PPGC19_AVAILABLE              1
#define FM_MFT_PPG_PPGC19_AVAILABLE               1
#define FM4_MFT_PPG_PPGC2_AVAILABLE               1
#define FM_MFT_PPG_PPGC2_AVAILABLE                1
#define FM4_MFT_PPG_PPGC20_AVAILABLE              1
#define FM_MFT_PPG_PPGC20_AVAILABLE               1
#define FM4_MFT_PPG_PPGC21_AVAILABLE              1
#define FM_MFT_PPG_PPGC21_AVAILABLE               1
#define FM4_MFT_PPG_PPGC22_AVAILABLE              1
#define FM_MFT_PPG_PPGC22_AVAILABLE               1
#define FM4_MFT_PPG_PPGC23_AVAILABLE              1
#define FM_MFT_PPG_PPGC23_AVAILABLE               1
#define FM4_MFT_PPG_PPGC3_AVAILABLE               1
#define FM_MFT_PPG_PPGC3_AVAILABLE                1
#define FM4_MFT_PPG_PPGC4_AVAILABLE               1
#define FM_MFT_PPG_PPGC4_AVAILABLE                1
#define FM4_MFT_PPG_PPGC5_AVAILABLE               1
#define FM_MFT_PPG_PPGC5_AVAILABLE                1
#define FM4_MFT_PPG_PPGC6_AVAILABLE               1
#define FM_MFT_PPG_PPGC6_AVAILABLE                1
#define FM4_MFT_PPG_PPGC7_AVAILABLE               1
#define FM_MFT_PPG_PPGC7_AVAILABLE                1
#define FM4_MFT_PPG_PPGC8_AVAILABLE               1
#define FM_MFT_PPG_PPGC8_AVAILABLE                1
#define FM4_MFT_PPG_PPGC9_AVAILABLE               1
#define FM_MFT_PPG_PPGC9_AVAILABLE                1
#define FM4_MFT_PPG_PRLH0_AVAILABLE               1
#define FM_MFT_PPG_PRLH0_AVAILABLE                1
#define FM4_MFT_PPG_PRLH1_AVAILABLE               1
#define FM_MFT_PPG_PRLH1_AVAILABLE                1
#define FM4_MFT_PPG_PRLH10_AVAILABLE              1
#define FM_MFT_PPG_PRLH10_AVAILABLE               1
#define FM4_MFT_PPG_PRLH11_AVAILABLE              1
#define FM_MFT_PPG_PRLH11_AVAILABLE               1
#define FM4_MFT_PPG_PRLH12_AVAILABLE              1
#define FM_MFT_PPG_PRLH12_AVAILABLE               1
#define FM4_MFT_PPG_PRLH13_AVAILABLE              1
#define FM_MFT_PPG_PRLH13_AVAILABLE               1
#define FM4_MFT_PPG_PRLH14_AVAILABLE              1
#define FM_MFT_PPG_PRLH14_AVAILABLE               1
#define FM4_MFT_PPG_PRLH15_AVAILABLE              1
#define FM_MFT_PPG_PRLH15_AVAILABLE               1
#define FM4_MFT_PPG_PRLH16_AVAILABLE              1
#define FM_MFT_PPG_PRLH16_AVAILABLE               1
#define FM4_MFT_PPG_PRLH17_AVAILABLE              1
#define FM_MFT_PPG_PRLH17_AVAILABLE               1
#define FM4_MFT_PPG_PRLH18_AVAILABLE              1
#define FM_MFT_PPG_PRLH18_AVAILABLE               1
#define FM4_MFT_PPG_PRLH19_AVAILABLE              1
#define FM_MFT_PPG_PRLH19_AVAILABLE               1
#define FM4_MFT_PPG_PRLH2_AVAILABLE               1
#define FM_MFT_PPG_PRLH2_AVAILABLE                1
#define FM4_MFT_PPG_PRLH20_AVAILABLE              1
#define FM_MFT_PPG_PRLH20_AVAILABLE               1
#define FM4_MFT_PPG_PRLH21_AVAILABLE              1
#define FM_MFT_PPG_PRLH21_AVAILABLE               1
#define FM4_MFT_PPG_PRLH22_AVAILABLE              1
#define FM_MFT_PPG_PRLH22_AVAILABLE               1
#define FM4_MFT_PPG_PRLH23_AVAILABLE              1
#define FM_MFT_PPG_PRLH23_AVAILABLE               1
#define FM4_MFT_PPG_PRLH3_AVAILABLE               1
#define FM_MFT_PPG_PRLH3_AVAILABLE                1
#define FM4_MFT_PPG_PRLH4_AVAILABLE               1
#define FM_MFT_PPG_PRLH4_AVAILABLE                1
#define FM4_MFT_PPG_PRLH5_AVAILABLE               1
#define FM_MFT_PPG_PRLH5_AVAILABLE                1
#define FM4_MFT_PPG_PRLH6_AVAILABLE               1
#define FM_MFT_PPG_PRLH6_AVAILABLE                1
#define FM4_MFT_PPG_PRLH7_AVAILABLE               1
#define FM_MFT_PPG_PRLH7_AVAILABLE                1
#define FM4_MFT_PPG_PRLH8_AVAILABLE               1
#define FM_MFT_PPG_PRLH8_AVAILABLE                1
#define FM4_MFT_PPG_PRLH9_AVAILABLE               1
#define FM_MFT_PPG_PRLH9_AVAILABLE                1
#define FM4_MFT_PPG_PRLL0_AVAILABLE               1
#define FM_MFT_PPG_PRLL0_AVAILABLE                1
#define FM4_MFT_PPG_PRLL1_AVAILABLE               1
#define FM_MFT_PPG_PRLL1_AVAILABLE                1
#define FM4_MFT_PPG_PRLL10_AVAILABLE              1
#define FM_MFT_PPG_PRLL10_AVAILABLE               1
#define FM4_MFT_PPG_PRLL11_AVAILABLE              1
#define FM_MFT_PPG_PRLL11_AVAILABLE               1
#define FM4_MFT_PPG_PRLL12_AVAILABLE              1
#define FM_MFT_PPG_PRLL12_AVAILABLE               1
#define FM4_MFT_PPG_PRLL13_AVAILABLE              1
#define FM_MFT_PPG_PRLL13_AVAILABLE               1
#define FM4_MFT_PPG_PRLL14_AVAILABLE              1
#define FM_MFT_PPG_PRLL14_AVAILABLE               1
#define FM4_MFT_PPG_PRLL15_AVAILABLE              1
#define FM_MFT_PPG_PRLL15_AVAILABLE               1
#define FM4_MFT_PPG_PRLL16_AVAILABLE              1
#define FM_MFT_PPG_PRLL16_AVAILABLE               1
#define FM4_MFT_PPG_PRLL17_AVAILABLE              1
#define FM_MFT_PPG_PRLL17_AVAILABLE               1
#define FM4_MFT_PPG_PRLL18_AVAILABLE              1
#define FM_MFT_PPG_PRLL18_AVAILABLE               1
#define FM4_MFT_PPG_PRLL19_AVAILABLE              1
#define FM_MFT_PPG_PRLL19_AVAILABLE               1
#define FM4_MFT_PPG_PRLL2_AVAILABLE               1
#define FM_MFT_PPG_PRLL2_AVAILABLE                1
#define FM4_MFT_PPG_PRLL20_AVAILABLE              1
#define FM_MFT_PPG_PRLL20_AVAILABLE               1
#define FM4_MFT_PPG_PRLL21_AVAILABLE              1
#define FM_MFT_PPG_PRLL21_AVAILABLE               1
#define FM4_MFT_PPG_PRLL22_AVAILABLE              1
#define FM_MFT_PPG_PRLL22_AVAILABLE               1
#define FM4_MFT_PPG_PRLL23_AVAILABLE              1
#define FM_MFT_PPG_PRLL23_AVAILABLE               1
#define FM4_MFT_PPG_PRLL3_AVAILABLE               1
#define FM_MFT_PPG_PRLL3_AVAILABLE                1
#define FM4_MFT_PPG_PRLL4_AVAILABLE               1
#define FM_MFT_PPG_PRLL4_AVAILABLE                1
#define FM4_MFT_PPG_PRLL5_AVAILABLE               1
#define FM_MFT_PPG_PRLL5_AVAILABLE                1
#define FM4_MFT_PPG_PRLL6_AVAILABLE               1
#define FM_MFT_PPG_PRLL6_AVAILABLE                1
#define FM4_MFT_PPG_PRLL7_AVAILABLE               1
#define FM_MFT_PPG_PRLL7_AVAILABLE                1
#define FM4_MFT_PPG_PRLL8_AVAILABLE               1
#define FM_MFT_PPG_PRLL8_AVAILABLE                1
#define FM4_MFT_PPG_PRLL9_AVAILABLE               1
#define FM_MFT_PPG_PRLL9_AVAILABLE                1
#define FM4_MFT_PPG_REVC0_AVAILABLE               1
#define FM_MFT_PPG_REVC0_AVAILABLE                1
#define FM4_MFT_PPG_REVC1_AVAILABLE               1
#define FM_MFT_PPG_REVC1_AVAILABLE                1
#define FM4_MFT_PPG_TRG0_AVAILABLE                1
#define FM_MFT_PPG_TRG0_AVAILABLE                 1
#define FM4_MFT_PPG_TRG1_AVAILABLE                1
#define FM_MFT_PPG_TRG1_AVAILABLE                 1
#define FM4_MFT_PPG_TTCR0_AVAILABLE               1
#define FM_MFT_PPG_TTCR0_AVAILABLE                1
#define FM4_MFT_PPG_TTCR1_AVAILABLE               1
#define FM_MFT_PPG_TTCR1_AVAILABLE                1
#define FM4_MFT_PPG_TTCR2_AVAILABLE               1
#define FM_MFT_PPG_TTCR2_AVAILABLE                1
/******************************************************************************
 ** PCRC
 ** 
 ******************************************************************************/
#define FM4_PCRC_PCRC_CFG_AVAILABLE               1
#define FM_PCRC_PCRC_CFG_AVAILABLE                1
#define FM4_PCRC_PCRC_FXOR_AVAILABLE              1
#define FM_PCRC_PCRC_FXOR_AVAILABLE               1
#define FM4_PCRC_PCRC_POLY_AVAILABLE              1
#define FM_PCRC_PCRC_POLY_AVAILABLE               1
#define FM4_PCRC_PCRC_RD_AVAILABLE                1
#define FM_PCRC_PCRC_RD_AVAILABLE                 1
#define FM4_PCRC_PCRC_SEED_AVAILABLE              1
#define FM_PCRC_PCRC_SEED_AVAILABLE               1
#define FM4_PCRC_PCRC_WR_AVAILABLE                1
#define FM_PCRC_PCRC_WR_AVAILABLE                 1
/******************************************************************************
 ** QPRC0
 ** 
 ******************************************************************************/
#define FM4_QPRC0_QCR_AVAILABLE                   1
#define FM_QPRC0_QCR_AVAILABLE                    1
#define FM4_QPRC0_QECR_AVAILABLE                  1
#define FM_QPRC0_QECR_AVAILABLE                   1
#define FM4_QPRC0_QICRH_AVAILABLE                 1
#define FM_QPRC0_QICRH_AVAILABLE                  1
#define FM4_QPRC0_QICRL_AVAILABLE                 1
#define FM_QPRC0_QICRL_AVAILABLE                  1
#define FM4_QPRC0_QMPR_AVAILABLE                  1
#define FM_QPRC0_QMPR_AVAILABLE                   1
#define FM4_QPRC0_QPCCR_AVAILABLE                 1
#define FM_QPRC0_QPCCR_AVAILABLE                  1
#define FM4_QPRC0_QPCR_AVAILABLE                  1
#define FM_QPRC0_QPCR_AVAILABLE                   1
#define FM4_QPRC0_QPRCR_AVAILABLE                 1
#define FM_QPRC0_QPRCR_AVAILABLE                  1
#define FM4_QPRC0_QPRCRR_AVAILABLE                1
#define FM_QPRC0_QPRCRR_AVAILABLE                 1
#define FM4_QPRC0_QRCR_AVAILABLE                  1
#define FM_QPRC0_QRCR_AVAILABLE                   1
/******************************************************************************
 ** QPRC0_NF
 ** 
 ******************************************************************************/
#define FM4_QPRC0_NF_NFCTLA_AVAILABLE             1
#define FM_QPRC0_NF_NFCTLA_AVAILABLE              1
#define FM4_QPRC0_NF_NFCTLB_AVAILABLE             1
#define FM_QPRC0_NF_NFCTLB_AVAILABLE              1
#define FM4_QPRC0_NF_NFCTLZ_AVAILABLE             1
#define FM_QPRC0_NF_NFCTLZ_AVAILABLE              1
/******************************************************************************
 ** RTC
 ** 
 ******************************************************************************/
#define FM4_RTC_ALDR_AVAILABLE                    1
#define FM_RTC_ALDR_AVAILABLE                     1
#define FM4_RTC_ALHR_AVAILABLE                    1
#define FM_RTC_ALHR_AVAILABLE                     1
#define FM4_RTC_ALMIR_AVAILABLE                   1
#define FM_RTC_ALMIR_AVAILABLE                    1
#define FM4_RTC_ALMOR_AVAILABLE                   1
#define FM_RTC_ALMOR_AVAILABLE                    1
#define FM4_RTC_ALYR_AVAILABLE                    1
#define FM_RTC_ALYR_AVAILABLE                     1
#define FM4_RTC_BOOST_AVAILABLE                   1
#define FM_RTC_BOOST_AVAILABLE                    1
#define FM4_RTC_BREG00_AVAILABLE                  1
#define FM_RTC_BREG00_AVAILABLE                   1
#define FM4_RTC_BREG01_AVAILABLE                  1
#define FM_RTC_BREG01_AVAILABLE                   1
#define FM4_RTC_BREG02_AVAILABLE                  1
#define FM_RTC_BREG02_AVAILABLE                   1
#define FM4_RTC_BREG03_AVAILABLE                  1
#define FM_RTC_BREG03_AVAILABLE                   1
#define FM4_RTC_BREG04_AVAILABLE                  1
#define FM_RTC_BREG04_AVAILABLE                   1
#define FM4_RTC_BREG05_AVAILABLE                  1
#define FM_RTC_BREG05_AVAILABLE                   1
#define FM4_RTC_BREG06_AVAILABLE                  1
#define FM_RTC_BREG06_AVAILABLE                   1
#define FM4_RTC_BREG07_AVAILABLE                  1
#define FM_RTC_BREG07_AVAILABLE                   1
#define FM4_RTC_BREG08_AVAILABLE                  1
#define FM_RTC_BREG08_AVAILABLE                   1
#define FM4_RTC_BREG09_AVAILABLE                  1
#define FM_RTC_BREG09_AVAILABLE                   1
#define FM4_RTC_BREG0A_AVAILABLE                  1
#define FM_RTC_BREG0A_AVAILABLE                   1
#define FM4_RTC_BREG0B_AVAILABLE                  1
#define FM_RTC_BREG0B_AVAILABLE                   1
#define FM4_RTC_BREG0C_AVAILABLE                  1
#define FM_RTC_BREG0C_AVAILABLE                   1
#define FM4_RTC_BREG0D_AVAILABLE                  1
#define FM_RTC_BREG0D_AVAILABLE                   1
#define FM4_RTC_BREG0E_AVAILABLE                  1
#define FM_RTC_BREG0E_AVAILABLE                   1
#define FM4_RTC_BREG0F_AVAILABLE                  1
#define FM_RTC_BREG0F_AVAILABLE                   1
#define FM4_RTC_BREG10_AVAILABLE                  1
#define FM_RTC_BREG10_AVAILABLE                   1
#define FM4_RTC_BREG11_AVAILABLE                  1
#define FM_RTC_BREG11_AVAILABLE                   1
#define FM4_RTC_BREG12_AVAILABLE                  1
#define FM_RTC_BREG12_AVAILABLE                   1
#define FM4_RTC_BREG13_AVAILABLE                  1
#define FM_RTC_BREG13_AVAILABLE                   1
#define FM4_RTC_BREG14_AVAILABLE                  1
#define FM_RTC_BREG14_AVAILABLE                   1
#define FM4_RTC_BREG15_AVAILABLE                  1
#define FM_RTC_BREG15_AVAILABLE                   1
#define FM4_RTC_BREG16_AVAILABLE                  1
#define FM_RTC_BREG16_AVAILABLE                   1
#define FM4_RTC_BREG17_AVAILABLE                  1
#define FM_RTC_BREG17_AVAILABLE                   1
#define FM4_RTC_BREG18_AVAILABLE                  1
#define FM_RTC_BREG18_AVAILABLE                   1
#define FM4_RTC_BREG19_AVAILABLE                  1
#define FM_RTC_BREG19_AVAILABLE                   1
#define FM4_RTC_BREG1A_AVAILABLE                  1
#define FM_RTC_BREG1A_AVAILABLE                   1
#define FM4_RTC_BREG1B_AVAILABLE                  1
#define FM_RTC_BREG1B_AVAILABLE                   1
#define FM4_RTC_BREG1C_AVAILABLE                  1
#define FM_RTC_BREG1C_AVAILABLE                   1
#define FM4_RTC_BREG1D_AVAILABLE                  1
#define FM_RTC_BREG1D_AVAILABLE                   1
#define FM4_RTC_BREG1E_AVAILABLE                  1
#define FM_RTC_BREG1E_AVAILABLE                   1
#define FM4_RTC_BREG1F_AVAILABLE                  1
#define FM_RTC_BREG1F_AVAILABLE                   1
#define FM4_RTC_BREG20_AVAILABLE                  1
#define FM_RTC_BREG20_AVAILABLE                   1
#define FM4_RTC_BREG21_AVAILABLE                  1
#define FM_RTC_BREG21_AVAILABLE                   1
#define FM4_RTC_BREG22_AVAILABLE                  1
#define FM_RTC_BREG22_AVAILABLE                   1
#define FM4_RTC_BREG23_AVAILABLE                  1
#define FM_RTC_BREG23_AVAILABLE                   1
#define FM4_RTC_BREG24_AVAILABLE                  1
#define FM_RTC_BREG24_AVAILABLE                   1
#define FM4_RTC_BREG25_AVAILABLE                  1
#define FM_RTC_BREG25_AVAILABLE                   1
#define FM4_RTC_BREG26_AVAILABLE                  1
#define FM_RTC_BREG26_AVAILABLE                   1
#define FM4_RTC_BREG27_AVAILABLE                  1
#define FM_RTC_BREG27_AVAILABLE                   1
#define FM4_RTC_BREG28_AVAILABLE                  1
#define FM_RTC_BREG28_AVAILABLE                   1
#define FM4_RTC_BREG29_AVAILABLE                  1
#define FM_RTC_BREG29_AVAILABLE                   1
#define FM4_RTC_BREG2A_AVAILABLE                  1
#define FM_RTC_BREG2A_AVAILABLE                   1
#define FM4_RTC_BREG2B_AVAILABLE                  1
#define FM_RTC_BREG2B_AVAILABLE                   1
#define FM4_RTC_BREG2C_AVAILABLE                  1
#define FM_RTC_BREG2C_AVAILABLE                   1
#define FM4_RTC_BREG2D_AVAILABLE                  1
#define FM_RTC_BREG2D_AVAILABLE                   1
#define FM4_RTC_BREG2E_AVAILABLE                  1
#define FM_RTC_BREG2E_AVAILABLE                   1
#define FM4_RTC_BREG2F_AVAILABLE                  1
#define FM_RTC_BREG2F_AVAILABLE                   1
#define FM4_RTC_BREG30_AVAILABLE                  1
#define FM_RTC_BREG30_AVAILABLE                   1
#define FM4_RTC_BREG31_AVAILABLE                  1
#define FM_RTC_BREG31_AVAILABLE                   1
#define FM4_RTC_BREG32_AVAILABLE                  1
#define FM_RTC_BREG32_AVAILABLE                   1
#define FM4_RTC_BREG33_AVAILABLE                  1
#define FM_RTC_BREG33_AVAILABLE                   1
#define FM4_RTC_BREG34_AVAILABLE                  1
#define FM_RTC_BREG34_AVAILABLE                   1
#define FM4_RTC_BREG35_AVAILABLE                  1
#define FM_RTC_BREG35_AVAILABLE                   1
#define FM4_RTC_BREG36_AVAILABLE                  1
#define FM_RTC_BREG36_AVAILABLE                   1
#define FM4_RTC_BREG37_AVAILABLE                  1
#define FM_RTC_BREG37_AVAILABLE                   1
