neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define FM4_USB0_HFCOMP_AVAILABLE                 1
#define FM_USB0_HFCOMP_AVAILABLE                  1
#define FM4_USB0_HFRAME_AVAILABLE                 1
#define FM_USB0_HFRAME_AVAILABLE                  1
#define FM4_USB0_HIRQ_AVAILABLE                   1
#define FM_USB0_HIRQ_AVAILABLE                    1
#define FM4_USB0_HRTIMER_AVAILABLE                1
#define FM_USB0_HRTIMER_AVAILABLE                 1
#define FM4_USB0_HRTIMER2_AVAILABLE               1
#define FM_USB0_HRTIMER2_AVAILABLE                1
#define FM4_USB0_HSTATE_AVAILABLE                 1
#define FM_USB0_HSTATE_AVAILABLE                  1
#define FM4_USB0_HTOKEN_AVAILABLE                 1
#define FM_USB0_HTOKEN_AVAILABLE                  1
#define FM4_USB0_TMSP_AVAILABLE                   1
#define FM_USB0_TMSP_AVAILABLE                    1
#define FM4_USB0_UDCC_AVAILABLE                   1
#define FM_USB0_UDCC_AVAILABLE                    1
#define FM4_USB0_UDCIE_AVAILABLE                  1
#define FM_USB0_UDCIE_AVAILABLE                   1
#define FM4_USB0_UDCS_AVAILABLE                   1
#define FM_USB0_UDCS_AVAILABLE                    1
/******************************************************************************
 ** USBETHERCLK
 ** 
 ******************************************************************************/
#define FM4_USBETHERCLK_UCCR_AVAILABLE            1
#define FM_USBETHERCLK_UCCR_AVAILABLE             1
#define FM4_USBETHERCLK_UP_STR_AVAILABLE          1
#define FM_USBETHERCLK_UP_STR_AVAILABLE           1
#define FM4_USBETHERCLK_UPCR1_AVAILABLE           1
#define FM_USBETHERCLK_UPCR1_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR2_AVAILABLE           1
#define FM_USBETHERCLK_UPCR2_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR3_AVAILABLE           1
#define FM_USBETHERCLK_UPCR3_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR4_AVAILABLE           1
#define FM_USBETHERCLK_UPCR4_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR5_AVAILABLE           1
#define FM_USBETHERCLK_UPCR5_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR6_AVAILABLE           1
#define FM_USBETHERCLK_UPCR6_AVAILABLE            1
#define FM4_USBETHERCLK_UPCR7_AVAILABLE           1
#define FM_USBETHERCLK_UPCR7_AVAILABLE            1
#define FM4_USBETHERCLK_UPINT_CLR_AVAILABLE       1
#define FM_USBETHERCLK_UPINT_CLR_AVAILABLE        1
#define FM4_USBETHERCLK_UPINT_ENR_AVAILABLE       1
#define FM_USBETHERCLK_UPINT_ENR_AVAILABLE        1
#define FM4_USBETHERCLK_UPINT_STR_AVAILABLE       1
#define FM_USBETHERCLK_UPINT_STR_AVAILABLE        1
#define FM4_USBETHERCLK_USBEN0_AVAILABLE          1
#define FM_USBETHERCLK_USBEN0_AVAILABLE           1
#define FM4_USBETHERCLK_USBEN1_AVAILABLE          1
#define FM_USBETHERCLK_USBEN1_AVAILABLE           1
/******************************************************************************
 ** WC
 ** 
 ******************************************************************************/
#define FM4_WC_CLK_EN_AVAILABLE                   1
#define FM_WC_CLK_EN_AVAILABLE                    1
#define FM4_WC_CLK_SEL_AVAILABLE                  1
#define FM_WC_CLK_SEL_AVAILABLE                   1
#define FM4_WC_WCCR_AVAILABLE                     1
#define FM_WC_WCCR_AVAILABLE                      1
#define FM4_WC_WCRD_AVAILABLE                     1
#define FM_WC_WCRD_AVAILABLE                      1
#define FM4_WC_WCRL_AVAILABLE                     1
#define FM_WC_WCRL_AVAILABLE                      1

/******************************************************************************
 ** Peripheral Bit Band Alias declaration
 ** 
 ******************************************************************************/
/******************************************************************************
 ** ADC Registers ADC0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_ADC0_ADCEN_ENBL                       *((volatile uint32_t*)(0x424E0780UL))
#define bFM4_ADC0_ADCEN_ENBL                      *((volatile uint32_t*)(0x424E0780UL))
#define bFM_ADC0_ADCEN_READY                      *((volatile uint32_t*)(0x424E0784UL))
#define bFM4_ADC0_ADCEN_READY                     *((volatile uint32_t*)(0x424E0784UL))

#define bFM_ADC0_ADCR_OVRIE                       *((volatile uint32_t*)(0x424E0020UL))
#define bFM4_ADC0_ADCR_OVRIE                      *((volatile uint32_t*)(0x424E0020UL))
#define bFM_ADC0_ADCR_CMPIE                       *((volatile uint32_t*)(0x424E0024UL))
#define bFM4_ADC0_ADCR_CMPIE                      *((volatile uint32_t*)(0x424E0024UL))
#define bFM_ADC0_ADCR_PCIE                        *((volatile uint32_t*)(0x424E0028UL))
#define bFM4_ADC0_ADCR_PCIE                       *((volatile uint32_t*)(0x424E0028UL))
#define bFM_ADC0_ADCR_SCIE                        *((volatile uint32_t*)(0x424E002CUL))
#define bFM4_ADC0_ADCR_SCIE                       *((volatile uint32_t*)(0x424E002CUL))
#define bFM_ADC0_ADCR_CMPIF                       *((volatile uint32_t*)(0x424E0034UL))
#define bFM4_ADC0_ADCR_CMPIF                      *((volatile uint32_t*)(0x424E0034UL))
#define bFM_ADC0_ADCR_PCIF                        *((volatile uint32_t*)(0x424E0038UL))
#define bFM4_ADC0_ADCR_PCIF                       *((volatile uint32_t*)(0x424E0038UL))
#define bFM_ADC0_ADCR_SCIF                        *((volatile uint32_t*)(0x424E003CUL))
#define bFM4_ADC0_ADCR_SCIF                       *((volatile uint32_t*)(0x424E003CUL))

#define bFM_ADC0_ADSR_SCS                         *((volatile uint32_t*)(0x424E0000UL))
#define bFM4_ADC0_ADSR_SCS                        *((volatile uint32_t*)(0x424E0000UL))
#define bFM_ADC0_ADSR_PCS                         *((volatile uint32_t*)(0x424E0004UL))
#define bFM4_ADC0_ADSR_PCS                        *((volatile uint32_t*)(0x424E0004UL))
#define bFM_ADC0_ADSR_PCNS                        *((volatile uint32_t*)(0x424E0008UL))
#define bFM4_ADC0_ADSR_PCNS                       *((volatile uint32_t*)(0x424E0008UL))
#define bFM_ADC0_ADSR_FDAS                        *((volatile uint32_t*)(0x424E0018UL))
#define bFM4_ADC0_ADSR_FDAS                       *((volatile uint32_t*)(0x424E0018UL))
#define bFM_ADC0_ADSR_ADSTP                       *((volatile uint32_t*)(0x424E001CUL))
#define bFM4_ADC0_ADSR_ADSTP                      *((volatile uint32_t*)(0x424E001CUL))

#define bFM_ADC0_ADSS01_TS0                       *((volatile uint32_t*)(0x424E0580UL))
#define bFM4_ADC0_ADSS01_TS0                      *((volatile uint32_t*)(0x424E0580UL))
#define bFM_ADC0_ADSS01_TS1                       *((volatile uint32_t*)(0x424E0584UL))
#define bFM4_ADC0_ADSS01_TS1                      *((volatile uint32_t*)(0x424E0584UL))
#define bFM_ADC0_ADSS01_TS2                       *((volatile uint32_t*)(0x424E0588UL))
#define bFM4_ADC0_ADSS01_TS2                      *((volatile uint32_t*)(0x424E0588UL))
#define bFM_ADC0_ADSS01_TS3                       *((volatile uint32_t*)(0x424E058CUL))
#define bFM4_ADC0_ADSS01_TS3                      *((volatile uint32_t*)(0x424E058CUL))
#define bFM_ADC0_ADSS01_TS4                       *((volatile uint32_t*)(0x424E0590UL))
#define bFM4_ADC0_ADSS01_TS4                      *((volatile uint32_t*)(0x424E0590UL))
#define bFM_ADC0_ADSS01_TS5                       *((volatile uint32_t*)(0x424E0594UL))
#define bFM4_ADC0_ADSS01_TS5                      *((volatile uint32_t*)(0x424E0594UL))
#define bFM_ADC0_ADSS01_TS6                       *((volatile uint32_t*)(0x424E0598UL))
#define bFM4_ADC0_ADSS01_TS6                      *((volatile uint32_t*)(0x424E0598UL))
#define bFM_ADC0_ADSS01_TS7                       *((volatile uint32_t*)(0x424E059CUL))
#define bFM4_ADC0_ADSS01_TS7                      *((volatile uint32_t*)(0x424E059CUL))
#define bFM_ADC0_ADSS01_TS8                       *((volatile uint32_t*)(0x424E05A0UL))
#define bFM4_ADC0_ADSS01_TS8                      *((volatile uint32_t*)(0x424E05A0UL))
#define bFM_ADC0_ADSS01_TS9                       *((volatile uint32_t*)(0x424E05A4UL))
#define bFM4_ADC0_ADSS01_TS9                      *((volatile uint32_t*)(0x424E05A4UL))
#define bFM_ADC0_ADSS01_TS10                      *((volatile uint32_t*)(0x424E05A8UL))
#define bFM4_ADC0_ADSS01_TS10                     *((volatile uint32_t*)(0x424E05A8UL))
#define bFM_ADC0_ADSS01_TS11                      *((volatile uint32_t*)(0x424E05ACUL))
#define bFM4_ADC0_ADSS01_TS11                     *((volatile uint32_t*)(0x424E05ACUL))
#define bFM_ADC0_ADSS01_TS12                      *((volatile uint32_t*)(0x424E05B0UL))
#define bFM4_ADC0_ADSS01_TS12                     *((volatile uint32_t*)(0x424E05B0UL))
#define bFM_ADC0_ADSS01_TS13                      *((volatile uint32_t*)(0x424E05B4UL))
#define bFM4_ADC0_ADSS01_TS13                     *((volatile uint32_t*)(0x424E05B4UL))
#define bFM_ADC0_ADSS01_TS14                      *((volatile uint32_t*)(0x424E05B8UL))
#define bFM4_ADC0_ADSS01_TS14                     *((volatile uint32_t*)(0x424E05B8UL))
#define bFM_ADC0_ADSS01_TS15                      *((volatile uint32_t*)(0x424E05BCUL))
#define bFM4_ADC0_ADSS01_TS15                     *((volatile uint32_t*)(0x424E05BCUL))

#define bFM_ADC0_ADSS23_TS16                      *((volatile uint32_t*)(0x424E0500UL))
#define bFM4_ADC0_ADSS23_TS16                     *((volatile uint32_t*)(0x424E0500UL))
#define bFM_ADC0_ADSS23_TS17                      *((volatile uint32_t*)(0x424E0504UL))
#define bFM4_ADC0_ADSS23_TS17                     *((volatile uint32_t*)(0x424E0504UL))
#define bFM_ADC0_ADSS23_TS18                      *((volatile uint32_t*)(0x424E0508UL))
#define bFM4_ADC0_ADSS23_TS18                     *((volatile uint32_t*)(0x424E0508UL))
#define bFM_ADC0_ADSS23_TS19                      *((volatile uint32_t*)(0x424E050CUL))
#define bFM4_ADC0_ADSS23_TS19                     *((volatile uint32_t*)(0x424E050CUL))
#define bFM_ADC0_ADSS23_TS20                      *((volatile uint32_t*)(0x424E0510UL))
#define bFM4_ADC0_ADSS23_TS20                     *((volatile uint32_t*)(0x424E0510UL))
#define bFM_ADC0_ADSS23_TS21                      *((volatile uint32_t*)(0x424E0514UL))
#define bFM4_ADC0_ADSS23_TS21                     *((volatile uint32_t*)(0x424E0514UL))
#define bFM_ADC0_ADSS23_TS22                      *((volatile uint32_t*)(0x424E0518UL))
#define bFM4_ADC0_ADSS23_TS22                     *((volatile uint32_t*)(0x424E0518UL))
#define bFM_ADC0_ADSS23_TS23                      *((volatile uint32_t*)(0x424E051CUL))
#define bFM4_ADC0_ADSS23_TS23                     *((volatile uint32_t*)(0x424E051CUL))
#define bFM_ADC0_ADSS23_TS24                      *((volatile uint32_t*)(0x424E0520UL))
#define bFM4_ADC0_ADSS23_TS24                     *((volatile uint32_t*)(0x424E0520UL))
#define bFM_ADC0_ADSS23_TS25                      *((volatile uint32_t*)(0x424E0524UL))
#define bFM4_ADC0_ADSS23_TS25                     *((volatile uint32_t*)(0x424E0524UL))
#define bFM_ADC0_ADSS23_TS26                      *((volatile uint32_t*)(0x424E0528UL))
#define bFM4_ADC0_ADSS23_TS26                     *((volatile uint32_t*)(0x424E0528UL))
#define bFM_ADC0_ADSS23_TS27                      *((volatile uint32_t*)(0x424E052CUL))
#define bFM4_ADC0_ADSS23_TS27                     *((volatile uint32_t*)(0x424E052CUL))
#define bFM_ADC0_ADSS23_TS28                      *((volatile uint32_t*)(0x424E0530UL))
#define bFM4_ADC0_ADSS23_TS28                     *((volatile uint32_t*)(0x424E0530UL))
#define bFM_ADC0_ADSS23_TS29                      *((volatile uint32_t*)(0x424E0534UL))
#define bFM4_ADC0_ADSS23_TS29                     *((volatile uint32_t*)(0x424E0534UL))
#define bFM_ADC0_ADSS23_TS30                      *((volatile uint32_t*)(0x424E0538UL))
#define bFM4_ADC0_ADSS23_TS30                     *((volatile uint32_t*)(0x424E0538UL))
#define bFM_ADC0_ADSS23_TS31                      *((volatile uint32_t*)(0x424E053CUL))
#define bFM4_ADC0_ADSS23_TS31                     *((volatile uint32_t*)(0x424E053CUL))

#define bFM_ADC0_CALSR_CLBEN                      *((volatile uint32_t*)(0x424E0820UL))
#define bFM4_ADC0_CALSR_CLBEN                     *((volatile uint32_t*)(0x424E0820UL))

#define bFM_ADC0_CMPCR_CMD0                       *((volatile uint32_t*)(0x424E0494UL))
#define bFM4_ADC0_CMPCR_CMD0                      *((volatile uint32_t*)(0x424E0494UL))
#define bFM_ADC0_CMPCR_CMD1                       *((volatile uint32_t*)(0x424E0498UL))
#define bFM4_ADC0_CMPCR_CMD1                      *((volatile uint32_t*)(0x424E0498UL))
#define bFM_ADC0_CMPCR_CMPEN                      *((volatile uint32_t*)(0x424E049CUL))
#define bFM4_ADC0_CMPCR_CMPEN                     *((volatile uint32_t*)(0x424E049CUL))

#define bFM_ADC0_PCCR_PSTR                        *((volatile uint32_t*)(0x424E0320UL))
#define bFM4_ADC0_PCCR_PSTR                       *((volatile uint32_t*)(0x424E0320UL))
#define bFM_ADC0_PCCR_PHEN                        *((volatile uint32_t*)(0x424E0324UL))
#define bFM4_ADC0_PCCR_PHEN                       *((volatile uint32_t*)(0x424E0324UL))
#define bFM_ADC0_PCCR_PEEN                        *((volatile uint32_t*)(0x424E0328UL))
#define bFM4_ADC0_PCCR_PEEN                       *((volatile uint32_t*)(0x424E0328UL))
#define bFM_ADC0_PCCR_ESCE                        *((volatile uint32_t*)(0x424E032CUL))
#define bFM4_ADC0_PCCR_ESCE                       *((volatile uint32_t*)(0x424E032CUL))
#define bFM_ADC0_PCCR_PFCLR                       *((volatile uint32_t*)(0x424E0330UL))
#define bFM4_ADC0_PCCR_PFCLR                      *((volatile uint32_t*)(0x424E0330UL))
#define bFM_ADC0_PCCR_POVR                        *((volatile uint32_t*)(0x424E0334UL))
#define bFM4_ADC0_PCCR_POVR                       *((volatile uint32_t*)(0x424E0334UL))
#define bFM_ADC0_PCCR_PFUL                        *((volatile uint32_t*)(0x424E0338UL))
#define bFM4_ADC0_PCCR_PFUL                       *((volatile uint32_t*)(0x424E0338UL))
#define bFM_ADC0_PCCR_PEMP                        *((volatile uint32_t*)(0x424E033CUL))
#define bFM4_ADC0_PCCR_PEMP                       *((volatile uint32_t*)(0x424E033CUL))

#define bFM_ADC0_PCFD_INVL                        *((volatile uint32_t*)(0x424E03B0UL))
#define bFM4_ADC0_PCFD_INVL                       *((volatile uint32_t*)(0x424E03B0UL))

#define bFM_ADC0_SCCR_SSTR                        *((volatile uint32_t*)(0x424E0120UL))
#define bFM4_ADC0_SCCR_SSTR                       *((volatile uint32_t*)(0x424E0120UL))
#define bFM_ADC0_SCCR_SHEN                        *((volatile uint32_t*)(0x424E0124UL))
#define bFM4_ADC0_SCCR_SHEN                       *((volatile uint32_t*)(0x424E0124UL))
#define bFM_ADC0_SCCR_RPT                         *((volatile uint32_t*)(0x424E0128UL))
#define bFM4_ADC0_SCCR_RPT                        *((volatile uint32_t*)(0x424E0128UL))
#define bFM_ADC0_SCCR_SFCLR                       *((volatile uint32_t*)(0x424E0130UL))
#define bFM4_ADC0_SCCR_SFCLR                      *((volatile uint32_t*)(0x424E0130UL))
#define bFM_ADC0_SCCR_SOVR                        *((volatile uint32_t*)(0x424E0134UL))
#define bFM4_ADC0_SCCR_SOVR                       *((volatile uint32_t*)(0x424E0134UL))
#define bFM_ADC0_SCCR_SFUL                        *((volatile uint32_t*)(0x424E0138UL))
#define bFM4_ADC0_SCCR_SFUL                       *((volatile uint32_t*)(0x424E0138UL))
#define bFM_ADC0_SCCR_SEMP                        *((volatile uint32_t*)(0x424E013CUL))
#define bFM4_ADC0_SCCR_SEMP                       *((volatile uint32_t*)(0x424E013CUL))

#define bFM_ADC0_SCFD_INVL                        *((volatile uint32_t*)(0x424E01B0UL))
#define bFM4_ADC0_SCFD_INVL                       *((volatile uint32_t*)(0x424E01B0UL))

#define bFM_ADC0_SCIS01_AN0                       *((volatile uint32_t*)(0x424E0280UL))
#define bFM4_ADC0_SCIS01_AN0                      *((volatile uint32_t*)(0x424E0280UL))
#define bFM_ADC0_SCIS01_AN1                       *((volatile uint32_t*)(0x424E0284UL))
#define bFM4_ADC0_SCIS01_AN1                      *((volatile uint32_t*)(0x424E0284UL))
#define bFM_ADC0_SCIS01_AN2                       *((volatile uint32_t*)(0x424E0288UL))
#define bFM4_ADC0_SCIS01_AN2                      *((volatile uint32_t*)(0x424E0288UL))
#define bFM_ADC0_SCIS01_AN3                       *((volatile uint32_t*)(0x424E028CUL))
#define bFM4_ADC0_SCIS01_AN3                      *((volatile uint32_t*)(0x424E028CUL))
#define bFM_ADC0_SCIS01_AN4                       *((volatile uint32_t*)(0x424E0290UL))
#define bFM4_ADC0_SCIS01_AN4                      *((volatile uint32_t*)(0x424E0290UL))
#define bFM_ADC0_SCIS01_AN5                       *((volatile uint32_t*)(0x424E0294UL))
#define bFM4_ADC0_SCIS01_AN5                      *((volatile uint32_t*)(0x424E0294UL))
#define bFM_ADC0_SCIS01_AN6                       *((volatile uint32_t*)(0x424E0298UL))
#define bFM4_ADC0_SCIS01_AN6                      *((volatile uint32_t*)(0x424E0298UL))
#define bFM_ADC0_SCIS01_AN7                       *((volatile uint32_t*)(0x424E029CUL))
#define bFM4_ADC0_SCIS01_AN7                      *((volatile uint32_t*)(0x424E029CUL))
#define bFM_ADC0_SCIS01_AN8                       *((volatile uint32_t*)(0x424E02A0UL))
#define bFM4_ADC0_SCIS01_AN8                      *((volatile uint32_t*)(0x424E02A0UL))
#define bFM_ADC0_SCIS01_AN9                       *((volatile uint32_t*)(0x424E02A4UL))
#define bFM4_ADC0_SCIS01_AN9                      *((volatile uint32_t*)(0x424E02A4UL))
#define bFM_ADC0_SCIS01_AN10                      *((volatile uint32_t*)(0x424E02A8UL))
#define bFM4_ADC0_SCIS01_AN10                     *((volatile uint32_t*)(0x424E02A8UL))
#define bFM_ADC0_SCIS01_AN11                      *((volatile uint32_t*)(0x424E02ACUL))
#define bFM4_ADC0_SCIS01_AN11                     *((volatile uint32_t*)(0x424E02ACUL))
#define bFM_ADC0_SCIS01_AN12                      *((volatile uint32_t*)(0x424E02B0UL))
#define bFM4_ADC0_SCIS01_AN12                     *((volatile uint32_t*)(0x424E02B0UL))
#define bFM_ADC0_SCIS01_AN13                      *((volatile uint32_t*)(0x424E02B4UL))
#define bFM4_ADC0_SCIS01_AN13                     *((volatile uint32_t*)(0x424E02B4UL))
#define bFM_ADC0_SCIS01_AN14                      *((volatile uint32_t*)(0x424E02B8UL))
#define bFM4_ADC0_SCIS01_AN14                     *((volatile uint32_t*)(0x424E02B8UL))
#define bFM_ADC0_SCIS01_AN15                      *((volatile uint32_t*)(0x424E02BCUL))
#define bFM4_ADC0_SCIS01_AN15                     *((volatile uint32_t*)(0x424E02BCUL))

