neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_ADC0_SCIS23_AN16                      *((volatile uint32_t*)(0x424E0200UL))
#define bFM4_ADC0_SCIS23_AN16                     *((volatile uint32_t*)(0x424E0200UL))
#define bFM_ADC0_SCIS23_AN17                      *((volatile uint32_t*)(0x424E0204UL))
#define bFM4_ADC0_SCIS23_AN17                     *((volatile uint32_t*)(0x424E0204UL))
#define bFM_ADC0_SCIS23_AN18                      *((volatile uint32_t*)(0x424E0208UL))
#define bFM4_ADC0_SCIS23_AN18                     *((volatile uint32_t*)(0x424E0208UL))
#define bFM_ADC0_SCIS23_AN19                      *((volatile uint32_t*)(0x424E020CUL))
#define bFM4_ADC0_SCIS23_AN19                     *((volatile uint32_t*)(0x424E020CUL))
#define bFM_ADC0_SCIS23_AN20                      *((volatile uint32_t*)(0x424E0210UL))
#define bFM4_ADC0_SCIS23_AN20                     *((volatile uint32_t*)(0x424E0210UL))
#define bFM_ADC0_SCIS23_AN21                      *((volatile uint32_t*)(0x424E0214UL))
#define bFM4_ADC0_SCIS23_AN21                     *((volatile uint32_t*)(0x424E0214UL))
#define bFM_ADC0_SCIS23_AN22                      *((volatile uint32_t*)(0x424E0218UL))
#define bFM4_ADC0_SCIS23_AN22                     *((volatile uint32_t*)(0x424E0218UL))
#define bFM_ADC0_SCIS23_AN23                      *((volatile uint32_t*)(0x424E021CUL))
#define bFM4_ADC0_SCIS23_AN23                     *((volatile uint32_t*)(0x424E021CUL))
#define bFM_ADC0_SCIS23_AN24                      *((volatile uint32_t*)(0x424E0220UL))
#define bFM4_ADC0_SCIS23_AN24                     *((volatile uint32_t*)(0x424E0220UL))
#define bFM_ADC0_SCIS23_AN25                      *((volatile uint32_t*)(0x424E0224UL))
#define bFM4_ADC0_SCIS23_AN25                     *((volatile uint32_t*)(0x424E0224UL))
#define bFM_ADC0_SCIS23_AN26                      *((volatile uint32_t*)(0x424E0228UL))
#define bFM4_ADC0_SCIS23_AN26                     *((volatile uint32_t*)(0x424E0228UL))
#define bFM_ADC0_SCIS23_AN27                      *((volatile uint32_t*)(0x424E022CUL))
#define bFM4_ADC0_SCIS23_AN27                     *((volatile uint32_t*)(0x424E022CUL))
#define bFM_ADC0_SCIS23_AN28                      *((volatile uint32_t*)(0x424E0230UL))
#define bFM4_ADC0_SCIS23_AN28                     *((volatile uint32_t*)(0x424E0230UL))
#define bFM_ADC0_SCIS23_AN29                      *((volatile uint32_t*)(0x424E0234UL))
#define bFM4_ADC0_SCIS23_AN29                     *((volatile uint32_t*)(0x424E0234UL))
#define bFM_ADC0_SCIS23_AN30                      *((volatile uint32_t*)(0x424E0238UL))
#define bFM4_ADC0_SCIS23_AN30                     *((volatile uint32_t*)(0x424E0238UL))
#define bFM_ADC0_SCIS23_AN31                      *((volatile uint32_t*)(0x424E023CUL))
#define bFM4_ADC0_SCIS23_AN31                     *((volatile uint32_t*)(0x424E023CUL))

#define bFM_ADC0_WCMPCR_RCOE                      *((volatile uint32_t*)(0x424E0988UL))
#define bFM4_ADC0_WCMPCR_RCOE                     *((volatile uint32_t*)(0x424E0988UL))
#define bFM_ADC0_WCMPCR_RCOIE                     *((volatile uint32_t*)(0x424E098CUL))
#define bFM4_ADC0_WCMPCR_RCOIE                    *((volatile uint32_t*)(0x424E098CUL))
#define bFM_ADC0_WCMPCR_RCOIRS                    *((volatile uint32_t*)(0x424E0990UL))
#define bFM4_ADC0_WCMPCR_RCOIRS                   *((volatile uint32_t*)(0x424E0990UL))

#define bFM_ADC0_WCMPSR_WCMD                      *((volatile uint32_t*)(0x424E09B4UL))
#define bFM4_ADC0_WCMPSR_WCMD                     *((volatile uint32_t*)(0x424E09B4UL))

#define bFM_ADC0_WCMRCIF_RCINT                    *((volatile uint32_t*)(0x424E0900UL))
#define bFM4_ADC0_WCMRCIF_RCINT                   *((volatile uint32_t*)(0x424E0900UL))

#define bFM_ADC0_WCMRCOT_RCOOF                    *((volatile uint32_t*)(0x424E0880UL))
#define bFM4_ADC0_WCMRCOT_RCOOF                   *((volatile uint32_t*)(0x424E0880UL))


/******************************************************************************
 ** ADC Registers ADC1
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_ADC1_ADCEN_ENBL                       *((volatile uint32_t*)(0x424E2780UL))
#define bFM4_ADC1_ADCEN_ENBL                      *((volatile uint32_t*)(0x424E2780UL))
#define bFM_ADC1_ADCEN_READY                      *((volatile uint32_t*)(0x424E2784UL))
#define bFM4_ADC1_ADCEN_READY                     *((volatile uint32_t*)(0x424E2784UL))

#define bFM_ADC1_ADCR_OVRIE                       *((volatile uint32_t*)(0x424E2020UL))
#define bFM4_ADC1_ADCR_OVRIE                      *((volatile uint32_t*)(0x424E2020UL))
#define bFM_ADC1_ADCR_CMPIE                       *((volatile uint32_t*)(0x424E2024UL))
#define bFM4_ADC1_ADCR_CMPIE                      *((volatile uint32_t*)(0x424E2024UL))
#define bFM_ADC1_ADCR_PCIE                        *((volatile uint32_t*)(0x424E2028UL))
#define bFM4_ADC1_ADCR_PCIE                       *((volatile uint32_t*)(0x424E2028UL))
#define bFM_ADC1_ADCR_SCIE                        *((volatile uint32_t*)(0x424E202CUL))
#define bFM4_ADC1_ADCR_SCIE                       *((volatile uint32_t*)(0x424E202CUL))
#define bFM_ADC1_ADCR_CMPIF                       *((volatile uint32_t*)(0x424E2034UL))
#define bFM4_ADC1_ADCR_CMPIF                      *((volatile uint32_t*)(0x424E2034UL))
#define bFM_ADC1_ADCR_PCIF                        *((volatile uint32_t*)(0x424E2038UL))
#define bFM4_ADC1_ADCR_PCIF                       *((volatile uint32_t*)(0x424E2038UL))
#define bFM_ADC1_ADCR_SCIF                        *((volatile uint32_t*)(0x424E203CUL))
#define bFM4_ADC1_ADCR_SCIF                       *((volatile uint32_t*)(0x424E203CUL))

#define bFM_ADC1_ADSR_SCS                         *((volatile uint32_t*)(0x424E2000UL))
#define bFM4_ADC1_ADSR_SCS                        *((volatile uint32_t*)(0x424E2000UL))
#define bFM_ADC1_ADSR_PCS                         *((volatile uint32_t*)(0x424E2004UL))
#define bFM4_ADC1_ADSR_PCS                        *((volatile uint32_t*)(0x424E2004UL))
#define bFM_ADC1_ADSR_PCNS                        *((volatile uint32_t*)(0x424E2008UL))
#define bFM4_ADC1_ADSR_PCNS                       *((volatile uint32_t*)(0x424E2008UL))
#define bFM_ADC1_ADSR_FDAS                        *((volatile uint32_t*)(0x424E2018UL))
#define bFM4_ADC1_ADSR_FDAS                       *((volatile uint32_t*)(0x424E2018UL))
#define bFM_ADC1_ADSR_ADSTP                       *((volatile uint32_t*)(0x424E201CUL))
#define bFM4_ADC1_ADSR_ADSTP                      *((volatile uint32_t*)(0x424E201CUL))

