neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_ADC1_ADSS01_TS0                       *((volatile uint32_t*)(0x424E2580UL))
#define bFM4_ADC1_ADSS01_TS0                      *((volatile uint32_t*)(0x424E2580UL))
#define bFM_ADC1_ADSS01_TS1                       *((volatile uint32_t*)(0x424E2584UL))
#define bFM4_ADC1_ADSS01_TS1                      *((volatile uint32_t*)(0x424E2584UL))
#define bFM_ADC1_ADSS01_TS2                       *((volatile uint32_t*)(0x424E2588UL))
#define bFM4_ADC1_ADSS01_TS2                      *((volatile uint32_t*)(0x424E2588UL))
#define bFM_ADC1_ADSS01_TS3                       *((volatile uint32_t*)(0x424E258CUL))
#define bFM4_ADC1_ADSS01_TS3                      *((volatile uint32_t*)(0x424E258CUL))
#define bFM_ADC1_ADSS01_TS4                       *((volatile uint32_t*)(0x424E2590UL))
#define bFM4_ADC1_ADSS01_TS4                      *((volatile uint32_t*)(0x424E2590UL))
#define bFM_ADC1_ADSS01_TS5                       *((volatile uint32_t*)(0x424E2594UL))
#define bFM4_ADC1_ADSS01_TS5                      *((volatile uint32_t*)(0x424E2594UL))
#define bFM_ADC1_ADSS01_TS6                       *((volatile uint32_t*)(0x424E2598UL))
#define bFM4_ADC1_ADSS01_TS6                      *((volatile uint32_t*)(0x424E2598UL))
#define bFM_ADC1_ADSS01_TS7                       *((volatile uint32_t*)(0x424E259CUL))
#define bFM4_ADC1_ADSS01_TS7                      *((volatile uint32_t*)(0x424E259CUL))
#define bFM_ADC1_ADSS01_TS8                       *((volatile uint32_t*)(0x424E25A0UL))
#define bFM4_ADC1_ADSS01_TS8                      *((volatile uint32_t*)(0x424E25A0UL))
#define bFM_ADC1_ADSS01_TS9                       *((volatile uint32_t*)(0x424E25A4UL))
#define bFM4_ADC1_ADSS01_TS9                      *((volatile uint32_t*)(0x424E25A4UL))
#define bFM_ADC1_ADSS01_TS10                      *((volatile uint32_t*)(0x424E25A8UL))
#define bFM4_ADC1_ADSS01_TS10                     *((volatile uint32_t*)(0x424E25A8UL))
#define bFM_ADC1_ADSS01_TS11                      *((volatile uint32_t*)(0x424E25ACUL))
#define bFM4_ADC1_ADSS01_TS11                     *((volatile uint32_t*)(0x424E25ACUL))
#define bFM_ADC1_ADSS01_TS12                      *((volatile uint32_t*)(0x424E25B0UL))
#define bFM4_ADC1_ADSS01_TS12                     *((volatile uint32_t*)(0x424E25B0UL))
#define bFM_ADC1_ADSS01_TS13                      *((volatile uint32_t*)(0x424E25B4UL))
#define bFM4_ADC1_ADSS01_TS13                     *((volatile uint32_t*)(0x424E25B4UL))
#define bFM_ADC1_ADSS01_TS14                      *((volatile uint32_t*)(0x424E25B8UL))
#define bFM4_ADC1_ADSS01_TS14                     *((volatile uint32_t*)(0x424E25B8UL))
#define bFM_ADC1_ADSS01_TS15                      *((volatile uint32_t*)(0x424E25BCUL))
#define bFM4_ADC1_ADSS01_TS15                     *((volatile uint32_t*)(0x424E25BCUL))

#define bFM_ADC1_ADSS23_TS16                      *((volatile uint32_t*)(0x424E2500UL))
#define bFM4_ADC1_ADSS23_TS16                     *((volatile uint32_t*)(0x424E2500UL))
#define bFM_ADC1_ADSS23_TS17                      *((volatile uint32_t*)(0x424E2504UL))
#define bFM4_ADC1_ADSS23_TS17                     *((volatile uint32_t*)(0x424E2504UL))
#define bFM_ADC1_ADSS23_TS18                      *((volatile uint32_t*)(0x424E2508UL))
#define bFM4_ADC1_ADSS23_TS18                     *((volatile uint32_t*)(0x424E2508UL))
#define bFM_ADC1_ADSS23_TS19                      *((volatile uint32_t*)(0x424E250CUL))
#define bFM4_ADC1_ADSS23_TS19                     *((volatile uint32_t*)(0x424E250CUL))
#define bFM_ADC1_ADSS23_TS20                      *((volatile uint32_t*)(0x424E2510UL))
#define bFM4_ADC1_ADSS23_TS20                     *((volatile uint32_t*)(0x424E2510UL))
#define bFM_ADC1_ADSS23_TS21                      *((volatile uint32_t*)(0x424E2514UL))
#define bFM4_ADC1_ADSS23_TS21                     *((volatile uint32_t*)(0x424E2514UL))
#define bFM_ADC1_ADSS23_TS22                      *((volatile uint32_t*)(0x424E2518UL))
#define bFM4_ADC1_ADSS23_TS22                     *((volatile uint32_t*)(0x424E2518UL))
#define bFM_ADC1_ADSS23_TS23                      *((volatile uint32_t*)(0x424E251CUL))
#define bFM4_ADC1_ADSS23_TS23                     *((volatile uint32_t*)(0x424E251CUL))
#define bFM_ADC1_ADSS23_TS24                      *((volatile uint32_t*)(0x424E2520UL))
#define bFM4_ADC1_ADSS23_TS24                     *((volatile uint32_t*)(0x424E2520UL))
#define bFM_ADC1_ADSS23_TS25                      *((volatile uint32_t*)(0x424E2524UL))
#define bFM4_ADC1_ADSS23_TS25                     *((volatile uint32_t*)(0x424E2524UL))
#define bFM_ADC1_ADSS23_TS26                      *((volatile uint32_t*)(0x424E2528UL))
#define bFM4_ADC1_ADSS23_TS26                     *((volatile uint32_t*)(0x424E2528UL))
#define bFM_ADC1_ADSS23_TS27                      *((volatile uint32_t*)(0x424E252CUL))
#define bFM4_ADC1_ADSS23_TS27                     *((volatile uint32_t*)(0x424E252CUL))
#define bFM_ADC1_ADSS23_TS28                      *((volatile uint32_t*)(0x424E2530UL))
#define bFM4_ADC1_ADSS23_TS28                     *((volatile uint32_t*)(0x424E2530UL))
#define bFM_ADC1_ADSS23_TS29                      *((volatile uint32_t*)(0x424E2534UL))
#define bFM4_ADC1_ADSS23_TS29                     *((volatile uint32_t*)(0x424E2534UL))
#define bFM_ADC1_ADSS23_TS30                      *((volatile uint32_t*)(0x424E2538UL))
#define bFM4_ADC1_ADSS23_TS30                     *((volatile uint32_t*)(0x424E2538UL))
#define bFM_ADC1_ADSS23_TS31                      *((volatile uint32_t*)(0x424E253CUL))
#define bFM4_ADC1_ADSS23_TS31                     *((volatile uint32_t*)(0x424E253CUL))

#define bFM_ADC1_CALSR_CLBEN                      *((volatile uint32_t*)(0x424E2820UL))
#define bFM4_ADC1_CALSR_CLBEN                     *((volatile uint32_t*)(0x424E2820UL))

#define bFM_ADC1_CMPCR_CMD0                       *((volatile uint32_t*)(0x424E2494UL))
#define bFM4_ADC1_CMPCR_CMD0                      *((volatile uint32_t*)(0x424E2494UL))
#define bFM_ADC1_CMPCR_CMD1                       *((volatile uint32_t*)(0x424E2498UL))
#define bFM4_ADC1_CMPCR_CMD1                      *((volatile uint32_t*)(0x424E2498UL))
#define bFM_ADC1_CMPCR_CMPEN                      *((volatile uint32_t*)(0x424E249CUL))
#define bFM4_ADC1_CMPCR_CMPEN                     *((volatile uint32_t*)(0x424E249CUL))

