neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_ADC1_PCCR_PSTR                        *((volatile uint32_t*)(0x424E2320UL))
#define bFM4_ADC1_PCCR_PSTR                       *((volatile uint32_t*)(0x424E2320UL))
#define bFM_ADC1_PCCR_PHEN                        *((volatile uint32_t*)(0x424E2324UL))
#define bFM4_ADC1_PCCR_PHEN                       *((volatile uint32_t*)(0x424E2324UL))
#define bFM_ADC1_PCCR_PEEN                        *((volatile uint32_t*)(0x424E2328UL))
#define bFM4_ADC1_PCCR_PEEN                       *((volatile uint32_t*)(0x424E2328UL))
#define bFM_ADC1_PCCR_ESCE                        *((volatile uint32_t*)(0x424E232CUL))
#define bFM4_ADC1_PCCR_ESCE                       *((volatile uint32_t*)(0x424E232CUL))
#define bFM_ADC1_PCCR_PFCLR                       *((volatile uint32_t*)(0x424E2330UL))
#define bFM4_ADC1_PCCR_PFCLR                      *((volatile uint32_t*)(0x424E2330UL))
#define bFM_ADC1_PCCR_POVR                        *((volatile uint32_t*)(0x424E2334UL))
#define bFM4_ADC1_PCCR_POVR                       *((volatile uint32_t*)(0x424E2334UL))
#define bFM_ADC1_PCCR_PFUL                        *((volatile uint32_t*)(0x424E2338UL))
#define bFM4_ADC1_PCCR_PFUL                       *((volatile uint32_t*)(0x424E2338UL))
#define bFM_ADC1_PCCR_PEMP                        *((volatile uint32_t*)(0x424E233CUL))
#define bFM4_ADC1_PCCR_PEMP                       *((volatile uint32_t*)(0x424E233CUL))

#define bFM_ADC1_PCFD_INVL                        *((volatile uint32_t*)(0x424E23B0UL))
#define bFM4_ADC1_PCFD_INVL                       *((volatile uint32_t*)(0x424E23B0UL))

#define bFM_ADC1_SCCR_SSTR                        *((volatile uint32_t*)(0x424E2120UL))
#define bFM4_ADC1_SCCR_SSTR                       *((volatile uint32_t*)(0x424E2120UL))
#define bFM_ADC1_SCCR_SHEN                        *((volatile uint32_t*)(0x424E2124UL))
#define bFM4_ADC1_SCCR_SHEN                       *((volatile uint32_t*)(0x424E2124UL))
#define bFM_ADC1_SCCR_RPT                         *((volatile uint32_t*)(0x424E2128UL))
#define bFM4_ADC1_SCCR_RPT                        *((volatile uint32_t*)(0x424E2128UL))
#define bFM_ADC1_SCCR_SFCLR                       *((volatile uint32_t*)(0x424E2130UL))
#define bFM4_ADC1_SCCR_SFCLR                      *((volatile uint32_t*)(0x424E2130UL))
#define bFM_ADC1_SCCR_SOVR                        *((volatile uint32_t*)(0x424E2134UL))
#define bFM4_ADC1_SCCR_SOVR                       *((volatile uint32_t*)(0x424E2134UL))
#define bFM_ADC1_SCCR_SFUL                        *((volatile uint32_t*)(0x424E2138UL))
#define bFM4_ADC1_SCCR_SFUL                       *((volatile uint32_t*)(0x424E2138UL))
#define bFM_ADC1_SCCR_SEMP                        *((volatile uint32_t*)(0x424E213CUL))
#define bFM4_ADC1_SCCR_SEMP                       *((volatile uint32_t*)(0x424E213CUL))

#define bFM_ADC1_SCFD_INVL                        *((volatile uint32_t*)(0x424E21B0UL))
#define bFM4_ADC1_SCFD_INVL                       *((volatile uint32_t*)(0x424E21B0UL))

#define bFM_ADC1_SCIS01_AN0                       *((volatile uint32_t*)(0x424E2280UL))
#define bFM4_ADC1_SCIS01_AN0                      *((volatile uint32_t*)(0x424E2280UL))
#define bFM_ADC1_SCIS01_AN1                       *((volatile uint32_t*)(0x424E2284UL))
#define bFM4_ADC1_SCIS01_AN1                      *((volatile uint32_t*)(0x424E2284UL))
#define bFM_ADC1_SCIS01_AN2                       *((volatile uint32_t*)(0x424E2288UL))
#define bFM4_ADC1_SCIS01_AN2                      *((volatile uint32_t*)(0x424E2288UL))
#define bFM_ADC1_SCIS01_AN3                       *((volatile uint32_t*)(0x424E228CUL))
#define bFM4_ADC1_SCIS01_AN3                      *((volatile uint32_t*)(0x424E228CUL))
#define bFM_ADC1_SCIS01_AN4                       *((volatile uint32_t*)(0x424E2290UL))
#define bFM4_ADC1_SCIS01_AN4                      *((volatile uint32_t*)(0x424E2290UL))
#define bFM_ADC1_SCIS01_AN5                       *((volatile uint32_t*)(0x424E2294UL))
#define bFM4_ADC1_SCIS01_AN5                      *((volatile uint32_t*)(0x424E2294UL))
#define bFM_ADC1_SCIS01_AN6                       *((volatile uint32_t*)(0x424E2298UL))
#define bFM4_ADC1_SCIS01_AN6                      *((volatile uint32_t*)(0x424E2298UL))
#define bFM_ADC1_SCIS01_AN7                       *((volatile uint32_t*)(0x424E229CUL))
#define bFM4_ADC1_SCIS01_AN7                      *((volatile uint32_t*)(0x424E229CUL))
#define bFM_ADC1_SCIS01_AN8                       *((volatile uint32_t*)(0x424E22A0UL))
#define bFM4_ADC1_SCIS01_AN8                      *((volatile uint32_t*)(0x424E22A0UL))
#define bFM_ADC1_SCIS01_AN9                       *((volatile uint32_t*)(0x424E22A4UL))
#define bFM4_ADC1_SCIS01_AN9                      *((volatile uint32_t*)(0x424E22A4UL))
#define bFM_ADC1_SCIS01_AN10                      *((volatile uint32_t*)(0x424E22A8UL))
#define bFM4_ADC1_SCIS01_AN10                     *((volatile uint32_t*)(0x424E22A8UL))
#define bFM_ADC1_SCIS01_AN11                      *((volatile uint32_t*)(0x424E22ACUL))
#define bFM4_ADC1_SCIS01_AN11                     *((volatile uint32_t*)(0x424E22ACUL))
#define bFM_ADC1_SCIS01_AN12                      *((volatile uint32_t*)(0x424E22B0UL))
#define bFM4_ADC1_SCIS01_AN12                     *((volatile uint32_t*)(0x424E22B0UL))
#define bFM_ADC1_SCIS01_AN13                      *((volatile uint32_t*)(0x424E22B4UL))
#define bFM4_ADC1_SCIS01_AN13                     *((volatile uint32_t*)(0x424E22B4UL))
#define bFM_ADC1_SCIS01_AN14                      *((volatile uint32_t*)(0x424E22B8UL))
#define bFM4_ADC1_SCIS01_AN14                     *((volatile uint32_t*)(0x424E22B8UL))
#define bFM_ADC1_SCIS01_AN15                      *((volatile uint32_t*)(0x424E22BCUL))
#define bFM4_ADC1_SCIS01_AN15                     *((volatile uint32_t*)(0x424E22BCUL))

#define bFM_ADC1_SCIS23_AN16                      *((volatile uint32_t*)(0x424E2200UL))
#define bFM4_ADC1_SCIS23_AN16                     *((volatile uint32_t*)(0x424E2200UL))
#define bFM_ADC1_SCIS23_AN17                      *((volatile uint32_t*)(0x424E2204UL))
#define bFM4_ADC1_SCIS23_AN17                     *((volatile uint32_t*)(0x424E2204UL))
#define bFM_ADC1_SCIS23_AN18                      *((volatile uint32_t*)(0x424E2208UL))
#define bFM4_ADC1_SCIS23_AN18                     *((volatile uint32_t*)(0x424E2208UL))
#define bFM_ADC1_SCIS23_AN19                      *((volatile uint32_t*)(0x424E220CUL))
#define bFM4_ADC1_SCIS23_AN19                     *((volatile uint32_t*)(0x424E220CUL))
#define bFM_ADC1_SCIS23_AN20                      *((volatile uint32_t*)(0x424E2210UL))
#define bFM4_ADC1_SCIS23_AN20                     *((volatile uint32_t*)(0x424E2210UL))
#define bFM_ADC1_SCIS23_AN21                      *((volatile uint32_t*)(0x424E2214UL))
#define bFM4_ADC1_SCIS23_AN21                     *((volatile uint32_t*)(0x424E2214UL))
#define bFM_ADC1_SCIS23_AN22                      *((volatile uint32_t*)(0x424E2218UL))
#define bFM4_ADC1_SCIS23_AN22                     *((volatile uint32_t*)(0x424E2218UL))
#define bFM_ADC1_SCIS23_AN23                      *((volatile uint32_t*)(0x424E221CUL))
#define bFM4_ADC1_SCIS23_AN23                     *((volatile uint32_t*)(0x424E221CUL))
#define bFM_ADC1_SCIS23_AN24                      *((volatile uint32_t*)(0x424E2220UL))
#define bFM4_ADC1_SCIS23_AN24                     *((volatile uint32_t*)(0x424E2220UL))
#define bFM_ADC1_SCIS23_AN25                      *((volatile uint32_t*)(0x424E2224UL))
#define bFM4_ADC1_SCIS23_AN25                     *((volatile uint32_t*)(0x424E2224UL))
#define bFM_ADC1_SCIS23_AN26                      *((volatile uint32_t*)(0x424E2228UL))
#define bFM4_ADC1_SCIS23_AN26                     *((volatile uint32_t*)(0x424E2228UL))
#define bFM_ADC1_SCIS23_AN27                      *((volatile uint32_t*)(0x424E222CUL))
#define bFM4_ADC1_SCIS23_AN27                     *((volatile uint32_t*)(0x424E222CUL))
#define bFM_ADC1_SCIS23_AN28                      *((volatile uint32_t*)(0x424E2230UL))
#define bFM4_ADC1_SCIS23_AN28                     *((volatile uint32_t*)(0x424E2230UL))
#define bFM_ADC1_SCIS23_AN29                      *((volatile uint32_t*)(0x424E2234UL))
#define bFM4_ADC1_SCIS23_AN29                     *((volatile uint32_t*)(0x424E2234UL))
#define bFM_ADC1_SCIS23_AN30                      *((volatile uint32_t*)(0x424E2238UL))
#define bFM4_ADC1_SCIS23_AN30                     *((volatile uint32_t*)(0x424E2238UL))
#define bFM_ADC1_SCIS23_AN31                      *((volatile uint32_t*)(0x424E223CUL))
#define bFM4_ADC1_SCIS23_AN31                     *((volatile uint32_t*)(0x424E223CUL))

#define bFM_ADC1_WCMPCR_RCOE                      *((volatile uint32_t*)(0x424E2988UL))
#define bFM4_ADC1_WCMPCR_RCOE                     *((volatile uint32_t*)(0x424E2988UL))
#define bFM_ADC1_WCMPCR_RCOIE                     *((volatile uint32_t*)(0x424E298CUL))
#define bFM4_ADC1_WCMPCR_RCOIE                    *((volatile uint32_t*)(0x424E298CUL))
#define bFM_ADC1_WCMPCR_RCOIRS                    *((volatile uint32_t*)(0x424E2990UL))
#define bFM4_ADC1_WCMPCR_RCOIRS                   *((volatile uint32_t*)(0x424E2990UL))

#define bFM_ADC1_WCMPSR_WCMD                      *((volatile uint32_t*)(0x424E29B4UL))
#define bFM4_ADC1_WCMPSR_WCMD                     *((volatile uint32_t*)(0x424E29B4UL))

#define bFM_ADC1_WCMRCIF_RCINT                    *((volatile uint32_t*)(0x424E2900UL))
#define bFM4_ADC1_WCMRCIF_RCINT                   *((volatile uint32_t*)(0x424E2900UL))

