neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_ADC1_WCMRCOT_RCOOF                    *((volatile uint32_t*)(0x424E2880UL))
#define bFM4_ADC1_WCMRCOT_RCOOF                   *((volatile uint32_t*)(0x424E2880UL))


/******************************************************************************
 ** ADC Registers ADC2
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_ADC2_ADCEN_ENBL                       *((volatile uint32_t*)(0x424E4780UL))
#define bFM4_ADC2_ADCEN_ENBL                      *((volatile uint32_t*)(0x424E4780UL))
#define bFM_ADC2_ADCEN_READY                      *((volatile uint32_t*)(0x424E4784UL))
#define bFM4_ADC2_ADCEN_READY                     *((volatile uint32_t*)(0x424E4784UL))

#define bFM_ADC2_ADCR_OVRIE                       *((volatile uint32_t*)(0x424E4020UL))
#define bFM4_ADC2_ADCR_OVRIE                      *((volatile uint32_t*)(0x424E4020UL))
#define bFM_ADC2_ADCR_CMPIE                       *((volatile uint32_t*)(0x424E4024UL))
#define bFM4_ADC2_ADCR_CMPIE                      *((volatile uint32_t*)(0x424E4024UL))
#define bFM_ADC2_ADCR_PCIE                        *((volatile uint32_t*)(0x424E4028UL))
#define bFM4_ADC2_ADCR_PCIE                       *((volatile uint32_t*)(0x424E4028UL))
#define bFM_ADC2_ADCR_SCIE                        *((volatile uint32_t*)(0x424E402CUL))
#define bFM4_ADC2_ADCR_SCIE                       *((volatile uint32_t*)(0x424E402CUL))
#define bFM_ADC2_ADCR_CMPIF                       *((volatile uint32_t*)(0x424E4034UL))
#define bFM4_ADC2_ADCR_CMPIF                      *((volatile uint32_t*)(0x424E4034UL))
#define bFM_ADC2_ADCR_PCIF                        *((volatile uint32_t*)(0x424E4038UL))
#define bFM4_ADC2_ADCR_PCIF                       *((volatile uint32_t*)(0x424E4038UL))
#define bFM_ADC2_ADCR_SCIF                        *((volatile uint32_t*)(0x424E403CUL))
#define bFM4_ADC2_ADCR_SCIF                       *((volatile uint32_t*)(0x424E403CUL))

#define bFM_ADC2_ADSR_SCS                         *((volatile uint32_t*)(0x424E4000UL))
#define bFM4_ADC2_ADSR_SCS                        *((volatile uint32_t*)(0x424E4000UL))
#define bFM_ADC2_ADSR_PCS                         *((volatile uint32_t*)(0x424E4004UL))
#define bFM4_ADC2_ADSR_PCS                        *((volatile uint32_t*)(0x424E4004UL))
#define bFM_ADC2_ADSR_PCNS                        *((volatile uint32_t*)(0x424E4008UL))
#define bFM4_ADC2_ADSR_PCNS                       *((volatile uint32_t*)(0x424E4008UL))
#define bFM_ADC2_ADSR_FDAS                        *((volatile uint32_t*)(0x424E4018UL))
#define bFM4_ADC2_ADSR_FDAS                       *((volatile uint32_t*)(0x424E4018UL))
#define bFM_ADC2_ADSR_ADSTP                       *((volatile uint32_t*)(0x424E401CUL))
#define bFM4_ADC2_ADSR_ADSTP                      *((volatile uint32_t*)(0x424E401CUL))

#define bFM_ADC2_ADSS01_TS0                       *((volatile uint32_t*)(0x424E4580UL))
#define bFM4_ADC2_ADSS01_TS0                      *((volatile uint32_t*)(0x424E4580UL))
#define bFM_ADC2_ADSS01_TS1                       *((volatile uint32_t*)(0x424E4584UL))
#define bFM4_ADC2_ADSS01_TS1                      *((volatile uint32_t*)(0x424E4584UL))
#define bFM_ADC2_ADSS01_TS2                       *((volatile uint32_t*)(0x424E4588UL))
#define bFM4_ADC2_ADSS01_TS2                      *((volatile uint32_t*)(0x424E4588UL))
#define bFM_ADC2_ADSS01_TS3                       *((volatile uint32_t*)(0x424E458CUL))
#define bFM4_ADC2_ADSS01_TS3                      *((volatile uint32_t*)(0x424E458CUL))
#define bFM_ADC2_ADSS01_TS4                       *((volatile uint32_t*)(0x424E4590UL))
#define bFM4_ADC2_ADSS01_TS4                      *((volatile uint32_t*)(0x424E4590UL))
#define bFM_ADC2_ADSS01_TS5                       *((volatile uint32_t*)(0x424E4594UL))
#define bFM4_ADC2_ADSS01_TS5                      *((volatile uint32_t*)(0x424E4594UL))
#define bFM_ADC2_ADSS01_TS6                       *((volatile uint32_t*)(0x424E4598UL))
#define bFM4_ADC2_ADSS01_TS6                      *((volatile uint32_t*)(0x424E4598UL))
#define bFM_ADC2_ADSS01_TS7                       *((volatile uint32_t*)(0x424E459CUL))
#define bFM4_ADC2_ADSS01_TS7                      *((volatile uint32_t*)(0x424E459CUL))
#define bFM_ADC2_ADSS01_TS8                       *((volatile uint32_t*)(0x424E45A0UL))
#define bFM4_ADC2_ADSS01_TS8                      *((volatile uint32_t*)(0x424E45A0UL))
#define bFM_ADC2_ADSS01_TS9                       *((volatile uint32_t*)(0x424E45A4UL))
#define bFM4_ADC2_ADSS01_TS9                      *((volatile uint32_t*)(0x424E45A4UL))
#define bFM_ADC2_ADSS01_TS10                      *((volatile uint32_t*)(0x424E45A8UL))
#define bFM4_ADC2_ADSS01_TS10                     *((volatile uint32_t*)(0x424E45A8UL))
#define bFM_ADC2_ADSS01_TS11                      *((volatile uint32_t*)(0x424E45ACUL))
#define bFM4_ADC2_ADSS01_TS11                     *((volatile uint32_t*)(0x424E45ACUL))
#define bFM_ADC2_ADSS01_TS12                      *((volatile uint32_t*)(0x424E45B0UL))
#define bFM4_ADC2_ADSS01_TS12                     *((volatile uint32_t*)(0x424E45B0UL))
#define bFM_ADC2_ADSS01_TS13                      *((volatile uint32_t*)(0x424E45B4UL))
#define bFM4_ADC2_ADSS01_TS13                     *((volatile uint32_t*)(0x424E45B4UL))
#define bFM_ADC2_ADSS01_TS14                      *((volatile uint32_t*)(0x424E45B8UL))
#define bFM4_ADC2_ADSS01_TS14                     *((volatile uint32_t*)(0x424E45B8UL))
#define bFM_ADC2_ADSS01_TS15                      *((volatile uint32_t*)(0x424E45BCUL))
#define bFM4_ADC2_ADSS01_TS15                     *((volatile uint32_t*)(0x424E45BCUL))

#define bFM_ADC2_ADSS23_TS16                      *((volatile uint32_t*)(0x424E4500UL))
#define bFM4_ADC2_ADSS23_TS16                     *((volatile uint32_t*)(0x424E4500UL))
#define bFM_ADC2_ADSS23_TS17                      *((volatile uint32_t*)(0x424E4504UL))
#define bFM4_ADC2_ADSS23_TS17                     *((volatile uint32_t*)(0x424E4504UL))
#define bFM_ADC2_ADSS23_TS18                      *((volatile uint32_t*)(0x424E4508UL))
#define bFM4_ADC2_ADSS23_TS18                     *((volatile uint32_t*)(0x424E4508UL))
#define bFM_ADC2_ADSS23_TS19                      *((volatile uint32_t*)(0x424E450CUL))
#define bFM4_ADC2_ADSS23_TS19                     *((volatile uint32_t*)(0x424E450CUL))
#define bFM_ADC2_ADSS23_TS20                      *((volatile uint32_t*)(0x424E4510UL))
#define bFM4_ADC2_ADSS23_TS20                     *((volatile uint32_t*)(0x424E4510UL))
#define bFM_ADC2_ADSS23_TS21                      *((volatile uint32_t*)(0x424E4514UL))
#define bFM4_ADC2_ADSS23_TS21                     *((volatile uint32_t*)(0x424E4514UL))
#define bFM_ADC2_ADSS23_TS22                      *((volatile uint32_t*)(0x424E4518UL))
#define bFM4_ADC2_ADSS23_TS22                     *((volatile uint32_t*)(0x424E4518UL))
#define bFM_ADC2_ADSS23_TS23                      *((volatile uint32_t*)(0x424E451CUL))
#define bFM4_ADC2_ADSS23_TS23                     *((volatile uint32_t*)(0x424E451CUL))
#define bFM_ADC2_ADSS23_TS24                      *((volatile uint32_t*)(0x424E4520UL))
#define bFM4_ADC2_ADSS23_TS24                     *((volatile uint32_t*)(0x424E4520UL))
#define bFM_ADC2_ADSS23_TS25                      *((volatile uint32_t*)(0x424E4524UL))
#define bFM4_ADC2_ADSS23_TS25                     *((volatile uint32_t*)(0x424E4524UL))
#define bFM_ADC2_ADSS23_TS26                      *((volatile uint32_t*)(0x424E4528UL))
#define bFM4_ADC2_ADSS23_TS26                     *((volatile uint32_t*)(0x424E4528UL))
#define bFM_ADC2_ADSS23_TS27                      *((volatile uint32_t*)(0x424E452CUL))
#define bFM4_ADC2_ADSS23_TS27                     *((volatile uint32_t*)(0x424E452CUL))
#define bFM_ADC2_ADSS23_TS28                      *((volatile uint32_t*)(0x424E4530UL))
#define bFM4_ADC2_ADSS23_TS28                     *((volatile uint32_t*)(0x424E4530UL))
#define bFM_ADC2_ADSS23_TS29                      *((volatile uint32_t*)(0x424E4534UL))
#define bFM4_ADC2_ADSS23_TS29                     *((volatile uint32_t*)(0x424E4534UL))
#define bFM_ADC2_ADSS23_TS30                      *((volatile uint32_t*)(0x424E4538UL))
#define bFM4_ADC2_ADSS23_TS30                     *((volatile uint32_t*)(0x424E4538UL))
#define bFM_ADC2_ADSS23_TS31                      *((volatile uint32_t*)(0x424E453CUL))
#define bFM4_ADC2_ADSS23_TS31                     *((volatile uint32_t*)(0x424E453CUL))

#define bFM_ADC2_CALSR_CLBEN                      *((volatile uint32_t*)(0x424E4820UL))
#define bFM4_ADC2_CALSR_CLBEN                     *((volatile uint32_t*)(0x424E4820UL))

#define bFM_ADC2_CMPCR_CMD0                       *((volatile uint32_t*)(0x424E4494UL))
#define bFM4_ADC2_CMPCR_CMD0                      *((volatile uint32_t*)(0x424E4494UL))
#define bFM_ADC2_CMPCR_CMD1                       *((volatile uint32_t*)(0x424E4498UL))
#define bFM4_ADC2_CMPCR_CMD1                      *((volatile uint32_t*)(0x424E4498UL))
#define bFM_ADC2_CMPCR_CMPEN                      *((volatile uint32_t*)(0x424E449CUL))
#define bFM4_ADC2_CMPCR_CMPEN                     *((volatile uint32_t*)(0x424E449CUL))

#define bFM_ADC2_PCCR_PSTR                        *((volatile uint32_t*)(0x424E4320UL))
#define bFM4_ADC2_PCCR_PSTR                       *((volatile uint32_t*)(0x424E4320UL))
#define bFM_ADC2_PCCR_PHEN                        *((volatile uint32_t*)(0x424E4324UL))
#define bFM4_ADC2_PCCR_PHEN                       *((volatile uint32_t*)(0x424E4324UL))
#define bFM_ADC2_PCCR_PEEN                        *((volatile uint32_t*)(0x424E4328UL))
#define bFM4_ADC2_PCCR_PEEN                       *((volatile uint32_t*)(0x424E4328UL))
#define bFM_ADC2_PCCR_ESCE                        *((volatile uint32_t*)(0x424E432CUL))
#define bFM4_ADC2_PCCR_ESCE                       *((volatile uint32_t*)(0x424E432CUL))
#define bFM_ADC2_PCCR_PFCLR                       *((volatile uint32_t*)(0x424E4330UL))
#define bFM4_ADC2_PCCR_PFCLR                      *((volatile uint32_t*)(0x424E4330UL))
#define bFM_ADC2_PCCR_POVR                        *((volatile uint32_t*)(0x424E4334UL))
#define bFM4_ADC2_PCCR_POVR                       *((volatile uint32_t*)(0x424E4334UL))
#define bFM_ADC2_PCCR_PFUL                        *((volatile uint32_t*)(0x424E4338UL))
#define bFM4_ADC2_PCCR_PFUL                       *((volatile uint32_t*)(0x424E4338UL))
#define bFM_ADC2_PCCR_PEMP                        *((volatile uint32_t*)(0x424E433CUL))
#define bFM4_ADC2_PCCR_PEMP                       *((volatile uint32_t*)(0x424E433CUL))

#define bFM_ADC2_PCFD_INVL                        *((volatile uint32_t*)(0x424E43B0UL))
#define bFM4_ADC2_PCFD_INVL                       *((volatile uint32_t*)(0x424E43B0UL))

#define bFM_ADC2_SCCR_SSTR                        *((volatile uint32_t*)(0x424E4120UL))
#define bFM4_ADC2_SCCR_SSTR                       *((volatile uint32_t*)(0x424E4120UL))
#define bFM_ADC2_SCCR_SHEN                        *((volatile uint32_t*)(0x424E4124UL))
#define bFM4_ADC2_SCCR_SHEN                       *((volatile uint32_t*)(0x424E4124UL))
#define bFM_ADC2_SCCR_RPT                         *((volatile uint32_t*)(0x424E4128UL))
#define bFM4_ADC2_SCCR_RPT                        *((volatile uint32_t*)(0x424E4128UL))
#define bFM_ADC2_SCCR_SFCLR                       *((volatile uint32_t*)(0x424E4130UL))
#define bFM4_ADC2_SCCR_SFCLR                      *((volatile uint32_t*)(0x424E4130UL))
#define bFM_ADC2_SCCR_SOVR                        *((volatile uint32_t*)(0x424E4134UL))
#define bFM4_ADC2_SCCR_SOVR                       *((volatile uint32_t*)(0x424E4134UL))
#define bFM_ADC2_SCCR_SFUL                        *((volatile uint32_t*)(0x424E4138UL))
#define bFM4_ADC2_SCCR_SFUL                       *((volatile uint32_t*)(0x424E4138UL))
#define bFM_ADC2_SCCR_SEMP                        *((volatile uint32_t*)(0x424E413CUL))
#define bFM4_ADC2_SCCR_SEMP                       *((volatile uint32_t*)(0x424E413CUL))

#define bFM_ADC2_SCFD_INVL                        *((volatile uint32_t*)(0x424E41B0UL))
#define bFM4_ADC2_SCFD_INVL                       *((volatile uint32_t*)(0x424E41B0UL))

