neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_ADC2_SCIS01_AN0                       *((volatile uint32_t*)(0x424E4280UL))
#define bFM4_ADC2_SCIS01_AN0                      *((volatile uint32_t*)(0x424E4280UL))
#define bFM_ADC2_SCIS01_AN1                       *((volatile uint32_t*)(0x424E4284UL))
#define bFM4_ADC2_SCIS01_AN1                      *((volatile uint32_t*)(0x424E4284UL))
#define bFM_ADC2_SCIS01_AN2                       *((volatile uint32_t*)(0x424E4288UL))
#define bFM4_ADC2_SCIS01_AN2                      *((volatile uint32_t*)(0x424E4288UL))
#define bFM_ADC2_SCIS01_AN3                       *((volatile uint32_t*)(0x424E428CUL))
#define bFM4_ADC2_SCIS01_AN3                      *((volatile uint32_t*)(0x424E428CUL))
#define bFM_ADC2_SCIS01_AN4                       *((volatile uint32_t*)(0x424E4290UL))
#define bFM4_ADC2_SCIS01_AN4                      *((volatile uint32_t*)(0x424E4290UL))
#define bFM_ADC2_SCIS01_AN5                       *((volatile uint32_t*)(0x424E4294UL))
#define bFM4_ADC2_SCIS01_AN5                      *((volatile uint32_t*)(0x424E4294UL))
#define bFM_ADC2_SCIS01_AN6                       *((volatile uint32_t*)(0x424E4298UL))
#define bFM4_ADC2_SCIS01_AN6                      *((volatile uint32_t*)(0x424E4298UL))
#define bFM_ADC2_SCIS01_AN7                       *((volatile uint32_t*)(0x424E429CUL))
#define bFM4_ADC2_SCIS01_AN7                      *((volatile uint32_t*)(0x424E429CUL))
#define bFM_ADC2_SCIS01_AN8                       *((volatile uint32_t*)(0x424E42A0UL))
#define bFM4_ADC2_SCIS01_AN8                      *((volatile uint32_t*)(0x424E42A0UL))
#define bFM_ADC2_SCIS01_AN9                       *((volatile uint32_t*)(0x424E42A4UL))
#define bFM4_ADC2_SCIS01_AN9                      *((volatile uint32_t*)(0x424E42A4UL))
#define bFM_ADC2_SCIS01_AN10                      *((volatile uint32_t*)(0x424E42A8UL))
#define bFM4_ADC2_SCIS01_AN10                     *((volatile uint32_t*)(0x424E42A8UL))
#define bFM_ADC2_SCIS01_AN11                      *((volatile uint32_t*)(0x424E42ACUL))
#define bFM4_ADC2_SCIS01_AN11                     *((volatile uint32_t*)(0x424E42ACUL))
#define bFM_ADC2_SCIS01_AN12                      *((volatile uint32_t*)(0x424E42B0UL))
#define bFM4_ADC2_SCIS01_AN12                     *((volatile uint32_t*)(0x424E42B0UL))
#define bFM_ADC2_SCIS01_AN13                      *((volatile uint32_t*)(0x424E42B4UL))
#define bFM4_ADC2_SCIS01_AN13                     *((volatile uint32_t*)(0x424E42B4UL))
#define bFM_ADC2_SCIS01_AN14                      *((volatile uint32_t*)(0x424E42B8UL))
#define bFM4_ADC2_SCIS01_AN14                     *((volatile uint32_t*)(0x424E42B8UL))
#define bFM_ADC2_SCIS01_AN15                      *((volatile uint32_t*)(0x424E42BCUL))
#define bFM4_ADC2_SCIS01_AN15                     *((volatile uint32_t*)(0x424E42BCUL))

#define bFM_ADC2_SCIS23_AN16                      *((volatile uint32_t*)(0x424E4200UL))
#define bFM4_ADC2_SCIS23_AN16                     *((volatile uint32_t*)(0x424E4200UL))
#define bFM_ADC2_SCIS23_AN17                      *((volatile uint32_t*)(0x424E4204UL))
#define bFM4_ADC2_SCIS23_AN17                     *((volatile uint32_t*)(0x424E4204UL))
#define bFM_ADC2_SCIS23_AN18                      *((volatile uint32_t*)(0x424E4208UL))
#define bFM4_ADC2_SCIS23_AN18                     *((volatile uint32_t*)(0x424E4208UL))
#define bFM_ADC2_SCIS23_AN19                      *((volatile uint32_t*)(0x424E420CUL))
#define bFM4_ADC2_SCIS23_AN19                     *((volatile uint32_t*)(0x424E420CUL))
#define bFM_ADC2_SCIS23_AN20                      *((volatile uint32_t*)(0x424E4210UL))
#define bFM4_ADC2_SCIS23_AN20                     *((volatile uint32_t*)(0x424E4210UL))
#define bFM_ADC2_SCIS23_AN21                      *((volatile uint32_t*)(0x424E4214UL))
#define bFM4_ADC2_SCIS23_AN21                     *((volatile uint32_t*)(0x424E4214UL))
#define bFM_ADC2_SCIS23_AN22                      *((volatile uint32_t*)(0x424E4218UL))
#define bFM4_ADC2_SCIS23_AN22                     *((volatile uint32_t*)(0x424E4218UL))
#define bFM_ADC2_SCIS23_AN23                      *((volatile uint32_t*)(0x424E421CUL))
#define bFM4_ADC2_SCIS23_AN23                     *((volatile uint32_t*)(0x424E421CUL))
#define bFM_ADC2_SCIS23_AN24                      *((volatile uint32_t*)(0x424E4220UL))
#define bFM4_ADC2_SCIS23_AN24                     *((volatile uint32_t*)(0x424E4220UL))
#define bFM_ADC2_SCIS23_AN25                      *((volatile uint32_t*)(0x424E4224UL))
#define bFM4_ADC2_SCIS23_AN25                     *((volatile uint32_t*)(0x424E4224UL))
#define bFM_ADC2_SCIS23_AN26                      *((volatile uint32_t*)(0x424E4228UL))
#define bFM4_ADC2_SCIS23_AN26                     *((volatile uint32_t*)(0x424E4228UL))
#define bFM_ADC2_SCIS23_AN27                      *((volatile uint32_t*)(0x424E422CUL))
#define bFM4_ADC2_SCIS23_AN27                     *((volatile uint32_t*)(0x424E422CUL))
#define bFM_ADC2_SCIS23_AN28                      *((volatile uint32_t*)(0x424E4230UL))
#define bFM4_ADC2_SCIS23_AN28                     *((volatile uint32_t*)(0x424E4230UL))
#define bFM_ADC2_SCIS23_AN29                      *((volatile uint32_t*)(0x424E4234UL))
#define bFM4_ADC2_SCIS23_AN29                     *((volatile uint32_t*)(0x424E4234UL))
#define bFM_ADC2_SCIS23_AN30                      *((volatile uint32_t*)(0x424E4238UL))
#define bFM4_ADC2_SCIS23_AN30                     *((volatile uint32_t*)(0x424E4238UL))
#define bFM_ADC2_SCIS23_AN31                      *((volatile uint32_t*)(0x424E423CUL))
#define bFM4_ADC2_SCIS23_AN31                     *((volatile uint32_t*)(0x424E423CUL))

#define bFM_ADC2_WCMPCR_RCOE                      *((volatile uint32_t*)(0x424E4988UL))
#define bFM4_ADC2_WCMPCR_RCOE                     *((volatile uint32_t*)(0x424E4988UL))
#define bFM_ADC2_WCMPCR_RCOIE                     *((volatile uint32_t*)(0x424E498CUL))
#define bFM4_ADC2_WCMPCR_RCOIE                    *((volatile uint32_t*)(0x424E498CUL))
#define bFM_ADC2_WCMPCR_RCOIRS                    *((volatile uint32_t*)(0x424E4990UL))
#define bFM4_ADC2_WCMPCR_RCOIRS                   *((volatile uint32_t*)(0x424E4990UL))

