neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_ADC2_WCMPSR_WCMD                      *((volatile uint32_t*)(0x424E49B4UL))
#define bFM4_ADC2_WCMPSR_WCMD                     *((volatile uint32_t*)(0x424E49B4UL))

#define bFM_ADC2_WCMRCIF_RCINT                    *((volatile uint32_t*)(0x424E4900UL))
#define bFM4_ADC2_WCMRCIF_RCINT                   *((volatile uint32_t*)(0x424E4900UL))

#define bFM_ADC2_WCMRCOT_RCOOF                    *((volatile uint32_t*)(0x424E4880UL))
#define bFM4_ADC2_WCMRCOT_RCOOF                   *((volatile uint32_t*)(0x424E4880UL))


/******************************************************************************
 ** BT Registers BT0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT0_PPG_STC_UDIR                      *((volatile uint32_t*)(0x424A0200UL))
#define bFM4_BT0_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424A0200UL))
#define bFM_BT0_PPG_STC_TGIR                      *((volatile uint32_t*)(0x424A0208UL))
#define bFM4_BT0_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424A0208UL))
#define bFM_BT0_PPG_STC_UDIE                      *((volatile uint32_t*)(0x424A0210UL))
#define bFM4_BT0_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424A0210UL))
#define bFM_BT0_PPG_STC_TGIE                      *((volatile uint32_t*)(0x424A0218UL))
#define bFM4_BT0_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424A0218UL))

#define bFM_BT0_PPG_TMCR_STRG                     *((volatile uint32_t*)(0x424A0180UL))
#define bFM4_BT0_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424A0180UL))
#define bFM_BT0_PPG_TMCR_CTEN                     *((volatile uint32_t*)(0x424A0184UL))
#define bFM4_BT0_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424A0184UL))
#define bFM_BT0_PPG_TMCR_MDSE                     *((volatile uint32_t*)(0x424A0188UL))
#define bFM4_BT0_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424A0188UL))
#define bFM_BT0_PPG_TMCR_OSEL                     *((volatile uint32_t*)(0x424A018CUL))
#define bFM4_BT0_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424A018CUL))
#define bFM_BT0_PPG_TMCR_PMSK                     *((volatile uint32_t*)(0x424A01A8UL))
#define bFM4_BT0_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424A01A8UL))
#define bFM_BT0_PPG_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A01ACUL))
#define bFM4_BT0_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A01ACUL))

#define bFM_BT0_PPG_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A0220UL))
#define bFM4_BT0_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A0220UL))

#define bFM_BT0_PWC_STC_OVIR                      *((volatile uint32_t*)(0x424A0200UL))
#define bFM4_BT0_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424A0200UL))
#define bFM_BT0_PWC_STC_EDIR                      *((volatile uint32_t*)(0x424A0208UL))
#define bFM4_BT0_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424A0208UL))
#define bFM_BT0_PWC_STC_OVIE                      *((volatile uint32_t*)(0x424A0210UL))
#define bFM4_BT0_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424A0210UL))
#define bFM_BT0_PWC_STC_EDIE                      *((volatile uint32_t*)(0x424A0218UL))
#define bFM4_BT0_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424A0218UL))
#define bFM_BT0_PWC_STC_ERR                       *((volatile uint32_t*)(0x424A021CUL))
#define bFM4_BT0_PWC_STC_ERR                      *((volatile uint32_t*)(0x424A021CUL))

#define bFM_BT0_PWC_TMCR_CTEN                     *((volatile uint32_t*)(0x424A0184UL))
#define bFM4_BT0_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424A0184UL))
#define bFM_BT0_PWC_TMCR_MDSE                     *((volatile uint32_t*)(0x424A0188UL))
#define bFM4_BT0_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424A0188UL))
#define bFM_BT0_PWC_TMCR_T32                      *((volatile uint32_t*)(0x424A019CUL))
#define bFM4_BT0_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424A019CUL))

#define bFM_BT0_PWC_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A0220UL))
#define bFM4_BT0_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A0220UL))

#define bFM_BT0_PWM_STC_UDIR                      *((volatile uint32_t*)(0x424A0200UL))
#define bFM4_BT0_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424A0200UL))
#define bFM_BT0_PWM_STC_DTIR                      *((volatile uint32_t*)(0x424A0204UL))
#define bFM4_BT0_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424A0204UL))
#define bFM_BT0_PWM_STC_TGIR                      *((volatile uint32_t*)(0x424A0208UL))
#define bFM4_BT0_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424A0208UL))
#define bFM_BT0_PWM_STC_UDIE                      *((volatile uint32_t*)(0x424A0210UL))
#define bFM4_BT0_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424A0210UL))
#define bFM_BT0_PWM_STC_DTIE                      *((volatile uint32_t*)(0x424A0214UL))
#define bFM4_BT0_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424A0214UL))
#define bFM_BT0_PWM_STC_TGIE                      *((volatile uint32_t*)(0x424A0218UL))
#define bFM4_BT0_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424A0218UL))

#define bFM_BT0_PWM_TMCR_STRG                     *((volatile uint32_t*)(0x424A0180UL))
#define bFM4_BT0_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424A0180UL))
#define bFM_BT0_PWM_TMCR_CTEN                     *((volatile uint32_t*)(0x424A0184UL))
#define bFM4_BT0_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424A0184UL))
#define bFM_BT0_PWM_TMCR_MDSE                     *((volatile uint32_t*)(0x424A0188UL))
#define bFM4_BT0_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424A0188UL))
#define bFM_BT0_PWM_TMCR_OSEL                     *((volatile uint32_t*)(0x424A018CUL))
#define bFM4_BT0_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424A018CUL))
#define bFM_BT0_PWM_TMCR_PMSK                     *((volatile uint32_t*)(0x424A01A8UL))
#define bFM4_BT0_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424A01A8UL))
#define bFM_BT0_PWM_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A01ACUL))
#define bFM4_BT0_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A01ACUL))

#define bFM_BT0_PWM_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A0220UL))
#define bFM4_BT0_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A0220UL))

#define bFM_BT0_RT_STC_UDIR                       *((volatile uint32_t*)(0x424A0200UL))
#define bFM4_BT0_RT_STC_UDIR                      *((volatile uint32_t*)(0x424A0200UL))
#define bFM_BT0_RT_STC_TGIR                       *((volatile uint32_t*)(0x424A0208UL))
#define bFM4_BT0_RT_STC_TGIR                      *((volatile uint32_t*)(0x424A0208UL))
#define bFM_BT0_RT_STC_UDIE                       *((volatile uint32_t*)(0x424A0210UL))
#define bFM4_BT0_RT_STC_UDIE                      *((volatile uint32_t*)(0x424A0210UL))
#define bFM_BT0_RT_STC_TGIE                       *((volatile uint32_t*)(0x424A0218UL))
#define bFM4_BT0_RT_STC_TGIE                      *((volatile uint32_t*)(0x424A0218UL))

