neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_BT0_RT_TMCR_STRG                      *((volatile uint32_t*)(0x424A0180UL))
#define bFM4_BT0_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424A0180UL))
#define bFM_BT0_RT_TMCR_CTEN                      *((volatile uint32_t*)(0x424A0184UL))
#define bFM4_BT0_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424A0184UL))
#define bFM_BT0_RT_TMCR_MDSE                      *((volatile uint32_t*)(0x424A0188UL))
#define bFM4_BT0_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424A0188UL))
#define bFM_BT0_RT_TMCR_OSEL                      *((volatile uint32_t*)(0x424A018CUL))
#define bFM4_BT0_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424A018CUL))
#define bFM_BT0_RT_TMCR_T32                       *((volatile uint32_t*)(0x424A019CUL))
#define bFM4_BT0_RT_TMCR_T32                      *((volatile uint32_t*)(0x424A019CUL))

#define bFM_BT0_RT_TMCR2_CKS3                     *((volatile uint32_t*)(0x424A0220UL))
#define bFM4_BT0_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A0220UL))
#define bFM_BT0_RT_TMCR2_GATE                     *((volatile uint32_t*)(0x424A023CUL))
#define bFM4_BT0_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424A023CUL))


/******************************************************************************
 ** BT Registers BT1
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT1_PPG_STC_UDIR                      *((volatile uint32_t*)(0x424A0A00UL))
#define bFM4_BT1_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424A0A00UL))
#define bFM_BT1_PPG_STC_TGIR                      *((volatile uint32_t*)(0x424A0A08UL))
#define bFM4_BT1_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424A0A08UL))
#define bFM_BT1_PPG_STC_UDIE                      *((volatile uint32_t*)(0x424A0A10UL))
#define bFM4_BT1_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424A0A10UL))
#define bFM_BT1_PPG_STC_TGIE                      *((volatile uint32_t*)(0x424A0A18UL))
#define bFM4_BT1_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424A0A18UL))

#define bFM_BT1_PPG_TMCR_STRG                     *((volatile uint32_t*)(0x424A0980UL))
#define bFM4_BT1_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424A0980UL))
#define bFM_BT1_PPG_TMCR_CTEN                     *((volatile uint32_t*)(0x424A0984UL))
#define bFM4_BT1_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424A0984UL))
#define bFM_BT1_PPG_TMCR_MDSE                     *((volatile uint32_t*)(0x424A0988UL))
#define bFM4_BT1_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424A0988UL))
#define bFM_BT1_PPG_TMCR_OSEL                     *((volatile uint32_t*)(0x424A098CUL))
#define bFM4_BT1_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424A098CUL))
#define bFM_BT1_PPG_TMCR_PMSK                     *((volatile uint32_t*)(0x424A09A8UL))
#define bFM4_BT1_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424A09A8UL))
#define bFM_BT1_PPG_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A09ACUL))
#define bFM4_BT1_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A09ACUL))

#define bFM_BT1_PPG_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A0A20UL))
#define bFM4_BT1_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A0A20UL))

#define bFM_BT1_PWC_STC_OVIR                      *((volatile uint32_t*)(0x424A0A00UL))
#define bFM4_BT1_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424A0A00UL))
#define bFM_BT1_PWC_STC_EDIR                      *((volatile uint32_t*)(0x424A0A08UL))
#define bFM4_BT1_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424A0A08UL))
#define bFM_BT1_PWC_STC_OVIE                      *((volatile uint32_t*)(0x424A0A10UL))
#define bFM4_BT1_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424A0A10UL))
#define bFM_BT1_PWC_STC_EDIE                      *((volatile uint32_t*)(0x424A0A18UL))
#define bFM4_BT1_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424A0A18UL))
#define bFM_BT1_PWC_STC_ERR                       *((volatile uint32_t*)(0x424A0A1CUL))
#define bFM4_BT1_PWC_STC_ERR                      *((volatile uint32_t*)(0x424A0A1CUL))

#define bFM_BT1_PWC_TMCR_CTEN                     *((volatile uint32_t*)(0x424A0984UL))
#define bFM4_BT1_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424A0984UL))
#define bFM_BT1_PWC_TMCR_MDSE                     *((volatile uint32_t*)(0x424A0988UL))
#define bFM4_BT1_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424A0988UL))
#define bFM_BT1_PWC_TMCR_T32                      *((volatile uint32_t*)(0x424A099CUL))
#define bFM4_BT1_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424A099CUL))

#define bFM_BT1_PWC_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A0A20UL))
#define bFM4_BT1_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A0A20UL))

#define bFM_BT1_PWM_STC_UDIR                      *((volatile uint32_t*)(0x424A0A00UL))
#define bFM4_BT1_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424A0A00UL))
#define bFM_BT1_PWM_STC_DTIR                      *((volatile uint32_t*)(0x424A0A04UL))
#define bFM4_BT1_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424A0A04UL))
#define bFM_BT1_PWM_STC_TGIR                      *((volatile uint32_t*)(0x424A0A08UL))
#define bFM4_BT1_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424A0A08UL))
#define bFM_BT1_PWM_STC_UDIE                      *((volatile uint32_t*)(0x424A0A10UL))
#define bFM4_BT1_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424A0A10UL))
#define bFM_BT1_PWM_STC_DTIE                      *((volatile uint32_t*)(0x424A0A14UL))
#define bFM4_BT1_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424A0A14UL))
#define bFM_BT1_PWM_STC_TGIE                      *((volatile uint32_t*)(0x424A0A18UL))
#define bFM4_BT1_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424A0A18UL))

#define bFM_BT1_PWM_TMCR_STRG                     *((volatile uint32_t*)(0x424A0980UL))
#define bFM4_BT1_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424A0980UL))
#define bFM_BT1_PWM_TMCR_CTEN                     *((volatile uint32_t*)(0x424A0984UL))
#define bFM4_BT1_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424A0984UL))
#define bFM_BT1_PWM_TMCR_MDSE                     *((volatile uint32_t*)(0x424A0988UL))
#define bFM4_BT1_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424A0988UL))
#define bFM_BT1_PWM_TMCR_OSEL                     *((volatile uint32_t*)(0x424A098CUL))
#define bFM4_BT1_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424A098CUL))
#define bFM_BT1_PWM_TMCR_PMSK                     *((volatile uint32_t*)(0x424A09A8UL))
#define bFM4_BT1_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424A09A8UL))
#define bFM_BT1_PWM_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A09ACUL))
#define bFM4_BT1_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A09ACUL))

#define bFM_BT1_PWM_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A0A20UL))
#define bFM4_BT1_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A0A20UL))

#define bFM_BT1_RT_STC_UDIR                       *((volatile uint32_t*)(0x424A0A00UL))
#define bFM4_BT1_RT_STC_UDIR                      *((volatile uint32_t*)(0x424A0A00UL))
#define bFM_BT1_RT_STC_TGIR                       *((volatile uint32_t*)(0x424A0A08UL))
#define bFM4_BT1_RT_STC_TGIR                      *((volatile uint32_t*)(0x424A0A08UL))
#define bFM_BT1_RT_STC_UDIE                       *((volatile uint32_t*)(0x424A0A10UL))
#define bFM4_BT1_RT_STC_UDIE                      *((volatile uint32_t*)(0x424A0A10UL))
#define bFM_BT1_RT_STC_TGIE                       *((volatile uint32_t*)(0x424A0A18UL))
#define bFM4_BT1_RT_STC_TGIE                      *((volatile uint32_t*)(0x424A0A18UL))

#define bFM_BT1_RT_TMCR_STRG                      *((volatile uint32_t*)(0x424A0980UL))
#define bFM4_BT1_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424A0980UL))
#define bFM_BT1_RT_TMCR_CTEN                      *((volatile uint32_t*)(0x424A0984UL))
#define bFM4_BT1_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424A0984UL))
#define bFM_BT1_RT_TMCR_MDSE                      *((volatile uint32_t*)(0x424A0988UL))
#define bFM4_BT1_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424A0988UL))
#define bFM_BT1_RT_TMCR_OSEL                      *((volatile uint32_t*)(0x424A098CUL))
#define bFM4_BT1_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424A098CUL))
#define bFM_BT1_RT_TMCR_T32                       *((volatile uint32_t*)(0x424A099CUL))
#define bFM4_BT1_RT_TMCR_T32                      *((volatile uint32_t*)(0x424A099CUL))

#define bFM_BT1_RT_TMCR2_CKS3                     *((volatile uint32_t*)(0x424A0A20UL))
#define bFM4_BT1_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A0A20UL))
#define bFM_BT1_RT_TMCR2_GATE                     *((volatile uint32_t*)(0x424A0A3CUL))
#define bFM4_BT1_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424A0A3CUL))


