neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** BT Registers BT12
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT12_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424AC200UL))
#define bFM4_BT12_PPG_STC_UDIR                    *((volatile uint32_t*)(0x424AC200UL))
#define bFM_BT12_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424AC208UL))
#define bFM4_BT12_PPG_STC_TGIR                    *((volatile uint32_t*)(0x424AC208UL))
#define bFM_BT12_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424AC210UL))
#define bFM4_BT12_PPG_STC_UDIE                    *((volatile uint32_t*)(0x424AC210UL))
#define bFM_BT12_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424AC218UL))
#define bFM4_BT12_PPG_STC_TGIE                    *((volatile uint32_t*)(0x424AC218UL))

#define bFM_BT12_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424AC180UL))
#define bFM4_BT12_PPG_TMCR_STRG                   *((volatile uint32_t*)(0x424AC180UL))
#define bFM_BT12_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424AC184UL))
#define bFM4_BT12_PPG_TMCR_CTEN                   *((volatile uint32_t*)(0x424AC184UL))
#define bFM_BT12_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424AC188UL))
#define bFM4_BT12_PPG_TMCR_MDSE                   *((volatile uint32_t*)(0x424AC188UL))
#define bFM_BT12_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424AC18CUL))
#define bFM4_BT12_PPG_TMCR_OSEL                   *((volatile uint32_t*)(0x424AC18CUL))
#define bFM_BT12_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424AC1A8UL))
#define bFM4_BT12_PPG_TMCR_PMSK                   *((volatile uint32_t*)(0x424AC1A8UL))
#define bFM_BT12_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424AC1ACUL))
#define bFM4_BT12_PPG_TMCR_RTGEN                  *((volatile uint32_t*)(0x424AC1ACUL))

#define bFM_BT12_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424AC220UL))
#define bFM4_BT12_PPG_TMCR2_CKS3                  *((volatile uint32_t*)(0x424AC220UL))

#define bFM_BT12_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424AC200UL))
#define bFM4_BT12_PWC_STC_OVIR                    *((volatile uint32_t*)(0x424AC200UL))
#define bFM_BT12_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424AC208UL))
#define bFM4_BT12_PWC_STC_EDIR                    *((volatile uint32_t*)(0x424AC208UL))
#define bFM_BT12_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424AC210UL))
#define bFM4_BT12_PWC_STC_OVIE                    *((volatile uint32_t*)(0x424AC210UL))
#define bFM_BT12_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424AC218UL))
#define bFM4_BT12_PWC_STC_EDIE                    *((volatile uint32_t*)(0x424AC218UL))
#define bFM_BT12_PWC_STC_ERR                      *((volatile uint32_t*)(0x424AC21CUL))
#define bFM4_BT12_PWC_STC_ERR                     *((volatile uint32_t*)(0x424AC21CUL))

#define bFM_BT12_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424AC184UL))
#define bFM4_BT12_PWC_TMCR_CTEN                   *((volatile uint32_t*)(0x424AC184UL))
#define bFM_BT12_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424AC188UL))
#define bFM4_BT12_PWC_TMCR_MDSE                   *((volatile uint32_t*)(0x424AC188UL))
#define bFM_BT12_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424AC19CUL))
#define bFM4_BT12_PWC_TMCR_T32                    *((volatile uint32_t*)(0x424AC19CUL))

#define bFM_BT12_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424AC220UL))
#define bFM4_BT12_PWC_TMCR2_CKS3                  *((volatile uint32_t*)(0x424AC220UL))

#define bFM_BT12_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424AC200UL))
#define bFM4_BT12_PWM_STC_UDIR                    *((volatile uint32_t*)(0x424AC200UL))
#define bFM_BT12_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424AC204UL))
#define bFM4_BT12_PWM_STC_DTIR                    *((volatile uint32_t*)(0x424AC204UL))
#define bFM_BT12_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424AC208UL))
#define bFM4_BT12_PWM_STC_TGIR                    *((volatile uint32_t*)(0x424AC208UL))
#define bFM_BT12_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424AC210UL))
#define bFM4_BT12_PWM_STC_UDIE                    *((volatile uint32_t*)(0x424AC210UL))
#define bFM_BT12_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424AC214UL))
#define bFM4_BT12_PWM_STC_DTIE                    *((volatile uint32_t*)(0x424AC214UL))
#define bFM_BT12_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424AC218UL))
#define bFM4_BT12_PWM_STC_TGIE                    *((volatile uint32_t*)(0x424AC218UL))

#define bFM_BT12_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424AC180UL))
#define bFM4_BT12_PWM_TMCR_STRG                   *((volatile uint32_t*)(0x424AC180UL))
#define bFM_BT12_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424AC184UL))
#define bFM4_BT12_PWM_TMCR_CTEN                   *((volatile uint32_t*)(0x424AC184UL))
#define bFM_BT12_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424AC188UL))
#define bFM4_BT12_PWM_TMCR_MDSE                   *((volatile uint32_t*)(0x424AC188UL))
#define bFM_BT12_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424AC18CUL))
#define bFM4_BT12_PWM_TMCR_OSEL                   *((volatile uint32_t*)(0x424AC18CUL))
#define bFM_BT12_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424AC1A8UL))
#define bFM4_BT12_PWM_TMCR_PMSK                   *((volatile uint32_t*)(0x424AC1A8UL))
#define bFM_BT12_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424AC1ACUL))
#define bFM4_BT12_PWM_TMCR_RTGEN                  *((volatile uint32_t*)(0x424AC1ACUL))

#define bFM_BT12_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424AC220UL))
#define bFM4_BT12_PWM_TMCR2_CKS3                  *((volatile uint32_t*)(0x424AC220UL))

#define bFM_BT12_RT_STC_UDIR                      *((volatile uint32_t*)(0x424AC200UL))
#define bFM4_BT12_RT_STC_UDIR                     *((volatile uint32_t*)(0x424AC200UL))
#define bFM_BT12_RT_STC_TGIR                      *((volatile uint32_t*)(0x424AC208UL))
#define bFM4_BT12_RT_STC_TGIR                     *((volatile uint32_t*)(0x424AC208UL))
#define bFM_BT12_RT_STC_UDIE                      *((volatile uint32_t*)(0x424AC210UL))
#define bFM4_BT12_RT_STC_UDIE                     *((volatile uint32_t*)(0x424AC210UL))
#define bFM_BT12_RT_STC_TGIE                      *((volatile uint32_t*)(0x424AC218UL))
#define bFM4_BT12_RT_STC_TGIE                     *((volatile uint32_t*)(0x424AC218UL))

#define bFM_BT12_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424AC180UL))
#define bFM4_BT12_RT_TMCR_STRG                    *((volatile uint32_t*)(0x424AC180UL))
#define bFM_BT12_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424AC184UL))
#define bFM4_BT12_RT_TMCR_CTEN                    *((volatile uint32_t*)(0x424AC184UL))
#define bFM_BT12_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424AC188UL))
#define bFM4_BT12_RT_TMCR_MDSE                    *((volatile uint32_t*)(0x424AC188UL))
#define bFM_BT12_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424AC18CUL))
#define bFM4_BT12_RT_TMCR_OSEL                    *((volatile uint32_t*)(0x424AC18CUL))
#define bFM_BT12_RT_TMCR_T32                      *((volatile uint32_t*)(0x424AC19CUL))
#define bFM4_BT12_RT_TMCR_T32                     *((volatile uint32_t*)(0x424AC19CUL))

#define bFM_BT12_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424AC220UL))
#define bFM4_BT12_RT_TMCR2_CKS3                   *((volatile uint32_t*)(0x424AC220UL))
#define bFM_BT12_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424AC23CUL))
#define bFM4_BT12_RT_TMCR2_GATE                   *((volatile uint32_t*)(0x424AC23CUL))


