neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** BT Registers BT13
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT13_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424ACA00UL))
#define bFM4_BT13_PPG_STC_UDIR                    *((volatile uint32_t*)(0x424ACA00UL))
#define bFM_BT13_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424ACA08UL))
#define bFM4_BT13_PPG_STC_TGIR                    *((volatile uint32_t*)(0x424ACA08UL))
#define bFM_BT13_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424ACA10UL))
#define bFM4_BT13_PPG_STC_UDIE                    *((volatile uint32_t*)(0x424ACA10UL))
#define bFM_BT13_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424ACA18UL))
#define bFM4_BT13_PPG_STC_TGIE                    *((volatile uint32_t*)(0x424ACA18UL))

#define bFM_BT13_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424AC980UL))
#define bFM4_BT13_PPG_TMCR_STRG                   *((volatile uint32_t*)(0x424AC980UL))
#define bFM_BT13_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424AC984UL))
#define bFM4_BT13_PPG_TMCR_CTEN                   *((volatile uint32_t*)(0x424AC984UL))
#define bFM_BT13_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424AC988UL))
#define bFM4_BT13_PPG_TMCR_MDSE                   *((volatile uint32_t*)(0x424AC988UL))
#define bFM_BT13_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424AC98CUL))
#define bFM4_BT13_PPG_TMCR_OSEL                   *((volatile uint32_t*)(0x424AC98CUL))
#define bFM_BT13_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424AC9A8UL))
#define bFM4_BT13_PPG_TMCR_PMSK                   *((volatile uint32_t*)(0x424AC9A8UL))
#define bFM_BT13_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424AC9ACUL))
#define bFM4_BT13_PPG_TMCR_RTGEN                  *((volatile uint32_t*)(0x424AC9ACUL))

#define bFM_BT13_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424ACA20UL))
#define bFM4_BT13_PPG_TMCR2_CKS3                  *((volatile uint32_t*)(0x424ACA20UL))

#define bFM_BT13_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424ACA00UL))
#define bFM4_BT13_PWC_STC_OVIR                    *((volatile uint32_t*)(0x424ACA00UL))
#define bFM_BT13_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424ACA08UL))
#define bFM4_BT13_PWC_STC_EDIR                    *((volatile uint32_t*)(0x424ACA08UL))
#define bFM_BT13_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424ACA10UL))
#define bFM4_BT13_PWC_STC_OVIE                    *((volatile uint32_t*)(0x424ACA10UL))
#define bFM_BT13_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424ACA18UL))
#define bFM4_BT13_PWC_STC_EDIE                    *((volatile uint32_t*)(0x424ACA18UL))
#define bFM_BT13_PWC_STC_ERR                      *((volatile uint32_t*)(0x424ACA1CUL))
#define bFM4_BT13_PWC_STC_ERR                     *((volatile uint32_t*)(0x424ACA1CUL))

#define bFM_BT13_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424AC984UL))
#define bFM4_BT13_PWC_TMCR_CTEN                   *((volatile uint32_t*)(0x424AC984UL))
#define bFM_BT13_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424AC988UL))
#define bFM4_BT13_PWC_TMCR_MDSE                   *((volatile uint32_t*)(0x424AC988UL))
#define bFM_BT13_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424AC99CUL))
#define bFM4_BT13_PWC_TMCR_T32                    *((volatile uint32_t*)(0x424AC99CUL))

#define bFM_BT13_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424ACA20UL))
#define bFM4_BT13_PWC_TMCR2_CKS3                  *((volatile uint32_t*)(0x424ACA20UL))

#define bFM_BT13_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424ACA00UL))
#define bFM4_BT13_PWM_STC_UDIR                    *((volatile uint32_t*)(0x424ACA00UL))
#define bFM_BT13_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424ACA04UL))
#define bFM4_BT13_PWM_STC_DTIR                    *((volatile uint32_t*)(0x424ACA04UL))
#define bFM_BT13_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424ACA08UL))
#define bFM4_BT13_PWM_STC_TGIR                    *((volatile uint32_t*)(0x424ACA08UL))
#define bFM_BT13_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424ACA10UL))
#define bFM4_BT13_PWM_STC_UDIE                    *((volatile uint32_t*)(0x424ACA10UL))
#define bFM_BT13_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424ACA14UL))
#define bFM4_BT13_PWM_STC_DTIE                    *((volatile uint32_t*)(0x424ACA14UL))
#define bFM_BT13_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424ACA18UL))
#define bFM4_BT13_PWM_STC_TGIE                    *((volatile uint32_t*)(0x424ACA18UL))

#define bFM_BT13_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424AC980UL))
#define bFM4_BT13_PWM_TMCR_STRG                   *((volatile uint32_t*)(0x424AC980UL))
#define bFM_BT13_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424AC984UL))
#define bFM4_BT13_PWM_TMCR_CTEN                   *((volatile uint32_t*)(0x424AC984UL))
#define bFM_BT13_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424AC988UL))
#define bFM4_BT13_PWM_TMCR_MDSE                   *((volatile uint32_t*)(0x424AC988UL))
#define bFM_BT13_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424AC98CUL))
#define bFM4_BT13_PWM_TMCR_OSEL                   *((volatile uint32_t*)(0x424AC98CUL))
#define bFM_BT13_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424AC9A8UL))
#define bFM4_BT13_PWM_TMCR_PMSK                   *((volatile uint32_t*)(0x424AC9A8UL))
#define bFM_BT13_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424AC9ACUL))
#define bFM4_BT13_PWM_TMCR_RTGEN                  *((volatile uint32_t*)(0x424AC9ACUL))

#define bFM_BT13_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424ACA20UL))
#define bFM4_BT13_PWM_TMCR2_CKS3                  *((volatile uint32_t*)(0x424ACA20UL))

#define bFM_BT13_RT_STC_UDIR                      *((volatile uint32_t*)(0x424ACA00UL))
#define bFM4_BT13_RT_STC_UDIR                     *((volatile uint32_t*)(0x424ACA00UL))
#define bFM_BT13_RT_STC_TGIR                      *((volatile uint32_t*)(0x424ACA08UL))
#define bFM4_BT13_RT_STC_TGIR                     *((volatile uint32_t*)(0x424ACA08UL))
#define bFM_BT13_RT_STC_UDIE                      *((volatile uint32_t*)(0x424ACA10UL))
#define bFM4_BT13_RT_STC_UDIE                     *((volatile uint32_t*)(0x424ACA10UL))
#define bFM_BT13_RT_STC_TGIE                      *((volatile uint32_t*)(0x424ACA18UL))
#define bFM4_BT13_RT_STC_TGIE                     *((volatile uint32_t*)(0x424ACA18UL))

