neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_BT13_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424AC980UL))
#define bFM4_BT13_RT_TMCR_STRG                    *((volatile uint32_t*)(0x424AC980UL))
#define bFM_BT13_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424AC984UL))
#define bFM4_BT13_RT_TMCR_CTEN                    *((volatile uint32_t*)(0x424AC984UL))
#define bFM_BT13_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424AC988UL))
#define bFM4_BT13_RT_TMCR_MDSE                    *((volatile uint32_t*)(0x424AC988UL))
#define bFM_BT13_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424AC98CUL))
#define bFM4_BT13_RT_TMCR_OSEL                    *((volatile uint32_t*)(0x424AC98CUL))
#define bFM_BT13_RT_TMCR_T32                      *((volatile uint32_t*)(0x424AC99CUL))
#define bFM4_BT13_RT_TMCR_T32                     *((volatile uint32_t*)(0x424AC99CUL))

#define bFM_BT13_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424ACA20UL))
#define bFM4_BT13_RT_TMCR2_CKS3                   *((volatile uint32_t*)(0x424ACA20UL))
#define bFM_BT13_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424ACA3CUL))
#define bFM4_BT13_RT_TMCR2_GATE                   *((volatile uint32_t*)(0x424ACA3CUL))


/******************************************************************************
 ** BT Registers BT14
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT14_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424AD200UL))
#define bFM4_BT14_PPG_STC_UDIR                    *((volatile uint32_t*)(0x424AD200UL))
#define bFM_BT14_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424AD208UL))
#define bFM4_BT14_PPG_STC_TGIR                    *((volatile uint32_t*)(0x424AD208UL))
#define bFM_BT14_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424AD210UL))
#define bFM4_BT14_PPG_STC_UDIE                    *((volatile uint32_t*)(0x424AD210UL))
#define bFM_BT14_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424AD218UL))
#define bFM4_BT14_PPG_STC_TGIE                    *((volatile uint32_t*)(0x424AD218UL))

#define bFM_BT14_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424AD180UL))
#define bFM4_BT14_PPG_TMCR_STRG                   *((volatile uint32_t*)(0x424AD180UL))
#define bFM_BT14_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424AD184UL))
#define bFM4_BT14_PPG_TMCR_CTEN                   *((volatile uint32_t*)(0x424AD184UL))
#define bFM_BT14_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424AD188UL))
#define bFM4_BT14_PPG_TMCR_MDSE                   *((volatile uint32_t*)(0x424AD188UL))
#define bFM_BT14_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424AD18CUL))
#define bFM4_BT14_PPG_TMCR_OSEL                   *((volatile uint32_t*)(0x424AD18CUL))
#define bFM_BT14_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424AD1A8UL))
#define bFM4_BT14_PPG_TMCR_PMSK                   *((volatile uint32_t*)(0x424AD1A8UL))
#define bFM_BT14_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424AD1ACUL))
#define bFM4_BT14_PPG_TMCR_RTGEN                  *((volatile uint32_t*)(0x424AD1ACUL))

#define bFM_BT14_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424AD220UL))
#define bFM4_BT14_PPG_TMCR2_CKS3                  *((volatile uint32_t*)(0x424AD220UL))

#define bFM_BT14_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424AD200UL))
#define bFM4_BT14_PWC_STC_OVIR                    *((volatile uint32_t*)(0x424AD200UL))
#define bFM_BT14_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424AD208UL))
#define bFM4_BT14_PWC_STC_EDIR                    *((volatile uint32_t*)(0x424AD208UL))
#define bFM_BT14_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424AD210UL))
#define bFM4_BT14_PWC_STC_OVIE                    *((volatile uint32_t*)(0x424AD210UL))
#define bFM_BT14_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424AD218UL))
#define bFM4_BT14_PWC_STC_EDIE                    *((volatile uint32_t*)(0x424AD218UL))
#define bFM_BT14_PWC_STC_ERR                      *((volatile uint32_t*)(0x424AD21CUL))
#define bFM4_BT14_PWC_STC_ERR                     *((volatile uint32_t*)(0x424AD21CUL))

#define bFM_BT14_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424AD184UL))
#define bFM4_BT14_PWC_TMCR_CTEN                   *((volatile uint32_t*)(0x424AD184UL))
#define bFM_BT14_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424AD188UL))
#define bFM4_BT14_PWC_TMCR_MDSE                   *((volatile uint32_t*)(0x424AD188UL))
#define bFM_BT14_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424AD19CUL))
#define bFM4_BT14_PWC_TMCR_T32                    *((volatile uint32_t*)(0x424AD19CUL))

#define bFM_BT14_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424AD220UL))
#define bFM4_BT14_PWC_TMCR2_CKS3                  *((volatile uint32_t*)(0x424AD220UL))

#define bFM_BT14_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424AD200UL))
#define bFM4_BT14_PWM_STC_UDIR                    *((volatile uint32_t*)(0x424AD200UL))
#define bFM_BT14_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424AD204UL))
#define bFM4_BT14_PWM_STC_DTIR                    *((volatile uint32_t*)(0x424AD204UL))
#define bFM_BT14_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424AD208UL))
#define bFM4_BT14_PWM_STC_TGIR                    *((volatile uint32_t*)(0x424AD208UL))
#define bFM_BT14_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424AD210UL))
#define bFM4_BT14_PWM_STC_UDIE                    *((volatile uint32_t*)(0x424AD210UL))
#define bFM_BT14_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424AD214UL))
#define bFM4_BT14_PWM_STC_DTIE                    *((volatile uint32_t*)(0x424AD214UL))
#define bFM_BT14_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424AD218UL))
#define bFM4_BT14_PWM_STC_TGIE                    *((volatile uint32_t*)(0x424AD218UL))

