neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_BT14_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424AD180UL))
#define bFM4_BT14_PWM_TMCR_STRG                   *((volatile uint32_t*)(0x424AD180UL))
#define bFM_BT14_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424AD184UL))
#define bFM4_BT14_PWM_TMCR_CTEN                   *((volatile uint32_t*)(0x424AD184UL))
#define bFM_BT14_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424AD188UL))
#define bFM4_BT14_PWM_TMCR_MDSE                   *((volatile uint32_t*)(0x424AD188UL))
#define bFM_BT14_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424AD18CUL))
#define bFM4_BT14_PWM_TMCR_OSEL                   *((volatile uint32_t*)(0x424AD18CUL))
#define bFM_BT14_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424AD1A8UL))
#define bFM4_BT14_PWM_TMCR_PMSK                   *((volatile uint32_t*)(0x424AD1A8UL))
#define bFM_BT14_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424AD1ACUL))
#define bFM4_BT14_PWM_TMCR_RTGEN                  *((volatile uint32_t*)(0x424AD1ACUL))

#define bFM_BT14_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424AD220UL))
#define bFM4_BT14_PWM_TMCR2_CKS3                  *((volatile uint32_t*)(0x424AD220UL))

#define bFM_BT14_RT_STC_UDIR                      *((volatile uint32_t*)(0x424AD200UL))
#define bFM4_BT14_RT_STC_UDIR                     *((volatile uint32_t*)(0x424AD200UL))
#define bFM_BT14_RT_STC_TGIR                      *((volatile uint32_t*)(0x424AD208UL))
#define bFM4_BT14_RT_STC_TGIR                     *((volatile uint32_t*)(0x424AD208UL))
#define bFM_BT14_RT_STC_UDIE                      *((volatile uint32_t*)(0x424AD210UL))
#define bFM4_BT14_RT_STC_UDIE                     *((volatile uint32_t*)(0x424AD210UL))
#define bFM_BT14_RT_STC_TGIE                      *((volatile uint32_t*)(0x424AD218UL))
#define bFM4_BT14_RT_STC_TGIE                     *((volatile uint32_t*)(0x424AD218UL))

#define bFM_BT14_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424AD180UL))
#define bFM4_BT14_RT_TMCR_STRG                    *((volatile uint32_t*)(0x424AD180UL))
#define bFM_BT14_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424AD184UL))
#define bFM4_BT14_RT_TMCR_CTEN                    *((volatile uint32_t*)(0x424AD184UL))
#define bFM_BT14_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424AD188UL))
#define bFM4_BT14_RT_TMCR_MDSE                    *((volatile uint32_t*)(0x424AD188UL))
#define bFM_BT14_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424AD18CUL))
#define bFM4_BT14_RT_TMCR_OSEL                    *((volatile uint32_t*)(0x424AD18CUL))
#define bFM_BT14_RT_TMCR_T32                      *((volatile uint32_t*)(0x424AD19CUL))
#define bFM4_BT14_RT_TMCR_T32                     *((volatile uint32_t*)(0x424AD19CUL))

#define bFM_BT14_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424AD220UL))
#define bFM4_BT14_RT_TMCR2_CKS3                   *((volatile uint32_t*)(0x424AD220UL))
#define bFM_BT14_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424AD23CUL))
#define bFM4_BT14_RT_TMCR2_GATE                   *((volatile uint32_t*)(0x424AD23CUL))


/******************************************************************************
 ** BT Registers BT15
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT15_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424ADA00UL))
#define bFM4_BT15_PPG_STC_UDIR                    *((volatile uint32_t*)(0x424ADA00UL))
#define bFM_BT15_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424ADA08UL))
#define bFM4_BT15_PPG_STC_TGIR                    *((volatile uint32_t*)(0x424ADA08UL))
#define bFM_BT15_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424ADA10UL))
#define bFM4_BT15_PPG_STC_UDIE                    *((volatile uint32_t*)(0x424ADA10UL))
#define bFM_BT15_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424ADA18UL))
#define bFM4_BT15_PPG_STC_TGIE                    *((volatile uint32_t*)(0x424ADA18UL))

#define bFM_BT15_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424AD980UL))
#define bFM4_BT15_PPG_TMCR_STRG                   *((volatile uint32_t*)(0x424AD980UL))
#define bFM_BT15_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424AD984UL))
#define bFM4_BT15_PPG_TMCR_CTEN                   *((volatile uint32_t*)(0x424AD984UL))
#define bFM_BT15_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424AD988UL))
#define bFM4_BT15_PPG_TMCR_MDSE                   *((volatile uint32_t*)(0x424AD988UL))
#define bFM_BT15_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424AD98CUL))
#define bFM4_BT15_PPG_TMCR_OSEL                   *((volatile uint32_t*)(0x424AD98CUL))
#define bFM_BT15_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424AD9A8UL))
#define bFM4_BT15_PPG_TMCR_PMSK                   *((volatile uint32_t*)(0x424AD9A8UL))
#define bFM_BT15_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424AD9ACUL))
#define bFM4_BT15_PPG_TMCR_RTGEN                  *((volatile uint32_t*)(0x424AD9ACUL))

#define bFM_BT15_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424ADA20UL))
#define bFM4_BT15_PPG_TMCR2_CKS3                  *((volatile uint32_t*)(0x424ADA20UL))

#define bFM_BT15_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424ADA00UL))
#define bFM4_BT15_PWC_STC_OVIR                    *((volatile uint32_t*)(0x424ADA00UL))
#define bFM_BT15_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424ADA08UL))
#define bFM4_BT15_PWC_STC_EDIR                    *((volatile uint32_t*)(0x424ADA08UL))
#define bFM_BT15_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424ADA10UL))
#define bFM4_BT15_PWC_STC_OVIE                    *((volatile uint32_t*)(0x424ADA10UL))
#define bFM_BT15_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424ADA18UL))
#define bFM4_BT15_PWC_STC_EDIE                    *((volatile uint32_t*)(0x424ADA18UL))
#define bFM_BT15_PWC_STC_ERR                      *((volatile uint32_t*)(0x424ADA1CUL))
#define bFM4_BT15_PWC_STC_ERR                     *((volatile uint32_t*)(0x424ADA1CUL))

#define bFM_BT15_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424AD984UL))
#define bFM4_BT15_PWC_TMCR_CTEN                   *((volatile uint32_t*)(0x424AD984UL))
#define bFM_BT15_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424AD988UL))
#define bFM4_BT15_PWC_TMCR_MDSE                   *((volatile uint32_t*)(0x424AD988UL))
#define bFM_BT15_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424AD99CUL))
#define bFM4_BT15_PWC_TMCR_T32                    *((volatile uint32_t*)(0x424AD99CUL))

