neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_BT15_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424ADA20UL))
#define bFM4_BT15_PWC_TMCR2_CKS3                  *((volatile uint32_t*)(0x424ADA20UL))

#define bFM_BT15_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424ADA00UL))
#define bFM4_BT15_PWM_STC_UDIR                    *((volatile uint32_t*)(0x424ADA00UL))
#define bFM_BT15_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424ADA04UL))
#define bFM4_BT15_PWM_STC_DTIR                    *((volatile uint32_t*)(0x424ADA04UL))
#define bFM_BT15_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424ADA08UL))
#define bFM4_BT15_PWM_STC_TGIR                    *((volatile uint32_t*)(0x424ADA08UL))
#define bFM_BT15_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424ADA10UL))
#define bFM4_BT15_PWM_STC_UDIE                    *((volatile uint32_t*)(0x424ADA10UL))
#define bFM_BT15_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424ADA14UL))
#define bFM4_BT15_PWM_STC_DTIE                    *((volatile uint32_t*)(0x424ADA14UL))
#define bFM_BT15_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424ADA18UL))
#define bFM4_BT15_PWM_STC_TGIE                    *((volatile uint32_t*)(0x424ADA18UL))

#define bFM_BT15_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424AD980UL))
#define bFM4_BT15_PWM_TMCR_STRG                   *((volatile uint32_t*)(0x424AD980UL))
#define bFM_BT15_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424AD984UL))
#define bFM4_BT15_PWM_TMCR_CTEN                   *((volatile uint32_t*)(0x424AD984UL))
#define bFM_BT15_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424AD988UL))
#define bFM4_BT15_PWM_TMCR_MDSE                   *((volatile uint32_t*)(0x424AD988UL))
#define bFM_BT15_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424AD98CUL))
#define bFM4_BT15_PWM_TMCR_OSEL                   *((volatile uint32_t*)(0x424AD98CUL))
#define bFM_BT15_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424AD9A8UL))
#define bFM4_BT15_PWM_TMCR_PMSK                   *((volatile uint32_t*)(0x424AD9A8UL))
#define bFM_BT15_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424AD9ACUL))
#define bFM4_BT15_PWM_TMCR_RTGEN                  *((volatile uint32_t*)(0x424AD9ACUL))

#define bFM_BT15_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424ADA20UL))
#define bFM4_BT15_PWM_TMCR2_CKS3                  *((volatile uint32_t*)(0x424ADA20UL))

#define bFM_BT15_RT_STC_UDIR                      *((volatile uint32_t*)(0x424ADA00UL))
#define bFM4_BT15_RT_STC_UDIR                     *((volatile uint32_t*)(0x424ADA00UL))
#define bFM_BT15_RT_STC_TGIR                      *((volatile uint32_t*)(0x424ADA08UL))
#define bFM4_BT15_RT_STC_TGIR                     *((volatile uint32_t*)(0x424ADA08UL))
#define bFM_BT15_RT_STC_UDIE                      *((volatile uint32_t*)(0x424ADA10UL))
#define bFM4_BT15_RT_STC_UDIE                     *((volatile uint32_t*)(0x424ADA10UL))
#define bFM_BT15_RT_STC_TGIE                      *((volatile uint32_t*)(0x424ADA18UL))
#define bFM4_BT15_RT_STC_TGIE                     *((volatile uint32_t*)(0x424ADA18UL))

#define bFM_BT15_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424AD980UL))
#define bFM4_BT15_RT_TMCR_STRG                    *((volatile uint32_t*)(0x424AD980UL))
#define bFM_BT15_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424AD984UL))
#define bFM4_BT15_RT_TMCR_CTEN                    *((volatile uint32_t*)(0x424AD984UL))
#define bFM_BT15_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424AD988UL))
#define bFM4_BT15_RT_TMCR_MDSE                    *((volatile uint32_t*)(0x424AD988UL))
#define bFM_BT15_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424AD98CUL))
#define bFM4_BT15_RT_TMCR_OSEL                    *((volatile uint32_t*)(0x424AD98CUL))
#define bFM_BT15_RT_TMCR_T32                      *((volatile uint32_t*)(0x424AD99CUL))
#define bFM4_BT15_RT_TMCR_T32                     *((volatile uint32_t*)(0x424AD99CUL))

#define bFM_BT15_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424ADA20UL))
#define bFM4_BT15_RT_TMCR2_CKS3                   *((volatile uint32_t*)(0x424ADA20UL))
#define bFM_BT15_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424ADA3CUL))
#define bFM4_BT15_RT_TMCR2_GATE                   *((volatile uint32_t*)(0x424ADA3CUL))


/******************************************************************************
 ** BT Registers BT2
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT2_PPG_STC_UDIR                      *((volatile uint32_t*)(0x424A1200UL))
#define bFM4_BT2_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424A1200UL))
#define bFM_BT2_PPG_STC_TGIR                      *((volatile uint32_t*)(0x424A1208UL))
#define bFM4_BT2_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424A1208UL))
#define bFM_BT2_PPG_STC_UDIE                      *((volatile uint32_t*)(0x424A1210UL))
#define bFM4_BT2_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424A1210UL))
#define bFM_BT2_PPG_STC_TGIE                      *((volatile uint32_t*)(0x424A1218UL))
#define bFM4_BT2_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424A1218UL))

#define bFM_BT2_PPG_TMCR_STRG                     *((volatile uint32_t*)(0x424A1180UL))
#define bFM4_BT2_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424A1180UL))
#define bFM_BT2_PPG_TMCR_CTEN                     *((volatile uint32_t*)(0x424A1184UL))
#define bFM4_BT2_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424A1184UL))
#define bFM_BT2_PPG_TMCR_MDSE                     *((volatile uint32_t*)(0x424A1188UL))
#define bFM4_BT2_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424A1188UL))
#define bFM_BT2_PPG_TMCR_OSEL                     *((volatile uint32_t*)(0x424A118CUL))
#define bFM4_BT2_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424A118CUL))
#define bFM_BT2_PPG_TMCR_PMSK                     *((volatile uint32_t*)(0x424A11A8UL))
#define bFM4_BT2_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424A11A8UL))
#define bFM_BT2_PPG_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A11ACUL))
#define bFM4_BT2_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A11ACUL))

