neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_BT3_PPG_TMCR_STRG                     *((volatile uint32_t*)(0x424A1980UL))
#define bFM4_BT3_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424A1980UL))
#define bFM_BT3_PPG_TMCR_CTEN                     *((volatile uint32_t*)(0x424A1984UL))
#define bFM4_BT3_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424A1984UL))
#define bFM_BT3_PPG_TMCR_MDSE                     *((volatile uint32_t*)(0x424A1988UL))
#define bFM4_BT3_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424A1988UL))
#define bFM_BT3_PPG_TMCR_OSEL                     *((volatile uint32_t*)(0x424A198CUL))
#define bFM4_BT3_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424A198CUL))
#define bFM_BT3_PPG_TMCR_PMSK                     *((volatile uint32_t*)(0x424A19A8UL))
#define bFM4_BT3_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424A19A8UL))
#define bFM_BT3_PPG_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A19ACUL))
#define bFM4_BT3_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A19ACUL))

#define bFM_BT3_PPG_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A1A20UL))
#define bFM4_BT3_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A1A20UL))

#define bFM_BT3_PWC_STC_OVIR                      *((volatile uint32_t*)(0x424A1A00UL))
#define bFM4_BT3_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424A1A00UL))
#define bFM_BT3_PWC_STC_EDIR                      *((volatile uint32_t*)(0x424A1A08UL))
#define bFM4_BT3_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424A1A08UL))
#define bFM_BT3_PWC_STC_OVIE                      *((volatile uint32_t*)(0x424A1A10UL))
#define bFM4_BT3_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424A1A10UL))
#define bFM_BT3_PWC_STC_EDIE                      *((volatile uint32_t*)(0x424A1A18UL))
#define bFM4_BT3_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424A1A18UL))
#define bFM_BT3_PWC_STC_ERR                       *((volatile uint32_t*)(0x424A1A1CUL))
#define bFM4_BT3_PWC_STC_ERR                      *((volatile uint32_t*)(0x424A1A1CUL))

#define bFM_BT3_PWC_TMCR_CTEN                     *((volatile uint32_t*)(0x424A1984UL))
#define bFM4_BT3_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424A1984UL))
#define bFM_BT3_PWC_TMCR_MDSE                     *((volatile uint32_t*)(0x424A1988UL))
#define bFM4_BT3_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424A1988UL))
#define bFM_BT3_PWC_TMCR_T32                      *((volatile uint32_t*)(0x424A199CUL))
#define bFM4_BT3_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424A199CUL))

#define bFM_BT3_PWC_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A1A20UL))
#define bFM4_BT3_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A1A20UL))

#define bFM_BT3_PWM_STC_UDIR                      *((volatile uint32_t*)(0x424A1A00UL))
#define bFM4_BT3_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424A1A00UL))
#define bFM_BT3_PWM_STC_DTIR                      *((volatile uint32_t*)(0x424A1A04UL))
#define bFM4_BT3_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424A1A04UL))
#define bFM_BT3_PWM_STC_TGIR                      *((volatile uint32_t*)(0x424A1A08UL))
#define bFM4_BT3_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424A1A08UL))
#define bFM_BT3_PWM_STC_UDIE                      *((volatile uint32_t*)(0x424A1A10UL))
#define bFM4_BT3_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424A1A10UL))
#define bFM_BT3_PWM_STC_DTIE                      *((volatile uint32_t*)(0x424A1A14UL))
#define bFM4_BT3_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424A1A14UL))
#define bFM_BT3_PWM_STC_TGIE                      *((volatile uint32_t*)(0x424A1A18UL))
#define bFM4_BT3_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424A1A18UL))

#define bFM_BT3_PWM_TMCR_STRG                     *((volatile uint32_t*)(0x424A1980UL))
#define bFM4_BT3_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424A1980UL))
#define bFM_BT3_PWM_TMCR_CTEN                     *((volatile uint32_t*)(0x424A1984UL))
#define bFM4_BT3_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424A1984UL))
#define bFM_BT3_PWM_TMCR_MDSE                     *((volatile uint32_t*)(0x424A1988UL))
#define bFM4_BT3_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424A1988UL))
#define bFM_BT3_PWM_TMCR_OSEL                     *((volatile uint32_t*)(0x424A198CUL))
#define bFM4_BT3_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424A198CUL))
#define bFM_BT3_PWM_TMCR_PMSK                     *((volatile uint32_t*)(0x424A19A8UL))
#define bFM4_BT3_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424A19A8UL))
#define bFM_BT3_PWM_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A19ACUL))
#define bFM4_BT3_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A19ACUL))

#define bFM_BT3_PWM_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A1A20UL))
#define bFM4_BT3_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A1A20UL))

#define bFM_BT3_RT_STC_UDIR                       *((volatile uint32_t*)(0x424A1A00UL))
#define bFM4_BT3_RT_STC_UDIR                      *((volatile uint32_t*)(0x424A1A00UL))
#define bFM_BT3_RT_STC_TGIR                       *((volatile uint32_t*)(0x424A1A08UL))
#define bFM4_BT3_RT_STC_TGIR                      *((volatile uint32_t*)(0x424A1A08UL))
#define bFM_BT3_RT_STC_UDIE                       *((volatile uint32_t*)(0x424A1A10UL))
#define bFM4_BT3_RT_STC_UDIE                      *((volatile uint32_t*)(0x424A1A10UL))
#define bFM_BT3_RT_STC_TGIE                       *((volatile uint32_t*)(0x424A1A18UL))
#define bFM4_BT3_RT_STC_TGIE                      *((volatile uint32_t*)(0x424A1A18UL))

#define bFM_BT3_RT_TMCR_STRG                      *((volatile uint32_t*)(0x424A1980UL))
#define bFM4_BT3_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424A1980UL))
#define bFM_BT3_RT_TMCR_CTEN                      *((volatile uint32_t*)(0x424A1984UL))
#define bFM4_BT3_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424A1984UL))
#define bFM_BT3_RT_TMCR_MDSE                      *((volatile uint32_t*)(0x424A1988UL))
#define bFM4_BT3_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424A1988UL))
#define bFM_BT3_RT_TMCR_OSEL                      *((volatile uint32_t*)(0x424A198CUL))
#define bFM4_BT3_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424A198CUL))
#define bFM_BT3_RT_TMCR_T32                       *((volatile uint32_t*)(0x424A199CUL))
#define bFM4_BT3_RT_TMCR_T32                      *((volatile uint32_t*)(0x424A199CUL))

#define bFM_BT3_RT_TMCR2_CKS3                     *((volatile uint32_t*)(0x424A1A20UL))
#define bFM4_BT3_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A1A20UL))
#define bFM_BT3_RT_TMCR2_GATE                     *((volatile uint32_t*)(0x424A1A3CUL))
#define bFM4_BT3_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424A1A3CUL))


