neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** BT Registers BT4
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT4_PPG_STC_UDIR                      *((volatile uint32_t*)(0x424A4200UL))
#define bFM4_BT4_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424A4200UL))
#define bFM_BT4_PPG_STC_TGIR                      *((volatile uint32_t*)(0x424A4208UL))
#define bFM4_BT4_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424A4208UL))
#define bFM_BT4_PPG_STC_UDIE                      *((volatile uint32_t*)(0x424A4210UL))
#define bFM4_BT4_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424A4210UL))
#define bFM_BT4_PPG_STC_TGIE                      *((volatile uint32_t*)(0x424A4218UL))
#define bFM4_BT4_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424A4218UL))

#define bFM_BT4_PPG_TMCR_STRG                     *((volatile uint32_t*)(0x424A4180UL))
#define bFM4_BT4_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424A4180UL))
#define bFM_BT4_PPG_TMCR_CTEN                     *((volatile uint32_t*)(0x424A4184UL))
#define bFM4_BT4_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424A4184UL))
#define bFM_BT4_PPG_TMCR_MDSE                     *((volatile uint32_t*)(0x424A4188UL))
#define bFM4_BT4_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424A4188UL))
#define bFM_BT4_PPG_TMCR_OSEL                     *((volatile uint32_t*)(0x424A418CUL))
#define bFM4_BT4_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424A418CUL))
#define bFM_BT4_PPG_TMCR_PMSK                     *((volatile uint32_t*)(0x424A41A8UL))
#define bFM4_BT4_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424A41A8UL))
#define bFM_BT4_PPG_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A41ACUL))
#define bFM4_BT4_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A41ACUL))

#define bFM_BT4_PPG_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A4220UL))
#define bFM4_BT4_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A4220UL))

#define bFM_BT4_PWC_STC_OVIR                      *((volatile uint32_t*)(0x424A4200UL))
#define bFM4_BT4_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424A4200UL))
#define bFM_BT4_PWC_STC_EDIR                      *((volatile uint32_t*)(0x424A4208UL))
#define bFM4_BT4_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424A4208UL))
#define bFM_BT4_PWC_STC_OVIE                      *((volatile uint32_t*)(0x424A4210UL))
#define bFM4_BT4_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424A4210UL))
#define bFM_BT4_PWC_STC_EDIE                      *((volatile uint32_t*)(0x424A4218UL))
#define bFM4_BT4_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424A4218UL))
#define bFM_BT4_PWC_STC_ERR                       *((volatile uint32_t*)(0x424A421CUL))
#define bFM4_BT4_PWC_STC_ERR                      *((volatile uint32_t*)(0x424A421CUL))

#define bFM_BT4_PWC_TMCR_CTEN                     *((volatile uint32_t*)(0x424A4184UL))
#define bFM4_BT4_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424A4184UL))
#define bFM_BT4_PWC_TMCR_MDSE                     *((volatile uint32_t*)(0x424A4188UL))
#define bFM4_BT4_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424A4188UL))
#define bFM_BT4_PWC_TMCR_T32                      *((volatile uint32_t*)(0x424A419CUL))
#define bFM4_BT4_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424A419CUL))

#define bFM_BT4_PWC_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A4220UL))
#define bFM4_BT4_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A4220UL))

#define bFM_BT4_PWM_STC_UDIR                      *((volatile uint32_t*)(0x424A4200UL))
#define bFM4_BT4_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424A4200UL))
#define bFM_BT4_PWM_STC_DTIR                      *((volatile uint32_t*)(0x424A4204UL))
#define bFM4_BT4_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424A4204UL))
#define bFM_BT4_PWM_STC_TGIR                      *((volatile uint32_t*)(0x424A4208UL))
#define bFM4_BT4_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424A4208UL))
#define bFM_BT4_PWM_STC_UDIE                      *((volatile uint32_t*)(0x424A4210UL))
#define bFM4_BT4_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424A4210UL))
#define bFM_BT4_PWM_STC_DTIE                      *((volatile uint32_t*)(0x424A4214UL))
#define bFM4_BT4_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424A4214UL))
#define bFM_BT4_PWM_STC_TGIE                      *((volatile uint32_t*)(0x424A4218UL))
#define bFM4_BT4_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424A4218UL))

#define bFM_BT4_PWM_TMCR_STRG                     *((volatile uint32_t*)(0x424A4180UL))
#define bFM4_BT4_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424A4180UL))
#define bFM_BT4_PWM_TMCR_CTEN                     *((volatile uint32_t*)(0x424A4184UL))
#define bFM4_BT4_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424A4184UL))
#define bFM_BT4_PWM_TMCR_MDSE                     *((volatile uint32_t*)(0x424A4188UL))
#define bFM4_BT4_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424A4188UL))
#define bFM_BT4_PWM_TMCR_OSEL                     *((volatile uint32_t*)(0x424A418CUL))
#define bFM4_BT4_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424A418CUL))
#define bFM_BT4_PWM_TMCR_PMSK                     *((volatile uint32_t*)(0x424A41A8UL))
#define bFM4_BT4_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424A41A8UL))
#define bFM_BT4_PWM_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A41ACUL))
#define bFM4_BT4_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A41ACUL))

#define bFM_BT4_PWM_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A4220UL))
#define bFM4_BT4_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A4220UL))

#define bFM_BT4_RT_STC_UDIR                       *((volatile uint32_t*)(0x424A4200UL))
#define bFM4_BT4_RT_STC_UDIR                      *((volatile uint32_t*)(0x424A4200UL))
#define bFM_BT4_RT_STC_TGIR                       *((volatile uint32_t*)(0x424A4208UL))
#define bFM4_BT4_RT_STC_TGIR                      *((volatile uint32_t*)(0x424A4208UL))
#define bFM_BT4_RT_STC_UDIE                       *((volatile uint32_t*)(0x424A4210UL))
#define bFM4_BT4_RT_STC_UDIE                      *((volatile uint32_t*)(0x424A4210UL))
#define bFM_BT4_RT_STC_TGIE                       *((volatile uint32_t*)(0x424A4218UL))
#define bFM4_BT4_RT_STC_TGIE                      *((volatile uint32_t*)(0x424A4218UL))

