neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_BT4_RT_TMCR_STRG                      *((volatile uint32_t*)(0x424A4180UL))
#define bFM4_BT4_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424A4180UL))
#define bFM_BT4_RT_TMCR_CTEN                      *((volatile uint32_t*)(0x424A4184UL))
#define bFM4_BT4_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424A4184UL))
#define bFM_BT4_RT_TMCR_MDSE                      *((volatile uint32_t*)(0x424A4188UL))
#define bFM4_BT4_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424A4188UL))
#define bFM_BT4_RT_TMCR_OSEL                      *((volatile uint32_t*)(0x424A418CUL))
#define bFM4_BT4_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424A418CUL))
#define bFM_BT4_RT_TMCR_T32                       *((volatile uint32_t*)(0x424A419CUL))
#define bFM4_BT4_RT_TMCR_T32                      *((volatile uint32_t*)(0x424A419CUL))

#define bFM_BT4_RT_TMCR2_CKS3                     *((volatile uint32_t*)(0x424A4220UL))
#define bFM4_BT4_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A4220UL))
#define bFM_BT4_RT_TMCR2_GATE                     *((volatile uint32_t*)(0x424A423CUL))
#define bFM4_BT4_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424A423CUL))


/******************************************************************************
 ** BT Registers BT5
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT5_PPG_STC_UDIR                      *((volatile uint32_t*)(0x424A4A00UL))
#define bFM4_BT5_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424A4A00UL))
#define bFM_BT5_PPG_STC_TGIR                      *((volatile uint32_t*)(0x424A4A08UL))
#define bFM4_BT5_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424A4A08UL))
#define bFM_BT5_PPG_STC_UDIE                      *((volatile uint32_t*)(0x424A4A10UL))
#define bFM4_BT5_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424A4A10UL))
#define bFM_BT5_PPG_STC_TGIE                      *((volatile uint32_t*)(0x424A4A18UL))
#define bFM4_BT5_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424A4A18UL))

#define bFM_BT5_PPG_TMCR_STRG                     *((volatile uint32_t*)(0x424A4980UL))
#define bFM4_BT5_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424A4980UL))
#define bFM_BT5_PPG_TMCR_CTEN                     *((volatile uint32_t*)(0x424A4984UL))
#define bFM4_BT5_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424A4984UL))
#define bFM_BT5_PPG_TMCR_MDSE                     *((volatile uint32_t*)(0x424A4988UL))
#define bFM4_BT5_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424A4988UL))
#define bFM_BT5_PPG_TMCR_OSEL                     *((volatile uint32_t*)(0x424A498CUL))
#define bFM4_BT5_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424A498CUL))
#define bFM_BT5_PPG_TMCR_PMSK                     *((volatile uint32_t*)(0x424A49A8UL))
#define bFM4_BT5_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424A49A8UL))
#define bFM_BT5_PPG_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A49ACUL))
#define bFM4_BT5_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A49ACUL))

#define bFM_BT5_PPG_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A4A20UL))
#define bFM4_BT5_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A4A20UL))

#define bFM_BT5_PWC_STC_OVIR                      *((volatile uint32_t*)(0x424A4A00UL))
#define bFM4_BT5_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424A4A00UL))
#define bFM_BT5_PWC_STC_EDIR                      *((volatile uint32_t*)(0x424A4A08UL))
#define bFM4_BT5_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424A4A08UL))
#define bFM_BT5_PWC_STC_OVIE                      *((volatile uint32_t*)(0x424A4A10UL))
#define bFM4_BT5_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424A4A10UL))
#define bFM_BT5_PWC_STC_EDIE                      *((volatile uint32_t*)(0x424A4A18UL))
#define bFM4_BT5_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424A4A18UL))
#define bFM_BT5_PWC_STC_ERR                       *((volatile uint32_t*)(0x424A4A1CUL))
#define bFM4_BT5_PWC_STC_ERR                      *((volatile uint32_t*)(0x424A4A1CUL))

#define bFM_BT5_PWC_TMCR_CTEN                     *((volatile uint32_t*)(0x424A4984UL))
#define bFM4_BT5_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424A4984UL))
#define bFM_BT5_PWC_TMCR_MDSE                     *((volatile uint32_t*)(0x424A4988UL))
#define bFM4_BT5_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424A4988UL))
#define bFM_BT5_PWC_TMCR_T32                      *((volatile uint32_t*)(0x424A499CUL))
#define bFM4_BT5_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424A499CUL))

#define bFM_BT5_PWC_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A4A20UL))
#define bFM4_BT5_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A4A20UL))

#define bFM_BT5_PWM_STC_UDIR                      *((volatile uint32_t*)(0x424A4A00UL))
#define bFM4_BT5_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424A4A00UL))
#define bFM_BT5_PWM_STC_DTIR                      *((volatile uint32_t*)(0x424A4A04UL))
#define bFM4_BT5_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424A4A04UL))
#define bFM_BT5_PWM_STC_TGIR                      *((volatile uint32_t*)(0x424A4A08UL))
#define bFM4_BT5_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424A4A08UL))
#define bFM_BT5_PWM_STC_UDIE                      *((volatile uint32_t*)(0x424A4A10UL))
#define bFM4_BT5_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424A4A10UL))
#define bFM_BT5_PWM_STC_DTIE                      *((volatile uint32_t*)(0x424A4A14UL))
#define bFM4_BT5_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424A4A14UL))
#define bFM_BT5_PWM_STC_TGIE                      *((volatile uint32_t*)(0x424A4A18UL))
#define bFM4_BT5_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424A4A18UL))

#define bFM_BT5_PWM_TMCR_STRG                     *((volatile uint32_t*)(0x424A4980UL))
#define bFM4_BT5_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424A4980UL))
#define bFM_BT5_PWM_TMCR_CTEN                     *((volatile uint32_t*)(0x424A4984UL))
#define bFM4_BT5_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424A4984UL))
#define bFM_BT5_PWM_TMCR_MDSE                     *((volatile uint32_t*)(0x424A4988UL))
#define bFM4_BT5_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424A4988UL))
#define bFM_BT5_PWM_TMCR_OSEL                     *((volatile uint32_t*)(0x424A498CUL))
#define bFM4_BT5_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424A498CUL))
#define bFM_BT5_PWM_TMCR_PMSK                     *((volatile uint32_t*)(0x424A49A8UL))
#define bFM4_BT5_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424A49A8UL))
#define bFM_BT5_PWM_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A49ACUL))
#define bFM4_BT5_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A49ACUL))

#define bFM_BT5_PWM_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A4A20UL))
#define bFM4_BT5_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A4A20UL))

#define bFM_BT5_RT_STC_UDIR                       *((volatile uint32_t*)(0x424A4A00UL))
#define bFM4_BT5_RT_STC_UDIR                      *((volatile uint32_t*)(0x424A4A00UL))
#define bFM_BT5_RT_STC_TGIR                       *((volatile uint32_t*)(0x424A4A08UL))
#define bFM4_BT5_RT_STC_TGIR                      *((volatile uint32_t*)(0x424A4A08UL))
#define bFM_BT5_RT_STC_UDIE                       *((volatile uint32_t*)(0x424A4A10UL))
#define bFM4_BT5_RT_STC_UDIE                      *((volatile uint32_t*)(0x424A4A10UL))
#define bFM_BT5_RT_STC_TGIE                       *((volatile uint32_t*)(0x424A4A18UL))
#define bFM4_BT5_RT_STC_TGIE                      *((volatile uint32_t*)(0x424A4A18UL))

#define bFM_BT5_RT_TMCR_STRG                      *((volatile uint32_t*)(0x424A4980UL))
#define bFM4_BT5_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424A4980UL))
#define bFM_BT5_RT_TMCR_CTEN                      *((volatile uint32_t*)(0x424A4984UL))
#define bFM4_BT5_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424A4984UL))
#define bFM_BT5_RT_TMCR_MDSE                      *((volatile uint32_t*)(0x424A4988UL))
#define bFM4_BT5_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424A4988UL))
#define bFM_BT5_RT_TMCR_OSEL                      *((volatile uint32_t*)(0x424A498CUL))
#define bFM4_BT5_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424A498CUL))
#define bFM_BT5_RT_TMCR_T32                       *((volatile uint32_t*)(0x424A499CUL))
#define bFM4_BT5_RT_TMCR_T32                      *((volatile uint32_t*)(0x424A499CUL))

#define bFM_BT5_RT_TMCR2_CKS3                     *((volatile uint32_t*)(0x424A4A20UL))
#define bFM4_BT5_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A4A20UL))
#define bFM_BT5_RT_TMCR2_GATE                     *((volatile uint32_t*)(0x424A4A3CUL))
#define bFM4_BT5_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424A4A3CUL))


