neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** BT Registers BT6
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT6_PPG_STC_UDIR                      *((volatile uint32_t*)(0x424A5200UL))
#define bFM4_BT6_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424A5200UL))
#define bFM_BT6_PPG_STC_TGIR                      *((volatile uint32_t*)(0x424A5208UL))
#define bFM4_BT6_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424A5208UL))
#define bFM_BT6_PPG_STC_UDIE                      *((volatile uint32_t*)(0x424A5210UL))
#define bFM4_BT6_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424A5210UL))
#define bFM_BT6_PPG_STC_TGIE                      *((volatile uint32_t*)(0x424A5218UL))
#define bFM4_BT6_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424A5218UL))

#define bFM_BT6_PPG_TMCR_STRG                     *((volatile uint32_t*)(0x424A5180UL))
#define bFM4_BT6_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424A5180UL))
#define bFM_BT6_PPG_TMCR_CTEN                     *((volatile uint32_t*)(0x424A5184UL))
#define bFM4_BT6_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424A5184UL))
#define bFM_BT6_PPG_TMCR_MDSE                     *((volatile uint32_t*)(0x424A5188UL))
#define bFM4_BT6_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424A5188UL))
#define bFM_BT6_PPG_TMCR_OSEL                     *((volatile uint32_t*)(0x424A518CUL))
#define bFM4_BT6_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424A518CUL))
#define bFM_BT6_PPG_TMCR_PMSK                     *((volatile uint32_t*)(0x424A51A8UL))
#define bFM4_BT6_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424A51A8UL))
#define bFM_BT6_PPG_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A51ACUL))
#define bFM4_BT6_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A51ACUL))

#define bFM_BT6_PPG_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A5220UL))
#define bFM4_BT6_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A5220UL))

#define bFM_BT6_PWC_STC_OVIR                      *((volatile uint32_t*)(0x424A5200UL))
#define bFM4_BT6_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424A5200UL))
#define bFM_BT6_PWC_STC_EDIR                      *((volatile uint32_t*)(0x424A5208UL))
#define bFM4_BT6_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424A5208UL))
#define bFM_BT6_PWC_STC_OVIE                      *((volatile uint32_t*)(0x424A5210UL))
#define bFM4_BT6_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424A5210UL))
#define bFM_BT6_PWC_STC_EDIE                      *((volatile uint32_t*)(0x424A5218UL))
#define bFM4_BT6_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424A5218UL))
#define bFM_BT6_PWC_STC_ERR                       *((volatile uint32_t*)(0x424A521CUL))
#define bFM4_BT6_PWC_STC_ERR                      *((volatile uint32_t*)(0x424A521CUL))

#define bFM_BT6_PWC_TMCR_CTEN                     *((volatile uint32_t*)(0x424A5184UL))
#define bFM4_BT6_PWC_TMCR_CTEN                    *((volatile uint32_t*)(0x424A5184UL))
#define bFM_BT6_PWC_TMCR_MDSE                     *((volatile uint32_t*)(0x424A5188UL))
#define bFM4_BT6_PWC_TMCR_MDSE                    *((volatile uint32_t*)(0x424A5188UL))
#define bFM_BT6_PWC_TMCR_T32                      *((volatile uint32_t*)(0x424A519CUL))
#define bFM4_BT6_PWC_TMCR_T32                     *((volatile uint32_t*)(0x424A519CUL))

#define bFM_BT6_PWC_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A5220UL))
#define bFM4_BT6_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A5220UL))

#define bFM_BT6_PWM_STC_UDIR                      *((volatile uint32_t*)(0x424A5200UL))
#define bFM4_BT6_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424A5200UL))
#define bFM_BT6_PWM_STC_DTIR                      *((volatile uint32_t*)(0x424A5204UL))
#define bFM4_BT6_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424A5204UL))
#define bFM_BT6_PWM_STC_TGIR                      *((volatile uint32_t*)(0x424A5208UL))
#define bFM4_BT6_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424A5208UL))
#define bFM_BT6_PWM_STC_UDIE                      *((volatile uint32_t*)(0x424A5210UL))
#define bFM4_BT6_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424A5210UL))
#define bFM_BT6_PWM_STC_DTIE                      *((volatile uint32_t*)(0x424A5214UL))
#define bFM4_BT6_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424A5214UL))
#define bFM_BT6_PWM_STC_TGIE                      *((volatile uint32_t*)(0x424A5218UL))
#define bFM4_BT6_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424A5218UL))

#define bFM_BT6_PWM_TMCR_STRG                     *((volatile uint32_t*)(0x424A5180UL))
#define bFM4_BT6_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424A5180UL))
#define bFM_BT6_PWM_TMCR_CTEN                     *((volatile uint32_t*)(0x424A5184UL))
#define bFM4_BT6_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424A5184UL))
#define bFM_BT6_PWM_TMCR_MDSE                     *((volatile uint32_t*)(0x424A5188UL))
#define bFM4_BT6_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424A5188UL))
#define bFM_BT6_PWM_TMCR_OSEL                     *((volatile uint32_t*)(0x424A518CUL))
#define bFM4_BT6_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424A518CUL))
#define bFM_BT6_PWM_TMCR_PMSK                     *((volatile uint32_t*)(0x424A51A8UL))
#define bFM4_BT6_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424A51A8UL))
#define bFM_BT6_PWM_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A51ACUL))
#define bFM4_BT6_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A51ACUL))

#define bFM_BT6_PWM_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A5220UL))
#define bFM4_BT6_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A5220UL))

