neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_BT7_PWM_TMCR_STRG                     *((volatile uint32_t*)(0x424A5980UL))
#define bFM4_BT7_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424A5980UL))
#define bFM_BT7_PWM_TMCR_CTEN                     *((volatile uint32_t*)(0x424A5984UL))
#define bFM4_BT7_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424A5984UL))
#define bFM_BT7_PWM_TMCR_MDSE                     *((volatile uint32_t*)(0x424A5988UL))
#define bFM4_BT7_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424A5988UL))
#define bFM_BT7_PWM_TMCR_OSEL                     *((volatile uint32_t*)(0x424A598CUL))
#define bFM4_BT7_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424A598CUL))
#define bFM_BT7_PWM_TMCR_PMSK                     *((volatile uint32_t*)(0x424A59A8UL))
#define bFM4_BT7_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424A59A8UL))
#define bFM_BT7_PWM_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A59ACUL))
#define bFM4_BT7_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A59ACUL))

#define bFM_BT7_PWM_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A5A20UL))
#define bFM4_BT7_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A5A20UL))

#define bFM_BT7_RT_STC_UDIR                       *((volatile uint32_t*)(0x424A5A00UL))
#define bFM4_BT7_RT_STC_UDIR                      *((volatile uint32_t*)(0x424A5A00UL))
#define bFM_BT7_RT_STC_TGIR                       *((volatile uint32_t*)(0x424A5A08UL))
#define bFM4_BT7_RT_STC_TGIR                      *((volatile uint32_t*)(0x424A5A08UL))
#define bFM_BT7_RT_STC_UDIE                       *((volatile uint32_t*)(0x424A5A10UL))
#define bFM4_BT7_RT_STC_UDIE                      *((volatile uint32_t*)(0x424A5A10UL))
#define bFM_BT7_RT_STC_TGIE                       *((volatile uint32_t*)(0x424A5A18UL))
#define bFM4_BT7_RT_STC_TGIE                      *((volatile uint32_t*)(0x424A5A18UL))

#define bFM_BT7_RT_TMCR_STRG                      *((volatile uint32_t*)(0x424A5980UL))
#define bFM4_BT7_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424A5980UL))
#define bFM_BT7_RT_TMCR_CTEN                      *((volatile uint32_t*)(0x424A5984UL))
#define bFM4_BT7_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424A5984UL))
#define bFM_BT7_RT_TMCR_MDSE                      *((volatile uint32_t*)(0x424A5988UL))
#define bFM4_BT7_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424A5988UL))
#define bFM_BT7_RT_TMCR_OSEL                      *((volatile uint32_t*)(0x424A598CUL))
#define bFM4_BT7_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424A598CUL))
#define bFM_BT7_RT_TMCR_T32                       *((volatile uint32_t*)(0x424A599CUL))
#define bFM4_BT7_RT_TMCR_T32                      *((volatile uint32_t*)(0x424A599CUL))

#define bFM_BT7_RT_TMCR2_CKS3                     *((volatile uint32_t*)(0x424A5A20UL))
#define bFM4_BT7_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A5A20UL))
#define bFM_BT7_RT_TMCR2_GATE                     *((volatile uint32_t*)(0x424A5A3CUL))
#define bFM4_BT7_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424A5A3CUL))


/******************************************************************************
 ** BT Registers BT8
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT8_PPG_STC_UDIR                      *((volatile uint32_t*)(0x424A8200UL))
#define bFM4_BT8_PPG_STC_UDIR                     *((volatile uint32_t*)(0x424A8200UL))
#define bFM_BT8_PPG_STC_TGIR                      *((volatile uint32_t*)(0x424A8208UL))
#define bFM4_BT8_PPG_STC_TGIR                     *((volatile uint32_t*)(0x424A8208UL))
#define bFM_BT8_PPG_STC_UDIE                      *((volatile uint32_t*)(0x424A8210UL))
#define bFM4_BT8_PPG_STC_UDIE                     *((volatile uint32_t*)(0x424A8210UL))
#define bFM_BT8_PPG_STC_TGIE                      *((volatile uint32_t*)(0x424A8218UL))
#define bFM4_BT8_PPG_STC_TGIE                     *((volatile uint32_t*)(0x424A8218UL))

#define bFM_BT8_PPG_TMCR_STRG                     *((volatile uint32_t*)(0x424A8180UL))
#define bFM4_BT8_PPG_TMCR_STRG                    *((volatile uint32_t*)(0x424A8180UL))
#define bFM_BT8_PPG_TMCR_CTEN                     *((volatile uint32_t*)(0x424A8184UL))
#define bFM4_BT8_PPG_TMCR_CTEN                    *((volatile uint32_t*)(0x424A8184UL))
#define bFM_BT8_PPG_TMCR_MDSE                     *((volatile uint32_t*)(0x424A8188UL))
#define bFM4_BT8_PPG_TMCR_MDSE                    *((volatile uint32_t*)(0x424A8188UL))
#define bFM_BT8_PPG_TMCR_OSEL                     *((volatile uint32_t*)(0x424A818CUL))
#define bFM4_BT8_PPG_TMCR_OSEL                    *((volatile uint32_t*)(0x424A818CUL))
#define bFM_BT8_PPG_TMCR_PMSK                     *((volatile uint32_t*)(0x424A81A8UL))
#define bFM4_BT8_PPG_TMCR_PMSK                    *((volatile uint32_t*)(0x424A81A8UL))
#define bFM_BT8_PPG_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A81ACUL))
#define bFM4_BT8_PPG_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A81ACUL))

#define bFM_BT8_PPG_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A8220UL))
#define bFM4_BT8_PPG_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A8220UL))

#define bFM_BT8_PWC_STC_OVIR                      *((volatile uint32_t*)(0x424A8200UL))
#define bFM4_BT8_PWC_STC_OVIR                     *((volatile uint32_t*)(0x424A8200UL))
#define bFM_BT8_PWC_STC_EDIR                      *((volatile uint32_t*)(0x424A8208UL))
#define bFM4_BT8_PWC_STC_EDIR                     *((volatile uint32_t*)(0x424A8208UL))
#define bFM_BT8_PWC_STC_OVIE                      *((volatile uint32_t*)(0x424A8210UL))
#define bFM4_BT8_PWC_STC_OVIE                     *((volatile uint32_t*)(0x424A8210UL))
#define bFM_BT8_PWC_STC_EDIE                      *((volatile uint32_t*)(0x424A8218UL))
#define bFM4_BT8_PWC_STC_EDIE                     *((volatile uint32_t*)(0x424A8218UL))
#define bFM_BT8_PWC_STC_ERR                       *((volatile uint32_t*)(0x424A821CUL))
#define bFM4_BT8_PWC_STC_ERR                      *((volatile uint32_t*)(0x424A821CUL))

