neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_BT9_PWC_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A8A20UL))
#define bFM4_BT9_PWC_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A8A20UL))

#define bFM_BT9_PWM_STC_UDIR                      *((volatile uint32_t*)(0x424A8A00UL))
#define bFM4_BT9_PWM_STC_UDIR                     *((volatile uint32_t*)(0x424A8A00UL))
#define bFM_BT9_PWM_STC_DTIR                      *((volatile uint32_t*)(0x424A8A04UL))
#define bFM4_BT9_PWM_STC_DTIR                     *((volatile uint32_t*)(0x424A8A04UL))
#define bFM_BT9_PWM_STC_TGIR                      *((volatile uint32_t*)(0x424A8A08UL))
#define bFM4_BT9_PWM_STC_TGIR                     *((volatile uint32_t*)(0x424A8A08UL))
#define bFM_BT9_PWM_STC_UDIE                      *((volatile uint32_t*)(0x424A8A10UL))
#define bFM4_BT9_PWM_STC_UDIE                     *((volatile uint32_t*)(0x424A8A10UL))
#define bFM_BT9_PWM_STC_DTIE                      *((volatile uint32_t*)(0x424A8A14UL))
#define bFM4_BT9_PWM_STC_DTIE                     *((volatile uint32_t*)(0x424A8A14UL))
#define bFM_BT9_PWM_STC_TGIE                      *((volatile uint32_t*)(0x424A8A18UL))
#define bFM4_BT9_PWM_STC_TGIE                     *((volatile uint32_t*)(0x424A8A18UL))

#define bFM_BT9_PWM_TMCR_STRG                     *((volatile uint32_t*)(0x424A8980UL))
#define bFM4_BT9_PWM_TMCR_STRG                    *((volatile uint32_t*)(0x424A8980UL))
#define bFM_BT9_PWM_TMCR_CTEN                     *((volatile uint32_t*)(0x424A8984UL))
#define bFM4_BT9_PWM_TMCR_CTEN                    *((volatile uint32_t*)(0x424A8984UL))
#define bFM_BT9_PWM_TMCR_MDSE                     *((volatile uint32_t*)(0x424A8988UL))
#define bFM4_BT9_PWM_TMCR_MDSE                    *((volatile uint32_t*)(0x424A8988UL))
#define bFM_BT9_PWM_TMCR_OSEL                     *((volatile uint32_t*)(0x424A898CUL))
#define bFM4_BT9_PWM_TMCR_OSEL                    *((volatile uint32_t*)(0x424A898CUL))
#define bFM_BT9_PWM_TMCR_PMSK                     *((volatile uint32_t*)(0x424A89A8UL))
#define bFM4_BT9_PWM_TMCR_PMSK                    *((volatile uint32_t*)(0x424A89A8UL))
#define bFM_BT9_PWM_TMCR_RTGEN                    *((volatile uint32_t*)(0x424A89ACUL))
#define bFM4_BT9_PWM_TMCR_RTGEN                   *((volatile uint32_t*)(0x424A89ACUL))

#define bFM_BT9_PWM_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A8A20UL))
#define bFM4_BT9_PWM_TMCR2_CKS3                   *((volatile uint32_t*)(0x424A8A20UL))

#define bFM_BT9_RT_STC_UDIR                       *((volatile uint32_t*)(0x424A8A00UL))
#define bFM4_BT9_RT_STC_UDIR                      *((volatile uint32_t*)(0x424A8A00UL))
#define bFM_BT9_RT_STC_TGIR                       *((volatile uint32_t*)(0x424A8A08UL))
#define bFM4_BT9_RT_STC_TGIR                      *((volatile uint32_t*)(0x424A8A08UL))
#define bFM_BT9_RT_STC_UDIE                       *((volatile uint32_t*)(0x424A8A10UL))
#define bFM4_BT9_RT_STC_UDIE                      *((volatile uint32_t*)(0x424A8A10UL))
#define bFM_BT9_RT_STC_TGIE                       *((volatile uint32_t*)(0x424A8A18UL))
#define bFM4_BT9_RT_STC_TGIE                      *((volatile uint32_t*)(0x424A8A18UL))

#define bFM_BT9_RT_TMCR_STRG                      *((volatile uint32_t*)(0x424A8980UL))
#define bFM4_BT9_RT_TMCR_STRG                     *((volatile uint32_t*)(0x424A8980UL))
#define bFM_BT9_RT_TMCR_CTEN                      *((volatile uint32_t*)(0x424A8984UL))
#define bFM4_BT9_RT_TMCR_CTEN                     *((volatile uint32_t*)(0x424A8984UL))
#define bFM_BT9_RT_TMCR_MDSE                      *((volatile uint32_t*)(0x424A8988UL))
#define bFM4_BT9_RT_TMCR_MDSE                     *((volatile uint32_t*)(0x424A8988UL))
#define bFM_BT9_RT_TMCR_OSEL                      *((volatile uint32_t*)(0x424A898CUL))
#define bFM4_BT9_RT_TMCR_OSEL                     *((volatile uint32_t*)(0x424A898CUL))
#define bFM_BT9_RT_TMCR_T32                       *((volatile uint32_t*)(0x424A899CUL))
#define bFM4_BT9_RT_TMCR_T32                      *((volatile uint32_t*)(0x424A899CUL))

#define bFM_BT9_RT_TMCR2_CKS3                     *((volatile uint32_t*)(0x424A8A20UL))
#define bFM4_BT9_RT_TMCR2_CKS3                    *((volatile uint32_t*)(0x424A8A20UL))
#define bFM_BT9_RT_TMCR2_GATE                     *((volatile uint32_t*)(0x424A8A3CUL))
#define bFM4_BT9_RT_TMCR2_GATE                    *((volatile uint32_t*)(0x424A8A3CUL))


/******************************************************************************
 ** BTIOSEL03 Registers BTIOSEL03
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** BTIOSEL47 Registers BTIOSEL47
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** BTIOSEL8B Registers BTIOSEL8B
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** BTIOSELCF Registers BTIOSELCF
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** CAN Registers CAN0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_CAN0_CTRLR_INIT                       *((volatile uint32_t*)(0x42C40000UL))
#define bFM4_CAN0_CTRLR_INIT                      *((volatile uint32_t*)(0x42C40000UL))
#define bFM_CAN0_CTRLR_IE                         *((volatile uint32_t*)(0x42C40004UL))
#define bFM4_CAN0_CTRLR_IE                        *((volatile uint32_t*)(0x42C40004UL))
#define bFM_CAN0_CTRLR_SIE                        *((volatile uint32_t*)(0x42C40008UL))
#define bFM4_CAN0_CTRLR_SIE                       *((volatile uint32_t*)(0x42C40008UL))
#define bFM_CAN0_CTRLR_EIE                        *((volatile uint32_t*)(0x42C4000CUL))
#define bFM4_CAN0_CTRLR_EIE                       *((volatile uint32_t*)(0x42C4000CUL))
#define bFM_CAN0_CTRLR_DAR                        *((volatile uint32_t*)(0x42C40014UL))
#define bFM4_CAN0_CTRLR_DAR                       *((volatile uint32_t*)(0x42C40014UL))
#define bFM_CAN0_CTRLR_CCE                        *((volatile uint32_t*)(0x42C40018UL))
#define bFM4_CAN0_CTRLR_CCE                       *((volatile uint32_t*)(0x42C40018UL))
#define bFM_CAN0_CTRLR_TEST                       *((volatile uint32_t*)(0x42C4001CUL))
#define bFM4_CAN0_CTRLR_TEST                      *((volatile uint32_t*)(0x42C4001CUL))

#define bFM_CAN0_ERRCNT_RP                        *((volatile uint32_t*)(0x42C400BCUL))
#define bFM4_CAN0_ERRCNT_RP                       *((volatile uint32_t*)(0x42C400BCUL))

