neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** CAN Registers CAN1
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_CAN1_CTRLR_INIT                       *((volatile uint32_t*)(0x42C60000UL))
#define bFM4_CAN1_CTRLR_INIT                      *((volatile uint32_t*)(0x42C60000UL))
#define bFM_CAN1_CTRLR_IE                         *((volatile uint32_t*)(0x42C60004UL))
#define bFM4_CAN1_CTRLR_IE                        *((volatile uint32_t*)(0x42C60004UL))
#define bFM_CAN1_CTRLR_SIE                        *((volatile uint32_t*)(0x42C60008UL))
#define bFM4_CAN1_CTRLR_SIE                       *((volatile uint32_t*)(0x42C60008UL))
#define bFM_CAN1_CTRLR_EIE                        *((volatile uint32_t*)(0x42C6000CUL))
#define bFM4_CAN1_CTRLR_EIE                       *((volatile uint32_t*)(0x42C6000CUL))
#define bFM_CAN1_CTRLR_DAR                        *((volatile uint32_t*)(0x42C60014UL))
#define bFM4_CAN1_CTRLR_DAR                       *((volatile uint32_t*)(0x42C60014UL))
#define bFM_CAN1_CTRLR_CCE                        *((volatile uint32_t*)(0x42C60018UL))
#define bFM4_CAN1_CTRLR_CCE                       *((volatile uint32_t*)(0x42C60018UL))
#define bFM_CAN1_CTRLR_TEST                       *((volatile uint32_t*)(0x42C6001CUL))
#define bFM4_CAN1_CTRLR_TEST                      *((volatile uint32_t*)(0x42C6001CUL))

#define bFM_CAN1_ERRCNT_RP                        *((volatile uint32_t*)(0x42C600BCUL))
#define bFM4_CAN1_ERRCNT_RP                       *((volatile uint32_t*)(0x42C600BCUL))

#define bFM_CAN1_IF1ARB_DIR                       *((volatile uint32_t*)(0x42C60374UL))
#define bFM4_CAN1_IF1ARB_DIR                      *((volatile uint32_t*)(0x42C60374UL))
#define bFM_CAN1_IF1ARB_XTD                       *((volatile uint32_t*)(0x42C60378UL))
#define bFM4_CAN1_IF1ARB_XTD                      *((volatile uint32_t*)(0x42C60378UL))
#define bFM_CAN1_IF1ARB_MSGVAL                    *((volatile uint32_t*)(0x42C6037CUL))
#define bFM4_CAN1_IF1ARB_MSGVAL                   *((volatile uint32_t*)(0x42C6037CUL))

#define bFM_CAN1_IF1CMSK_DATAB                    *((volatile uint32_t*)(0x42C60240UL))
#define bFM4_CAN1_IF1CMSK_DATAB                   *((volatile uint32_t*)(0x42C60240UL))
#define bFM_CAN1_IF1CMSK_DATAA                    *((volatile uint32_t*)(0x42C60244UL))
#define bFM4_CAN1_IF1CMSK_DATAA                   *((volatile uint32_t*)(0x42C60244UL))
#define bFM_CAN1_IF1CMSK_NEWDAT                   *((volatile uint32_t*)(0x42C60248UL))
#define bFM4_CAN1_IF1CMSK_NEWDAT                  *((volatile uint32_t*)(0x42C60248UL))
#define bFM_CAN1_IF1CMSK_CIP                      *((volatile uint32_t*)(0x42C6024CUL))
#define bFM4_CAN1_IF1CMSK_CIP                     *((volatile uint32_t*)(0x42C6024CUL))
#define bFM_CAN1_IF1CMSK_CONTROL                  *((volatile uint32_t*)(0x42C60250UL))
#define bFM4_CAN1_IF1CMSK_CONTROL                 *((volatile uint32_t*)(0x42C60250UL))
#define bFM_CAN1_IF1CMSK_ARB                      *((volatile uint32_t*)(0x42C60254UL))
#define bFM4_CAN1_IF1CMSK_ARB                     *((volatile uint32_t*)(0x42C60254UL))
#define bFM_CAN1_IF1CMSK_MASK                     *((volatile uint32_t*)(0x42C60258UL))
#define bFM4_CAN1_IF1CMSK_MASK                    *((volatile uint32_t*)(0x42C60258UL))
#define bFM_CAN1_IF1CMSK_WR_RD                    *((volatile uint32_t*)(0x42C6025CUL))
#define bFM4_CAN1_IF1CMSK_WR_RD                   *((volatile uint32_t*)(0x42C6025CUL))

#define bFM_CAN1_IF1CREQ_BUSY                     *((volatile uint32_t*)(0x42C6023CUL))
#define bFM4_CAN1_IF1CREQ_BUSY                    *((volatile uint32_t*)(0x42C6023CUL))

#define bFM_CAN1_IF1MCTR_EOB                      *((volatile uint32_t*)(0x42C6039CUL))
#define bFM4_CAN1_IF1MCTR_EOB                     *((volatile uint32_t*)(0x42C6039CUL))
#define bFM_CAN1_IF1MCTR_TXRQST                   *((volatile uint32_t*)(0x42C603A0UL))
#define bFM4_CAN1_IF1MCTR_TXRQST                  *((volatile uint32_t*)(0x42C603A0UL))
#define bFM_CAN1_IF1MCTR_RMTEN                    *((volatile uint32_t*)(0x42C603A4UL))
#define bFM4_CAN1_IF1MCTR_RMTEN                   *((volatile uint32_t*)(0x42C603A4UL))
#define bFM_CAN1_IF1MCTR_RXIE                     *((volatile uint32_t*)(0x42C603A8UL))
#define bFM4_CAN1_IF1MCTR_RXIE                    *((volatile uint32_t*)(0x42C603A8UL))
#define bFM_CAN1_IF1MCTR_TXIE                     *((volatile uint32_t*)(0x42C603ACUL))
#define bFM4_CAN1_IF1MCTR_TXIE                    *((volatile uint32_t*)(0x42C603ACUL))
#define bFM_CAN1_IF1MCTR_UMASK                    *((volatile uint32_t*)(0x42C603B0UL))
#define bFM4_CAN1_IF1MCTR_UMASK                   *((volatile uint32_t*)(0x42C603B0UL))
#define bFM_CAN1_IF1MCTR_INTPND                   *((volatile uint32_t*)(0x42C603B4UL))
#define bFM4_CAN1_IF1MCTR_INTPND                  *((volatile uint32_t*)(0x42C603B4UL))
#define bFM_CAN1_IF1MCTR_MSGLST                   *((volatile uint32_t*)(0x42C603B8UL))
#define bFM4_CAN1_IF1MCTR_MSGLST                  *((volatile uint32_t*)(0x42C603B8UL))
#define bFM_CAN1_IF1MCTR_NEWDAT                   *((volatile uint32_t*)(0x42C603BCUL))
#define bFM4_CAN1_IF1MCTR_NEWDAT                  *((volatile uint32_t*)(0x42C603BCUL))

#define bFM_CAN1_IF1MSK_MDIR                      *((volatile uint32_t*)(0x42C602F8UL))
#define bFM4_CAN1_IF1MSK_MDIR                     *((volatile uint32_t*)(0x42C602F8UL))
#define bFM_CAN1_IF1MSK_MXTD                      *((volatile uint32_t*)(0x42C602FCUL))
#define bFM4_CAN1_IF1MSK_MXTD                     *((volatile uint32_t*)(0x42C602FCUL))

#define bFM_CAN1_IF2ARB_DIR                       *((volatile uint32_t*)(0x42C60974UL))
#define bFM4_CAN1_IF2ARB_DIR                      *((volatile uint32_t*)(0x42C60974UL))
#define bFM_CAN1_IF2ARB_XTD                       *((volatile uint32_t*)(0x42C60978UL))
#define bFM4_CAN1_IF2ARB_XTD                      *((volatile uint32_t*)(0x42C60978UL))
#define bFM_CAN1_IF2ARB_MSGVAL                    *((volatile uint32_t*)(0x42C6097CUL))
#define bFM4_CAN1_IF2ARB_MSGVAL                   *((volatile uint32_t*)(0x42C6097CUL))

#define bFM_CAN1_IF2CMSK_DATAB                    *((volatile uint32_t*)(0x42C60840UL))
#define bFM4_CAN1_IF2CMSK_DATAB                   *((volatile uint32_t*)(0x42C60840UL))
#define bFM_CAN1_IF2CMSK_DATAA                    *((volatile uint32_t*)(0x42C60844UL))
#define bFM4_CAN1_IF2CMSK_DATAA                   *((volatile uint32_t*)(0x42C60844UL))
#define bFM_CAN1_IF2CMSK_NEWDAT                   *((volatile uint32_t*)(0x42C60848UL))
#define bFM4_CAN1_IF2CMSK_NEWDAT                  *((volatile uint32_t*)(0x42C60848UL))
#define bFM_CAN1_IF2CMSK_CIP                      *((volatile uint32_t*)(0x42C6084CUL))
#define bFM4_CAN1_IF2CMSK_CIP                     *((volatile uint32_t*)(0x42C6084CUL))
#define bFM_CAN1_IF2CMSK_CONTROL                  *((volatile uint32_t*)(0x42C60850UL))
#define bFM4_CAN1_IF2CMSK_CONTROL                 *((volatile uint32_t*)(0x42C60850UL))
#define bFM_CAN1_IF2CMSK_ARB                      *((volatile uint32_t*)(0x42C60854UL))
#define bFM4_CAN1_IF2CMSK_ARB                     *((volatile uint32_t*)(0x42C60854UL))
#define bFM_CAN1_IF2CMSK_MASK                     *((volatile uint32_t*)(0x42C60858UL))
#define bFM4_CAN1_IF2CMSK_MASK                    *((volatile uint32_t*)(0x42C60858UL))
#define bFM_CAN1_IF2CMSK_WR_RD                    *((volatile uint32_t*)(0x42C6085CUL))
#define bFM4_CAN1_IF2CMSK_WR_RD                   *((volatile uint32_t*)(0x42C6085CUL))

#define bFM_CAN1_IF2CREQ_BUSY                     *((volatile uint32_t*)(0x42C6083CUL))
#define bFM4_CAN1_IF2CREQ_BUSY                    *((volatile uint32_t*)(0x42C6083CUL))

#define bFM_CAN1_IF2MCTR_EOB                      *((volatile uint32_t*)(0x42C6099CUL))
#define bFM4_CAN1_IF2MCTR_EOB                     *((volatile uint32_t*)(0x42C6099CUL))
#define bFM_CAN1_IF2MCTR_TXRQST                   *((volatile uint32_t*)(0x42C609A0UL))
#define bFM4_CAN1_IF2MCTR_TXRQST                  *((volatile uint32_t*)(0x42C609A0UL))
#define bFM_CAN1_IF2MCTR_RMTEN                    *((volatile uint32_t*)(0x42C609A4UL))
#define bFM4_CAN1_IF2MCTR_RMTEN                   *((volatile uint32_t*)(0x42C609A4UL))
#define bFM_CAN1_IF2MCTR_RXIE                     *((volatile uint32_t*)(0x42C609A8UL))
#define bFM4_CAN1_IF2MCTR_RXIE                    *((volatile uint32_t*)(0x42C609A8UL))
#define bFM_CAN1_IF2MCTR_TXIE                     *((volatile uint32_t*)(0x42C609ACUL))
#define bFM4_CAN1_IF2MCTR_TXIE                    *((volatile uint32_t*)(0x42C609ACUL))
#define bFM_CAN1_IF2MCTR_UMASK                    *((volatile uint32_t*)(0x42C609B0UL))
#define bFM4_CAN1_IF2MCTR_UMASK                   *((volatile uint32_t*)(0x42C609B0UL))
#define bFM_CAN1_IF2MCTR_INTPND                   *((volatile uint32_t*)(0x42C609B4UL))
#define bFM4_CAN1_IF2MCTR_INTPND                  *((volatile uint32_t*)(0x42C609B4UL))
#define bFM_CAN1_IF2MCTR_MSGLST                   *((volatile uint32_t*)(0x42C609B8UL))
#define bFM4_CAN1_IF2MCTR_MSGLST                  *((volatile uint32_t*)(0x42C609B8UL))
#define bFM_CAN1_IF2MCTR_NEWDAT                   *((volatile uint32_t*)(0x42C609BCUL))
#define bFM4_CAN1_IF2MCTR_NEWDAT                  *((volatile uint32_t*)(0x42C609BCUL))

#define bFM_CAN1_IF2MSK_MDIR                      *((volatile uint32_t*)(0x42C608F8UL))
#define bFM4_CAN1_IF2MSK_MDIR                     *((volatile uint32_t*)(0x42C608F8UL))
#define bFM_CAN1_IF2MSK_MXTD                      *((volatile uint32_t*)(0x42C608FCUL))
#define bFM4_CAN1_IF2MSK_MXTD                     *((volatile uint32_t*)(0x42C608FCUL))

#define bFM_CAN1_INTPND_INTPND1                   *((volatile uint32_t*)(0x42C61400UL))
#define bFM4_CAN1_INTPND_INTPND1                  *((volatile uint32_t*)(0x42C61400UL))
#define bFM_CAN1_INTPND_INTPND2                   *((volatile uint32_t*)(0x42C61404UL))
#define bFM4_CAN1_INTPND_INTPND2                  *((volatile uint32_t*)(0x42C61404UL))
#define bFM_CAN1_INTPND_INTPND3                   *((volatile uint32_t*)(0x42C61408UL))
#define bFM4_CAN1_INTPND_INTPND3                  *((volatile uint32_t*)(0x42C61408UL))
#define bFM_CAN1_INTPND_INTPND4                   *((volatile uint32_t*)(0x42C6140CUL))
#define bFM4_CAN1_INTPND_INTPND4                  *((volatile uint32_t*)(0x42C6140CUL))
#define bFM_CAN1_INTPND_INTPND5                   *((volatile uint32_t*)(0x42C61410UL))
#define bFM4_CAN1_INTPND_INTPND5                  *((volatile uint32_t*)(0x42C61410UL))
#define bFM_CAN1_INTPND_INTPND6                   *((volatile uint32_t*)(0x42C61414UL))
#define bFM4_CAN1_INTPND_INTPND6                  *((volatile uint32_t*)(0x42C61414UL))
#define bFM_CAN1_INTPND_INTPND7                   *((volatile uint32_t*)(0x42C61418UL))
#define bFM4_CAN1_INTPND_INTPND7                  *((volatile uint32_t*)(0x42C61418UL))
#define bFM_CAN1_INTPND_INTPND8                   *((volatile uint32_t*)(0x42C6141CUL))
#define bFM4_CAN1_INTPND_INTPND8                  *((volatile uint32_t*)(0x42C6141CUL))
#define bFM_CAN1_INTPND_INTPND9                   *((volatile uint32_t*)(0x42C61420UL))
#define bFM4_CAN1_INTPND_INTPND9                  *((volatile uint32_t*)(0x42C61420UL))
#define bFM_CAN1_INTPND_INTPND10                  *((volatile uint32_t*)(0x42C61424UL))
#define bFM4_CAN1_INTPND_INTPND10                 *((volatile uint32_t*)(0x42C61424UL))
#define bFM_CAN1_INTPND_INTPND11                  *((volatile uint32_t*)(0x42C61428UL))
#define bFM4_CAN1_INTPND_INTPND11                 *((volatile uint32_t*)(0x42C61428UL))
#define bFM_CAN1_INTPND_INTPND12                  *((volatile uint32_t*)(0x42C6142CUL))
#define bFM4_CAN1_INTPND_INTPND12                 *((volatile uint32_t*)(0x42C6142CUL))
#define bFM_CAN1_INTPND_INTPND13                  *((volatile uint32_t*)(0x42C61430UL))
#define bFM4_CAN1_INTPND_INTPND13                 *((volatile uint32_t*)(0x42C61430UL))
#define bFM_CAN1_INTPND_INTPND14                  *((volatile uint32_t*)(0x42C61434UL))
#define bFM4_CAN1_INTPND_INTPND14                 *((volatile uint32_t*)(0x42C61434UL))
#define bFM_CAN1_INTPND_INTPND15                  *((volatile uint32_t*)(0x42C61438UL))
#define bFM4_CAN1_INTPND_INTPND15                 *((volatile uint32_t*)(0x42C61438UL))
#define bFM_CAN1_INTPND_INTPND16                  *((volatile uint32_t*)(0x42C6143CUL))
#define bFM4_CAN1_INTPND_INTPND16                 *((volatile uint32_t*)(0x42C6143CUL))
#define bFM_CAN1_INTPND_INTPND17                  *((volatile uint32_t*)(0x42C61440UL))
#define bFM4_CAN1_INTPND_INTPND17                 *((volatile uint32_t*)(0x42C61440UL))
#define bFM_CAN1_INTPND_INTPND18                  *((volatile uint32_t*)(0x42C61444UL))
#define bFM4_CAN1_INTPND_INTPND18                 *((volatile uint32_t*)(0x42C61444UL))
#define bFM_CAN1_INTPND_INTPND19                  *((volatile uint32_t*)(0x42C61448UL))
#define bFM4_CAN1_INTPND_INTPND19                 *((volatile uint32_t*)(0x42C61448UL))
#define bFM_CAN1_INTPND_INTPND20                  *((volatile uint32_t*)(0x42C6144CUL))
#define bFM4_CAN1_INTPND_INTPND20                 *((volatile uint32_t*)(0x42C6144CUL))
#define bFM_CAN1_INTPND_INTPND21                  *((volatile uint32_t*)(0x42C61450UL))
#define bFM4_CAN1_INTPND_INTPND21                 *((volatile uint32_t*)(0x42C61450UL))
#define bFM_CAN1_INTPND_INTPND22                  *((volatile uint32_t*)(0x42C61454UL))
#define bFM4_CAN1_INTPND_INTPND22                 *((volatile uint32_t*)(0x42C61454UL))
#define bFM_CAN1_INTPND_INTPND23                  *((volatile uint32_t*)(0x42C61458UL))
#define bFM4_CAN1_INTPND_INTPND23                 *((volatile uint32_t*)(0x42C61458UL))
#define bFM_CAN1_INTPND_INTPND24                  *((volatile uint32_t*)(0x42C6145CUL))
#define bFM4_CAN1_INTPND_INTPND24                 *((volatile uint32_t*)(0x42C6145CUL))
#define bFM_CAN1_INTPND_INTPND25                  *((volatile uint32_t*)(0x42C61460UL))
#define bFM4_CAN1_INTPND_INTPND25                 *((volatile uint32_t*)(0x42C61460UL))
#define bFM_CAN1_INTPND_INTPND26                  *((volatile uint32_t*)(0x42C61464UL))
#define bFM4_CAN1_INTPND_INTPND26                 *((volatile uint32_t*)(0x42C61464UL))
#define bFM_CAN1_INTPND_INTPND27                  *((volatile uint32_t*)(0x42C61468UL))
#define bFM4_CAN1_INTPND_INTPND27                 *((volatile uint32_t*)(0x42C61468UL))
#define bFM_CAN1_INTPND_INTPND28                  *((volatile uint32_t*)(0x42C6146CUL))
#define bFM4_CAN1_INTPND_INTPND28                 *((volatile uint32_t*)(0x42C6146CUL))
#define bFM_CAN1_INTPND_INTPND29                  *((volatile uint32_t*)(0x42C61470UL))
#define bFM4_CAN1_INTPND_INTPND29                 *((volatile uint32_t*)(0x42C61470UL))
#define bFM_CAN1_INTPND_INTPND30                  *((volatile uint32_t*)(0x42C61474UL))
#define bFM4_CAN1_INTPND_INTPND30                 *((volatile uint32_t*)(0x42C61474UL))
#define bFM_CAN1_INTPND_INTPND31                  *((volatile uint32_t*)(0x42C61478UL))
#define bFM4_CAN1_INTPND_INTPND31                 *((volatile uint32_t*)(0x42C61478UL))
#define bFM_CAN1_INTPND_INTPND32                  *((volatile uint32_t*)(0x42C6147CUL))
#define bFM4_CAN1_INTPND_INTPND32                 *((volatile uint32_t*)(0x42C6147CUL))

#define bFM_CAN1_MSGVAL_MSGVAL1                   *((volatile uint32_t*)(0x42C61600UL))
#define bFM4_CAN1_MSGVAL_MSGVAL1                  *((volatile uint32_t*)(0x42C61600UL))
#define bFM_CAN1_MSGVAL_MSGVAL2                   *((volatile uint32_t*)(0x42C61604UL))
#define bFM4_CAN1_MSGVAL_MSGVAL2                  *((volatile uint32_t*)(0x42C61604UL))
#define bFM_CAN1_MSGVAL_MSGVAL3                   *((volatile uint32_t*)(0x42C61608UL))
#define bFM4_CAN1_MSGVAL_MSGVAL3                  *((volatile uint32_t*)(0x42C61608UL))
#define bFM_CAN1_MSGVAL_MSGVAL4                   *((volatile uint32_t*)(0x42C6160CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL4                  *((volatile uint32_t*)(0x42C6160CUL))
#define bFM_CAN1_MSGVAL_MSGVAL5                   *((volatile uint32_t*)(0x42C61610UL))
#define bFM4_CAN1_MSGVAL_MSGVAL5                  *((volatile uint32_t*)(0x42C61610UL))
#define bFM_CAN1_MSGVAL_MSGVAL6                   *((volatile uint32_t*)(0x42C61614UL))
#define bFM4_CAN1_MSGVAL_MSGVAL6                  *((volatile uint32_t*)(0x42C61614UL))
#define bFM_CAN1_MSGVAL_MSGVAL7                   *((volatile uint32_t*)(0x42C61618UL))
#define bFM4_CAN1_MSGVAL_MSGVAL7                  *((volatile uint32_t*)(0x42C61618UL))
#define bFM_CAN1_MSGVAL_MSGVAL8                   *((volatile uint32_t*)(0x42C6161CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL8                  *((volatile uint32_t*)(0x42C6161CUL))
#define bFM_CAN1_MSGVAL_MSGVAL9                   *((volatile uint32_t*)(0x42C61620UL))
#define bFM4_CAN1_MSGVAL_MSGVAL9                  *((volatile uint32_t*)(0x42C61620UL))
#define bFM_CAN1_MSGVAL_MSGVAL10                  *((volatile uint32_t*)(0x42C61624UL))
#define bFM4_CAN1_MSGVAL_MSGVAL10                 *((volatile uint32_t*)(0x42C61624UL))
#define bFM_CAN1_MSGVAL_MSGVAL11                  *((volatile uint32_t*)(0x42C61628UL))
#define bFM4_CAN1_MSGVAL_MSGVAL11                 *((volatile uint32_t*)(0x42C61628UL))
#define bFM_CAN1_MSGVAL_MSGVAL12                  *((volatile uint32_t*)(0x42C6162CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL12                 *((volatile uint32_t*)(0x42C6162CUL))
#define bFM_CAN1_MSGVAL_MSGVAL13                  *((volatile uint32_t*)(0x42C61630UL))
#define bFM4_CAN1_MSGVAL_MSGVAL13                 *((volatile uint32_t*)(0x42C61630UL))
#define bFM_CAN1_MSGVAL_MSGVAL14                  *((volatile uint32_t*)(0x42C61634UL))
#define bFM4_CAN1_MSGVAL_MSGVAL14                 *((volatile uint32_t*)(0x42C61634UL))
#define bFM_CAN1_MSGVAL_MSGVAL15                  *((volatile uint32_t*)(0x42C61638UL))
#define bFM4_CAN1_MSGVAL_MSGVAL15                 *((volatile uint32_t*)(0x42C61638UL))
#define bFM_CAN1_MSGVAL_MSGVAL16                  *((volatile uint32_t*)(0x42C6163CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL16                 *((volatile uint32_t*)(0x42C6163CUL))
#define bFM_CAN1_MSGVAL_MSGVAL17                  *((volatile uint32_t*)(0x42C61640UL))
#define bFM4_CAN1_MSGVAL_MSGVAL17                 *((volatile uint32_t*)(0x42C61640UL))
#define bFM_CAN1_MSGVAL_MSGVAL18                  *((volatile uint32_t*)(0x42C61644UL))
#define bFM4_CAN1_MSGVAL_MSGVAL18                 *((volatile uint32_t*)(0x42C61644UL))
#define bFM_CAN1_MSGVAL_MSGVAL19                  *((volatile uint32_t*)(0x42C61648UL))
#define bFM4_CAN1_MSGVAL_MSGVAL19                 *((volatile uint32_t*)(0x42C61648UL))
#define bFM_CAN1_MSGVAL_MSGVAL20                  *((volatile uint32_t*)(0x42C6164CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL20                 *((volatile uint32_t*)(0x42C6164CUL))
#define bFM_CAN1_MSGVAL_MSGVAL21                  *((volatile uint32_t*)(0x42C61650UL))
#define bFM4_CAN1_MSGVAL_MSGVAL21                 *((volatile uint32_t*)(0x42C61650UL))
#define bFM_CAN1_MSGVAL_MSGVAL22                  *((volatile uint32_t*)(0x42C61654UL))
#define bFM4_CAN1_MSGVAL_MSGVAL22                 *((volatile uint32_t*)(0x42C61654UL))
#define bFM_CAN1_MSGVAL_MSGVAL23                  *((volatile uint32_t*)(0x42C61658UL))
#define bFM4_CAN1_MSGVAL_MSGVAL23                 *((volatile uint32_t*)(0x42C61658UL))
#define bFM_CAN1_MSGVAL_MSGVAL24                  *((volatile uint32_t*)(0x42C6165CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL24                 *((volatile uint32_t*)(0x42C6165CUL))
#define bFM_CAN1_MSGVAL_MSGVAL25                  *((volatile uint32_t*)(0x42C61660UL))
#define bFM4_CAN1_MSGVAL_MSGVAL25                 *((volatile uint32_t*)(0x42C61660UL))
#define bFM_CAN1_MSGVAL_MSGVAL26                  *((volatile uint32_t*)(0x42C61664UL))
#define bFM4_CAN1_MSGVAL_MSGVAL26                 *((volatile uint32_t*)(0x42C61664UL))
#define bFM_CAN1_MSGVAL_MSGVAL27                  *((volatile uint32_t*)(0x42C61668UL))
#define bFM4_CAN1_MSGVAL_MSGVAL27                 *((volatile uint32_t*)(0x42C61668UL))
#define bFM_CAN1_MSGVAL_MSGVAL28                  *((volatile uint32_t*)(0x42C6166CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL28                 *((volatile uint32_t*)(0x42C6166CUL))
#define bFM_CAN1_MSGVAL_MSGVAL29                  *((volatile uint32_t*)(0x42C61670UL))
#define bFM4_CAN1_MSGVAL_MSGVAL29                 *((volatile uint32_t*)(0x42C61670UL))
#define bFM_CAN1_MSGVAL_MSGVAL30                  *((volatile uint32_t*)(0x42C61674UL))
#define bFM4_CAN1_MSGVAL_MSGVAL30                 *((volatile uint32_t*)(0x42C61674UL))
#define bFM_CAN1_MSGVAL_MSGVAL31                  *((volatile uint32_t*)(0x42C61678UL))
#define bFM4_CAN1_MSGVAL_MSGVAL31                 *((volatile uint32_t*)(0x42C61678UL))
#define bFM_CAN1_MSGVAL_MSGVAL32                  *((volatile uint32_t*)(0x42C6167CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL32                 *((volatile uint32_t*)(0x42C6167CUL))

