neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_CAN1_NEWDT_NEWDAT1                    *((volatile uint32_t*)(0x42C61200UL))
#define bFM4_CAN1_NEWDT_NEWDAT1                   *((volatile uint32_t*)(0x42C61200UL))
#define bFM_CAN1_NEWDT_NEWDAT2                    *((volatile uint32_t*)(0x42C61204UL))
#define bFM4_CAN1_NEWDT_NEWDAT2                   *((volatile uint32_t*)(0x42C61204UL))
#define bFM_CAN1_NEWDT_NEWDAT3                    *((volatile uint32_t*)(0x42C61208UL))
#define bFM4_CAN1_NEWDT_NEWDAT3                   *((volatile uint32_t*)(0x42C61208UL))
#define bFM_CAN1_NEWDT_NEWDAT4                    *((volatile uint32_t*)(0x42C6120CUL))
#define bFM4_CAN1_NEWDT_NEWDAT4                   *((volatile uint32_t*)(0x42C6120CUL))
#define bFM_CAN1_NEWDT_NEWDAT5                    *((volatile uint32_t*)(0x42C61210UL))
#define bFM4_CAN1_NEWDT_NEWDAT5                   *((volatile uint32_t*)(0x42C61210UL))
#define bFM_CAN1_NEWDT_NEWDAT6                    *((volatile uint32_t*)(0x42C61214UL))
#define bFM4_CAN1_NEWDT_NEWDAT6                   *((volatile uint32_t*)(0x42C61214UL))
#define bFM_CAN1_NEWDT_NEWDAT7                    *((volatile uint32_t*)(0x42C61218UL))
#define bFM4_CAN1_NEWDT_NEWDAT7                   *((volatile uint32_t*)(0x42C61218UL))
#define bFM_CAN1_NEWDT_NEWDAT8                    *((volatile uint32_t*)(0x42C6121CUL))
#define bFM4_CAN1_NEWDT_NEWDAT8                   *((volatile uint32_t*)(0x42C6121CUL))
#define bFM_CAN1_NEWDT_NEWDAT9                    *((volatile uint32_t*)(0x42C61220UL))
#define bFM4_CAN1_NEWDT_NEWDAT9                   *((volatile uint32_t*)(0x42C61220UL))
#define bFM_CAN1_NEWDT_NEWDAT10                   *((volatile uint32_t*)(0x42C61224UL))
#define bFM4_CAN1_NEWDT_NEWDAT10                  *((volatile uint32_t*)(0x42C61224UL))
#define bFM_CAN1_NEWDT_NEWDAT11                   *((volatile uint32_t*)(0x42C61228UL))
#define bFM4_CAN1_NEWDT_NEWDAT11                  *((volatile uint32_t*)(0x42C61228UL))
#define bFM_CAN1_NEWDT_NEWDAT12                   *((volatile uint32_t*)(0x42C6122CUL))
#define bFM4_CAN1_NEWDT_NEWDAT12                  *((volatile uint32_t*)(0x42C6122CUL))
#define bFM_CAN1_NEWDT_NEWDAT13                   *((volatile uint32_t*)(0x42C61230UL))
#define bFM4_CAN1_NEWDT_NEWDAT13                  *((volatile uint32_t*)(0x42C61230UL))
#define bFM_CAN1_NEWDT_NEWDAT14                   *((volatile uint32_t*)(0x42C61234UL))
#define bFM4_CAN1_NEWDT_NEWDAT14                  *((volatile uint32_t*)(0x42C61234UL))
#define bFM_CAN1_NEWDT_NEWDAT15                   *((volatile uint32_t*)(0x42C61238UL))
#define bFM4_CAN1_NEWDT_NEWDAT15                  *((volatile uint32_t*)(0x42C61238UL))
#define bFM_CAN1_NEWDT_NEWDAT16                   *((volatile uint32_t*)(0x42C6123CUL))
#define bFM4_CAN1_NEWDT_NEWDAT16                  *((volatile uint32_t*)(0x42C6123CUL))
#define bFM_CAN1_NEWDT_NEWDAT17                   *((volatile uint32_t*)(0x42C61240UL))
#define bFM4_CAN1_NEWDT_NEWDAT17                  *((volatile uint32_t*)(0x42C61240UL))
#define bFM_CAN1_NEWDT_NEWDAT18                   *((volatile uint32_t*)(0x42C61244UL))
#define bFM4_CAN1_NEWDT_NEWDAT18                  *((volatile uint32_t*)(0x42C61244UL))
#define bFM_CAN1_NEWDT_NEWDAT19                   *((volatile uint32_t*)(0x42C61248UL))
#define bFM4_CAN1_NEWDT_NEWDAT19                  *((volatile uint32_t*)(0x42C61248UL))
#define bFM_CAN1_NEWDT_NEWDAT20                   *((volatile uint32_t*)(0x42C6124CUL))
#define bFM4_CAN1_NEWDT_NEWDAT20                  *((volatile uint32_t*)(0x42C6124CUL))
#define bFM_CAN1_NEWDT_NEWDAT21                   *((volatile uint32_t*)(0x42C61250UL))
#define bFM4_CAN1_NEWDT_NEWDAT21                  *((volatile uint32_t*)(0x42C61250UL))
#define bFM_CAN1_NEWDT_NEWDAT22                   *((volatile uint32_t*)(0x42C61254UL))
#define bFM4_CAN1_NEWDT_NEWDAT22                  *((volatile uint32_t*)(0x42C61254UL))
#define bFM_CAN1_NEWDT_NEWDAT23                   *((volatile uint32_t*)(0x42C61258UL))
#define bFM4_CAN1_NEWDT_NEWDAT23                  *((volatile uint32_t*)(0x42C61258UL))
#define bFM_CAN1_NEWDT_NEWDAT24                   *((volatile uint32_t*)(0x42C6125CUL))
#define bFM4_CAN1_NEWDT_NEWDAT24                  *((volatile uint32_t*)(0x42C6125CUL))
#define bFM_CAN1_NEWDT_NEWDAT25                   *((volatile uint32_t*)(0x42C61260UL))
#define bFM4_CAN1_NEWDT_NEWDAT25                  *((volatile uint32_t*)(0x42C61260UL))
#define bFM_CAN1_NEWDT_NEWDAT26                   *((volatile uint32_t*)(0x42C61264UL))
#define bFM4_CAN1_NEWDT_NEWDAT26                  *((volatile uint32_t*)(0x42C61264UL))
#define bFM_CAN1_NEWDT_NEWDAT27                   *((volatile uint32_t*)(0x42C61268UL))
#define bFM4_CAN1_NEWDT_NEWDAT27                  *((volatile uint32_t*)(0x42C61268UL))
#define bFM_CAN1_NEWDT_NEWDAT28                   *((volatile uint32_t*)(0x42C6126CUL))
#define bFM4_CAN1_NEWDT_NEWDAT28                  *((volatile uint32_t*)(0x42C6126CUL))
#define bFM_CAN1_NEWDT_NEWDAT29                   *((volatile uint32_t*)(0x42C61270UL))
#define bFM4_CAN1_NEWDT_NEWDAT29                  *((volatile uint32_t*)(0x42C61270UL))
#define bFM_CAN1_NEWDT_NEWDAT30                   *((volatile uint32_t*)(0x42C61274UL))
#define bFM4_CAN1_NEWDT_NEWDAT30                  *((volatile uint32_t*)(0x42C61274UL))
#define bFM_CAN1_NEWDT_NEWDAT31                   *((volatile uint32_t*)(0x42C61278UL))
#define bFM4_CAN1_NEWDT_NEWDAT31                  *((volatile uint32_t*)(0x42C61278UL))
#define bFM_CAN1_NEWDT_NEWDAT32                   *((volatile uint32_t*)(0x42C6127CUL))
#define bFM4_CAN1_NEWDT_NEWDAT32                  *((volatile uint32_t*)(0x42C6127CUL))

#define bFM_CAN1_STATR_TXOK                       *((volatile uint32_t*)(0x42C6004CUL))
#define bFM4_CAN1_STATR_TXOK                      *((volatile uint32_t*)(0x42C6004CUL))
#define bFM_CAN1_STATR_RXOK                       *((volatile uint32_t*)(0x42C60050UL))
#define bFM4_CAN1_STATR_RXOK                      *((volatile uint32_t*)(0x42C60050UL))
#define bFM_CAN1_STATR_EPASS                      *((volatile uint32_t*)(0x42C60054UL))
#define bFM4_CAN1_STATR_EPASS                     *((volatile uint32_t*)(0x42C60054UL))
#define bFM_CAN1_STATR_EWARN                      *((volatile uint32_t*)(0x42C60058UL))
#define bFM4_CAN1_STATR_EWARN                     *((volatile uint32_t*)(0x42C60058UL))
#define bFM_CAN1_STATR_BOFF                       *((volatile uint32_t*)(0x42C6005CUL))
#define bFM4_CAN1_STATR_BOFF                      *((volatile uint32_t*)(0x42C6005CUL))

#define bFM_CAN1_TESTR_BASIC                      *((volatile uint32_t*)(0x42C60148UL))
#define bFM4_CAN1_TESTR_BASIC                     *((volatile uint32_t*)(0x42C60148UL))
#define bFM_CAN1_TESTR_SILENT                     *((volatile uint32_t*)(0x42C6014CUL))
#define bFM4_CAN1_TESTR_SILENT                    *((volatile uint32_t*)(0x42C6014CUL))
#define bFM_CAN1_TESTR_LBACK                      *((volatile uint32_t*)(0x42C60150UL))
#define bFM4_CAN1_TESTR_LBACK                     *((volatile uint32_t*)(0x42C60150UL))
#define bFM_CAN1_TESTR_RX                         *((volatile uint32_t*)(0x42C6015CUL))
#define bFM4_CAN1_TESTR_RX                        *((volatile uint32_t*)(0x42C6015CUL))

#define bFM_CAN1_TREQR_TXRQST1                    *((volatile uint32_t*)(0x42C61000UL))
#define bFM4_CAN1_TREQR_TXRQST1                   *((volatile uint32_t*)(0x42C61000UL))
#define bFM_CAN1_TREQR_TXRQST2                    *((volatile uint32_t*)(0x42C61004UL))
#define bFM4_CAN1_TREQR_TXRQST2                   *((volatile uint32_t*)(0x42C61004UL))
#define bFM_CAN1_TREQR_TXRQST3                    *((volatile uint32_t*)(0x42C61008UL))
#define bFM4_CAN1_TREQR_TXRQST3                   *((volatile uint32_t*)(0x42C61008UL))
#define bFM_CAN1_TREQR_TXRQST4                    *((volatile uint32_t*)(0x42C6100CUL))
#define bFM4_CAN1_TREQR_TXRQST4                   *((volatile uint32_t*)(0x42C6100CUL))
#define bFM_CAN1_TREQR_TXRQST5                    *((volatile uint32_t*)(0x42C61010UL))
#define bFM4_CAN1_TREQR_TXRQST5                   *((volatile uint32_t*)(0x42C61010UL))
#define bFM_CAN1_TREQR_TXRQST6                    *((volatile uint32_t*)(0x42C61014UL))
#define bFM4_CAN1_TREQR_TXRQST6                   *((volatile uint32_t*)(0x42C61014UL))
#define bFM_CAN1_TREQR_TXRQST7                    *((volatile uint32_t*)(0x42C61018UL))
#define bFM4_CAN1_TREQR_TXRQST7                   *((volatile uint32_t*)(0x42C61018UL))
#define bFM_CAN1_TREQR_TXRQST8                    *((volatile uint32_t*)(0x42C6101CUL))
#define bFM4_CAN1_TREQR_TXRQST8                   *((volatile uint32_t*)(0x42C6101CUL))
#define bFM_CAN1_TREQR_TXRQST9                    *((volatile uint32_t*)(0x42C61020UL))
#define bFM4_CAN1_TREQR_TXRQST9                   *((volatile uint32_t*)(0x42C61020UL))
#define bFM_CAN1_TREQR_TXRQST10                   *((volatile uint32_t*)(0x42C61024UL))
#define bFM4_CAN1_TREQR_TXRQST10                  *((volatile uint32_t*)(0x42C61024UL))
#define bFM_CAN1_TREQR_TXRQST11                   *((volatile uint32_t*)(0x42C61028UL))
#define bFM4_CAN1_TREQR_TXRQST11                  *((volatile uint32_t*)(0x42C61028UL))
#define bFM_CAN1_TREQR_TXRQST12                   *((volatile uint32_t*)(0x42C6102CUL))
#define bFM4_CAN1_TREQR_TXRQST12                  *((volatile uint32_t*)(0x42C6102CUL))
#define bFM_CAN1_TREQR_TXRQST13                   *((volatile uint32_t*)(0x42C61030UL))
#define bFM4_CAN1_TREQR_TXRQST13                  *((volatile uint32_t*)(0x42C61030UL))
#define bFM_CAN1_TREQR_TXRQST14                   *((volatile uint32_t*)(0x42C61034UL))
#define bFM4_CAN1_TREQR_TXRQST14                  *((volatile uint32_t*)(0x42C61034UL))
#define bFM_CAN1_TREQR_TXRQST15                   *((volatile uint32_t*)(0x42C61038UL))
#define bFM4_CAN1_TREQR_TXRQST15                  *((volatile uint32_t*)(0x42C61038UL))
#define bFM_CAN1_TREQR_TXRQST16                   *((volatile uint32_t*)(0x42C6103CUL))
#define bFM4_CAN1_TREQR_TXRQST16                  *((volatile uint32_t*)(0x42C6103CUL))
#define bFM_CAN1_TREQR_TXRQST17                   *((volatile uint32_t*)(0x42C61040UL))
#define bFM4_CAN1_TREQR_TXRQST17                  *((volatile uint32_t*)(0x42C61040UL))
#define bFM_CAN1_TREQR_TXRQST18                   *((volatile uint32_t*)(0x42C61044UL))
#define bFM4_CAN1_TREQR_TXRQST18                  *((volatile uint32_t*)(0x42C61044UL))
#define bFM_CAN1_TREQR_TXRQST19                   *((volatile uint32_t*)(0x42C61048UL))
#define bFM4_CAN1_TREQR_TXRQST19                  *((volatile uint32_t*)(0x42C61048UL))
#define bFM_CAN1_TREQR_TXRQST20                   *((volatile uint32_t*)(0x42C6104CUL))
#define bFM4_CAN1_TREQR_TXRQST20                  *((volatile uint32_t*)(0x42C6104CUL))
#define bFM_CAN1_TREQR_TXRQST21                   *((volatile uint32_t*)(0x42C61050UL))
#define bFM4_CAN1_TREQR_TXRQST21                  *((volatile uint32_t*)(0x42C61050UL))
#define bFM_CAN1_TREQR_TXRQST22                   *((volatile uint32_t*)(0x42C61054UL))
#define bFM4_CAN1_TREQR_TXRQST22                  *((volatile uint32_t*)(0x42C61054UL))
#define bFM_CAN1_TREQR_TXRQST23                   *((volatile uint32_t*)(0x42C61058UL))
#define bFM4_CAN1_TREQR_TXRQST23                  *((volatile uint32_t*)(0x42C61058UL))
#define bFM_CAN1_TREQR_TXRQST24                   *((volatile uint32_t*)(0x42C6105CUL))
#define bFM4_CAN1_TREQR_TXRQST24                  *((volatile uint32_t*)(0x42C6105CUL))
#define bFM_CAN1_TREQR_TXRQST25                   *((volatile uint32_t*)(0x42C61060UL))
#define bFM4_CAN1_TREQR_TXRQST25                  *((volatile uint32_t*)(0x42C61060UL))
#define bFM_CAN1_TREQR_TXRQST26                   *((volatile uint32_t*)(0x42C61064UL))
#define bFM4_CAN1_TREQR_TXRQST26                  *((volatile uint32_t*)(0x42C61064UL))
#define bFM_CAN1_TREQR_TXRQST27                   *((volatile uint32_t*)(0x42C61068UL))
#define bFM4_CAN1_TREQR_TXRQST27                  *((volatile uint32_t*)(0x42C61068UL))
#define bFM_CAN1_TREQR_TXRQST28                   *((volatile uint32_t*)(0x42C6106CUL))
#define bFM4_CAN1_TREQR_TXRQST28                  *((volatile uint32_t*)(0x42C6106CUL))
#define bFM_CAN1_TREQR_TXRQST29                   *((volatile uint32_t*)(0x42C61070UL))
#define bFM4_CAN1_TREQR_TXRQST29                  *((volatile uint32_t*)(0x42C61070UL))
#define bFM_CAN1_TREQR_TXRQST30                   *((volatile uint32_t*)(0x42C61074UL))
#define bFM4_CAN1_TREQR_TXRQST30                  *((volatile uint32_t*)(0x42C61074UL))
#define bFM_CAN1_TREQR_TXRQST31                   *((volatile uint32_t*)(0x42C61078UL))
#define bFM4_CAN1_TREQR_TXRQST31                  *((volatile uint32_t*)(0x42C61078UL))
#define bFM_CAN1_TREQR_TXRQST32                   *((volatile uint32_t*)(0x42C6107CUL))
#define bFM4_CAN1_TREQR_TXRQST32                  *((volatile uint32_t*)(0x42C6107CUL))


