neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** CANFD Registers CANFD0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_CANFD0_CCCR_INIT                      *((volatile uint32_t*)(0x42E00300UL))
#define bFM4_CANFD0_CCCR_INIT                     *((volatile uint32_t*)(0x42E00300UL))
#define bFM_CANFD0_CCCR_CCE                       *((volatile uint32_t*)(0x42E00304UL))
#define bFM4_CANFD0_CCCR_CCE                      *((volatile uint32_t*)(0x42E00304UL))
#define bFM_CANFD0_CCCR_ASM                       *((volatile uint32_t*)(0x42E00308UL))
#define bFM4_CANFD0_CCCR_ASM                      *((volatile uint32_t*)(0x42E00308UL))
#define bFM_CANFD0_CCCR_CSA                       *((volatile uint32_t*)(0x42E0030CUL))
#define bFM4_CANFD0_CCCR_CSA                      *((volatile uint32_t*)(0x42E0030CUL))
#define bFM_CANFD0_CCCR_CSR                       *((volatile uint32_t*)(0x42E00310UL))
#define bFM4_CANFD0_CCCR_CSR                      *((volatile uint32_t*)(0x42E00310UL))
#define bFM_CANFD0_CCCR_MON                       *((volatile uint32_t*)(0x42E00314UL))
#define bFM4_CANFD0_CCCR_MON                      *((volatile uint32_t*)(0x42E00314UL))
#define bFM_CANFD0_CCCR_DAR                       *((volatile uint32_t*)(0x42E00318UL))
#define bFM4_CANFD0_CCCR_DAR                      *((volatile uint32_t*)(0x42E00318UL))
#define bFM_CANFD0_CCCR_TEST                      *((volatile uint32_t*)(0x42E0031CUL))
#define bFM4_CANFD0_CCCR_TEST                     *((volatile uint32_t*)(0x42E0031CUL))
#define bFM_CANFD0_CCCR_FDO                       *((volatile uint32_t*)(0x42E00330UL))
#define bFM4_CANFD0_CCCR_FDO                      *((volatile uint32_t*)(0x42E00330UL))
#define bFM_CANFD0_CCCR_FDBS                      *((volatile uint32_t*)(0x42E00334UL))
#define bFM4_CANFD0_CCCR_FDBS                     *((volatile uint32_t*)(0x42E00334UL))
#define bFM_CANFD0_CCCR_TXP                       *((volatile uint32_t*)(0x42E00338UL))
#define bFM4_CANFD0_CCCR_TXP                      *((volatile uint32_t*)(0x42E00338UL))

#define bFM_CANFD0_ECR_RP                         *((volatile uint32_t*)(0x42E0083CUL))
#define bFM4_CANFD0_ECR_RP                        *((volatile uint32_t*)(0x42E0083CUL))

#define bFM_CANFD0_FBTP_TDC                       *((volatile uint32_t*)(0x42E001DCUL))
#define bFM4_CANFD0_FBTP_TDC                      *((volatile uint32_t*)(0x42E001DCUL))

#define bFM_CANFD0_FDECR_SEIE                     *((volatile uint32_t*)(0x42E04000UL))
#define bFM4_CANFD0_FDECR_SEIE                    *((volatile uint32_t*)(0x42E04000UL))
#define bFM_CANFD0_FDECR_DEIE                     *((volatile uint32_t*)(0x42E04004UL))
#define bFM4_CANFD0_FDECR_DEIE                    *((volatile uint32_t*)(0x42E04004UL))
#define bFM_CANFD0_FDECR_CEREN                    *((volatile uint32_t*)(0x42E04008UL))
#define bFM4_CANFD0_FDECR_CEREN                   *((volatile uint32_t*)(0x42E04008UL))
#define bFM_CANFD0_FDECR_CEIV                     *((volatile uint32_t*)(0x42E0400CUL))
#define bFM4_CANFD0_FDECR_CEIV                    *((volatile uint32_t*)(0x42E0400CUL))

#define bFM_CANFD0_FDESCR_SEIC                    *((volatile uint32_t*)(0x42E040A0UL))
#define bFM4_CANFD0_FDESCR_SEIC                   *((volatile uint32_t*)(0x42E040A0UL))
#define bFM_CANFD0_FDESCR_DEIC                    *((volatile uint32_t*)(0x42E040A4UL))
#define bFM4_CANFD0_FDESCR_DEIC                   *((volatile uint32_t*)(0x42E040A4UL))

#define bFM_CANFD0_FDESR_SEI                      *((volatile uint32_t*)(0x42E04020UL))
#define bFM4_CANFD0_FDESR_SEI                     *((volatile uint32_t*)(0x42E04020UL))
#define bFM_CANFD0_FDESR_DEI                      *((volatile uint32_t*)(0x42E04024UL))
#define bFM4_CANFD0_FDESR_DEI                     *((volatile uint32_t*)(0x42E04024UL))

#define bFM_CANFD0_GFC_RRFE                       *((volatile uint32_t*)(0x42E01000UL))
#define bFM4_CANFD0_GFC_RRFE                      *((volatile uint32_t*)(0x42E01000UL))
#define bFM_CANFD0_GFC_RRFS                       *((volatile uint32_t*)(0x42E01004UL))
#define bFM4_CANFD0_GFC_RRFS                      *((volatile uint32_t*)(0x42E01004UL))

#define bFM_CANFD0_HPMS_FLST                      *((volatile uint32_t*)(0x42E012BCUL))
#define bFM4_CANFD0_HPMS_FLST                     *((volatile uint32_t*)(0x42E012BCUL))

#define bFM_CANFD0_IE_RF0NE                       *((volatile uint32_t*)(0x42E00A80UL))
#define bFM4_CANFD0_IE_RF0NE                      *((volatile uint32_t*)(0x42E00A80UL))
#define bFM_CANFD0_IE_RF0WE                       *((volatile uint32_t*)(0x42E00A84UL))
#define bFM4_CANFD0_IE_RF0WE                      *((volatile uint32_t*)(0x42E00A84UL))
#define bFM_CANFD0_IE_RF0FE                       *((volatile uint32_t*)(0x42E00A88UL))
#define bFM4_CANFD0_IE_RF0FE                      *((volatile uint32_t*)(0x42E00A88UL))
#define bFM_CANFD0_IE_RF0LE                       *((volatile uint32_t*)(0x42E00A8CUL))
#define bFM4_CANFD0_IE_RF0LE                      *((volatile uint32_t*)(0x42E00A8CUL))
#define bFM_CANFD0_IE_RF1NE                       *((volatile uint32_t*)(0x42E00A90UL))
#define bFM4_CANFD0_IE_RF1NE                      *((volatile uint32_t*)(0x42E00A90UL))
#define bFM_CANFD0_IE_RF1WE                       *((volatile uint32_t*)(0x42E00A94UL))
#define bFM4_CANFD0_IE_RF1WE                      *((volatile uint32_t*)(0x42E00A94UL))
#define bFM_CANFD0_IE_RF1FE                       *((volatile uint32_t*)(0x42E00A98UL))
#define bFM4_CANFD0_IE_RF1FE                      *((volatile uint32_t*)(0x42E00A98UL))
#define bFM_CANFD0_IE_RF1LE                       *((volatile uint32_t*)(0x42E00A9CUL))
#define bFM4_CANFD0_IE_RF1LE                      *((volatile uint32_t*)(0x42E00A9CUL))
#define bFM_CANFD0_IE_HPME                        *((volatile uint32_t*)(0x42E00AA0UL))
#define bFM4_CANFD0_IE_HPME                       *((volatile uint32_t*)(0x42E00AA0UL))
#define bFM_CANFD0_IE_TCE                         *((volatile uint32_t*)(0x42E00AA4UL))
#define bFM4_CANFD0_IE_TCE                        *((volatile uint32_t*)(0x42E00AA4UL))
#define bFM_CANFD0_IE_TCFE                        *((volatile uint32_t*)(0x42E00AA8UL))
#define bFM4_CANFD0_IE_TCFE                       *((volatile uint32_t*)(0x42E00AA8UL))
#define bFM_CANFD0_IE_TFEE                        *((volatile uint32_t*)(0x42E00AACUL))
#define bFM4_CANFD0_IE_TFEE                       *((volatile uint32_t*)(0x42E00AACUL))
#define bFM_CANFD0_IE_TEFNE                       *((volatile uint32_t*)(0x42E00AB0UL))
#define bFM4_CANFD0_IE_TEFNE                      *((volatile uint32_t*)(0x42E00AB0UL))
#define bFM_CANFD0_IE_TEFWE                       *((volatile uint32_t*)(0x42E00AB4UL))
#define bFM4_CANFD0_IE_TEFWE                      *((volatile uint32_t*)(0x42E00AB4UL))
#define bFM_CANFD0_IE_TEFFE                       *((volatile uint32_t*)(0x42E00AB8UL))
#define bFM4_CANFD0_IE_TEFFE                      *((volatile uint32_t*)(0x42E00AB8UL))
#define bFM_CANFD0_IE_TEFLE                       *((volatile uint32_t*)(0x42E00ABCUL))
#define bFM4_CANFD0_IE_TEFLE                      *((volatile uint32_t*)(0x42E00ABCUL))
#define bFM_CANFD0_IE_TSWE                        *((volatile uint32_t*)(0x42E00AC0UL))
#define bFM4_CANFD0_IE_TSWE                       *((volatile uint32_t*)(0x42E00AC0UL))
#define bFM_CANFD0_IE_MRAFE                       *((volatile uint32_t*)(0x42E00AC4UL))
#define bFM4_CANFD0_IE_MRAFE                      *((volatile uint32_t*)(0x42E00AC4UL))
#define bFM_CANFD0_IE_TOOE                        *((volatile uint32_t*)(0x42E00AC8UL))
#define bFM4_CANFD0_IE_TOOE                       *((volatile uint32_t*)(0x42E00AC8UL))
#define bFM_CANFD0_IE_DRXE                        *((volatile uint32_t*)(0x42E00ACCUL))
#define bFM4_CANFD0_IE_DRXE                       *((volatile uint32_t*)(0x42E00ACCUL))
#define bFM_CANFD0_IE_BECE                        *((volatile uint32_t*)(0x42E00AD0UL))
#define bFM4_CANFD0_IE_BECE                       *((volatile uint32_t*)(0x42E00AD0UL))
#define bFM_CANFD0_IE_BEUE                        *((volatile uint32_t*)(0x42E00AD4UL))
#define bFM4_CANFD0_IE_BEUE                       *((volatile uint32_t*)(0x42E00AD4UL))
#define bFM_CANFD0_IE_ELOE                        *((volatile uint32_t*)(0x42E00AD8UL))
#define bFM4_CANFD0_IE_ELOE                       *((volatile uint32_t*)(0x42E00AD8UL))
#define bFM_CANFD0_IE_EPE                         *((volatile uint32_t*)(0x42E00ADCUL))
#define bFM4_CANFD0_IE_EPE                        *((volatile uint32_t*)(0x42E00ADCUL))
#define bFM_CANFD0_IE_EWE                         *((volatile uint32_t*)(0x42E00AE0UL))
#define bFM4_CANFD0_IE_EWE                        *((volatile uint32_t*)(0x42E00AE0UL))
#define bFM_CANFD0_IE_BOE                         *((volatile uint32_t*)(0x42E00AE4UL))
#define bFM4_CANFD0_IE_BOE                        *((volatile uint32_t*)(0x42E00AE4UL))
#define bFM_CANFD0_IE_WDIE                        *((volatile uint32_t*)(0x42E00AE8UL))
#define bFM4_CANFD0_IE_WDIE                       *((volatile uint32_t*)(0x42E00AE8UL))
#define bFM_CANFD0_IE_CRCEE                       *((volatile uint32_t*)(0x42E00AECUL))
#define bFM4_CANFD0_IE_CRCEE                      *((volatile uint32_t*)(0x42E00AECUL))
#define bFM_CANFD0_IE_BEE                         *((volatile uint32_t*)(0x42E00AF0UL))
#define bFM4_CANFD0_IE_BEE                        *((volatile uint32_t*)(0x42E00AF0UL))
#define bFM_CANFD0_IE_ACKEE                       *((volatile uint32_t*)(0x42E00AF4UL))
#define bFM4_CANFD0_IE_ACKEE                      *((volatile uint32_t*)(0x42E00AF4UL))
#define bFM_CANFD0_IE_FOEE                        *((volatile uint32_t*)(0x42E00AF8UL))
#define bFM4_CANFD0_IE_FOEE                       *((volatile uint32_t*)(0x42E00AF8UL))
#define bFM_CANFD0_IE_STEE                        *((volatile uint32_t*)(0x42E00AFCUL))
#define bFM4_CANFD0_IE_STEE                       *((volatile uint32_t*)(0x42E00AFCUL))

#define bFM_CANFD0_ILE_EINT0                      *((volatile uint32_t*)(0x42E00B80UL))
#define bFM4_CANFD0_ILE_EINT0                     *((volatile uint32_t*)(0x42E00B80UL))
#define bFM_CANFD0_ILE_EINT1                      *((volatile uint32_t*)(0x42E00B84UL))
#define bFM4_CANFD0_ILE_EINT1                     *((volatile uint32_t*)(0x42E00B84UL))

#define bFM_CANFD0_ILS_RF0NL                      *((volatile uint32_t*)(0x42E00B00UL))
#define bFM4_CANFD0_ILS_RF0NL                     *((volatile uint32_t*)(0x42E00B00UL))
#define bFM_CANFD0_ILS_RF0WL                      *((volatile uint32_t*)(0x42E00B04UL))
#define bFM4_CANFD0_ILS_RF0WL                     *((volatile uint32_t*)(0x42E00B04UL))
#define bFM_CANFD0_ILS_RF0FL                      *((volatile uint32_t*)(0x42E00B08UL))
#define bFM4_CANFD0_ILS_RF0FL                     *((volatile uint32_t*)(0x42E00B08UL))
#define bFM_CANFD0_ILS_RF0LL                      *((volatile uint32_t*)(0x42E00B0CUL))
#define bFM4_CANFD0_ILS_RF0LL                     *((volatile uint32_t*)(0x42E00B0CUL))
#define bFM_CANFD0_ILS_RF1NL                      *((volatile uint32_t*)(0x42E00B10UL))
#define bFM4_CANFD0_ILS_RF1NL                     *((volatile uint32_t*)(0x42E00B10UL))
#define bFM_CANFD0_ILS_RF1WL                      *((volatile uint32_t*)(0x42E00B14UL))
#define bFM4_CANFD0_ILS_RF1WL                     *((volatile uint32_t*)(0x42E00B14UL))
#define bFM_CANFD0_ILS_RF1FL                      *((volatile uint32_t*)(0x42E00B18UL))
#define bFM4_CANFD0_ILS_RF1FL                     *((volatile uint32_t*)(0x42E00B18UL))
#define bFM_CANFD0_ILS_RF1LL                      *((volatile uint32_t*)(0x42E00B1CUL))
#define bFM4_CANFD0_ILS_RF1LL                     *((volatile uint32_t*)(0x42E00B1CUL))
#define bFM_CANFD0_ILS_HPML                       *((volatile uint32_t*)(0x42E00B20UL))
#define bFM4_CANFD0_ILS_HPML                      *((volatile uint32_t*)(0x42E00B20UL))
#define bFM_CANFD0_ILS_TCL                        *((volatile uint32_t*)(0x42E00B24UL))
#define bFM4_CANFD0_ILS_TCL                       *((volatile uint32_t*)(0x42E00B24UL))
#define bFM_CANFD0_ILS_TCFL                       *((volatile uint32_t*)(0x42E00B28UL))
#define bFM4_CANFD0_ILS_TCFL                      *((volatile uint32_t*)(0x42E00B28UL))
#define bFM_CANFD0_ILS_TFEL                       *((volatile uint32_t*)(0x42E00B2CUL))
#define bFM4_CANFD0_ILS_TFEL                      *((volatile uint32_t*)(0x42E00B2CUL))
#define bFM_CANFD0_ILS_TEFNL                      *((volatile uint32_t*)(0x42E00B30UL))
#define bFM4_CANFD0_ILS_TEFNL                     *((volatile uint32_t*)(0x42E00B30UL))
#define bFM_CANFD0_ILS_TEFWL                      *((volatile uint32_t*)(0x42E00B34UL))
#define bFM4_CANFD0_ILS_TEFWL                     *((volatile uint32_t*)(0x42E00B34UL))
#define bFM_CANFD0_ILS_TEFFL                      *((volatile uint32_t*)(0x42E00B38UL))
#define bFM4_CANFD0_ILS_TEFFL                     *((volatile uint32_t*)(0x42E00B38UL))
#define bFM_CANFD0_ILS_TEFLL                      *((volatile uint32_t*)(0x42E00B3CUL))
#define bFM4_CANFD0_ILS_TEFLL                     *((volatile uint32_t*)(0x42E00B3CUL))
#define bFM_CANFD0_ILS_TSWL                       *((volatile uint32_t*)(0x42E00B40UL))
#define bFM4_CANFD0_ILS_TSWL                      *((volatile uint32_t*)(0x42E00B40UL))
#define bFM_CANFD0_ILS_MRAFL                      *((volatile uint32_t*)(0x42E00B44UL))
#define bFM4_CANFD0_ILS_MRAFL                     *((volatile uint32_t*)(0x42E00B44UL))
#define bFM_CANFD0_ILS_TOOL                       *((volatile uint32_t*)(0x42E00B48UL))
#define bFM4_CANFD0_ILS_TOOL                      *((volatile uint32_t*)(0x42E00B48UL))
#define bFM_CANFD0_ILS_DRXL                       *((volatile uint32_t*)(0x42E00B4CUL))
#define bFM4_CANFD0_ILS_DRXL                      *((volatile uint32_t*)(0x42E00B4CUL))
#define bFM_CANFD0_ILS_BECL                       *((volatile uint32_t*)(0x42E00B50UL))
#define bFM4_CANFD0_ILS_BECL                      *((volatile uint32_t*)(0x42E00B50UL))
#define bFM_CANFD0_ILS_BEUL                       *((volatile uint32_t*)(0x42E00B54UL))
#define bFM4_CANFD0_ILS_BEUL                      *((volatile uint32_t*)(0x42E00B54UL))
#define bFM_CANFD0_ILS_ELOL                       *((volatile uint32_t*)(0x42E00B58UL))
#define bFM4_CANFD0_ILS_ELOL                      *((volatile uint32_t*)(0x42E00B58UL))
#define bFM_CANFD0_ILS_EPL                        *((volatile uint32_t*)(0x42E00B5CUL))
#define bFM4_CANFD0_ILS_EPL                       *((volatile uint32_t*)(0x42E00B5CUL))
#define bFM_CANFD0_ILS_EWL                        *((volatile uint32_t*)(0x42E00B60UL))
#define bFM4_CANFD0_ILS_EWL                       *((volatile uint32_t*)(0x42E00B60UL))
#define bFM_CANFD0_ILS_BOL                        *((volatile uint32_t*)(0x42E00B64UL))
#define bFM4_CANFD0_ILS_BOL                       *((volatile uint32_t*)(0x42E00B64UL))
#define bFM_CANFD0_ILS_WDIL                       *((volatile uint32_t*)(0x42E00B68UL))
#define bFM4_CANFD0_ILS_WDIL                      *((volatile uint32_t*)(0x42E00B68UL))
#define bFM_CANFD0_ILS_CRCEL                      *((volatile uint32_t*)(0x42E00B6CUL))
#define bFM4_CANFD0_ILS_CRCEL                     *((volatile uint32_t*)(0x42E00B6CUL))
#define bFM_CANFD0_ILS_BEL                        *((volatile uint32_t*)(0x42E00B70UL))
#define bFM4_CANFD0_ILS_BEL                       *((volatile uint32_t*)(0x42E00B70UL))
#define bFM_CANFD0_ILS_ACKEL                      *((volatile uint32_t*)(0x42E00B74UL))
#define bFM4_CANFD0_ILS_ACKEL                     *((volatile uint32_t*)(0x42E00B74UL))
#define bFM_CANFD0_ILS_FOEL                       *((volatile uint32_t*)(0x42E00B78UL))
#define bFM4_CANFD0_ILS_FOEL                      *((volatile uint32_t*)(0x42E00B78UL))
#define bFM_CANFD0_ILS_STEL                       *((volatile uint32_t*)(0x42E00B7CUL))
#define bFM4_CANFD0_ILS_STEL                      *((volatile uint32_t*)(0x42E00B7CUL))

#define bFM_CANFD0_IR_RF0N                        *((volatile uint32_t*)(0x42E00A00UL))
#define bFM4_CANFD0_IR_RF0N                       *((volatile uint32_t*)(0x42E00A00UL))
#define bFM_CANFD0_IR_RF0W                        *((volatile uint32_t*)(0x42E00A04UL))
#define bFM4_CANFD0_IR_RF0W                       *((volatile uint32_t*)(0x42E00A04UL))
#define bFM_CANFD0_IR_RF0F                        *((volatile uint32_t*)(0x42E00A08UL))
#define bFM4_CANFD0_IR_RF0F                       *((volatile uint32_t*)(0x42E00A08UL))
#define bFM_CANFD0_IR_RF0L                        *((volatile uint32_t*)(0x42E00A0CUL))
#define bFM4_CANFD0_IR_RF0L                       *((volatile uint32_t*)(0x42E00A0CUL))
#define bFM_CANFD0_IR_RF1N                        *((volatile uint32_t*)(0x42E00A10UL))
#define bFM4_CANFD0_IR_RF1N                       *((volatile uint32_t*)(0x42E00A10UL))
#define bFM_CANFD0_IR_RF1W                        *((volatile uint32_t*)(0x42E00A14UL))
#define bFM4_CANFD0_IR_RF1W                       *((volatile uint32_t*)(0x42E00A14UL))
#define bFM_CANFD0_IR_RF1F                        *((volatile uint32_t*)(0x42E00A18UL))
#define bFM4_CANFD0_IR_RF1F                       *((volatile uint32_t*)(0x42E00A18UL))
#define bFM_CANFD0_IR_RF1L                        *((volatile uint32_t*)(0x42E00A1CUL))
#define bFM4_CANFD0_IR_RF1L                       *((volatile uint32_t*)(0x42E00A1CUL))
#define bFM_CANFD0_IR_HPM                         *((volatile uint32_t*)(0x42E00A20UL))
#define bFM4_CANFD0_IR_HPM                        *((volatile uint32_t*)(0x42E00A20UL))
#define bFM_CANFD0_IR_TC                          *((volatile uint32_t*)(0x42E00A24UL))
#define bFM4_CANFD0_IR_TC                         *((volatile uint32_t*)(0x42E00A24UL))
#define bFM_CANFD0_IR_TCF                         *((volatile uint32_t*)(0x42E00A28UL))
#define bFM4_CANFD0_IR_TCF                        *((volatile uint32_t*)(0x42E00A28UL))
#define bFM_CANFD0_IR_TFE                         *((volatile uint32_t*)(0x42E00A2CUL))
#define bFM4_CANFD0_IR_TFE                        *((volatile uint32_t*)(0x42E00A2CUL))
#define bFM_CANFD0_IR_TEFN                        *((volatile uint32_t*)(0x42E00A30UL))
#define bFM4_CANFD0_IR_TEFN                       *((volatile uint32_t*)(0x42E00A30UL))
#define bFM_CANFD0_IR_TEFW                        *((volatile uint32_t*)(0x42E00A34UL))
#define bFM4_CANFD0_IR_TEFW                       *((volatile uint32_t*)(0x42E00A34UL))
#define bFM_CANFD0_IR_TEFF                        *((volatile uint32_t*)(0x42E00A38UL))
#define bFM4_CANFD0_IR_TEFF                       *((volatile uint32_t*)(0x42E00A38UL))
#define bFM_CANFD0_IR_TEFL                        *((volatile uint32_t*)(0x42E00A3CUL))
#define bFM4_CANFD0_IR_TEFL                       *((volatile uint32_t*)(0x42E00A3CUL))
#define bFM_CANFD0_IR_TSW                         *((volatile uint32_t*)(0x42E00A40UL))
#define bFM4_CANFD0_IR_TSW                        *((volatile uint32_t*)(0x42E00A40UL))
#define bFM_CANFD0_IR_MRAF                        *((volatile uint32_t*)(0x42E00A44UL))
#define bFM4_CANFD0_IR_MRAF                       *((volatile uint32_t*)(0x42E00A44UL))
#define bFM_CANFD0_IR_TOO                         *((volatile uint32_t*)(0x42E00A48UL))
#define bFM4_CANFD0_IR_TOO                        *((volatile uint32_t*)(0x42E00A48UL))
#define bFM_CANFD0_IR_DRX                         *((volatile uint32_t*)(0x42E00A4CUL))
#define bFM4_CANFD0_IR_DRX                        *((volatile uint32_t*)(0x42E00A4CUL))
#define bFM_CANFD0_IR_BEC                         *((volatile uint32_t*)(0x42E00A50UL))
#define bFM4_CANFD0_IR_BEC                        *((volatile uint32_t*)(0x42E00A50UL))
#define bFM_CANFD0_IR_BEU                         *((volatile uint32_t*)(0x42E00A54UL))
#define bFM4_CANFD0_IR_BEU                        *((volatile uint32_t*)(0x42E00A54UL))
#define bFM_CANFD0_IR_ELO                         *((volatile uint32_t*)(0x42E00A58UL))
#define bFM4_CANFD0_IR_ELO                        *((volatile uint32_t*)(0x42E00A58UL))
#define bFM_CANFD0_IR_EP                          *((volatile uint32_t*)(0x42E00A5CUL))
#define bFM4_CANFD0_IR_EP                         *((volatile uint32_t*)(0x42E00A5CUL))
#define bFM_CANFD0_IR_EW                          *((volatile uint32_t*)(0x42E00A60UL))
#define bFM4_CANFD0_IR_EW                         *((volatile uint32_t*)(0x42E00A60UL))
#define bFM_CANFD0_IR_BO                          *((volatile uint32_t*)(0x42E00A64UL))
#define bFM4_CANFD0_IR_BO                         *((volatile uint32_t*)(0x42E00A64UL))
#define bFM_CANFD0_IR_WDI                         *((volatile uint32_t*)(0x42E00A68UL))
#define bFM4_CANFD0_IR_WDI                        *((volatile uint32_t*)(0x42E00A68UL))
#define bFM_CANFD0_IR_CRCE                        *((volatile uint32_t*)(0x42E00A6CUL))
#define bFM4_CANFD0_IR_CRCE                       *((volatile uint32_t*)(0x42E00A6CUL))
#define bFM_CANFD0_IR_BE                          *((volatile uint32_t*)(0x42E00A70UL))
#define bFM4_CANFD0_IR_BE                         *((volatile uint32_t*)(0x42E00A70UL))
#define bFM_CANFD0_IR_ACKE                        *((volatile uint32_t*)(0x42E00A74UL))
#define bFM4_CANFD0_IR_ACKE                       *((volatile uint32_t*)(0x42E00A74UL))
#define bFM_CANFD0_IR_FOE                         *((volatile uint32_t*)(0x42E00A78UL))
#define bFM4_CANFD0_IR_FOE                        *((volatile uint32_t*)(0x42E00A78UL))
#define bFM_CANFD0_IR_STE                         *((volatile uint32_t*)(0x42E00A7CUL))
#define bFM4_CANFD0_IR_STE                        *((volatile uint32_t*)(0x42E00A7CUL))

