neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_CANFD0_NDAT1_ND0                      *((volatile uint32_t*)(0x42E01300UL))
#define bFM4_CANFD0_NDAT1_ND0                     *((volatile uint32_t*)(0x42E01300UL))
#define bFM_CANFD0_NDAT1_ND1                      *((volatile uint32_t*)(0x42E01304UL))
#define bFM4_CANFD0_NDAT1_ND1                     *((volatile uint32_t*)(0x42E01304UL))
#define bFM_CANFD0_NDAT1_ND2                      *((volatile uint32_t*)(0x42E01308UL))
#define bFM4_CANFD0_NDAT1_ND2                     *((volatile uint32_t*)(0x42E01308UL))
#define bFM_CANFD0_NDAT1_ND3                      *((volatile uint32_t*)(0x42E0130CUL))
#define bFM4_CANFD0_NDAT1_ND3                     *((volatile uint32_t*)(0x42E0130CUL))
#define bFM_CANFD0_NDAT1_ND4                      *((volatile uint32_t*)(0x42E01310UL))
#define bFM4_CANFD0_NDAT1_ND4                     *((volatile uint32_t*)(0x42E01310UL))
#define bFM_CANFD0_NDAT1_ND5                      *((volatile uint32_t*)(0x42E01314UL))
#define bFM4_CANFD0_NDAT1_ND5                     *((volatile uint32_t*)(0x42E01314UL))
#define bFM_CANFD0_NDAT1_ND6                      *((volatile uint32_t*)(0x42E01318UL))
#define bFM4_CANFD0_NDAT1_ND6                     *((volatile uint32_t*)(0x42E01318UL))
#define bFM_CANFD0_NDAT1_ND7                      *((volatile uint32_t*)(0x42E0131CUL))
#define bFM4_CANFD0_NDAT1_ND7                     *((volatile uint32_t*)(0x42E0131CUL))
#define bFM_CANFD0_NDAT1_ND8                      *((volatile uint32_t*)(0x42E01320UL))
#define bFM4_CANFD0_NDAT1_ND8                     *((volatile uint32_t*)(0x42E01320UL))
#define bFM_CANFD0_NDAT1_ND9                      *((volatile uint32_t*)(0x42E01324UL))
#define bFM4_CANFD0_NDAT1_ND9                     *((volatile uint32_t*)(0x42E01324UL))
#define bFM_CANFD0_NDAT1_ND10                     *((volatile uint32_t*)(0x42E01328UL))
#define bFM4_CANFD0_NDAT1_ND10                    *((volatile uint32_t*)(0x42E01328UL))
#define bFM_CANFD0_NDAT1_ND11                     *((volatile uint32_t*)(0x42E0132CUL))
#define bFM4_CANFD0_NDAT1_ND11                    *((volatile uint32_t*)(0x42E0132CUL))
#define bFM_CANFD0_NDAT1_ND12                     *((volatile uint32_t*)(0x42E01330UL))
#define bFM4_CANFD0_NDAT1_ND12                    *((volatile uint32_t*)(0x42E01330UL))
#define bFM_CANFD0_NDAT1_ND13                     *((volatile uint32_t*)(0x42E01334UL))
#define bFM4_CANFD0_NDAT1_ND13                    *((volatile uint32_t*)(0x42E01334UL))
#define bFM_CANFD0_NDAT1_ND14                     *((volatile uint32_t*)(0x42E01338UL))
#define bFM4_CANFD0_NDAT1_ND14                    *((volatile uint32_t*)(0x42E01338UL))
#define bFM_CANFD0_NDAT1_ND15                     *((volatile uint32_t*)(0x42E0133CUL))
#define bFM4_CANFD0_NDAT1_ND15                    *((volatile uint32_t*)(0x42E0133CUL))
#define bFM_CANFD0_NDAT1_ND16                     *((volatile uint32_t*)(0x42E01340UL))
#define bFM4_CANFD0_NDAT1_ND16                    *((volatile uint32_t*)(0x42E01340UL))
#define bFM_CANFD0_NDAT1_ND17                     *((volatile uint32_t*)(0x42E01344UL))
#define bFM4_CANFD0_NDAT1_ND17                    *((volatile uint32_t*)(0x42E01344UL))
#define bFM_CANFD0_NDAT1_ND18                     *((volatile uint32_t*)(0x42E01348UL))
#define bFM4_CANFD0_NDAT1_ND18                    *((volatile uint32_t*)(0x42E01348UL))
#define bFM_CANFD0_NDAT1_ND19                     *((volatile uint32_t*)(0x42E0134CUL))
#define bFM4_CANFD0_NDAT1_ND19                    *((volatile uint32_t*)(0x42E0134CUL))
#define bFM_CANFD0_NDAT1_ND20                     *((volatile uint32_t*)(0x42E01350UL))
#define bFM4_CANFD0_NDAT1_ND20                    *((volatile uint32_t*)(0x42E01350UL))
#define bFM_CANFD0_NDAT1_ND21                     *((volatile uint32_t*)(0x42E01354UL))
#define bFM4_CANFD0_NDAT1_ND21                    *((volatile uint32_t*)(0x42E01354UL))
#define bFM_CANFD0_NDAT1_ND22                     *((volatile uint32_t*)(0x42E01358UL))
#define bFM4_CANFD0_NDAT1_ND22                    *((volatile uint32_t*)(0x42E01358UL))
#define bFM_CANFD0_NDAT1_ND23                     *((volatile uint32_t*)(0x42E0135CUL))
#define bFM4_CANFD0_NDAT1_ND23                    *((volatile uint32_t*)(0x42E0135CUL))
#define bFM_CANFD0_NDAT1_ND24                     *((volatile uint32_t*)(0x42E01360UL))
#define bFM4_CANFD0_NDAT1_ND24                    *((volatile uint32_t*)(0x42E01360UL))
#define bFM_CANFD0_NDAT1_ND25                     *((volatile uint32_t*)(0x42E01364UL))
#define bFM4_CANFD0_NDAT1_ND25                    *((volatile uint32_t*)(0x42E01364UL))
#define bFM_CANFD0_NDAT1_ND26                     *((volatile uint32_t*)(0x42E01368UL))
#define bFM4_CANFD0_NDAT1_ND26                    *((volatile uint32_t*)(0x42E01368UL))
#define bFM_CANFD0_NDAT1_ND27                     *((volatile uint32_t*)(0x42E0136CUL))
#define bFM4_CANFD0_NDAT1_ND27                    *((volatile uint32_t*)(0x42E0136CUL))
#define bFM_CANFD0_NDAT1_ND28                     *((volatile uint32_t*)(0x42E01370UL))
#define bFM4_CANFD0_NDAT1_ND28                    *((volatile uint32_t*)(0x42E01370UL))
#define bFM_CANFD0_NDAT1_ND29                     *((volatile uint32_t*)(0x42E01374UL))
#define bFM4_CANFD0_NDAT1_ND29                    *((volatile uint32_t*)(0x42E01374UL))
#define bFM_CANFD0_NDAT1_ND30                     *((volatile uint32_t*)(0x42E01378UL))
#define bFM4_CANFD0_NDAT1_ND30                    *((volatile uint32_t*)(0x42E01378UL))
#define bFM_CANFD0_NDAT1_ND31                     *((volatile uint32_t*)(0x42E0137CUL))
#define bFM4_CANFD0_NDAT1_ND31                    *((volatile uint32_t*)(0x42E0137CUL))

#define bFM_CANFD0_NDAT2_ND32                     *((volatile uint32_t*)(0x42E01380UL))
#define bFM4_CANFD0_NDAT2_ND32                    *((volatile uint32_t*)(0x42E01380UL))
#define bFM_CANFD0_NDAT2_ND33                     *((volatile uint32_t*)(0x42E01384UL))
#define bFM4_CANFD0_NDAT2_ND33                    *((volatile uint32_t*)(0x42E01384UL))
#define bFM_CANFD0_NDAT2_ND34                     *((volatile uint32_t*)(0x42E01388UL))
#define bFM4_CANFD0_NDAT2_ND34                    *((volatile uint32_t*)(0x42E01388UL))
#define bFM_CANFD0_NDAT2_ND35                     *((volatile uint32_t*)(0x42E0138CUL))
#define bFM4_CANFD0_NDAT2_ND35                    *((volatile uint32_t*)(0x42E0138CUL))
#define bFM_CANFD0_NDAT2_ND36                     *((volatile uint32_t*)(0x42E01390UL))
#define bFM4_CANFD0_NDAT2_ND36                    *((volatile uint32_t*)(0x42E01390UL))
#define bFM_CANFD0_NDAT2_ND37                     *((volatile uint32_t*)(0x42E01394UL))
#define bFM4_CANFD0_NDAT2_ND37                    *((volatile uint32_t*)(0x42E01394UL))
#define bFM_CANFD0_NDAT2_ND38                     *((volatile uint32_t*)(0x42E01398UL))
#define bFM4_CANFD0_NDAT2_ND38                    *((volatile uint32_t*)(0x42E01398UL))
#define bFM_CANFD0_NDAT2_ND39                     *((volatile uint32_t*)(0x42E0139CUL))
#define bFM4_CANFD0_NDAT2_ND39                    *((volatile uint32_t*)(0x42E0139CUL))
#define bFM_CANFD0_NDAT2_ND40                     *((volatile uint32_t*)(0x42E013A0UL))
#define bFM4_CANFD0_NDAT2_ND40                    *((volatile uint32_t*)(0x42E013A0UL))
#define bFM_CANFD0_NDAT2_ND41                     *((volatile uint32_t*)(0x42E013A4UL))
#define bFM4_CANFD0_NDAT2_ND41                    *((volatile uint32_t*)(0x42E013A4UL))
#define bFM_CANFD0_NDAT2_ND42                     *((volatile uint32_t*)(0x42E013A8UL))
#define bFM4_CANFD0_NDAT2_ND42                    *((volatile uint32_t*)(0x42E013A8UL))
#define bFM_CANFD0_NDAT2_ND43                     *((volatile uint32_t*)(0x42E013ACUL))
#define bFM4_CANFD0_NDAT2_ND43                    *((volatile uint32_t*)(0x42E013ACUL))
#define bFM_CANFD0_NDAT2_ND44                     *((volatile uint32_t*)(0x42E013B0UL))
#define bFM4_CANFD0_NDAT2_ND44                    *((volatile uint32_t*)(0x42E013B0UL))
#define bFM_CANFD0_NDAT2_ND45                     *((volatile uint32_t*)(0x42E013B4UL))
#define bFM4_CANFD0_NDAT2_ND45                    *((volatile uint32_t*)(0x42E013B4UL))
#define bFM_CANFD0_NDAT2_ND46                     *((volatile uint32_t*)(0x42E013B8UL))
#define bFM4_CANFD0_NDAT2_ND46                    *((volatile uint32_t*)(0x42E013B8UL))
#define bFM_CANFD0_NDAT2_ND47                     *((volatile uint32_t*)(0x42E013BCUL))
#define bFM4_CANFD0_NDAT2_ND47                    *((volatile uint32_t*)(0x42E013BCUL))
#define bFM_CANFD0_NDAT2_ND48                     *((volatile uint32_t*)(0x42E013C0UL))
#define bFM4_CANFD0_NDAT2_ND48                    *((volatile uint32_t*)(0x42E013C0UL))
#define bFM_CANFD0_NDAT2_ND49                     *((volatile uint32_t*)(0x42E013C4UL))
#define bFM4_CANFD0_NDAT2_ND49                    *((volatile uint32_t*)(0x42E013C4UL))
#define bFM_CANFD0_NDAT2_ND50                     *((volatile uint32_t*)(0x42E013C8UL))
#define bFM4_CANFD0_NDAT2_ND50                    *((volatile uint32_t*)(0x42E013C8UL))
#define bFM_CANFD0_NDAT2_ND51                     *((volatile uint32_t*)(0x42E013CCUL))
#define bFM4_CANFD0_NDAT2_ND51                    *((volatile uint32_t*)(0x42E013CCUL))
#define bFM_CANFD0_NDAT2_ND52                     *((volatile uint32_t*)(0x42E013D0UL))
#define bFM4_CANFD0_NDAT2_ND52                    *((volatile uint32_t*)(0x42E013D0UL))
#define bFM_CANFD0_NDAT2_ND53                     *((volatile uint32_t*)(0x42E013D4UL))
#define bFM4_CANFD0_NDAT2_ND53                    *((volatile uint32_t*)(0x42E013D4UL))
#define bFM_CANFD0_NDAT2_ND54                     *((volatile uint32_t*)(0x42E013D8UL))
#define bFM4_CANFD0_NDAT2_ND54                    *((volatile uint32_t*)(0x42E013D8UL))
#define bFM_CANFD0_NDAT2_ND55                     *((volatile uint32_t*)(0x42E013DCUL))
#define bFM4_CANFD0_NDAT2_ND55                    *((volatile uint32_t*)(0x42E013DCUL))
#define bFM_CANFD0_NDAT2_ND56                     *((volatile uint32_t*)(0x42E013E0UL))
#define bFM4_CANFD0_NDAT2_ND56                    *((volatile uint32_t*)(0x42E013E0UL))
#define bFM_CANFD0_NDAT2_ND57                     *((volatile uint32_t*)(0x42E013E4UL))
#define bFM4_CANFD0_NDAT2_ND57                    *((volatile uint32_t*)(0x42E013E4UL))
#define bFM_CANFD0_NDAT2_ND58                     *((volatile uint32_t*)(0x42E013E8UL))
#define bFM4_CANFD0_NDAT2_ND58                    *((volatile uint32_t*)(0x42E013E8UL))
#define bFM_CANFD0_NDAT2_ND59                     *((volatile uint32_t*)(0x42E013ECUL))
#define bFM4_CANFD0_NDAT2_ND59                    *((volatile uint32_t*)(0x42E013ECUL))
#define bFM_CANFD0_NDAT2_ND60                     *((volatile uint32_t*)(0x42E013F0UL))
#define bFM4_CANFD0_NDAT2_ND60                    *((volatile uint32_t*)(0x42E013F0UL))
#define bFM_CANFD0_NDAT2_ND61                     *((volatile uint32_t*)(0x42E013F4UL))
#define bFM4_CANFD0_NDAT2_ND61                    *((volatile uint32_t*)(0x42E013F4UL))
#define bFM_CANFD0_NDAT2_ND62                     *((volatile uint32_t*)(0x42E013F8UL))
#define bFM4_CANFD0_NDAT2_ND62                    *((volatile uint32_t*)(0x42E013F8UL))
#define bFM_CANFD0_NDAT2_ND63                     *((volatile uint32_t*)(0x42E013FCUL))
#define bFM4_CANFD0_NDAT2_ND63                    *((volatile uint32_t*)(0x42E013FCUL))

