neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_CANFD0_PSR_EP                         *((volatile uint32_t*)(0x42E00894UL))
#define bFM4_CANFD0_PSR_EP                        *((volatile uint32_t*)(0x42E00894UL))
#define bFM_CANFD0_PSR_EW                         *((volatile uint32_t*)(0x42E00898UL))
#define bFM4_CANFD0_PSR_EW                        *((volatile uint32_t*)(0x42E00898UL))
#define bFM_CANFD0_PSR_BO                         *((volatile uint32_t*)(0x42E0089CUL))
#define bFM4_CANFD0_PSR_BO                        *((volatile uint32_t*)(0x42E0089CUL))
#define bFM_CANFD0_PSR_RESI                       *((volatile uint32_t*)(0x42E008ACUL))
#define bFM4_CANFD0_PSR_RESI                      *((volatile uint32_t*)(0x42E008ACUL))
#define bFM_CANFD0_PSR_RBRS                       *((volatile uint32_t*)(0x42E008B0UL))
#define bFM4_CANFD0_PSR_RBRS                      *((volatile uint32_t*)(0x42E008B0UL))
#define bFM_CANFD0_PSR_REDL                       *((volatile uint32_t*)(0x42E008B4UL))
#define bFM4_CANFD0_PSR_REDL                      *((volatile uint32_t*)(0x42E008B4UL))

#define bFM_CANFD0_RXF0C_F0OM                     *((volatile uint32_t*)(0x42E0147CUL))
#define bFM4_CANFD0_RXF0C_F0OM                    *((volatile uint32_t*)(0x42E0147CUL))

#define bFM_CANFD0_RXF0S_F0F                      *((volatile uint32_t*)(0x42E014E0UL))
#define bFM4_CANFD0_RXF0S_F0F                     *((volatile uint32_t*)(0x42E014E0UL))
#define bFM_CANFD0_RXF0S_RF0L                     *((volatile uint32_t*)(0x42E014E4UL))
#define bFM4_CANFD0_RXF0S_RF0L                    *((volatile uint32_t*)(0x42E014E4UL))

#define bFM_CANFD0_RXF1C_F1OM                     *((volatile uint32_t*)(0x42E0167CUL))
#define bFM4_CANFD0_RXF1C_F1OM                    *((volatile uint32_t*)(0x42E0167CUL))

#define bFM_CANFD0_RXF1S_F1F                      *((volatile uint32_t*)(0x42E016E0UL))
#define bFM4_CANFD0_RXF1S_F1F                     *((volatile uint32_t*)(0x42E016E0UL))
#define bFM_CANFD0_RXF1S_RF1L                     *((volatile uint32_t*)(0x42E016E4UL))
#define bFM4_CANFD0_RXF1S_RF1L                    *((volatile uint32_t*)(0x42E016E4UL))

#define bFM_CANFD0_TEST_LBCK                      *((volatile uint32_t*)(0x42E00210UL))
#define bFM4_CANFD0_TEST_LBCK                     *((volatile uint32_t*)(0x42E00210UL))
#define bFM_CANFD0_TEST_RX                        *((volatile uint32_t*)(0x42E0021CUL))
#define bFM4_CANFD0_TEST_RX                       *((volatile uint32_t*)(0x42E0021CUL))

#define bFM_CANFD0_TOCC_ETOC                      *((volatile uint32_t*)(0x42E00500UL))
#define bFM4_CANFD0_TOCC_ETOC                     *((volatile uint32_t*)(0x42E00500UL))

#define bFM_CANFD0_TSCNTR_CCLR                    *((volatile uint32_t*)(0x42E04200UL))
#define bFM4_CANFD0_TSCNTR_CCLR                   *((volatile uint32_t*)(0x42E04200UL))

#define bFM_CANFD0_TSMDR_CNTEN                    *((volatile uint32_t*)(0x42E04240UL))
#define bFM4_CANFD0_TSMDR_CNTEN                   *((volatile uint32_t*)(0x42E04240UL))

#define bFM_CANFD0_TXBAR_AR0                      *((volatile uint32_t*)(0x42E01A00UL))
#define bFM4_CANFD0_TXBAR_AR0                     *((volatile uint32_t*)(0x42E01A00UL))
#define bFM_CANFD0_TXBAR_AR1                      *((volatile uint32_t*)(0x42E01A04UL))
#define bFM4_CANFD0_TXBAR_AR1                     *((volatile uint32_t*)(0x42E01A04UL))
#define bFM_CANFD0_TXBAR_AR2                      *((volatile uint32_t*)(0x42E01A08UL))
#define bFM4_CANFD0_TXBAR_AR2                     *((volatile uint32_t*)(0x42E01A08UL))
#define bFM_CANFD0_TXBAR_AR3                      *((volatile uint32_t*)(0x42E01A0CUL))
#define bFM4_CANFD0_TXBAR_AR3                     *((volatile uint32_t*)(0x42E01A0CUL))
#define bFM_CANFD0_TXBAR_AR4                      *((volatile uint32_t*)(0x42E01A10UL))
#define bFM4_CANFD0_TXBAR_AR4                     *((volatile uint32_t*)(0x42E01A10UL))
#define bFM_CANFD0_TXBAR_AR5                      *((volatile uint32_t*)(0x42E01A14UL))
#define bFM4_CANFD0_TXBAR_AR5                     *((volatile uint32_t*)(0x42E01A14UL))
#define bFM_CANFD0_TXBAR_AR6                      *((volatile uint32_t*)(0x42E01A18UL))
#define bFM4_CANFD0_TXBAR_AR6                     *((volatile uint32_t*)(0x42E01A18UL))
#define bFM_CANFD0_TXBAR_AR7                      *((volatile uint32_t*)(0x42E01A1CUL))
#define bFM4_CANFD0_TXBAR_AR7                     *((volatile uint32_t*)(0x42E01A1CUL))
#define bFM_CANFD0_TXBAR_AR8                      *((volatile uint32_t*)(0x42E01A20UL))
#define bFM4_CANFD0_TXBAR_AR8                     *((volatile uint32_t*)(0x42E01A20UL))
#define bFM_CANFD0_TXBAR_AR9                      *((volatile uint32_t*)(0x42E01A24UL))
#define bFM4_CANFD0_TXBAR_AR9                     *((volatile uint32_t*)(0x42E01A24UL))
#define bFM_CANFD0_TXBAR_AR10                     *((volatile uint32_t*)(0x42E01A28UL))
#define bFM4_CANFD0_TXBAR_AR10                    *((volatile uint32_t*)(0x42E01A28UL))
#define bFM_CANFD0_TXBAR_AR11                     *((volatile uint32_t*)(0x42E01A2CUL))
#define bFM4_CANFD0_TXBAR_AR11                    *((volatile uint32_t*)(0x42E01A2CUL))
#define bFM_CANFD0_TXBAR_AR12                     *((volatile uint32_t*)(0x42E01A30UL))
#define bFM4_CANFD0_TXBAR_AR12                    *((volatile uint32_t*)(0x42E01A30UL))
#define bFM_CANFD0_TXBAR_AR13                     *((volatile uint32_t*)(0x42E01A34UL))
#define bFM4_CANFD0_TXBAR_AR13                    *((volatile uint32_t*)(0x42E01A34UL))
#define bFM_CANFD0_TXBAR_AR14                     *((volatile uint32_t*)(0x42E01A38UL))
#define bFM4_CANFD0_TXBAR_AR14                    *((volatile uint32_t*)(0x42E01A38UL))
#define bFM_CANFD0_TXBAR_AR15                     *((volatile uint32_t*)(0x42E01A3CUL))
#define bFM4_CANFD0_TXBAR_AR15                    *((volatile uint32_t*)(0x42E01A3CUL))
#define bFM_CANFD0_TXBAR_AR16                     *((volatile uint32_t*)(0x42E01A40UL))
#define bFM4_CANFD0_TXBAR_AR16                    *((volatile uint32_t*)(0x42E01A40UL))
#define bFM_CANFD0_TXBAR_AR17                     *((volatile uint32_t*)(0x42E01A44UL))
#define bFM4_CANFD0_TXBAR_AR17                    *((volatile uint32_t*)(0x42E01A44UL))
#define bFM_CANFD0_TXBAR_AR18                     *((volatile uint32_t*)(0x42E01A48UL))
#define bFM4_CANFD0_TXBAR_AR18                    *((volatile uint32_t*)(0x42E01A48UL))
#define bFM_CANFD0_TXBAR_AR19                     *((volatile uint32_t*)(0x42E01A4CUL))
#define bFM4_CANFD0_TXBAR_AR19                    *((volatile uint32_t*)(0x42E01A4CUL))
#define bFM_CANFD0_TXBAR_AR20                     *((volatile uint32_t*)(0x42E01A50UL))
#define bFM4_CANFD0_TXBAR_AR20                    *((volatile uint32_t*)(0x42E01A50UL))
#define bFM_CANFD0_TXBAR_AR21                     *((volatile uint32_t*)(0x42E01A54UL))
#define bFM4_CANFD0_TXBAR_AR21                    *((volatile uint32_t*)(0x42E01A54UL))
#define bFM_CANFD0_TXBAR_AR22                     *((volatile uint32_t*)(0x42E01A58UL))
#define bFM4_CANFD0_TXBAR_AR22                    *((volatile uint32_t*)(0x42E01A58UL))
#define bFM_CANFD0_TXBAR_AR23                     *((volatile uint32_t*)(0x42E01A5CUL))
#define bFM4_CANFD0_TXBAR_AR23                    *((volatile uint32_t*)(0x42E01A5CUL))
#define bFM_CANFD0_TXBAR_AR24                     *((volatile uint32_t*)(0x42E01A60UL))
#define bFM4_CANFD0_TXBAR_AR24                    *((volatile uint32_t*)(0x42E01A60UL))
#define bFM_CANFD0_TXBAR_AR25                     *((volatile uint32_t*)(0x42E01A64UL))
#define bFM4_CANFD0_TXBAR_AR25                    *((volatile uint32_t*)(0x42E01A64UL))
#define bFM_CANFD0_TXBAR_AR26                     *((volatile uint32_t*)(0x42E01A68UL))
#define bFM4_CANFD0_TXBAR_AR26                    *((volatile uint32_t*)(0x42E01A68UL))
#define bFM_CANFD0_TXBAR_AR27                     *((volatile uint32_t*)(0x42E01A6CUL))
#define bFM4_CANFD0_TXBAR_AR27                    *((volatile uint32_t*)(0x42E01A6CUL))
#define bFM_CANFD0_TXBAR_AR28                     *((volatile uint32_t*)(0x42E01A70UL))
#define bFM4_CANFD0_TXBAR_AR28                    *((volatile uint32_t*)(0x42E01A70UL))
#define bFM_CANFD0_TXBAR_AR29                     *((volatile uint32_t*)(0x42E01A74UL))
#define bFM4_CANFD0_TXBAR_AR29                    *((volatile uint32_t*)(0x42E01A74UL))
#define bFM_CANFD0_TXBAR_AR30                     *((volatile uint32_t*)(0x42E01A78UL))
#define bFM4_CANFD0_TXBAR_AR30                    *((volatile uint32_t*)(0x42E01A78UL))
#define bFM_CANFD0_TXBAR_AR31                     *((volatile uint32_t*)(0x42E01A7CUL))
#define bFM4_CANFD0_TXBAR_AR31                    *((volatile uint32_t*)(0x42E01A7CUL))

#define bFM_CANFD0_TXBC_TFQM                      *((volatile uint32_t*)(0x42E01878UL))
#define bFM4_CANFD0_TXBC_TFQM                     *((volatile uint32_t*)(0x42E01878UL))

#define bFM_CANFD0_TXBCF_CF0                      *((volatile uint32_t*)(0x42E01B80UL))
#define bFM4_CANFD0_TXBCF_CF0                     *((volatile uint32_t*)(0x42E01B80UL))
#define bFM_CANFD0_TXBCF_CF1                      *((volatile uint32_t*)(0x42E01B84UL))
#define bFM4_CANFD0_TXBCF_CF1                     *((volatile uint32_t*)(0x42E01B84UL))
#define bFM_CANFD0_TXBCF_CF2                      *((volatile uint32_t*)(0x42E01B88UL))
#define bFM4_CANFD0_TXBCF_CF2                     *((volatile uint32_t*)(0x42E01B88UL))
#define bFM_CANFD0_TXBCF_CF3                      *((volatile uint32_t*)(0x42E01B8CUL))
#define bFM4_CANFD0_TXBCF_CF3                     *((volatile uint32_t*)(0x42E01B8CUL))
#define bFM_CANFD0_TXBCF_CF4                      *((volatile uint32_t*)(0x42E01B90UL))
#define bFM4_CANFD0_TXBCF_CF4                     *((volatile uint32_t*)(0x42E01B90UL))
#define bFM_CANFD0_TXBCF_CF5                      *((volatile uint32_t*)(0x42E01B94UL))
#define bFM4_CANFD0_TXBCF_CF5                     *((volatile uint32_t*)(0x42E01B94UL))
#define bFM_CANFD0_TXBCF_CF6                      *((volatile uint32_t*)(0x42E01B98UL))
#define bFM4_CANFD0_TXBCF_CF6                     *((volatile uint32_t*)(0x42E01B98UL))
#define bFM_CANFD0_TXBCF_CF7                      *((volatile uint32_t*)(0x42E01B9CUL))
#define bFM4_CANFD0_TXBCF_CF7                     *((volatile uint32_t*)(0x42E01B9CUL))
#define bFM_CANFD0_TXBCF_CF8                      *((volatile uint32_t*)(0x42E01BA0UL))
#define bFM4_CANFD0_TXBCF_CF8                     *((volatile uint32_t*)(0x42E01BA0UL))
#define bFM_CANFD0_TXBCF_CF9                      *((volatile uint32_t*)(0x42E01BA4UL))
#define bFM4_CANFD0_TXBCF_CF9                     *((volatile uint32_t*)(0x42E01BA4UL))
#define bFM_CANFD0_TXBCF_CF10                     *((volatile uint32_t*)(0x42E01BA8UL))
#define bFM4_CANFD0_TXBCF_CF10                    *((volatile uint32_t*)(0x42E01BA8UL))
#define bFM_CANFD0_TXBCF_CF11                     *((volatile uint32_t*)(0x42E01BACUL))
#define bFM4_CANFD0_TXBCF_CF11                    *((volatile uint32_t*)(0x42E01BACUL))
#define bFM_CANFD0_TXBCF_CF12                     *((volatile uint32_t*)(0x42E01BB0UL))
#define bFM4_CANFD0_TXBCF_CF12                    *((volatile uint32_t*)(0x42E01BB0UL))
#define bFM_CANFD0_TXBCF_CF13                     *((volatile uint32_t*)(0x42E01BB4UL))
#define bFM4_CANFD0_TXBCF_CF13                    *((volatile uint32_t*)(0x42E01BB4UL))
#define bFM_CANFD0_TXBCF_CF14                     *((volatile uint32_t*)(0x42E01BB8UL))
#define bFM4_CANFD0_TXBCF_CF14                    *((volatile uint32_t*)(0x42E01BB8UL))
#define bFM_CANFD0_TXBCF_CF15                     *((volatile uint32_t*)(0x42E01BBCUL))
#define bFM4_CANFD0_TXBCF_CF15                    *((volatile uint32_t*)(0x42E01BBCUL))
#define bFM_CANFD0_TXBCF_CF16                     *((volatile uint32_t*)(0x42E01BC0UL))
#define bFM4_CANFD0_TXBCF_CF16                    *((volatile uint32_t*)(0x42E01BC0UL))
#define bFM_CANFD0_TXBCF_CF17                     *((volatile uint32_t*)(0x42E01BC4UL))
#define bFM4_CANFD0_TXBCF_CF17                    *((volatile uint32_t*)(0x42E01BC4UL))
#define bFM_CANFD0_TXBCF_CF18                     *((volatile uint32_t*)(0x42E01BC8UL))
#define bFM4_CANFD0_TXBCF_CF18                    *((volatile uint32_t*)(0x42E01BC8UL))
#define bFM_CANFD0_TXBCF_CF19                     *((volatile uint32_t*)(0x42E01BCCUL))
#define bFM4_CANFD0_TXBCF_CF19                    *((volatile uint32_t*)(0x42E01BCCUL))
#define bFM_CANFD0_TXBCF_CF20                     *((volatile uint32_t*)(0x42E01BD0UL))
#define bFM4_CANFD0_TXBCF_CF20                    *((volatile uint32_t*)(0x42E01BD0UL))
#define bFM_CANFD0_TXBCF_CF21                     *((volatile uint32_t*)(0x42E01BD4UL))
#define bFM4_CANFD0_TXBCF_CF21                    *((volatile uint32_t*)(0x42E01BD4UL))
#define bFM_CANFD0_TXBCF_CF22                     *((volatile uint32_t*)(0x42E01BD8UL))
#define bFM4_CANFD0_TXBCF_CF22                    *((volatile uint32_t*)(0x42E01BD8UL))
#define bFM_CANFD0_TXBCF_CF23                     *((volatile uint32_t*)(0x42E01BDCUL))
#define bFM4_CANFD0_TXBCF_CF23                    *((volatile uint32_t*)(0x42E01BDCUL))
#define bFM_CANFD0_TXBCF_CF24                     *((volatile uint32_t*)(0x42E01BE0UL))
#define bFM4_CANFD0_TXBCF_CF24                    *((volatile uint32_t*)(0x42E01BE0UL))
#define bFM_CANFD0_TXBCF_CF25                     *((volatile uint32_t*)(0x42E01BE4UL))
#define bFM4_CANFD0_TXBCF_CF25                    *((volatile uint32_t*)(0x42E01BE4UL))
#define bFM_CANFD0_TXBCF_CF26                     *((volatile uint32_t*)(0x42E01BE8UL))
#define bFM4_CANFD0_TXBCF_CF26                    *((volatile uint32_t*)(0x42E01BE8UL))
#define bFM_CANFD0_TXBCF_CF27                     *((volatile uint32_t*)(0x42E01BECUL))
#define bFM4_CANFD0_TXBCF_CF27                    *((volatile uint32_t*)(0x42E01BECUL))
#define bFM_CANFD0_TXBCF_CF28                     *((volatile uint32_t*)(0x42E01BF0UL))
#define bFM4_CANFD0_TXBCF_CF28                    *((volatile uint32_t*)(0x42E01BF0UL))
#define bFM_CANFD0_TXBCF_CF29                     *((volatile uint32_t*)(0x42E01BF4UL))
#define bFM4_CANFD0_TXBCF_CF29                    *((volatile uint32_t*)(0x42E01BF4UL))
#define bFM_CANFD0_TXBCF_CF30                     *((volatile uint32_t*)(0x42E01BF8UL))
#define bFM4_CANFD0_TXBCF_CF30                    *((volatile uint32_t*)(0x42E01BF8UL))
#define bFM_CANFD0_TXBCF_CF31                     *((volatile uint32_t*)(0x42E01BFCUL))
#define bFM4_CANFD0_TXBCF_CF31                    *((volatile uint32_t*)(0x42E01BFCUL))

