neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_CANFD0_TXBCIE_CFIE0                   *((volatile uint32_t*)(0x42E01C80UL))
#define bFM4_CANFD0_TXBCIE_CFIE0                  *((volatile uint32_t*)(0x42E01C80UL))
#define bFM_CANFD0_TXBCIE_CFIE1                   *((volatile uint32_t*)(0x42E01C84UL))
#define bFM4_CANFD0_TXBCIE_CFIE1                  *((volatile uint32_t*)(0x42E01C84UL))
#define bFM_CANFD0_TXBCIE_CFIE2                   *((volatile uint32_t*)(0x42E01C88UL))
#define bFM4_CANFD0_TXBCIE_CFIE2                  *((volatile uint32_t*)(0x42E01C88UL))
#define bFM_CANFD0_TXBCIE_CFIE3                   *((volatile uint32_t*)(0x42E01C8CUL))
#define bFM4_CANFD0_TXBCIE_CFIE3                  *((volatile uint32_t*)(0x42E01C8CUL))
#define bFM_CANFD0_TXBCIE_CFIE4                   *((volatile uint32_t*)(0x42E01C90UL))
#define bFM4_CANFD0_TXBCIE_CFIE4                  *((volatile uint32_t*)(0x42E01C90UL))
#define bFM_CANFD0_TXBCIE_CFIE5                   *((volatile uint32_t*)(0x42E01C94UL))
#define bFM4_CANFD0_TXBCIE_CFIE5                  *((volatile uint32_t*)(0x42E01C94UL))
#define bFM_CANFD0_TXBCIE_CFIE6                   *((volatile uint32_t*)(0x42E01C98UL))
#define bFM4_CANFD0_TXBCIE_CFIE6                  *((volatile uint32_t*)(0x42E01C98UL))
#define bFM_CANFD0_TXBCIE_CFIE7                   *((volatile uint32_t*)(0x42E01C9CUL))
#define bFM4_CANFD0_TXBCIE_CFIE7                  *((volatile uint32_t*)(0x42E01C9CUL))
#define bFM_CANFD0_TXBCIE_CFIE8                   *((volatile uint32_t*)(0x42E01CA0UL))
#define bFM4_CANFD0_TXBCIE_CFIE8                  *((volatile uint32_t*)(0x42E01CA0UL))
#define bFM_CANFD0_TXBCIE_CFIE9                   *((volatile uint32_t*)(0x42E01CA4UL))
#define bFM4_CANFD0_TXBCIE_CFIE9                  *((volatile uint32_t*)(0x42E01CA4UL))
#define bFM_CANFD0_TXBCIE_CFIE10                  *((volatile uint32_t*)(0x42E01CA8UL))
#define bFM4_CANFD0_TXBCIE_CFIE10                 *((volatile uint32_t*)(0x42E01CA8UL))
#define bFM_CANFD0_TXBCIE_CFIE11                  *((volatile uint32_t*)(0x42E01CACUL))
#define bFM4_CANFD0_TXBCIE_CFIE11                 *((volatile uint32_t*)(0x42E01CACUL))
#define bFM_CANFD0_TXBCIE_CFIE12                  *((volatile uint32_t*)(0x42E01CB0UL))
#define bFM4_CANFD0_TXBCIE_CFIE12                 *((volatile uint32_t*)(0x42E01CB0UL))
#define bFM_CANFD0_TXBCIE_CFIE13                  *((volatile uint32_t*)(0x42E01CB4UL))
#define bFM4_CANFD0_TXBCIE_CFIE13                 *((volatile uint32_t*)(0x42E01CB4UL))
#define bFM_CANFD0_TXBCIE_CFIE14                  *((volatile uint32_t*)(0x42E01CB8UL))
#define bFM4_CANFD0_TXBCIE_CFIE14                 *((volatile uint32_t*)(0x42E01CB8UL))
#define bFM_CANFD0_TXBCIE_CFIE15                  *((volatile uint32_t*)(0x42E01CBCUL))
#define bFM4_CANFD0_TXBCIE_CFIE15                 *((volatile uint32_t*)(0x42E01CBCUL))
#define bFM_CANFD0_TXBCIE_CFIE16                  *((volatile uint32_t*)(0x42E01CC0UL))
#define bFM4_CANFD0_TXBCIE_CFIE16                 *((volatile uint32_t*)(0x42E01CC0UL))
#define bFM_CANFD0_TXBCIE_CFIE17                  *((volatile uint32_t*)(0x42E01CC4UL))
#define bFM4_CANFD0_TXBCIE_CFIE17                 *((volatile uint32_t*)(0x42E01CC4UL))
#define bFM_CANFD0_TXBCIE_CFIE18                  *((volatile uint32_t*)(0x42E01CC8UL))
#define bFM4_CANFD0_TXBCIE_CFIE18                 *((volatile uint32_t*)(0x42E01CC8UL))
#define bFM_CANFD0_TXBCIE_CFIE19                  *((volatile uint32_t*)(0x42E01CCCUL))
#define bFM4_CANFD0_TXBCIE_CFIE19                 *((volatile uint32_t*)(0x42E01CCCUL))
#define bFM_CANFD0_TXBCIE_CFIE20                  *((volatile uint32_t*)(0x42E01CD0UL))
#define bFM4_CANFD0_TXBCIE_CFIE20                 *((volatile uint32_t*)(0x42E01CD0UL))
#define bFM_CANFD0_TXBCIE_CFIE21                  *((volatile uint32_t*)(0x42E01CD4UL))
#define bFM4_CANFD0_TXBCIE_CFIE21                 *((volatile uint32_t*)(0x42E01CD4UL))
#define bFM_CANFD0_TXBCIE_CFIE22                  *((volatile uint32_t*)(0x42E01CD8UL))
#define bFM4_CANFD0_TXBCIE_CFIE22                 *((volatile uint32_t*)(0x42E01CD8UL))
#define bFM_CANFD0_TXBCIE_CFIE23                  *((volatile uint32_t*)(0x42E01CDCUL))
#define bFM4_CANFD0_TXBCIE_CFIE23                 *((volatile uint32_t*)(0x42E01CDCUL))
#define bFM_CANFD0_TXBCIE_CFIE24                  *((volatile uint32_t*)(0x42E01CE0UL))
#define bFM4_CANFD0_TXBCIE_CFIE24                 *((volatile uint32_t*)(0x42E01CE0UL))
#define bFM_CANFD0_TXBCIE_CFIE25                  *((volatile uint32_t*)(0x42E01CE4UL))
#define bFM4_CANFD0_TXBCIE_CFIE25                 *((volatile uint32_t*)(0x42E01CE4UL))
#define bFM_CANFD0_TXBCIE_CFIE26                  *((volatile uint32_t*)(0x42E01CE8UL))
#define bFM4_CANFD0_TXBCIE_CFIE26                 *((volatile uint32_t*)(0x42E01CE8UL))
#define bFM_CANFD0_TXBCIE_CFIE27                  *((volatile uint32_t*)(0x42E01CECUL))
#define bFM4_CANFD0_TXBCIE_CFIE27                 *((volatile uint32_t*)(0x42E01CECUL))
#define bFM_CANFD0_TXBCIE_CFIE28                  *((volatile uint32_t*)(0x42E01CF0UL))
#define bFM4_CANFD0_TXBCIE_CFIE28                 *((volatile uint32_t*)(0x42E01CF0UL))
#define bFM_CANFD0_TXBCIE_CFIE29                  *((volatile uint32_t*)(0x42E01CF4UL))
#define bFM4_CANFD0_TXBCIE_CFIE29                 *((volatile uint32_t*)(0x42E01CF4UL))
#define bFM_CANFD0_TXBCIE_CFIE30                  *((volatile uint32_t*)(0x42E01CF8UL))
#define bFM4_CANFD0_TXBCIE_CFIE30                 *((volatile uint32_t*)(0x42E01CF8UL))
#define bFM_CANFD0_TXBCIE_CFIE31                  *((volatile uint32_t*)(0x42E01CFCUL))
#define bFM4_CANFD0_TXBCIE_CFIE31                 *((volatile uint32_t*)(0x42E01CFCUL))

#define bFM_CANFD0_TXBCR_CR0                      *((volatile uint32_t*)(0x42E01A80UL))
#define bFM4_CANFD0_TXBCR_CR0                     *((volatile uint32_t*)(0x42E01A80UL))
#define bFM_CANFD0_TXBCR_CR1                      *((volatile uint32_t*)(0x42E01A84UL))
#define bFM4_CANFD0_TXBCR_CR1                     *((volatile uint32_t*)(0x42E01A84UL))
#define bFM_CANFD0_TXBCR_CR2                      *((volatile uint32_t*)(0x42E01A88UL))
#define bFM4_CANFD0_TXBCR_CR2                     *((volatile uint32_t*)(0x42E01A88UL))
#define bFM_CANFD0_TXBCR_CR3                      *((volatile uint32_t*)(0x42E01A8CUL))
#define bFM4_CANFD0_TXBCR_CR3                     *((volatile uint32_t*)(0x42E01A8CUL))
#define bFM_CANFD0_TXBCR_CR4                      *((volatile uint32_t*)(0x42E01A90UL))
#define bFM4_CANFD0_TXBCR_CR4                     *((volatile uint32_t*)(0x42E01A90UL))
#define bFM_CANFD0_TXBCR_CR5                      *((volatile uint32_t*)(0x42E01A94UL))
#define bFM4_CANFD0_TXBCR_CR5                     *((volatile uint32_t*)(0x42E01A94UL))
#define bFM_CANFD0_TXBCR_CR6                      *((volatile uint32_t*)(0x42E01A98UL))
#define bFM4_CANFD0_TXBCR_CR6                     *((volatile uint32_t*)(0x42E01A98UL))
#define bFM_CANFD0_TXBCR_CR7                      *((volatile uint32_t*)(0x42E01A9CUL))
#define bFM4_CANFD0_TXBCR_CR7                     *((volatile uint32_t*)(0x42E01A9CUL))
#define bFM_CANFD0_TXBCR_CR8                      *((volatile uint32_t*)(0x42E01AA0UL))
#define bFM4_CANFD0_TXBCR_CR8                     *((volatile uint32_t*)(0x42E01AA0UL))
#define bFM_CANFD0_TXBCR_CR9                      *((volatile uint32_t*)(0x42E01AA4UL))
#define bFM4_CANFD0_TXBCR_CR9                     *((volatile uint32_t*)(0x42E01AA4UL))
#define bFM_CANFD0_TXBCR_CR10                     *((volatile uint32_t*)(0x42E01AA8UL))
#define bFM4_CANFD0_TXBCR_CR10                    *((volatile uint32_t*)(0x42E01AA8UL))
#define bFM_CANFD0_TXBCR_CR11                     *((volatile uint32_t*)(0x42E01AACUL))
#define bFM4_CANFD0_TXBCR_CR11                    *((volatile uint32_t*)(0x42E01AACUL))
#define bFM_CANFD0_TXBCR_CR12                     *((volatile uint32_t*)(0x42E01AB0UL))
#define bFM4_CANFD0_TXBCR_CR12                    *((volatile uint32_t*)(0x42E01AB0UL))
#define bFM_CANFD0_TXBCR_CR13                     *((volatile uint32_t*)(0x42E01AB4UL))
#define bFM4_CANFD0_TXBCR_CR13                    *((volatile uint32_t*)(0x42E01AB4UL))
#define bFM_CANFD0_TXBCR_CR14                     *((volatile uint32_t*)(0x42E01AB8UL))
#define bFM4_CANFD0_TXBCR_CR14                    *((volatile uint32_t*)(0x42E01AB8UL))
#define bFM_CANFD0_TXBCR_CR15                     *((volatile uint32_t*)(0x42E01ABCUL))
#define bFM4_CANFD0_TXBCR_CR15                    *((volatile uint32_t*)(0x42E01ABCUL))
#define bFM_CANFD0_TXBCR_CR16                     *((volatile uint32_t*)(0x42E01AC0UL))
#define bFM4_CANFD0_TXBCR_CR16                    *((volatile uint32_t*)(0x42E01AC0UL))
#define bFM_CANFD0_TXBCR_CR17                     *((volatile uint32_t*)(0x42E01AC4UL))
#define bFM4_CANFD0_TXBCR_CR17                    *((volatile uint32_t*)(0x42E01AC4UL))
#define bFM_CANFD0_TXBCR_CR18                     *((volatile uint32_t*)(0x42E01AC8UL))
#define bFM4_CANFD0_TXBCR_CR18                    *((volatile uint32_t*)(0x42E01AC8UL))
#define bFM_CANFD0_TXBCR_CR19                     *((volatile uint32_t*)(0x42E01ACCUL))
#define bFM4_CANFD0_TXBCR_CR19                    *((volatile uint32_t*)(0x42E01ACCUL))
#define bFM_CANFD0_TXBCR_CR20                     *((volatile uint32_t*)(0x42E01AD0UL))
#define bFM4_CANFD0_TXBCR_CR20                    *((volatile uint32_t*)(0x42E01AD0UL))
#define bFM_CANFD0_TXBCR_CR21                     *((volatile uint32_t*)(0x42E01AD4UL))
#define bFM4_CANFD0_TXBCR_CR21                    *((volatile uint32_t*)(0x42E01AD4UL))
#define bFM_CANFD0_TXBCR_CR22                     *((volatile uint32_t*)(0x42E01AD8UL))
#define bFM4_CANFD0_TXBCR_CR22                    *((volatile uint32_t*)(0x42E01AD8UL))
#define bFM_CANFD0_TXBCR_CR23                     *((volatile uint32_t*)(0x42E01ADCUL))
#define bFM4_CANFD0_TXBCR_CR23                    *((volatile uint32_t*)(0x42E01ADCUL))
#define bFM_CANFD0_TXBCR_CR24                     *((volatile uint32_t*)(0x42E01AE0UL))
#define bFM4_CANFD0_TXBCR_CR24                    *((volatile uint32_t*)(0x42E01AE0UL))
#define bFM_CANFD0_TXBCR_CR25                     *((volatile uint32_t*)(0x42E01AE4UL))
#define bFM4_CANFD0_TXBCR_CR25                    *((volatile uint32_t*)(0x42E01AE4UL))
#define bFM_CANFD0_TXBCR_CR26                     *((volatile uint32_t*)(0x42E01AE8UL))
#define bFM4_CANFD0_TXBCR_CR26                    *((volatile uint32_t*)(0x42E01AE8UL))
#define bFM_CANFD0_TXBCR_CR27                     *((volatile uint32_t*)(0x42E01AECUL))
#define bFM4_CANFD0_TXBCR_CR27                    *((volatile uint32_t*)(0x42E01AECUL))
#define bFM_CANFD0_TXBCR_CR28                     *((volatile uint32_t*)(0x42E01AF0UL))
#define bFM4_CANFD0_TXBCR_CR28                    *((volatile uint32_t*)(0x42E01AF0UL))
#define bFM_CANFD0_TXBCR_CR29                     *((volatile uint32_t*)(0x42E01AF4UL))
#define bFM4_CANFD0_TXBCR_CR29                    *((volatile uint32_t*)(0x42E01AF4UL))
#define bFM_CANFD0_TXBCR_CR30                     *((volatile uint32_t*)(0x42E01AF8UL))
#define bFM4_CANFD0_TXBCR_CR30                    *((volatile uint32_t*)(0x42E01AF8UL))
#define bFM_CANFD0_TXBCR_CR31                     *((volatile uint32_t*)(0x42E01AFCUL))
#define bFM4_CANFD0_TXBCR_CR31                    *((volatile uint32_t*)(0x42E01AFCUL))

#define bFM_CANFD0_TXBRP_TRP0                     *((volatile uint32_t*)(0x42E01980UL))
#define bFM4_CANFD0_TXBRP_TRP0                    *((volatile uint32_t*)(0x42E01980UL))
#define bFM_CANFD0_TXBRP_TRP1                     *((volatile uint32_t*)(0x42E01984UL))
#define bFM4_CANFD0_TXBRP_TRP1                    *((volatile uint32_t*)(0x42E01984UL))
#define bFM_CANFD0_TXBRP_TRP2                     *((volatile uint32_t*)(0x42E01988UL))
#define bFM4_CANFD0_TXBRP_TRP2                    *((volatile uint32_t*)(0x42E01988UL))
#define bFM_CANFD0_TXBRP_TRP3                     *((volatile uint32_t*)(0x42E0198CUL))
#define bFM4_CANFD0_TXBRP_TRP3                    *((volatile uint32_t*)(0x42E0198CUL))
#define bFM_CANFD0_TXBRP_TRP4                     *((volatile uint32_t*)(0x42E01990UL))
#define bFM4_CANFD0_TXBRP_TRP4                    *((volatile uint32_t*)(0x42E01990UL))
#define bFM_CANFD0_TXBRP_TRP5                     *((volatile uint32_t*)(0x42E01994UL))
#define bFM4_CANFD0_TXBRP_TRP5                    *((volatile uint32_t*)(0x42E01994UL))
#define bFM_CANFD0_TXBRP_TRP6                     *((volatile uint32_t*)(0x42E01998UL))
#define bFM4_CANFD0_TXBRP_TRP6                    *((volatile uint32_t*)(0x42E01998UL))
#define bFM_CANFD0_TXBRP_TRP7                     *((volatile uint32_t*)(0x42E0199CUL))
#define bFM4_CANFD0_TXBRP_TRP7                    *((volatile uint32_t*)(0x42E0199CUL))
#define bFM_CANFD0_TXBRP_TRP8                     *((volatile uint32_t*)(0x42E019A0UL))
#define bFM4_CANFD0_TXBRP_TRP8                    *((volatile uint32_t*)(0x42E019A0UL))
#define bFM_CANFD0_TXBRP_TRP9                     *((volatile uint32_t*)(0x42E019A4UL))
#define bFM4_CANFD0_TXBRP_TRP9                    *((volatile uint32_t*)(0x42E019A4UL))
#define bFM_CANFD0_TXBRP_TRP10                    *((volatile uint32_t*)(0x42E019A8UL))
#define bFM4_CANFD0_TXBRP_TRP10                   *((volatile uint32_t*)(0x42E019A8UL))
#define bFM_CANFD0_TXBRP_TRP11                    *((volatile uint32_t*)(0x42E019ACUL))
#define bFM4_CANFD0_TXBRP_TRP11                   *((volatile uint32_t*)(0x42E019ACUL))
#define bFM_CANFD0_TXBRP_TRP12                    *((volatile uint32_t*)(0x42E019B0UL))
#define bFM4_CANFD0_TXBRP_TRP12                   *((volatile uint32_t*)(0x42E019B0UL))
#define bFM_CANFD0_TXBRP_TRP13                    *((volatile uint32_t*)(0x42E019B4UL))
#define bFM4_CANFD0_TXBRP_TRP13                   *((volatile uint32_t*)(0x42E019B4UL))
#define bFM_CANFD0_TXBRP_TRP14                    *((volatile uint32_t*)(0x42E019B8UL))
#define bFM4_CANFD0_TXBRP_TRP14                   *((volatile uint32_t*)(0x42E019B8UL))
#define bFM_CANFD0_TXBRP_TRP15                    *((volatile uint32_t*)(0x42E019BCUL))
#define bFM4_CANFD0_TXBRP_TRP15                   *((volatile uint32_t*)(0x42E019BCUL))
#define bFM_CANFD0_TXBRP_TRP16                    *((volatile uint32_t*)(0x42E019C0UL))
#define bFM4_CANFD0_TXBRP_TRP16                   *((volatile uint32_t*)(0x42E019C0UL))
#define bFM_CANFD0_TXBRP_TRP17                    *((volatile uint32_t*)(0x42E019C4UL))
#define bFM4_CANFD0_TXBRP_TRP17                   *((volatile uint32_t*)(0x42E019C4UL))
#define bFM_CANFD0_TXBRP_TRP18                    *((volatile uint32_t*)(0x42E019C8UL))
#define bFM4_CANFD0_TXBRP_TRP18                   *((volatile uint32_t*)(0x42E019C8UL))
#define bFM_CANFD0_TXBRP_TRP19                    *((volatile uint32_t*)(0x42E019CCUL))
#define bFM4_CANFD0_TXBRP_TRP19                   *((volatile uint32_t*)(0x42E019CCUL))
#define bFM_CANFD0_TXBRP_TRP20                    *((volatile uint32_t*)(0x42E019D0UL))
#define bFM4_CANFD0_TXBRP_TRP20                   *((volatile uint32_t*)(0x42E019D0UL))
#define bFM_CANFD0_TXBRP_TRP21                    *((volatile uint32_t*)(0x42E019D4UL))
#define bFM4_CANFD0_TXBRP_TRP21                   *((volatile uint32_t*)(0x42E019D4UL))
#define bFM_CANFD0_TXBRP_TRP22                    *((volatile uint32_t*)(0x42E019D8UL))
#define bFM4_CANFD0_TXBRP_TRP22                   *((volatile uint32_t*)(0x42E019D8UL))
#define bFM_CANFD0_TXBRP_TRP23                    *((volatile uint32_t*)(0x42E019DCUL))
#define bFM4_CANFD0_TXBRP_TRP23                   *((volatile uint32_t*)(0x42E019DCUL))
#define bFM_CANFD0_TXBRP_TRP24                    *((volatile uint32_t*)(0x42E019E0UL))
#define bFM4_CANFD0_TXBRP_TRP24                   *((volatile uint32_t*)(0x42E019E0UL))
#define bFM_CANFD0_TXBRP_TRP25                    *((volatile uint32_t*)(0x42E019E4UL))
#define bFM4_CANFD0_TXBRP_TRP25                   *((volatile uint32_t*)(0x42E019E4UL))
#define bFM_CANFD0_TXBRP_TRP26                    *((volatile uint32_t*)(0x42E019E8UL))
#define bFM4_CANFD0_TXBRP_TRP26                   *((volatile uint32_t*)(0x42E019E8UL))
#define bFM_CANFD0_TXBRP_TRP27                    *((volatile uint32_t*)(0x42E019ECUL))
#define bFM4_CANFD0_TXBRP_TRP27                   *((volatile uint32_t*)(0x42E019ECUL))
#define bFM_CANFD0_TXBRP_TRP28                    *((volatile uint32_t*)(0x42E019F0UL))
#define bFM4_CANFD0_TXBRP_TRP28                   *((volatile uint32_t*)(0x42E019F0UL))
#define bFM_CANFD0_TXBRP_TRP29                    *((volatile uint32_t*)(0x42E019F4UL))
#define bFM4_CANFD0_TXBRP_TRP29                   *((volatile uint32_t*)(0x42E019F4UL))
#define bFM_CANFD0_TXBRP_TRP30                    *((volatile uint32_t*)(0x42E019F8UL))
#define bFM4_CANFD0_TXBRP_TRP30                   *((volatile uint32_t*)(0x42E019F8UL))
#define bFM_CANFD0_TXBRP_TRP31                    *((volatile uint32_t*)(0x42E019FCUL))
#define bFM4_CANFD0_TXBRP_TRP31                   *((volatile uint32_t*)(0x42E019FCUL))

