neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** CANPRES Registers CANPRES
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** CLK_GATING Registers CLK_GATING
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_CLK_GATING_CKEN0_MFSCK0               *((volatile uint32_t*)(0x42782000UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK0              *((volatile uint32_t*)(0x42782000UL))
#define bFM_CLK_GATING_CKEN0_MFSCK1               *((volatile uint32_t*)(0x42782004UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK1              *((volatile uint32_t*)(0x42782004UL))
#define bFM_CLK_GATING_CKEN0_MFSCK2               *((volatile uint32_t*)(0x42782008UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK2              *((volatile uint32_t*)(0x42782008UL))
#define bFM_CLK_GATING_CKEN0_MFSCK3               *((volatile uint32_t*)(0x4278200CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK3              *((volatile uint32_t*)(0x4278200CUL))
#define bFM_CLK_GATING_CKEN0_MFSCK4               *((volatile uint32_t*)(0x42782010UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK4              *((volatile uint32_t*)(0x42782010UL))
#define bFM_CLK_GATING_CKEN0_MFSCK5               *((volatile uint32_t*)(0x42782014UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK5              *((volatile uint32_t*)(0x42782014UL))
#define bFM_CLK_GATING_CKEN0_MFSCK6               *((volatile uint32_t*)(0x42782018UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK6              *((volatile uint32_t*)(0x42782018UL))
#define bFM_CLK_GATING_CKEN0_MFSCK7               *((volatile uint32_t*)(0x4278201CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK7              *((volatile uint32_t*)(0x4278201CUL))
#define bFM_CLK_GATING_CKEN0_MFSCK8               *((volatile uint32_t*)(0x42782020UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK8              *((volatile uint32_t*)(0x42782020UL))
#define bFM_CLK_GATING_CKEN0_MFSCK9               *((volatile uint32_t*)(0x42782024UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK9              *((volatile uint32_t*)(0x42782024UL))
#define bFM_CLK_GATING_CKEN0_MFSCK10              *((volatile uint32_t*)(0x42782028UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK10             *((volatile uint32_t*)(0x42782028UL))
#define bFM_CLK_GATING_CKEN0_MFSCK11              *((volatile uint32_t*)(0x4278202CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK11             *((volatile uint32_t*)(0x4278202CUL))
#define bFM_CLK_GATING_CKEN0_MFSCK12              *((volatile uint32_t*)(0x42782030UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK12             *((volatile uint32_t*)(0x42782030UL))
#define bFM_CLK_GATING_CKEN0_MFSCK13              *((volatile uint32_t*)(0x42782034UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK13             *((volatile uint32_t*)(0x42782034UL))
#define bFM_CLK_GATING_CKEN0_MFSCK14              *((volatile uint32_t*)(0x42782038UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK14             *((volatile uint32_t*)(0x42782038UL))
#define bFM_CLK_GATING_CKEN0_MFSCK15              *((volatile uint32_t*)(0x4278203CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK15             *((volatile uint32_t*)(0x4278203CUL))
#define bFM_CLK_GATING_CKEN0_ADCCK0               *((volatile uint32_t*)(0x42782040UL))
#define bFM4_CLK_GATING_CKEN0_ADCCK0              *((volatile uint32_t*)(0x42782040UL))
#define bFM_CLK_GATING_CKEN0_ADCCK1               *((volatile uint32_t*)(0x42782044UL))
#define bFM4_CLK_GATING_CKEN0_ADCCK1              *((volatile uint32_t*)(0x42782044UL))
#define bFM_CLK_GATING_CKEN0_ADCCK2               *((volatile uint32_t*)(0x42782048UL))
#define bFM4_CLK_GATING_CKEN0_ADCCK2              *((volatile uint32_t*)(0x42782048UL))
#define bFM_CLK_GATING_CKEN0_ADCCK3               *((volatile uint32_t*)(0x4278204CUL))
#define bFM4_CLK_GATING_CKEN0_ADCCK3              *((volatile uint32_t*)(0x4278204CUL))
#define bFM_CLK_GATING_CKEN0_DMACK                *((volatile uint32_t*)(0x42782060UL))
#define bFM4_CLK_GATING_CKEN0_DMACK               *((volatile uint32_t*)(0x42782060UL))
#define bFM_CLK_GATING_CKEN0_EXBCK                *((volatile uint32_t*)(0x42782068UL))
#define bFM4_CLK_GATING_CKEN0_EXBCK               *((volatile uint32_t*)(0x42782068UL))
#define bFM_CLK_GATING_CKEN0_GIOCK                *((volatile uint32_t*)(0x42782070UL))
#define bFM4_CLK_GATING_CKEN0_GIOCK               *((volatile uint32_t*)(0x42782070UL))

#define bFM_CLK_GATING_CKEN1_BTMCK0               *((volatile uint32_t*)(0x42782200UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK0              *((volatile uint32_t*)(0x42782200UL))
#define bFM_CLK_GATING_CKEN1_BTMCK1               *((volatile uint32_t*)(0x42782204UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK1              *((volatile uint32_t*)(0x42782204UL))
#define bFM_CLK_GATING_CKEN1_BTMCK2               *((volatile uint32_t*)(0x42782208UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK2              *((volatile uint32_t*)(0x42782208UL))
#define bFM_CLK_GATING_CKEN1_BTMCK3               *((volatile uint32_t*)(0x4278220CUL))
#define bFM4_CLK_GATING_CKEN1_BTMCK3              *((volatile uint32_t*)(0x4278220CUL))
#define bFM_CLK_GATING_CKEN1_MFTCK0               *((volatile uint32_t*)(0x42782220UL))
#define bFM4_CLK_GATING_CKEN1_MFTCK0              *((volatile uint32_t*)(0x42782220UL))
#define bFM_CLK_GATING_CKEN1_MFTCK1               *((volatile uint32_t*)(0x42782224UL))
#define bFM4_CLK_GATING_CKEN1_MFTCK1              *((volatile uint32_t*)(0x42782224UL))
#define bFM_CLK_GATING_CKEN1_MFTCK2               *((volatile uint32_t*)(0x42782228UL))
#define bFM4_CLK_GATING_CKEN1_MFTCK2              *((volatile uint32_t*)(0x42782228UL))
#define bFM_CLK_GATING_CKEN1_MFTCK3               *((volatile uint32_t*)(0x4278222CUL))
#define bFM4_CLK_GATING_CKEN1_MFTCK3              *((volatile uint32_t*)(0x4278222CUL))
#define bFM_CLK_GATING_CKEN1_QDUCK0               *((volatile uint32_t*)(0x42782240UL))
#define bFM4_CLK_GATING_CKEN1_QDUCK0              *((volatile uint32_t*)(0x42782240UL))
#define bFM_CLK_GATING_CKEN1_QDUCK1               *((volatile uint32_t*)(0x42782244UL))
#define bFM4_CLK_GATING_CKEN1_QDUCK1              *((volatile uint32_t*)(0x42782244UL))
#define bFM_CLK_GATING_CKEN1_QDUCK2               *((volatile uint32_t*)(0x42782248UL))
#define bFM4_CLK_GATING_CKEN1_QDUCK2              *((volatile uint32_t*)(0x42782248UL))
#define bFM_CLK_GATING_CKEN1_QDUCK3               *((volatile uint32_t*)(0x4278224CUL))
#define bFM4_CLK_GATING_CKEN1_QDUCK3              *((volatile uint32_t*)(0x4278224CUL))

#define bFM_CLK_GATING_CKEN2_USBCK0               *((volatile uint32_t*)(0x42782400UL))
#define bFM4_CLK_GATING_CKEN2_USBCK0              *((volatile uint32_t*)(0x42782400UL))
#define bFM_CLK_GATING_CKEN2_USBCK1               *((volatile uint32_t*)(0x42782404UL))
#define bFM4_CLK_GATING_CKEN2_USBCK1              *((volatile uint32_t*)(0x42782404UL))
#define bFM_CLK_GATING_CKEN2_CANCK0               *((volatile uint32_t*)(0x42782410UL))
#define bFM4_CLK_GATING_CKEN2_CANCK0              *((volatile uint32_t*)(0x42782410UL))
#define bFM_CLK_GATING_CKEN2_CANCK1               *((volatile uint32_t*)(0x42782414UL))
#define bFM4_CLK_GATING_CKEN2_CANCK1              *((volatile uint32_t*)(0x42782414UL))
#define bFM_CLK_GATING_CKEN2_CANCK2               *((volatile uint32_t*)(0x42782418UL))
#define bFM4_CLK_GATING_CKEN2_CANCK2              *((volatile uint32_t*)(0x42782418UL))
#define bFM_CLK_GATING_CKEN2_SDCCK                *((volatile uint32_t*)(0x42782420UL))
#define bFM4_CLK_GATING_CKEN2_SDCCK               *((volatile uint32_t*)(0x42782420UL))
#define bFM_CLK_GATING_CKEN2_I2SCK0               *((volatile uint32_t*)(0x42782440UL))
#define bFM4_CLK_GATING_CKEN2_I2SCK0              *((volatile uint32_t*)(0x42782440UL))
#define bFM_CLK_GATING_CKEN2_I2SCK1               *((volatile uint32_t*)(0x42782444UL))
#define bFM4_CLK_GATING_CKEN2_I2SCK1              *((volatile uint32_t*)(0x42782444UL))
#define bFM_CLK_GATING_CKEN2_PCRCCK               *((volatile uint32_t*)(0x42782450UL))
#define bFM4_CLK_GATING_CKEN2_PCRCCK              *((volatile uint32_t*)(0x42782450UL))
#define bFM_CLK_GATING_CKEN2_CECCK0               *((volatile uint32_t*)(0x42782460UL))
#define bFM4_CLK_GATING_CKEN2_CECCK0              *((volatile uint32_t*)(0x42782460UL))
#define bFM_CLK_GATING_CKEN2_CECCK1               *((volatile uint32_t*)(0x42782464UL))
#define bFM4_CLK_GATING_CKEN2_CECCK1              *((volatile uint32_t*)(0x42782464UL))
#define bFM_CLK_GATING_CKEN2_HSSPICK              *((volatile uint32_t*)(0x42782470UL))
#define bFM4_CLK_GATING_CKEN2_HSSPICK             *((volatile uint32_t*)(0x42782470UL))

