neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_CLK_GATING_MRST0_MFSRST0              *((volatile uint32_t*)(0x42782080UL))
#define bFM4_CLK_GATING_MRST0_MFSRST0             *((volatile uint32_t*)(0x42782080UL))
#define bFM_CLK_GATING_MRST0_MFSRST1              *((volatile uint32_t*)(0x42782084UL))
#define bFM4_CLK_GATING_MRST0_MFSRST1             *((volatile uint32_t*)(0x42782084UL))
#define bFM_CLK_GATING_MRST0_MFSRST2              *((volatile uint32_t*)(0x42782088UL))
#define bFM4_CLK_GATING_MRST0_MFSRST2             *((volatile uint32_t*)(0x42782088UL))
#define bFM_CLK_GATING_MRST0_MFSRST3              *((volatile uint32_t*)(0x4278208CUL))
#define bFM4_CLK_GATING_MRST0_MFSRST3             *((volatile uint32_t*)(0x4278208CUL))
#define bFM_CLK_GATING_MRST0_MFSRST4              *((volatile uint32_t*)(0x42782090UL))
#define bFM4_CLK_GATING_MRST0_MFSRST4             *((volatile uint32_t*)(0x42782090UL))
#define bFM_CLK_GATING_MRST0_MFSRST5              *((volatile uint32_t*)(0x42782094UL))
#define bFM4_CLK_GATING_MRST0_MFSRST5             *((volatile uint32_t*)(0x42782094UL))
#define bFM_CLK_GATING_MRST0_MFSRST6              *((volatile uint32_t*)(0x42782098UL))
#define bFM4_CLK_GATING_MRST0_MFSRST6             *((volatile uint32_t*)(0x42782098UL))
#define bFM_CLK_GATING_MRST0_MFSRST7              *((volatile uint32_t*)(0x4278209CUL))
#define bFM4_CLK_GATING_MRST0_MFSRST7             *((volatile uint32_t*)(0x4278209CUL))
#define bFM_CLK_GATING_MRST0_MFSRST8              *((volatile uint32_t*)(0x427820A0UL))
#define bFM4_CLK_GATING_MRST0_MFSRST8             *((volatile uint32_t*)(0x427820A0UL))
#define bFM_CLK_GATING_MRST0_MFSRST9              *((volatile uint32_t*)(0x427820A4UL))
#define bFM4_CLK_GATING_MRST0_MFSRST9             *((volatile uint32_t*)(0x427820A4UL))
#define bFM_CLK_GATING_MRST0_MFSRST10             *((volatile uint32_t*)(0x427820A8UL))
#define bFM4_CLK_GATING_MRST0_MFSRST10            *((volatile uint32_t*)(0x427820A8UL))
#define bFM_CLK_GATING_MRST0_MFSRST11             *((volatile uint32_t*)(0x427820ACUL))
#define bFM4_CLK_GATING_MRST0_MFSRST11            *((volatile uint32_t*)(0x427820ACUL))
#define bFM_CLK_GATING_MRST0_MFSRST12             *((volatile uint32_t*)(0x427820B0UL))
#define bFM4_CLK_GATING_MRST0_MFSRST12            *((volatile uint32_t*)(0x427820B0UL))
#define bFM_CLK_GATING_MRST0_MFSRST13             *((volatile uint32_t*)(0x427820B4UL))
#define bFM4_CLK_GATING_MRST0_MFSRST13            *((volatile uint32_t*)(0x427820B4UL))
#define bFM_CLK_GATING_MRST0_MFSRST14             *((volatile uint32_t*)(0x427820B8UL))
#define bFM4_CLK_GATING_MRST0_MFSRST14            *((volatile uint32_t*)(0x427820B8UL))
#define bFM_CLK_GATING_MRST0_MFSRST15             *((volatile uint32_t*)(0x427820BCUL))
#define bFM4_CLK_GATING_MRST0_MFSRST15            *((volatile uint32_t*)(0x427820BCUL))
#define bFM_CLK_GATING_MRST0_ADCRST0              *((volatile uint32_t*)(0x427820C0UL))
#define bFM4_CLK_GATING_MRST0_ADCRST0             *((volatile uint32_t*)(0x427820C0UL))
#define bFM_CLK_GATING_MRST0_ADCRST1              *((volatile uint32_t*)(0x427820C4UL))
#define bFM4_CLK_GATING_MRST0_ADCRST1             *((volatile uint32_t*)(0x427820C4UL))
#define bFM_CLK_GATING_MRST0_ADCRST2              *((volatile uint32_t*)(0x427820C8UL))
#define bFM4_CLK_GATING_MRST0_ADCRST2             *((volatile uint32_t*)(0x427820C8UL))
#define bFM_CLK_GATING_MRST0_ADCRST3              *((volatile uint32_t*)(0x427820CCUL))
#define bFM4_CLK_GATING_MRST0_ADCRST3             *((volatile uint32_t*)(0x427820CCUL))
#define bFM_CLK_GATING_MRST0_DMARST               *((volatile uint32_t*)(0x427820E0UL))
#define bFM4_CLK_GATING_MRST0_DMARST              *((volatile uint32_t*)(0x427820E0UL))
#define bFM_CLK_GATING_MRST0_EXBRST               *((volatile uint32_t*)(0x427820E8UL))
#define bFM4_CLK_GATING_MRST0_EXBRST              *((volatile uint32_t*)(0x427820E8UL))

#define bFM_CLK_GATING_MRST1_BTMRST0              *((volatile uint32_t*)(0x42782280UL))
#define bFM4_CLK_GATING_MRST1_BTMRST0             *((volatile uint32_t*)(0x42782280UL))
#define bFM_CLK_GATING_MRST1_BTMRST1              *((volatile uint32_t*)(0x42782284UL))
#define bFM4_CLK_GATING_MRST1_BTMRST1             *((volatile uint32_t*)(0x42782284UL))
#define bFM_CLK_GATING_MRST1_BTMRST2              *((volatile uint32_t*)(0x42782288UL))
#define bFM4_CLK_GATING_MRST1_BTMRST2             *((volatile uint32_t*)(0x42782288UL))
#define bFM_CLK_GATING_MRST1_BTMRST3              *((volatile uint32_t*)(0x4278228CUL))
#define bFM4_CLK_GATING_MRST1_BTMRST3             *((volatile uint32_t*)(0x4278228CUL))
#define bFM_CLK_GATING_MRST1_MFTRST0              *((volatile uint32_t*)(0x427822A0UL))
#define bFM4_CLK_GATING_MRST1_MFTRST0             *((volatile uint32_t*)(0x427822A0UL))
#define bFM_CLK_GATING_MRST1_MFTRST1              *((volatile uint32_t*)(0x427822A4UL))
#define bFM4_CLK_GATING_MRST1_MFTRST1             *((volatile uint32_t*)(0x427822A4UL))
#define bFM_CLK_GATING_MRST1_MFTRST2              *((volatile uint32_t*)(0x427822A8UL))
#define bFM4_CLK_GATING_MRST1_MFTRST2             *((volatile uint32_t*)(0x427822A8UL))
#define bFM_CLK_GATING_MRST1_MFTRST3              *((volatile uint32_t*)(0x427822ACUL))
#define bFM4_CLK_GATING_MRST1_MFTRST3             *((volatile uint32_t*)(0x427822ACUL))
#define bFM_CLK_GATING_MRST1_QDURST0              *((volatile uint32_t*)(0x427822C0UL))
#define bFM4_CLK_GATING_MRST1_QDURST0             *((volatile uint32_t*)(0x427822C0UL))
#define bFM_CLK_GATING_MRST1_QDURST1              *((volatile uint32_t*)(0x427822C4UL))
#define bFM4_CLK_GATING_MRST1_QDURST1             *((volatile uint32_t*)(0x427822C4UL))
#define bFM_CLK_GATING_MRST1_QDURST2              *((volatile uint32_t*)(0x427822C8UL))
#define bFM4_CLK_GATING_MRST1_QDURST2             *((volatile uint32_t*)(0x427822C8UL))
#define bFM_CLK_GATING_MRST1_QDURST3              *((volatile uint32_t*)(0x427822CCUL))
#define bFM4_CLK_GATING_MRST1_QDURST3             *((volatile uint32_t*)(0x427822CCUL))

#define bFM_CLK_GATING_MRST2_USBRST0              *((volatile uint32_t*)(0x42782480UL))
#define bFM4_CLK_GATING_MRST2_USBRST0             *((volatile uint32_t*)(0x42782480UL))
#define bFM_CLK_GATING_MRST2_USBRST1              *((volatile uint32_t*)(0x42782484UL))
#define bFM4_CLK_GATING_MRST2_USBRST1             *((volatile uint32_t*)(0x42782484UL))
#define bFM_CLK_GATING_MRST2_CANRST0              *((volatile uint32_t*)(0x42782490UL))
#define bFM4_CLK_GATING_MRST2_CANRST0             *((volatile uint32_t*)(0x42782490UL))
#define bFM_CLK_GATING_MRST2_CANRST1              *((volatile uint32_t*)(0x42782494UL))
#define bFM4_CLK_GATING_MRST2_CANRST1             *((volatile uint32_t*)(0x42782494UL))
#define bFM_CLK_GATING_MRST2_CANRST2              *((volatile uint32_t*)(0x42782498UL))
#define bFM4_CLK_GATING_MRST2_CANRST2             *((volatile uint32_t*)(0x42782498UL))
#define bFM_CLK_GATING_MRST2_SDCRST               *((volatile uint32_t*)(0x427824A0UL))
#define bFM4_CLK_GATING_MRST2_SDCRST              *((volatile uint32_t*)(0x427824A0UL))
#define bFM_CLK_GATING_MRST2_I2SRST0              *((volatile uint32_t*)(0x427824C0UL))
#define bFM4_CLK_GATING_MRST2_I2SRST0             *((volatile uint32_t*)(0x427824C0UL))
#define bFM_CLK_GATING_MRST2_I2SRST1              *((volatile uint32_t*)(0x427824C4UL))
#define bFM4_CLK_GATING_MRST2_I2SRST1             *((volatile uint32_t*)(0x427824C4UL))
#define bFM_CLK_GATING_MRST2_PCRCRST              *((volatile uint32_t*)(0x427824D0UL))
#define bFM4_CLK_GATING_MRST2_PCRCRST             *((volatile uint32_t*)(0x427824D0UL))
#define bFM_CLK_GATING_MRST2_CECRST0              *((volatile uint32_t*)(0x427824E0UL))
#define bFM4_CLK_GATING_MRST2_CECRST0             *((volatile uint32_t*)(0x427824E0UL))
#define bFM_CLK_GATING_MRST2_CECRST1              *((volatile uint32_t*)(0x427824E4UL))
#define bFM4_CLK_GATING_MRST2_CECRST1             *((volatile uint32_t*)(0x427824E4UL))
#define bFM_CLK_GATING_MRST2_HSSPIRST             *((volatile uint32_t*)(0x427824F0UL))
#define bFM4_CLK_GATING_MRST2_HSSPIRST            *((volatile uint32_t*)(0x427824F0UL))


