neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_CRG_PSW_TMR_PINC                      *((volatile uint32_t*)(0x42200690UL))
#define bFM4_CRG_PSW_TMR_PINC                     *((volatile uint32_t*)(0x42200690UL))

#define bFM_CRG_RST_STR_PONR                      *((volatile uint32_t*)(0x42200180UL))
#define bFM4_CRG_RST_STR_PONR                     *((volatile uint32_t*)(0x42200180UL))
#define bFM_CRG_RST_STR_INITX                     *((volatile uint32_t*)(0x42200184UL))
#define bFM4_CRG_RST_STR_INITX                    *((volatile uint32_t*)(0x42200184UL))
#define bFM_CRG_RST_STR_SWDT                      *((volatile uint32_t*)(0x42200190UL))
#define bFM4_CRG_RST_STR_SWDT                     *((volatile uint32_t*)(0x42200190UL))
#define bFM_CRG_RST_STR_HWDT                      *((volatile uint32_t*)(0x42200194UL))
#define bFM4_CRG_RST_STR_HWDT                     *((volatile uint32_t*)(0x42200194UL))
#define bFM_CRG_RST_STR_CSVR                      *((volatile uint32_t*)(0x42200198UL))
#define bFM4_CRG_RST_STR_CSVR                     *((volatile uint32_t*)(0x42200198UL))
#define bFM_CRG_RST_STR_FCSR                      *((volatile uint32_t*)(0x4220019CUL))
#define bFM4_CRG_RST_STR_FCSR                     *((volatile uint32_t*)(0x4220019CUL))
#define bFM_CRG_RST_STR_SRST                      *((volatile uint32_t*)(0x422001A0UL))
#define bFM4_CRG_RST_STR_SRST                     *((volatile uint32_t*)(0x422001A0UL))

#define bFM_CRG_SCM_CTL_MOSCE                     *((volatile uint32_t*)(0x42200004UL))
#define bFM4_CRG_SCM_CTL_MOSCE                    *((volatile uint32_t*)(0x42200004UL))
#define bFM_CRG_SCM_CTL_SOSCE                     *((volatile uint32_t*)(0x4220000CUL))
#define bFM4_CRG_SCM_CTL_SOSCE                    *((volatile uint32_t*)(0x4220000CUL))
#define bFM_CRG_SCM_CTL_PLLE                      *((volatile uint32_t*)(0x42200010UL))
#define bFM4_CRG_SCM_CTL_PLLE                     *((volatile uint32_t*)(0x42200010UL))

#define bFM_CRG_SCM_STR_MORDY                     *((volatile uint32_t*)(0x42200084UL))
#define bFM4_CRG_SCM_STR_MORDY                    *((volatile uint32_t*)(0x42200084UL))
#define bFM_CRG_SCM_STR_SORDY                     *((volatile uint32_t*)(0x4220008CUL))
#define bFM4_CRG_SCM_STR_SORDY                    *((volatile uint32_t*)(0x4220008CUL))
#define bFM_CRG_SCM_STR_PLRDY                     *((volatile uint32_t*)(0x42200090UL))
#define bFM4_CRG_SCM_STR_PLRDY                    *((volatile uint32_t*)(0x42200090UL))

#define bFM_CRG_STB_CTL_DSTM                      *((volatile uint32_t*)(0x42200108UL))
#define bFM4_CRG_STB_CTL_DSTM                     *((volatile uint32_t*)(0x42200108UL))
#define bFM_CRG_STB_CTL_SPL                       *((volatile uint32_t*)(0x42200110UL))
#define bFM4_CRG_STB_CTL_SPL                      *((volatile uint32_t*)(0x42200110UL))


/******************************************************************************
 ** CRTRIM Registers CRTRIM
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** DAC Registers DAC0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_DAC0_DACR_DAE                         *((volatile uint32_t*)(0x42660000UL))
#define bFM4_DAC0_DACR_DAE                        *((volatile uint32_t*)(0x42660000UL))
#define bFM_DAC0_DACR_DRDY                        *((volatile uint32_t*)(0x42660004UL))
#define bFM4_DAC0_DACR_DRDY                       *((volatile uint32_t*)(0x42660004UL))
#define bFM_DAC0_DACR_DAC10                       *((volatile uint32_t*)(0x42660010UL))
#define bFM4_DAC0_DACR_DAC10                      *((volatile uint32_t*)(0x42660010UL))
#define bFM_DAC0_DACR_DDAS                        *((volatile uint32_t*)(0x42660014UL))
#define bFM4_DAC0_DACR_DDAS                       *((volatile uint32_t*)(0x42660014UL))


/******************************************************************************
 ** DAC Registers DAC1
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_DAC1_DACR_DAE                         *((volatile uint32_t*)(0x42660100UL))
#define bFM4_DAC1_DACR_DAE                        *((volatile uint32_t*)(0x42660100UL))
#define bFM_DAC1_DACR_DRDY                        *((volatile uint32_t*)(0x42660104UL))
#define bFM4_DAC1_DACR_DRDY                       *((volatile uint32_t*)(0x42660104UL))
#define bFM_DAC1_DACR_DAC10                       *((volatile uint32_t*)(0x42660110UL))
#define bFM4_DAC1_DACR_DAC10                      *((volatile uint32_t*)(0x42660110UL))
#define bFM_DAC1_DACR_DDAS                        *((volatile uint32_t*)(0x42660114UL))
#define bFM4_DAC1_DACR_DDAS                       *((volatile uint32_t*)(0x42660114UL))


/******************************************************************************
 ** DMAC Registers DMAC
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_DMAC_DMACA0_ST                        *((volatile uint32_t*)(0x42C00274UL))
#define bFM4_DMAC_DMACA0_ST                       *((volatile uint32_t*)(0x42C00274UL))
#define bFM_DMAC_DMACA0_PB                        *((volatile uint32_t*)(0x42C00278UL))
#define bFM4_DMAC_DMACA0_PB                       *((volatile uint32_t*)(0x42C00278UL))
#define bFM_DMAC_DMACA0_EB                        *((volatile uint32_t*)(0x42C0027CUL))
#define bFM4_DMAC_DMACA0_EB                       *((volatile uint32_t*)(0x42C0027CUL))

#define bFM_DMAC_DMACA1_ST                        *((volatile uint32_t*)(0x42C00474UL))
#define bFM4_DMAC_DMACA1_ST                       *((volatile uint32_t*)(0x42C00474UL))
#define bFM_DMAC_DMACA1_PB                        *((volatile uint32_t*)(0x42C00478UL))
#define bFM4_DMAC_DMACA1_PB                       *((volatile uint32_t*)(0x42C00478UL))
#define bFM_DMAC_DMACA1_EB                        *((volatile uint32_t*)(0x42C0047CUL))
#define bFM4_DMAC_DMACA1_EB                       *((volatile uint32_t*)(0x42C0047CUL))

