neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_DMAC_DMACA2_ST                        *((volatile uint32_t*)(0x42C00674UL))
#define bFM4_DMAC_DMACA2_ST                       *((volatile uint32_t*)(0x42C00674UL))
#define bFM_DMAC_DMACA2_PB                        *((volatile uint32_t*)(0x42C00678UL))
#define bFM4_DMAC_DMACA2_PB                       *((volatile uint32_t*)(0x42C00678UL))
#define bFM_DMAC_DMACA2_EB                        *((volatile uint32_t*)(0x42C0067CUL))
#define bFM4_DMAC_DMACA2_EB                       *((volatile uint32_t*)(0x42C0067CUL))

#define bFM_DMAC_DMACA3_ST                        *((volatile uint32_t*)(0x42C00874UL))
#define bFM4_DMAC_DMACA3_ST                       *((volatile uint32_t*)(0x42C00874UL))
#define bFM_DMAC_DMACA3_PB                        *((volatile uint32_t*)(0x42C00878UL))
#define bFM4_DMAC_DMACA3_PB                       *((volatile uint32_t*)(0x42C00878UL))
#define bFM_DMAC_DMACA3_EB                        *((volatile uint32_t*)(0x42C0087CUL))
#define bFM4_DMAC_DMACA3_EB                       *((volatile uint32_t*)(0x42C0087CUL))

#define bFM_DMAC_DMACA4_ST                        *((volatile uint32_t*)(0x42C00A74UL))
#define bFM4_DMAC_DMACA4_ST                       *((volatile uint32_t*)(0x42C00A74UL))
#define bFM_DMAC_DMACA4_PB                        *((volatile uint32_t*)(0x42C00A78UL))
#define bFM4_DMAC_DMACA4_PB                       *((volatile uint32_t*)(0x42C00A78UL))
#define bFM_DMAC_DMACA4_EB                        *((volatile uint32_t*)(0x42C00A7CUL))
#define bFM4_DMAC_DMACA4_EB                       *((volatile uint32_t*)(0x42C00A7CUL))

#define bFM_DMAC_DMACA5_ST                        *((volatile uint32_t*)(0x42C00C74UL))
#define bFM4_DMAC_DMACA5_ST                       *((volatile uint32_t*)(0x42C00C74UL))
#define bFM_DMAC_DMACA5_PB                        *((volatile uint32_t*)(0x42C00C78UL))
#define bFM4_DMAC_DMACA5_PB                       *((volatile uint32_t*)(0x42C00C78UL))
#define bFM_DMAC_DMACA5_EB                        *((volatile uint32_t*)(0x42C00C7CUL))
#define bFM4_DMAC_DMACA5_EB                       *((volatile uint32_t*)(0x42C00C7CUL))

#define bFM_DMAC_DMACA6_ST                        *((volatile uint32_t*)(0x42C00E74UL))
#define bFM4_DMAC_DMACA6_ST                       *((volatile uint32_t*)(0x42C00E74UL))
#define bFM_DMAC_DMACA6_PB                        *((volatile uint32_t*)(0x42C00E78UL))
#define bFM4_DMAC_DMACA6_PB                       *((volatile uint32_t*)(0x42C00E78UL))
#define bFM_DMAC_DMACA6_EB                        *((volatile uint32_t*)(0x42C00E7CUL))
#define bFM4_DMAC_DMACA6_EB                       *((volatile uint32_t*)(0x42C00E7CUL))

#define bFM_DMAC_DMACA7_ST                        *((volatile uint32_t*)(0x42C01074UL))
#define bFM4_DMAC_DMACA7_ST                       *((volatile uint32_t*)(0x42C01074UL))
#define bFM_DMAC_DMACA7_PB                        *((volatile uint32_t*)(0x42C01078UL))
#define bFM4_DMAC_DMACA7_PB                       *((volatile uint32_t*)(0x42C01078UL))
#define bFM_DMAC_DMACA7_EB                        *((volatile uint32_t*)(0x42C0107CUL))
#define bFM4_DMAC_DMACA7_EB                       *((volatile uint32_t*)(0x42C0107CUL))

#define bFM_DMAC_DMACB0_EM                        *((volatile uint32_t*)(0x42C00280UL))
#define bFM4_DMAC_DMACB0_EM                       *((volatile uint32_t*)(0x42C00280UL))
#define bFM_DMAC_DMACB0_CI                        *((volatile uint32_t*)(0x42C002CCUL))
#define bFM4_DMAC_DMACB0_CI                       *((volatile uint32_t*)(0x42C002CCUL))
#define bFM_DMAC_DMACB0_EI                        *((volatile uint32_t*)(0x42C002D0UL))
#define bFM4_DMAC_DMACB0_EI                       *((volatile uint32_t*)(0x42C002D0UL))
#define bFM_DMAC_DMACB0_RD                        *((volatile uint32_t*)(0x42C002D4UL))
#define bFM4_DMAC_DMACB0_RD                       *((volatile uint32_t*)(0x42C002D4UL))
#define bFM_DMAC_DMACB0_RS                        *((volatile uint32_t*)(0x42C002D8UL))
#define bFM4_DMAC_DMACB0_RS                       *((volatile uint32_t*)(0x42C002D8UL))
#define bFM_DMAC_DMACB0_RC                        *((volatile uint32_t*)(0x42C002DCUL))
#define bFM4_DMAC_DMACB0_RC                       *((volatile uint32_t*)(0x42C002DCUL))
#define bFM_DMAC_DMACB0_FD                        *((volatile uint32_t*)(0x42C002E0UL))
#define bFM4_DMAC_DMACB0_FD                       *((volatile uint32_t*)(0x42C002E0UL))
#define bFM_DMAC_DMACB0_FS                        *((volatile uint32_t*)(0x42C002E4UL))
#define bFM4_DMAC_DMACB0_FS                       *((volatile uint32_t*)(0x42C002E4UL))

#define bFM_DMAC_DMACB1_EM                        *((volatile uint32_t*)(0x42C00480UL))
#define bFM4_DMAC_DMACB1_EM                       *((volatile uint32_t*)(0x42C00480UL))
#define bFM_DMAC_DMACB1_CI                        *((volatile uint32_t*)(0x42C004CCUL))
#define bFM4_DMAC_DMACB1_CI                       *((volatile uint32_t*)(0x42C004CCUL))
#define bFM_DMAC_DMACB1_EI                        *((volatile uint32_t*)(0x42C004D0UL))
#define bFM4_DMAC_DMACB1_EI                       *((volatile uint32_t*)(0x42C004D0UL))
#define bFM_DMAC_DMACB1_RD                        *((volatile uint32_t*)(0x42C004D4UL))
#define bFM4_DMAC_DMACB1_RD                       *((volatile uint32_t*)(0x42C004D4UL))
#define bFM_DMAC_DMACB1_RS                        *((volatile uint32_t*)(0x42C004D8UL))
#define bFM4_DMAC_DMACB1_RS                       *((volatile uint32_t*)(0x42C004D8UL))
#define bFM_DMAC_DMACB1_RC                        *((volatile uint32_t*)(0x42C004DCUL))
#define bFM4_DMAC_DMACB1_RC                       *((volatile uint32_t*)(0x42C004DCUL))
#define bFM_DMAC_DMACB1_FD                        *((volatile uint32_t*)(0x42C004E0UL))
#define bFM4_DMAC_DMACB1_FD                       *((volatile uint32_t*)(0x42C004E0UL))
#define bFM_DMAC_DMACB1_FS                        *((volatile uint32_t*)(0x42C004E4UL))
#define bFM4_DMAC_DMACB1_FS                       *((volatile uint32_t*)(0x42C004E4UL))

#define bFM_DMAC_DMACB2_EM                        *((volatile uint32_t*)(0x42C00680UL))
#define bFM4_DMAC_DMACB2_EM                       *((volatile uint32_t*)(0x42C00680UL))
#define bFM_DMAC_DMACB2_CI                        *((volatile uint32_t*)(0x42C006CCUL))
#define bFM4_DMAC_DMACB2_CI                       *((volatile uint32_t*)(0x42C006CCUL))
#define bFM_DMAC_DMACB2_EI                        *((volatile uint32_t*)(0x42C006D0UL))
#define bFM4_DMAC_DMACB2_EI                       *((volatile uint32_t*)(0x42C006D0UL))
#define bFM_DMAC_DMACB2_RD                        *((volatile uint32_t*)(0x42C006D4UL))
#define bFM4_DMAC_DMACB2_RD                       *((volatile uint32_t*)(0x42C006D4UL))
#define bFM_DMAC_DMACB2_RS                        *((volatile uint32_t*)(0x42C006D8UL))
#define bFM4_DMAC_DMACB2_RS                       *((volatile uint32_t*)(0x42C006D8UL))
#define bFM_DMAC_DMACB2_RC                        *((volatile uint32_t*)(0x42C006DCUL))
#define bFM4_DMAC_DMACB2_RC                       *((volatile uint32_t*)(0x42C006DCUL))
#define bFM_DMAC_DMACB2_FD                        *((volatile uint32_t*)(0x42C006E0UL))
#define bFM4_DMAC_DMACB2_FD                       *((volatile uint32_t*)(0x42C006E0UL))
#define bFM_DMAC_DMACB2_FS                        *((volatile uint32_t*)(0x42C006E4UL))
#define bFM4_DMAC_DMACB2_FS                       *((volatile uint32_t*)(0x42C006E4UL))

#define bFM_DMAC_DMACB3_EM                        *((volatile uint32_t*)(0x42C00880UL))
#define bFM4_DMAC_DMACB3_EM                       *((volatile uint32_t*)(0x42C00880UL))
#define bFM_DMAC_DMACB3_CI                        *((volatile uint32_t*)(0x42C008CCUL))
#define bFM4_DMAC_DMACB3_CI                       *((volatile uint32_t*)(0x42C008CCUL))
#define bFM_DMAC_DMACB3_EI                        *((volatile uint32_t*)(0x42C008D0UL))
#define bFM4_DMAC_DMACB3_EI                       *((volatile uint32_t*)(0x42C008D0UL))
#define bFM_DMAC_DMACB3_RD                        *((volatile uint32_t*)(0x42C008D4UL))
#define bFM4_DMAC_DMACB3_RD                       *((volatile uint32_t*)(0x42C008D4UL))
#define bFM_DMAC_DMACB3_RS                        *((volatile uint32_t*)(0x42C008D8UL))
#define bFM4_DMAC_DMACB3_RS                       *((volatile uint32_t*)(0x42C008D8UL))
#define bFM_DMAC_DMACB3_RC                        *((volatile uint32_t*)(0x42C008DCUL))
#define bFM4_DMAC_DMACB3_RC                       *((volatile uint32_t*)(0x42C008DCUL))
#define bFM_DMAC_DMACB3_FD                        *((volatile uint32_t*)(0x42C008E0UL))
#define bFM4_DMAC_DMACB3_FD                       *((volatile uint32_t*)(0x42C008E0UL))
#define bFM_DMAC_DMACB3_FS                        *((volatile uint32_t*)(0x42C008E4UL))
#define bFM4_DMAC_DMACB3_FS                       *((volatile uint32_t*)(0x42C008E4UL))

#define bFM_DMAC_DMACB4_EM                        *((volatile uint32_t*)(0x42C00A80UL))
#define bFM4_DMAC_DMACB4_EM                       *((volatile uint32_t*)(0x42C00A80UL))
#define bFM_DMAC_DMACB4_CI                        *((volatile uint32_t*)(0x42C00ACCUL))
#define bFM4_DMAC_DMACB4_CI                       *((volatile uint32_t*)(0x42C00ACCUL))
#define bFM_DMAC_DMACB4_EI                        *((volatile uint32_t*)(0x42C00AD0UL))
#define bFM4_DMAC_DMACB4_EI                       *((volatile uint32_t*)(0x42C00AD0UL))
#define bFM_DMAC_DMACB4_RD                        *((volatile uint32_t*)(0x42C00AD4UL))
#define bFM4_DMAC_DMACB4_RD                       *((volatile uint32_t*)(0x42C00AD4UL))
#define bFM_DMAC_DMACB4_RS                        *((volatile uint32_t*)(0x42C00AD8UL))
#define bFM4_DMAC_DMACB4_RS                       *((volatile uint32_t*)(0x42C00AD8UL))
#define bFM_DMAC_DMACB4_RC                        *((volatile uint32_t*)(0x42C00ADCUL))
#define bFM4_DMAC_DMACB4_RC                       *((volatile uint32_t*)(0x42C00ADCUL))
#define bFM_DMAC_DMACB4_FD                        *((volatile uint32_t*)(0x42C00AE0UL))
#define bFM4_DMAC_DMACB4_FD                       *((volatile uint32_t*)(0x42C00AE0UL))
#define bFM_DMAC_DMACB4_FS                        *((volatile uint32_t*)(0x42C00AE4UL))
#define bFM4_DMAC_DMACB4_FS                       *((volatile uint32_t*)(0x42C00AE4UL))

#define bFM_DMAC_DMACB5_EM                        *((volatile uint32_t*)(0x42C00C80UL))
#define bFM4_DMAC_DMACB5_EM                       *((volatile uint32_t*)(0x42C00C80UL))
#define bFM_DMAC_DMACB5_CI                        *((volatile uint32_t*)(0x42C00CCCUL))
#define bFM4_DMAC_DMACB5_CI                       *((volatile uint32_t*)(0x42C00CCCUL))
#define bFM_DMAC_DMACB5_EI                        *((volatile uint32_t*)(0x42C00CD0UL))
#define bFM4_DMAC_DMACB5_EI                       *((volatile uint32_t*)(0x42C00CD0UL))
#define bFM_DMAC_DMACB5_RD                        *((volatile uint32_t*)(0x42C00CD4UL))
#define bFM4_DMAC_DMACB5_RD                       *((volatile uint32_t*)(0x42C00CD4UL))
#define bFM_DMAC_DMACB5_RS                        *((volatile uint32_t*)(0x42C00CD8UL))
#define bFM4_DMAC_DMACB5_RS                       *((volatile uint32_t*)(0x42C00CD8UL))
#define bFM_DMAC_DMACB5_RC                        *((volatile uint32_t*)(0x42C00CDCUL))
#define bFM4_DMAC_DMACB5_RC                       *((volatile uint32_t*)(0x42C00CDCUL))
#define bFM_DMAC_DMACB5_FD                        *((volatile uint32_t*)(0x42C00CE0UL))
#define bFM4_DMAC_DMACB5_FD                       *((volatile uint32_t*)(0x42C00CE0UL))
#define bFM_DMAC_DMACB5_FS                        *((volatile uint32_t*)(0x42C00CE4UL))
#define bFM4_DMAC_DMACB5_FS                       *((volatile uint32_t*)(0x42C00CE4UL))

#define bFM_DMAC_DMACB6_EM                        *((volatile uint32_t*)(0x42C00E80UL))
#define bFM4_DMAC_DMACB6_EM                       *((volatile uint32_t*)(0x42C00E80UL))
#define bFM_DMAC_DMACB6_CI                        *((volatile uint32_t*)(0x42C00ECCUL))
#define bFM4_DMAC_DMACB6_CI                       *((volatile uint32_t*)(0x42C00ECCUL))
#define bFM_DMAC_DMACB6_EI                        *((volatile uint32_t*)(0x42C00ED0UL))
#define bFM4_DMAC_DMACB6_EI                       *((volatile uint32_t*)(0x42C00ED0UL))
#define bFM_DMAC_DMACB6_RD                        *((volatile uint32_t*)(0x42C00ED4UL))
#define bFM4_DMAC_DMACB6_RD                       *((volatile uint32_t*)(0x42C00ED4UL))
#define bFM_DMAC_DMACB6_RS                        *((volatile uint32_t*)(0x42C00ED8UL))
#define bFM4_DMAC_DMACB6_RS                       *((volatile uint32_t*)(0x42C00ED8UL))
#define bFM_DMAC_DMACB6_RC                        *((volatile uint32_t*)(0x42C00EDCUL))
#define bFM4_DMAC_DMACB6_RC                       *((volatile uint32_t*)(0x42C00EDCUL))
#define bFM_DMAC_DMACB6_FD                        *((volatile uint32_t*)(0x42C00EE0UL))
#define bFM4_DMAC_DMACB6_FD                       *((volatile uint32_t*)(0x42C00EE0UL))
#define bFM_DMAC_DMACB6_FS                        *((volatile uint32_t*)(0x42C00EE4UL))
#define bFM4_DMAC_DMACB6_FS                       *((volatile uint32_t*)(0x42C00EE4UL))

#define bFM_DMAC_DMACB7_EM                        *((volatile uint32_t*)(0x42C01080UL))
#define bFM4_DMAC_DMACB7_EM                       *((volatile uint32_t*)(0x42C01080UL))
#define bFM_DMAC_DMACB7_CI                        *((volatile uint32_t*)(0x42C010CCUL))
#define bFM4_DMAC_DMACB7_CI                       *((volatile uint32_t*)(0x42C010CCUL))
#define bFM_DMAC_DMACB7_EI                        *((volatile uint32_t*)(0x42C010D0UL))
#define bFM4_DMAC_DMACB7_EI                       *((volatile uint32_t*)(0x42C010D0UL))
#define bFM_DMAC_DMACB7_RD                        *((volatile uint32_t*)(0x42C010D4UL))
#define bFM4_DMAC_DMACB7_RD                       *((volatile uint32_t*)(0x42C010D4UL))
#define bFM_DMAC_DMACB7_RS                        *((volatile uint32_t*)(0x42C010D8UL))
#define bFM4_DMAC_DMACB7_RS                       *((volatile uint32_t*)(0x42C010D8UL))
#define bFM_DMAC_DMACB7_RC                        *((volatile uint32_t*)(0x42C010DCUL))
#define bFM4_DMAC_DMACB7_RC                       *((volatile uint32_t*)(0x42C010DCUL))
#define bFM_DMAC_DMACB7_FD                        *((volatile uint32_t*)(0x42C010E0UL))
#define bFM4_DMAC_DMACB7_FD                       *((volatile uint32_t*)(0x42C010E0UL))
#define bFM_DMAC_DMACB7_FS                        *((volatile uint32_t*)(0x42C010E4UL))
#define bFM4_DMAC_DMACB7_FS                       *((volatile uint32_t*)(0x42C010E4UL))

#define bFM_DMAC_DMACR_PR                         *((volatile uint32_t*)(0x42C00070UL))
#define bFM4_DMAC_DMACR_PR                        *((volatile uint32_t*)(0x42C00070UL))
#define bFM_DMAC_DMACR_DS                         *((volatile uint32_t*)(0x42C00078UL))
#define bFM4_DMAC_DMACR_DS                        *((volatile uint32_t*)(0x42C00078UL))
#define bFM_DMAC_DMACR_DE                         *((volatile uint32_t*)(0x42C0007CUL))
#define bFM4_DMAC_DMACR_DE                        *((volatile uint32_t*)(0x42C0007CUL))


