neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_ETHERNET_MAC0_MAR16H_SA               *((volatile uint32_t*)(0x42C90078UL))
#define bFM4_ETHERNET_MAC0_MAR16H_SA              *((volatile uint32_t*)(0x42C90078UL))
#define bFM_ETHERNET_MAC0_MAR16H_AE               *((volatile uint32_t*)(0x42C9007CUL))
#define bFM4_ETHERNET_MAC0_MAR16H_AE              *((volatile uint32_t*)(0x42C9007CUL))

#define bFM_ETHERNET_MAC0_MAR17H_SA               *((volatile uint32_t*)(0x42C90178UL))
#define bFM4_ETHERNET_MAC0_MAR17H_SA              *((volatile uint32_t*)(0x42C90178UL))
#define bFM_ETHERNET_MAC0_MAR17H_AE               *((volatile uint32_t*)(0x42C9017CUL))
#define bFM4_ETHERNET_MAC0_MAR17H_AE              *((volatile uint32_t*)(0x42C9017CUL))

#define bFM_ETHERNET_MAC0_MAR18H_SA               *((volatile uint32_t*)(0x42C90278UL))
#define bFM4_ETHERNET_MAC0_MAR18H_SA              *((volatile uint32_t*)(0x42C90278UL))
#define bFM_ETHERNET_MAC0_MAR18H_AE               *((volatile uint32_t*)(0x42C9027CUL))
#define bFM4_ETHERNET_MAC0_MAR18H_AE              *((volatile uint32_t*)(0x42C9027CUL))

#define bFM_ETHERNET_MAC0_MAR19H_SA               *((volatile uint32_t*)(0x42C90378UL))
#define bFM4_ETHERNET_MAC0_MAR19H_SA              *((volatile uint32_t*)(0x42C90378UL))
#define bFM_ETHERNET_MAC0_MAR19H_AE               *((volatile uint32_t*)(0x42C9037CUL))
#define bFM4_ETHERNET_MAC0_MAR19H_AE              *((volatile uint32_t*)(0x42C9037CUL))

#define bFM_ETHERNET_MAC0_MAR1H_SA                *((volatile uint32_t*)(0x42C80978UL))
#define bFM4_ETHERNET_MAC0_MAR1H_SA               *((volatile uint32_t*)(0x42C80978UL))
#define bFM_ETHERNET_MAC0_MAR1H_AE                *((volatile uint32_t*)(0x42C8097CUL))
#define bFM4_ETHERNET_MAC0_MAR1H_AE               *((volatile uint32_t*)(0x42C8097CUL))

#define bFM_ETHERNET_MAC0_MAR20H_SA               *((volatile uint32_t*)(0x42C90478UL))
#define bFM4_ETHERNET_MAC0_MAR20H_SA              *((volatile uint32_t*)(0x42C90478UL))
#define bFM_ETHERNET_MAC0_MAR20H_AE               *((volatile uint32_t*)(0x42C9047CUL))
#define bFM4_ETHERNET_MAC0_MAR20H_AE              *((volatile uint32_t*)(0x42C9047CUL))

#define bFM_ETHERNET_MAC0_MAR21H_SA               *((volatile uint32_t*)(0x42C90578UL))
#define bFM4_ETHERNET_MAC0_MAR21H_SA              *((volatile uint32_t*)(0x42C90578UL))
#define bFM_ETHERNET_MAC0_MAR21H_AE               *((volatile uint32_t*)(0x42C9057CUL))
#define bFM4_ETHERNET_MAC0_MAR21H_AE              *((volatile uint32_t*)(0x42C9057CUL))

#define bFM_ETHERNET_MAC0_MAR22H_SA               *((volatile uint32_t*)(0x42C90678UL))
#define bFM4_ETHERNET_MAC0_MAR22H_SA              *((volatile uint32_t*)(0x42C90678UL))
#define bFM_ETHERNET_MAC0_MAR22H_AE               *((volatile uint32_t*)(0x42C9067CUL))
#define bFM4_ETHERNET_MAC0_MAR22H_AE              *((volatile uint32_t*)(0x42C9067CUL))

#define bFM_ETHERNET_MAC0_MAR23H_SA               *((volatile uint32_t*)(0x42C90778UL))
#define bFM4_ETHERNET_MAC0_MAR23H_SA              *((volatile uint32_t*)(0x42C90778UL))
#define bFM_ETHERNET_MAC0_MAR23H_AE               *((volatile uint32_t*)(0x42C9077CUL))
#define bFM4_ETHERNET_MAC0_MAR23H_AE              *((volatile uint32_t*)(0x42C9077CUL))

#define bFM_ETHERNET_MAC0_MAR24H_SA               *((volatile uint32_t*)(0x42C90878UL))
#define bFM4_ETHERNET_MAC0_MAR24H_SA              *((volatile uint32_t*)(0x42C90878UL))
#define bFM_ETHERNET_MAC0_MAR24H_AE               *((volatile uint32_t*)(0x42C9087CUL))
#define bFM4_ETHERNET_MAC0_MAR24H_AE              *((volatile uint32_t*)(0x42C9087CUL))

#define bFM_ETHERNET_MAC0_MAR25H_SA               *((volatile uint32_t*)(0x42C90978UL))
#define bFM4_ETHERNET_MAC0_MAR25H_SA              *((volatile uint32_t*)(0x42C90978UL))
#define bFM_ETHERNET_MAC0_MAR25H_AE               *((volatile uint32_t*)(0x42C9097CUL))
#define bFM4_ETHERNET_MAC0_MAR25H_AE              *((volatile uint32_t*)(0x42C9097CUL))

#define bFM_ETHERNET_MAC0_MAR26H_SA               *((volatile uint32_t*)(0x42C90A78UL))
#define bFM4_ETHERNET_MAC0_MAR26H_SA              *((volatile uint32_t*)(0x42C90A78UL))
#define bFM_ETHERNET_MAC0_MAR26H_AE               *((volatile uint32_t*)(0x42C90A7CUL))
#define bFM4_ETHERNET_MAC0_MAR26H_AE              *((volatile uint32_t*)(0x42C90A7CUL))

#define bFM_ETHERNET_MAC0_MAR27H_SA               *((volatile uint32_t*)(0x42C90B78UL))
#define bFM4_ETHERNET_MAC0_MAR27H_SA              *((volatile uint32_t*)(0x42C90B78UL))
#define bFM_ETHERNET_MAC0_MAR27H_AE               *((volatile uint32_t*)(0x42C90B7CUL))
#define bFM4_ETHERNET_MAC0_MAR27H_AE              *((volatile uint32_t*)(0x42C90B7CUL))

#define bFM_ETHERNET_MAC0_MAR28H_SA               *((volatile uint32_t*)(0x42C90C78UL))
#define bFM4_ETHERNET_MAC0_MAR28H_SA              *((volatile uint32_t*)(0x42C90C78UL))
#define bFM_ETHERNET_MAC0_MAR28H_AE               *((volatile uint32_t*)(0x42C90C7CUL))
#define bFM4_ETHERNET_MAC0_MAR28H_AE              *((volatile uint32_t*)(0x42C90C7CUL))

#define bFM_ETHERNET_MAC0_MAR29H_SA               *((volatile uint32_t*)(0x42C90D78UL))
#define bFM4_ETHERNET_MAC0_MAR29H_SA              *((volatile uint32_t*)(0x42C90D78UL))
#define bFM_ETHERNET_MAC0_MAR29H_AE               *((volatile uint32_t*)(0x42C90D7CUL))
#define bFM4_ETHERNET_MAC0_MAR29H_AE              *((volatile uint32_t*)(0x42C90D7CUL))

#define bFM_ETHERNET_MAC0_MAR2H_SA                *((volatile uint32_t*)(0x42C80A78UL))
#define bFM4_ETHERNET_MAC0_MAR2H_SA               *((volatile uint32_t*)(0x42C80A78UL))
#define bFM_ETHERNET_MAC0_MAR2H_AE                *((volatile uint32_t*)(0x42C80A7CUL))
#define bFM4_ETHERNET_MAC0_MAR2H_AE               *((volatile uint32_t*)(0x42C80A7CUL))

#define bFM_ETHERNET_MAC0_MAR30H_SA               *((volatile uint32_t*)(0x42C90E78UL))
#define bFM4_ETHERNET_MAC0_MAR30H_SA              *((volatile uint32_t*)(0x42C90E78UL))
#define bFM_ETHERNET_MAC0_MAR30H_AE               *((volatile uint32_t*)(0x42C90E7CUL))
#define bFM4_ETHERNET_MAC0_MAR30H_AE              *((volatile uint32_t*)(0x42C90E7CUL))

#define bFM_ETHERNET_MAC0_MAR31H_SA               *((volatile uint32_t*)(0x42C90F78UL))
#define bFM4_ETHERNET_MAC0_MAR31H_SA              *((volatile uint32_t*)(0x42C90F78UL))
#define bFM_ETHERNET_MAC0_MAR31H_AE               *((volatile uint32_t*)(0x42C90F7CUL))
#define bFM4_ETHERNET_MAC0_MAR31H_AE              *((volatile uint32_t*)(0x42C90F7CUL))

#define bFM_ETHERNET_MAC0_MAR3H_SA                *((volatile uint32_t*)(0x42C80B78UL))
#define bFM4_ETHERNET_MAC0_MAR3H_SA               *((volatile uint32_t*)(0x42C80B78UL))
#define bFM_ETHERNET_MAC0_MAR3H_AE                *((volatile uint32_t*)(0x42C80B7CUL))
#define bFM4_ETHERNET_MAC0_MAR3H_AE               *((volatile uint32_t*)(0x42C80B7CUL))

#define bFM_ETHERNET_MAC0_MAR4H_SA                *((volatile uint32_t*)(0x42C80C78UL))
#define bFM4_ETHERNET_MAC0_MAR4H_SA               *((volatile uint32_t*)(0x42C80C78UL))
#define bFM_ETHERNET_MAC0_MAR4H_AE                *((volatile uint32_t*)(0x42C80C7CUL))
#define bFM4_ETHERNET_MAC0_MAR4H_AE               *((volatile uint32_t*)(0x42C80C7CUL))

#define bFM_ETHERNET_MAC0_MAR5H_SA                *((volatile uint32_t*)(0x42C80D78UL))
#define bFM4_ETHERNET_MAC0_MAR5H_SA               *((volatile uint32_t*)(0x42C80D78UL))
#define bFM_ETHERNET_MAC0_MAR5H_AE                *((volatile uint32_t*)(0x42C80D7CUL))
#define bFM4_ETHERNET_MAC0_MAR5H_AE               *((volatile uint32_t*)(0x42C80D7CUL))

#define bFM_ETHERNET_MAC0_MAR6H_SA                *((volatile uint32_t*)(0x42C80E78UL))
#define bFM4_ETHERNET_MAC0_MAR6H_SA               *((volatile uint32_t*)(0x42C80E78UL))
#define bFM_ETHERNET_MAC0_MAR6H_AE                *((volatile uint32_t*)(0x42C80E7CUL))
#define bFM4_ETHERNET_MAC0_MAR6H_AE               *((volatile uint32_t*)(0x42C80E7CUL))

#define bFM_ETHERNET_MAC0_MAR7H_SA                *((volatile uint32_t*)(0x42C80F78UL))
#define bFM4_ETHERNET_MAC0_MAR7H_SA               *((volatile uint32_t*)(0x42C80F78UL))
#define bFM_ETHERNET_MAC0_MAR7H_AE                *((volatile uint32_t*)(0x42C80F7CUL))
#define bFM4_ETHERNET_MAC0_MAR7H_AE               *((volatile uint32_t*)(0x42C80F7CUL))

#define bFM_ETHERNET_MAC0_MAR8H_SA                *((volatile uint32_t*)(0x42C81078UL))
#define bFM4_ETHERNET_MAC0_MAR8H_SA               *((volatile uint32_t*)(0x42C81078UL))
#define bFM_ETHERNET_MAC0_MAR8H_AE                *((volatile uint32_t*)(0x42C8107CUL))
#define bFM4_ETHERNET_MAC0_MAR8H_AE               *((volatile uint32_t*)(0x42C8107CUL))

#define bFM_ETHERNET_MAC0_MAR9H_SA                *((volatile uint32_t*)(0x42C81178UL))
#define bFM4_ETHERNET_MAC0_MAR9H_SA               *((volatile uint32_t*)(0x42C81178UL))
#define bFM_ETHERNET_MAC0_MAR9H_AE                *((volatile uint32_t*)(0x42C8117CUL))
#define bFM4_ETHERNET_MAC0_MAR9H_AE               *((volatile uint32_t*)(0x42C8117CUL))

#define bFM_ETHERNET_MAC0_MCR_RE                  *((volatile uint32_t*)(0x42C80008UL))
#define bFM4_ETHERNET_MAC0_MCR_RE                 *((volatile uint32_t*)(0x42C80008UL))
#define bFM_ETHERNET_MAC0_MCR_TE                  *((volatile uint32_t*)(0x42C8000CUL))
#define bFM4_ETHERNET_MAC0_MCR_TE                 *((volatile uint32_t*)(0x42C8000CUL))
#define bFM_ETHERNET_MAC0_MCR_DC                  *((volatile uint32_t*)(0x42C80010UL))
#define bFM4_ETHERNET_MAC0_MCR_DC                 *((volatile uint32_t*)(0x42C80010UL))
#define bFM_ETHERNET_MAC0_MCR_ACS                 *((volatile uint32_t*)(0x42C8001CUL))
#define bFM4_ETHERNET_MAC0_MCR_ACS                *((volatile uint32_t*)(0x42C8001CUL))
#define bFM_ETHERNET_MAC0_MCR_LUD                 *((volatile uint32_t*)(0x42C80020UL))
#define bFM4_ETHERNET_MAC0_MCR_LUD                *((volatile uint32_t*)(0x42C80020UL))
#define bFM_ETHERNET_MAC0_MCR_DR                  *((volatile uint32_t*)(0x42C80024UL))
#define bFM4_ETHERNET_MAC0_MCR_DR                 *((volatile uint32_t*)(0x42C80024UL))
#define bFM_ETHERNET_MAC0_MCR_IPC                 *((volatile uint32_t*)(0x42C80028UL))
#define bFM4_ETHERNET_MAC0_MCR_IPC                *((volatile uint32_t*)(0x42C80028UL))
#define bFM_ETHERNET_MAC0_MCR_DM                  *((volatile uint32_t*)(0x42C8002CUL))
#define bFM4_ETHERNET_MAC0_MCR_DM                 *((volatile uint32_t*)(0x42C8002CUL))
#define bFM_ETHERNET_MAC0_MCR_LM                  *((volatile uint32_t*)(0x42C80030UL))
#define bFM4_ETHERNET_MAC0_MCR_LM                 *((volatile uint32_t*)(0x42C80030UL))
#define bFM_ETHERNET_MAC0_MCR_DO                  *((volatile uint32_t*)(0x42C80034UL))
#define bFM4_ETHERNET_MAC0_MCR_DO                 *((volatile uint32_t*)(0x42C80034UL))
#define bFM_ETHERNET_MAC0_MCR_FES                 *((volatile uint32_t*)(0x42C80038UL))
#define bFM4_ETHERNET_MAC0_MCR_FES                *((volatile uint32_t*)(0x42C80038UL))
#define bFM_ETHERNET_MAC0_MCR_PS                  *((volatile uint32_t*)(0x42C8003CUL))
#define bFM4_ETHERNET_MAC0_MCR_PS                 *((volatile uint32_t*)(0x42C8003CUL))
#define bFM_ETHERNET_MAC0_MCR_DCRS                *((volatile uint32_t*)(0x42C80040UL))
#define bFM4_ETHERNET_MAC0_MCR_DCRS               *((volatile uint32_t*)(0x42C80040UL))
#define bFM_ETHERNET_MAC0_MCR_JE                  *((volatile uint32_t*)(0x42C80050UL))
#define bFM4_ETHERNET_MAC0_MCR_JE                 *((volatile uint32_t*)(0x42C80050UL))
#define bFM_ETHERNET_MAC0_MCR_BE                  *((volatile uint32_t*)(0x42C80054UL))
#define bFM4_ETHERNET_MAC0_MCR_BE                 *((volatile uint32_t*)(0x42C80054UL))
#define bFM_ETHERNET_MAC0_MCR_JD                  *((volatile uint32_t*)(0x42C80058UL))
#define bFM4_ETHERNET_MAC0_MCR_JD                 *((volatile uint32_t*)(0x42C80058UL))
#define bFM_ETHERNET_MAC0_MCR_WD                  *((volatile uint32_t*)(0x42C8005CUL))
#define bFM4_ETHERNET_MAC0_MCR_WD                 *((volatile uint32_t*)(0x42C8005CUL))
#define bFM_ETHERNET_MAC0_MCR_TC                  *((volatile uint32_t*)(0x42C80060UL))
#define bFM4_ETHERNET_MAC0_MCR_TC                 *((volatile uint32_t*)(0x42C80060UL))
#define bFM_ETHERNET_MAC0_MCR_CST                 *((volatile uint32_t*)(0x42C80064UL))
#define bFM4_ETHERNET_MAC0_MCR_CST                *((volatile uint32_t*)(0x42C80064UL))

#define bFM_ETHERNET_MAC0_MFBOCR_ONMFH            *((volatile uint32_t*)(0x42CA0440UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_ONMFH           *((volatile uint32_t*)(0x42CA0440UL))
#define bFM_ETHERNET_MAC0_MFBOCR_ONMFF            *((volatile uint32_t*)(0x42CA0470UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_ONMFF           *((volatile uint32_t*)(0x42CA0470UL))

#define bFM_ETHERNET_MAC0_MFFR_PR                 *((volatile uint32_t*)(0x42C80080UL))
#define bFM4_ETHERNET_MAC0_MFFR_PR                *((volatile uint32_t*)(0x42C80080UL))
#define bFM_ETHERNET_MAC0_MFFR_HUC                *((volatile uint32_t*)(0x42C80084UL))
#define bFM4_ETHERNET_MAC0_MFFR_HUC               *((volatile uint32_t*)(0x42C80084UL))
#define bFM_ETHERNET_MAC0_MFFR_HMC                *((volatile uint32_t*)(0x42C80088UL))
#define bFM4_ETHERNET_MAC0_MFFR_HMC               *((volatile uint32_t*)(0x42C80088UL))
#define bFM_ETHERNET_MAC0_MFFR_DAIF               *((volatile uint32_t*)(0x42C8008CUL))
#define bFM4_ETHERNET_MAC0_MFFR_DAIF              *((volatile uint32_t*)(0x42C8008CUL))
#define bFM_ETHERNET_MAC0_MFFR_PM                 *((volatile uint32_t*)(0x42C80090UL))
#define bFM4_ETHERNET_MAC0_MFFR_PM                *((volatile uint32_t*)(0x42C80090UL))
#define bFM_ETHERNET_MAC0_MFFR_DB                 *((volatile uint32_t*)(0x42C80094UL))
#define bFM4_ETHERNET_MAC0_MFFR_DB                *((volatile uint32_t*)(0x42C80094UL))
#define bFM_ETHERNET_MAC0_MFFR_SAIF               *((volatile uint32_t*)(0x42C800A0UL))
#define bFM4_ETHERNET_MAC0_MFFR_SAIF              *((volatile uint32_t*)(0x42C800A0UL))
#define bFM_ETHERNET_MAC0_MFFR_SAF                *((volatile uint32_t*)(0x42C800A4UL))
#define bFM4_ETHERNET_MAC0_MFFR_SAF               *((volatile uint32_t*)(0x42C800A4UL))
#define bFM_ETHERNET_MAC0_MFFR_HPF                *((volatile uint32_t*)(0x42C800A8UL))
#define bFM4_ETHERNET_MAC0_MFFR_HPF               *((volatile uint32_t*)(0x42C800A8UL))
#define bFM_ETHERNET_MAC0_MFFR_RA                 *((volatile uint32_t*)(0x42C800FCUL))
#define bFM4_ETHERNET_MAC0_MFFR_RA                *((volatile uint32_t*)(0x42C800FCUL))

#define bFM_ETHERNET_MAC0_OMR_SR                  *((volatile uint32_t*)(0x42CA0304UL))
#define bFM4_ETHERNET_MAC0_OMR_SR                 *((volatile uint32_t*)(0x42CA0304UL))
#define bFM_ETHERNET_MAC0_OMR_OSF                 *((volatile uint32_t*)(0x42CA0308UL))
#define bFM4_ETHERNET_MAC0_OMR_OSF                *((volatile uint32_t*)(0x42CA0308UL))
#define bFM_ETHERNET_MAC0_OMR_FUF                 *((volatile uint32_t*)(0x42CA0318UL))
#define bFM4_ETHERNET_MAC0_OMR_FUF                *((volatile uint32_t*)(0x42CA0318UL))
#define bFM_ETHERNET_MAC0_OMR_FEF                 *((volatile uint32_t*)(0x42CA031CUL))
#define bFM4_ETHERNET_MAC0_OMR_FEF                *((volatile uint32_t*)(0x42CA031CUL))
#define bFM_ETHERNET_MAC0_OMR_ST                  *((volatile uint32_t*)(0x42CA0334UL))
#define bFM4_ETHERNET_MAC0_OMR_ST                 *((volatile uint32_t*)(0x42CA0334UL))
#define bFM_ETHERNET_MAC0_OMR_FTF                 *((volatile uint32_t*)(0x42CA0350UL))
#define bFM4_ETHERNET_MAC0_OMR_FTF                *((volatile uint32_t*)(0x42CA0350UL))
#define bFM_ETHERNET_MAC0_OMR_TSF                 *((volatile uint32_t*)(0x42CA0354UL))
#define bFM4_ETHERNET_MAC0_OMR_TSF                *((volatile uint32_t*)(0x42CA0354UL))
#define bFM_ETHERNET_MAC0_OMR_DFF                 *((volatile uint32_t*)(0x42CA0360UL))
#define bFM4_ETHERNET_MAC0_OMR_DFF                *((volatile uint32_t*)(0x42CA0360UL))
#define bFM_ETHERNET_MAC0_OMR_RSF                 *((volatile uint32_t*)(0x42CA0364UL))
#define bFM4_ETHERNET_MAC0_OMR_RSF                *((volatile uint32_t*)(0x42CA0364UL))
#define bFM_ETHERNET_MAC0_OMR_DT                  *((volatile uint32_t*)(0x42CA0368UL))
#define bFM4_ETHERNET_MAC0_OMR_DT                 *((volatile uint32_t*)(0x42CA0368UL))

#define bFM_ETHERNET_MAC0_PMTR_PD                 *((volatile uint32_t*)(0x42C80580UL))
#define bFM4_ETHERNET_MAC0_PMTR_PD                *((volatile uint32_t*)(0x42C80580UL))
#define bFM_ETHERNET_MAC0_PMTR_MPE                *((volatile uint32_t*)(0x42C80584UL))
#define bFM4_ETHERNET_MAC0_PMTR_MPE               *((volatile uint32_t*)(0x42C80584UL))
#define bFM_ETHERNET_MAC0_PMTR_WFE                *((volatile uint32_t*)(0x42C80588UL))
#define bFM4_ETHERNET_MAC0_PMTR_WFE               *((volatile uint32_t*)(0x42C80588UL))
#define bFM_ETHERNET_MAC0_PMTR_MPR                *((volatile uint32_t*)(0x42C80594UL))
#define bFM4_ETHERNET_MAC0_PMTR_MPR               *((volatile uint32_t*)(0x42C80594UL))
#define bFM_ETHERNET_MAC0_PMTR_WPR                *((volatile uint32_t*)(0x42C80598UL))
#define bFM4_ETHERNET_MAC0_PMTR_WPR               *((volatile uint32_t*)(0x42C80598UL))
#define bFM_ETHERNET_MAC0_PMTR_GU                 *((volatile uint32_t*)(0x42C805A4UL))
#define bFM4_ETHERNET_MAC0_PMTR_GU                *((volatile uint32_t*)(0x42C805A4UL))
#define bFM_ETHERNET_MAC0_PMTR_RWFFRPR            *((volatile uint32_t*)(0x42C805FCUL))
#define bFM4_ETHERNET_MAC0_PMTR_RWFFRPR           *((volatile uint32_t*)(0x42C805FCUL))

#define bFM_ETHERNET_MAC0_RGSR_LM                 *((volatile uint32_t*)(0x42C81B00UL))
#define bFM4_ETHERNET_MAC0_RGSR_LM                *((volatile uint32_t*)(0x42C81B00UL))
#define bFM_ETHERNET_MAC0_RGSR_LS                 *((volatile uint32_t*)(0x42C81B0CUL))
#define bFM4_ETHERNET_MAC0_RGSR_LS                *((volatile uint32_t*)(0x42C81B0CUL))

#define bFM_ETHERNET_MAC0_SR_TI                   *((volatile uint32_t*)(0x42CA0280UL))
#define bFM4_ETHERNET_MAC0_SR_TI                  *((volatile uint32_t*)(0x42CA0280UL))
#define bFM_ETHERNET_MAC0_SR_TPS                  *((volatile uint32_t*)(0x42CA0284UL))
#define bFM4_ETHERNET_MAC0_SR_TPS                 *((volatile uint32_t*)(0x42CA0284UL))
#define bFM_ETHERNET_MAC0_SR_TU                   *((volatile uint32_t*)(0x42CA0288UL))
#define bFM4_ETHERNET_MAC0_SR_TU                  *((volatile uint32_t*)(0x42CA0288UL))
#define bFM_ETHERNET_MAC0_SR_TJT                  *((volatile uint32_t*)(0x42CA028CUL))
#define bFM4_ETHERNET_MAC0_SR_TJT                 *((volatile uint32_t*)(0x42CA028CUL))
#define bFM_ETHERNET_MAC0_SR_OVF                  *((volatile uint32_t*)(0x42CA0290UL))
#define bFM4_ETHERNET_MAC0_SR_OVF                 *((volatile uint32_t*)(0x42CA0290UL))
#define bFM_ETHERNET_MAC0_SR_UNF                  *((volatile uint32_t*)(0x42CA0294UL))
#define bFM4_ETHERNET_MAC0_SR_UNF                 *((volatile uint32_t*)(0x42CA0294UL))
#define bFM_ETHERNET_MAC0_SR_RI                   *((volatile uint32_t*)(0x42CA0298UL))
#define bFM4_ETHERNET_MAC0_SR_RI                  *((volatile uint32_t*)(0x42CA0298UL))
#define bFM_ETHERNET_MAC0_SR_RU                   *((volatile uint32_t*)(0x42CA029CUL))
#define bFM4_ETHERNET_MAC0_SR_RU                  *((volatile uint32_t*)(0x42CA029CUL))
#define bFM_ETHERNET_MAC0_SR_RPS                  *((volatile uint32_t*)(0x42CA02A0UL))
#define bFM4_ETHERNET_MAC0_SR_RPS                 *((volatile uint32_t*)(0x42CA02A0UL))
#define bFM_ETHERNET_MAC0_SR_RWT                  *((volatile uint32_t*)(0x42CA02A4UL))
#define bFM4_ETHERNET_MAC0_SR_RWT                 *((volatile uint32_t*)(0x42CA02A4UL))
#define bFM_ETHERNET_MAC0_SR_ETI                  *((volatile uint32_t*)(0x42CA02A8UL))
#define bFM4_ETHERNET_MAC0_SR_ETI                 *((volatile uint32_t*)(0x42CA02A8UL))
#define bFM_ETHERNET_MAC0_SR_FBI                  *((volatile uint32_t*)(0x42CA02B4UL))
#define bFM4_ETHERNET_MAC0_SR_FBI                 *((volatile uint32_t*)(0x42CA02B4UL))
#define bFM_ETHERNET_MAC0_SR_ERI                  *((volatile uint32_t*)(0x42CA02B8UL))
#define bFM4_ETHERNET_MAC0_SR_ERI                 *((volatile uint32_t*)(0x42CA02B8UL))
#define bFM_ETHERNET_MAC0_SR_AIS                  *((volatile uint32_t*)(0x42CA02BCUL))
#define bFM4_ETHERNET_MAC0_SR_AIS                 *((volatile uint32_t*)(0x42CA02BCUL))
#define bFM_ETHERNET_MAC0_SR_NIS                  *((volatile uint32_t*)(0x42CA02C0UL))
#define bFM4_ETHERNET_MAC0_SR_NIS                 *((volatile uint32_t*)(0x42CA02C0UL))
#define bFM_ETHERNET_MAC0_SR_GLI                  *((volatile uint32_t*)(0x42CA02E8UL))
#define bFM4_ETHERNET_MAC0_SR_GLI                 *((volatile uint32_t*)(0x42CA02E8UL))
#define bFM_ETHERNET_MAC0_SR_GMI                  *((volatile uint32_t*)(0x42CA02ECUL))
#define bFM4_ETHERNET_MAC0_SR_GMI                 *((volatile uint32_t*)(0x42CA02ECUL))
#define bFM_ETHERNET_MAC0_SR_GPI                  *((volatile uint32_t*)(0x42CA02F0UL))
#define bFM4_ETHERNET_MAC0_SR_GPI                 *((volatile uint32_t*)(0x42CA02F0UL))
#define bFM_ETHERNET_MAC0_SR_TTI                  *((volatile uint32_t*)(0x42CA02F4UL))
#define bFM4_ETHERNET_MAC0_SR_TTI                 *((volatile uint32_t*)(0x42CA02F4UL))
#define bFM_ETHERNET_MAC0_SR_GLPII                *((volatile uint32_t*)(0x42CA02F8UL))
#define bFM4_ETHERNET_MAC0_SR_GLPII               *((volatile uint32_t*)(0x42CA02F8UL))

#define bFM_ETHERNET_MAC0_STNUR_ADDSUB            *((volatile uint32_t*)(0x42C8E2FCUL))
#define bFM4_ETHERNET_MAC0_STNUR_ADDSUB           *((volatile uint32_t*)(0x42C8E2FCUL))

