neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_DDR0_P0                          *((volatile uint32_t*)(0x42DE4000UL))
#define bFM4_GPIO_DDR0_P0                         *((volatile uint32_t*)(0x42DE4000UL))
#define bFM_GPIO_DDR0_P1                          *((volatile uint32_t*)(0x42DE4004UL))
#define bFM4_GPIO_DDR0_P1                         *((volatile uint32_t*)(0x42DE4004UL))
#define bFM_GPIO_DDR0_P2                          *((volatile uint32_t*)(0x42DE4008UL))
#define bFM4_GPIO_DDR0_P2                         *((volatile uint32_t*)(0x42DE4008UL))
#define bFM_GPIO_DDR0_P3                          *((volatile uint32_t*)(0x42DE400CUL))
#define bFM4_GPIO_DDR0_P3                         *((volatile uint32_t*)(0x42DE400CUL))
#define bFM_GPIO_DDR0_P4                          *((volatile uint32_t*)(0x42DE4010UL))
#define bFM4_GPIO_DDR0_P4                         *((volatile uint32_t*)(0x42DE4010UL))
#define bFM_GPIO_DDR0_P8                          *((volatile uint32_t*)(0x42DE4020UL))
#define bFM4_GPIO_DDR0_P8                         *((volatile uint32_t*)(0x42DE4020UL))
#define bFM_GPIO_DDR0_P9                          *((volatile uint32_t*)(0x42DE4024UL))
#define bFM4_GPIO_DDR0_P9                         *((volatile uint32_t*)(0x42DE4024UL))
#define bFM_GPIO_DDR0_PA                          *((volatile uint32_t*)(0x42DE4028UL))
#define bFM4_GPIO_DDR0_PA                         *((volatile uint32_t*)(0x42DE4028UL))

#define bFM_GPIO_DDR1_P0                          *((volatile uint32_t*)(0x42DE4080UL))
#define bFM4_GPIO_DDR1_P0                         *((volatile uint32_t*)(0x42DE4080UL))
#define bFM_GPIO_DDR1_P1                          *((volatile uint32_t*)(0x42DE4084UL))
#define bFM4_GPIO_DDR1_P1                         *((volatile uint32_t*)(0x42DE4084UL))
#define bFM_GPIO_DDR1_P2                          *((volatile uint32_t*)(0x42DE4088UL))
#define bFM4_GPIO_DDR1_P2                         *((volatile uint32_t*)(0x42DE4088UL))
#define bFM_GPIO_DDR1_P3                          *((volatile uint32_t*)(0x42DE408CUL))
#define bFM4_GPIO_DDR1_P3                         *((volatile uint32_t*)(0x42DE408CUL))
#define bFM_GPIO_DDR1_P4                          *((volatile uint32_t*)(0x42DE4090UL))
#define bFM4_GPIO_DDR1_P4                         *((volatile uint32_t*)(0x42DE4090UL))
#define bFM_GPIO_DDR1_P5                          *((volatile uint32_t*)(0x42DE4094UL))
#define bFM4_GPIO_DDR1_P5                         *((volatile uint32_t*)(0x42DE4094UL))
#define bFM_GPIO_DDR1_P6                          *((volatile uint32_t*)(0x42DE4098UL))
#define bFM4_GPIO_DDR1_P6                         *((volatile uint32_t*)(0x42DE4098UL))
#define bFM_GPIO_DDR1_P7                          *((volatile uint32_t*)(0x42DE409CUL))
#define bFM4_GPIO_DDR1_P7                         *((volatile uint32_t*)(0x42DE409CUL))
#define bFM_GPIO_DDR1_P8                          *((volatile uint32_t*)(0x42DE40A0UL))
#define bFM4_GPIO_DDR1_P8                         *((volatile uint32_t*)(0x42DE40A0UL))
#define bFM_GPIO_DDR1_P9                          *((volatile uint32_t*)(0x42DE40A4UL))
#define bFM4_GPIO_DDR1_P9                         *((volatile uint32_t*)(0x42DE40A4UL))
#define bFM_GPIO_DDR1_PA                          *((volatile uint32_t*)(0x42DE40A8UL))
#define bFM4_GPIO_DDR1_PA                         *((volatile uint32_t*)(0x42DE40A8UL))
#define bFM_GPIO_DDR1_PB                          *((volatile uint32_t*)(0x42DE40ACUL))
#define bFM4_GPIO_DDR1_PB                         *((volatile uint32_t*)(0x42DE40ACUL))
#define bFM_GPIO_DDR1_PC                          *((volatile uint32_t*)(0x42DE40B0UL))
#define bFM4_GPIO_DDR1_PC                         *((volatile uint32_t*)(0x42DE40B0UL))
#define bFM_GPIO_DDR1_PD                          *((volatile uint32_t*)(0x42DE40B4UL))
#define bFM4_GPIO_DDR1_PD                         *((volatile uint32_t*)(0x42DE40B4UL))
#define bFM_GPIO_DDR1_PE                          *((volatile uint32_t*)(0x42DE40B8UL))
#define bFM4_GPIO_DDR1_PE                         *((volatile uint32_t*)(0x42DE40B8UL))
#define bFM_GPIO_DDR1_PF                          *((volatile uint32_t*)(0x42DE40BCUL))
#define bFM4_GPIO_DDR1_PF                         *((volatile uint32_t*)(0x42DE40BCUL))

#define bFM_GPIO_DDR2_P0                          *((volatile uint32_t*)(0x42DE4100UL))
#define bFM4_GPIO_DDR2_P0                         *((volatile uint32_t*)(0x42DE4100UL))
#define bFM_GPIO_DDR2_P1                          *((volatile uint32_t*)(0x42DE4104UL))
#define bFM4_GPIO_DDR2_P1                         *((volatile uint32_t*)(0x42DE4104UL))
#define bFM_GPIO_DDR2_P2                          *((volatile uint32_t*)(0x42DE4108UL))
#define bFM4_GPIO_DDR2_P2                         *((volatile uint32_t*)(0x42DE4108UL))
#define bFM_GPIO_DDR2_P3                          *((volatile uint32_t*)(0x42DE410CUL))
#define bFM4_GPIO_DDR2_P3                         *((volatile uint32_t*)(0x42DE410CUL))
#define bFM_GPIO_DDR2_P4                          *((volatile uint32_t*)(0x42DE4110UL))
#define bFM4_GPIO_DDR2_P4                         *((volatile uint32_t*)(0x42DE4110UL))
#define bFM_GPIO_DDR2_P5                          *((volatile uint32_t*)(0x42DE4114UL))
#define bFM4_GPIO_DDR2_P5                         *((volatile uint32_t*)(0x42DE4114UL))
#define bFM_GPIO_DDR2_P6                          *((volatile uint32_t*)(0x42DE4118UL))
#define bFM4_GPIO_DDR2_P6                         *((volatile uint32_t*)(0x42DE4118UL))
#define bFM_GPIO_DDR2_P7                          *((volatile uint32_t*)(0x42DE411CUL))
#define bFM4_GPIO_DDR2_P7                         *((volatile uint32_t*)(0x42DE411CUL))
#define bFM_GPIO_DDR2_P8                          *((volatile uint32_t*)(0x42DE4120UL))
#define bFM4_GPIO_DDR2_P8                         *((volatile uint32_t*)(0x42DE4120UL))
#define bFM_GPIO_DDR2_P9                          *((volatile uint32_t*)(0x42DE4124UL))
#define bFM4_GPIO_DDR2_P9                         *((volatile uint32_t*)(0x42DE4124UL))
#define bFM_GPIO_DDR2_PA                          *((volatile uint32_t*)(0x42DE4128UL))
#define bFM4_GPIO_DDR2_PA                         *((volatile uint32_t*)(0x42DE4128UL))

