neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_DDR3_P0                          *((volatile uint32_t*)(0x42DE4180UL))
#define bFM4_GPIO_DDR3_P0                         *((volatile uint32_t*)(0x42DE4180UL))
#define bFM_GPIO_DDR3_P1                          *((volatile uint32_t*)(0x42DE4184UL))
#define bFM4_GPIO_DDR3_P1                         *((volatile uint32_t*)(0x42DE4184UL))
#define bFM_GPIO_DDR3_P2                          *((volatile uint32_t*)(0x42DE4188UL))
#define bFM4_GPIO_DDR3_P2                         *((volatile uint32_t*)(0x42DE4188UL))
#define bFM_GPIO_DDR3_P3                          *((volatile uint32_t*)(0x42DE418CUL))
#define bFM4_GPIO_DDR3_P3                         *((volatile uint32_t*)(0x42DE418CUL))
#define bFM_GPIO_DDR3_P4                          *((volatile uint32_t*)(0x42DE4190UL))
#define bFM4_GPIO_DDR3_P4                         *((volatile uint32_t*)(0x42DE4190UL))
#define bFM_GPIO_DDR3_P5                          *((volatile uint32_t*)(0x42DE4194UL))
#define bFM4_GPIO_DDR3_P5                         *((volatile uint32_t*)(0x42DE4194UL))
#define bFM_GPIO_DDR3_P6                          *((volatile uint32_t*)(0x42DE4198UL))
#define bFM4_GPIO_DDR3_P6                         *((volatile uint32_t*)(0x42DE4198UL))
#define bFM_GPIO_DDR3_P7                          *((volatile uint32_t*)(0x42DE419CUL))
#define bFM4_GPIO_DDR3_P7                         *((volatile uint32_t*)(0x42DE419CUL))
#define bFM_GPIO_DDR3_P8                          *((volatile uint32_t*)(0x42DE41A0UL))
#define bFM4_GPIO_DDR3_P8                         *((volatile uint32_t*)(0x42DE41A0UL))
#define bFM_GPIO_DDR3_P9                          *((volatile uint32_t*)(0x42DE41A4UL))
#define bFM4_GPIO_DDR3_P9                         *((volatile uint32_t*)(0x42DE41A4UL))
#define bFM_GPIO_DDR3_PA                          *((volatile uint32_t*)(0x42DE41A8UL))
#define bFM4_GPIO_DDR3_PA                         *((volatile uint32_t*)(0x42DE41A8UL))
#define bFM_GPIO_DDR3_PB                          *((volatile uint32_t*)(0x42DE41ACUL))
#define bFM4_GPIO_DDR3_PB                         *((volatile uint32_t*)(0x42DE41ACUL))
#define bFM_GPIO_DDR3_PC                          *((volatile uint32_t*)(0x42DE41B0UL))
#define bFM4_GPIO_DDR3_PC                         *((volatile uint32_t*)(0x42DE41B0UL))
#define bFM_GPIO_DDR3_PD                          *((volatile uint32_t*)(0x42DE41B4UL))
#define bFM4_GPIO_DDR3_PD                         *((volatile uint32_t*)(0x42DE41B4UL))
#define bFM_GPIO_DDR3_PE                          *((volatile uint32_t*)(0x42DE41B8UL))
#define bFM4_GPIO_DDR3_PE                         *((volatile uint32_t*)(0x42DE41B8UL))

#define bFM_GPIO_DDR4_P0                          *((volatile uint32_t*)(0x42DE4200UL))
#define bFM4_GPIO_DDR4_P0                         *((volatile uint32_t*)(0x42DE4200UL))
#define bFM_GPIO_DDR4_P1                          *((volatile uint32_t*)(0x42DE4204UL))
#define bFM4_GPIO_DDR4_P1                         *((volatile uint32_t*)(0x42DE4204UL))
#define bFM_GPIO_DDR4_P2                          *((volatile uint32_t*)(0x42DE4208UL))
#define bFM4_GPIO_DDR4_P2                         *((volatile uint32_t*)(0x42DE4208UL))
#define bFM_GPIO_DDR4_P3                          *((volatile uint32_t*)(0x42DE420CUL))
#define bFM4_GPIO_DDR4_P3                         *((volatile uint32_t*)(0x42DE420CUL))
#define bFM_GPIO_DDR4_P4                          *((volatile uint32_t*)(0x42DE4210UL))
#define bFM4_GPIO_DDR4_P4                         *((volatile uint32_t*)(0x42DE4210UL))
#define bFM_GPIO_DDR4_P5                          *((volatile uint32_t*)(0x42DE4214UL))
#define bFM4_GPIO_DDR4_P5                         *((volatile uint32_t*)(0x42DE4214UL))
#define bFM_GPIO_DDR4_P6                          *((volatile uint32_t*)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P6                         *((volatile uint32_t*)(0x42DE4218UL))
#define bFM_GPIO_DDR4_P7                          *((volatile uint32_t*)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P7                         *((volatile uint32_t*)(0x42DE421CUL))
#define bFM_GPIO_DDR4_P8                          *((volatile uint32_t*)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P8                         *((volatile uint32_t*)(0x42DE4220UL))
#define bFM_GPIO_DDR4_P9                          *((volatile uint32_t*)(0x42DE4224UL))
#define bFM4_GPIO_DDR4_P9                         *((volatile uint32_t*)(0x42DE4224UL))
#define bFM_GPIO_DDR4_PA                          *((volatile uint32_t*)(0x42DE4228UL))
#define bFM4_GPIO_DDR4_PA                         *((volatile uint32_t*)(0x42DE4228UL))
#define bFM_GPIO_DDR4_PB                          *((volatile uint32_t*)(0x42DE422CUL))
#define bFM4_GPIO_DDR4_PB                         *((volatile uint32_t*)(0x42DE422CUL))
#define bFM_GPIO_DDR4_PC                          *((volatile uint32_t*)(0x42DE4230UL))
#define bFM4_GPIO_DDR4_PC                         *((volatile uint32_t*)(0x42DE4230UL))
#define bFM_GPIO_DDR4_PD                          *((volatile uint32_t*)(0x42DE4234UL))
#define bFM4_GPIO_DDR4_PD                         *((volatile uint32_t*)(0x42DE4234UL))
#define bFM_GPIO_DDR4_PE                          *((volatile uint32_t*)(0x42DE4238UL))
#define bFM4_GPIO_DDR4_PE                         *((volatile uint32_t*)(0x42DE4238UL))

#define bFM_GPIO_DDR5_P0                          *((volatile uint32_t*)(0x42DE4280UL))
#define bFM4_GPIO_DDR5_P0                         *((volatile uint32_t*)(0x42DE4280UL))
#define bFM_GPIO_DDR5_P1                          *((volatile uint32_t*)(0x42DE4284UL))
#define bFM4_GPIO_DDR5_P1                         *((volatile uint32_t*)(0x42DE4284UL))
#define bFM_GPIO_DDR5_P2                          *((volatile uint32_t*)(0x42DE4288UL))
#define bFM4_GPIO_DDR5_P2                         *((volatile uint32_t*)(0x42DE4288UL))
#define bFM_GPIO_DDR5_P3                          *((volatile uint32_t*)(0x42DE428CUL))
#define bFM4_GPIO_DDR5_P3                         *((volatile uint32_t*)(0x42DE428CUL))
#define bFM_GPIO_DDR5_P4                          *((volatile uint32_t*)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P4                         *((volatile uint32_t*)(0x42DE4290UL))
#define bFM_GPIO_DDR5_P5                          *((volatile uint32_t*)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P5                         *((volatile uint32_t*)(0x42DE4294UL))
#define bFM_GPIO_DDR5_P6                          *((volatile uint32_t*)(0x42DE4298UL))
#define bFM4_GPIO_DDR5_P6                         *((volatile uint32_t*)(0x42DE4298UL))
#define bFM_GPIO_DDR5_P7                          *((volatile uint32_t*)(0x42DE429CUL))
#define bFM4_GPIO_DDR5_P7                         *((volatile uint32_t*)(0x42DE429CUL))
#define bFM_GPIO_DDR5_P8                          *((volatile uint32_t*)(0x42DE42A0UL))
#define bFM4_GPIO_DDR5_P8                         *((volatile uint32_t*)(0x42DE42A0UL))
#define bFM_GPIO_DDR5_P9                          *((volatile uint32_t*)(0x42DE42A4UL))
#define bFM4_GPIO_DDR5_P9                         *((volatile uint32_t*)(0x42DE42A4UL))
#define bFM_GPIO_DDR5_PA                          *((volatile uint32_t*)(0x42DE42A8UL))
#define bFM4_GPIO_DDR5_PA                         *((volatile uint32_t*)(0x42DE42A8UL))
#define bFM_GPIO_DDR5_PB                          *((volatile uint32_t*)(0x42DE42ACUL))
#define bFM4_GPIO_DDR5_PB                         *((volatile uint32_t*)(0x42DE42ACUL))
#define bFM_GPIO_DDR5_PC                          *((volatile uint32_t*)(0x42DE42B0UL))
#define bFM4_GPIO_DDR5_PC                         *((volatile uint32_t*)(0x42DE42B0UL))
#define bFM_GPIO_DDR5_PD                          *((volatile uint32_t*)(0x42DE42B4UL))
#define bFM4_GPIO_DDR5_PD                         *((volatile uint32_t*)(0x42DE42B4UL))
#define bFM_GPIO_DDR5_PE                          *((volatile uint32_t*)(0x42DE42B8UL))
#define bFM4_GPIO_DDR5_PE                         *((volatile uint32_t*)(0x42DE42B8UL))
#define bFM_GPIO_DDR5_PF                          *((volatile uint32_t*)(0x42DE42BCUL))
#define bFM4_GPIO_DDR5_PF                         *((volatile uint32_t*)(0x42DE42BCUL))

#define bFM_GPIO_DDR6_P0                          *((volatile uint32_t*)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P0                         *((volatile uint32_t*)(0x42DE4300UL))
#define bFM_GPIO_DDR6_P1                          *((volatile uint32_t*)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P1                         *((volatile uint32_t*)(0x42DE4304UL))
#define bFM_GPIO_DDR6_P2                          *((volatile uint32_t*)(0x42DE4308UL))
#define bFM4_GPIO_DDR6_P2                         *((volatile uint32_t*)(0x42DE4308UL))
#define bFM_GPIO_DDR6_P3                          *((volatile uint32_t*)(0x42DE430CUL))
#define bFM4_GPIO_DDR6_P3                         *((volatile uint32_t*)(0x42DE430CUL))
#define bFM_GPIO_DDR6_P4                          *((volatile uint32_t*)(0x42DE4310UL))
#define bFM4_GPIO_DDR6_P4                         *((volatile uint32_t*)(0x42DE4310UL))
#define bFM_GPIO_DDR6_P5                          *((volatile uint32_t*)(0x42DE4314UL))
#define bFM4_GPIO_DDR6_P5                         *((volatile uint32_t*)(0x42DE4314UL))
#define bFM_GPIO_DDR6_P6                          *((volatile uint32_t*)(0x42DE4318UL))
#define bFM4_GPIO_DDR6_P6                         *((volatile uint32_t*)(0x42DE4318UL))
#define bFM_GPIO_DDR6_P7                          *((volatile uint32_t*)(0x42DE431CUL))
#define bFM4_GPIO_DDR6_P7                         *((volatile uint32_t*)(0x42DE431CUL))
#define bFM_GPIO_DDR6_P8                          *((volatile uint32_t*)(0x42DE4320UL))
#define bFM4_GPIO_DDR6_P8                         *((volatile uint32_t*)(0x42DE4320UL))
#define bFM_GPIO_DDR6_P9                          *((volatile uint32_t*)(0x42DE4324UL))
#define bFM4_GPIO_DDR6_P9                         *((volatile uint32_t*)(0x42DE4324UL))
#define bFM_GPIO_DDR6_PA                          *((volatile uint32_t*)(0x42DE4328UL))
#define bFM4_GPIO_DDR6_PA                         *((volatile uint32_t*)(0x42DE4328UL))
#define bFM_GPIO_DDR6_PB                          *((volatile uint32_t*)(0x42DE432CUL))
#define bFM4_GPIO_DDR6_PB                         *((volatile uint32_t*)(0x42DE432CUL))
#define bFM_GPIO_DDR6_PC                          *((volatile uint32_t*)(0x42DE4330UL))
#define bFM4_GPIO_DDR6_PC                         *((volatile uint32_t*)(0x42DE4330UL))
#define bFM_GPIO_DDR6_PD                          *((volatile uint32_t*)(0x42DE4334UL))
#define bFM4_GPIO_DDR6_PD                         *((volatile uint32_t*)(0x42DE4334UL))
#define bFM_GPIO_DDR6_PE                          *((volatile uint32_t*)(0x42DE4338UL))
#define bFM4_GPIO_DDR6_PE                         *((volatile uint32_t*)(0x42DE4338UL))

#define bFM_GPIO_DDR7_P0                          *((volatile uint32_t*)(0x42DE4380UL))
#define bFM4_GPIO_DDR7_P0                         *((volatile uint32_t*)(0x42DE4380UL))
#define bFM_GPIO_DDR7_P1                          *((volatile uint32_t*)(0x42DE4384UL))
#define bFM4_GPIO_DDR7_P1                         *((volatile uint32_t*)(0x42DE4384UL))
#define bFM_GPIO_DDR7_P2                          *((volatile uint32_t*)(0x42DE4388UL))
#define bFM4_GPIO_DDR7_P2                         *((volatile uint32_t*)(0x42DE4388UL))
#define bFM_GPIO_DDR7_P3                          *((volatile uint32_t*)(0x42DE438CUL))
#define bFM4_GPIO_DDR7_P3                         *((volatile uint32_t*)(0x42DE438CUL))
#define bFM_GPIO_DDR7_P4                          *((volatile uint32_t*)(0x42DE4390UL))
#define bFM4_GPIO_DDR7_P4                         *((volatile uint32_t*)(0x42DE4390UL))
#define bFM_GPIO_DDR7_P5                          *((volatile uint32_t*)(0x42DE4394UL))
#define bFM4_GPIO_DDR7_P5                         *((volatile uint32_t*)(0x42DE4394UL))
#define bFM_GPIO_DDR7_P6                          *((volatile uint32_t*)(0x42DE4398UL))
#define bFM4_GPIO_DDR7_P6                         *((volatile uint32_t*)(0x42DE4398UL))
#define bFM_GPIO_DDR7_P7                          *((volatile uint32_t*)(0x42DE439CUL))
#define bFM4_GPIO_DDR7_P7                         *((volatile uint32_t*)(0x42DE439CUL))
#define bFM_GPIO_DDR7_P8                          *((volatile uint32_t*)(0x42DE43A0UL))
#define bFM4_GPIO_DDR7_P8                         *((volatile uint32_t*)(0x42DE43A0UL))
#define bFM_GPIO_DDR7_P9                          *((volatile uint32_t*)(0x42DE43A4UL))
#define bFM4_GPIO_DDR7_P9                         *((volatile uint32_t*)(0x42DE43A4UL))
#define bFM_GPIO_DDR7_PA                          *((volatile uint32_t*)(0x42DE43A8UL))
#define bFM4_GPIO_DDR7_PA                         *((volatile uint32_t*)(0x42DE43A8UL))
#define bFM_GPIO_DDR7_PB                          *((volatile uint32_t*)(0x42DE43ACUL))
#define bFM4_GPIO_DDR7_PB                         *((volatile uint32_t*)(0x42DE43ACUL))
#define bFM_GPIO_DDR7_PC                          *((volatile uint32_t*)(0x42DE43B0UL))
#define bFM4_GPIO_DDR7_PC                         *((volatile uint32_t*)(0x42DE43B0UL))
#define bFM_GPIO_DDR7_PD                          *((volatile uint32_t*)(0x42DE43B4UL))
#define bFM4_GPIO_DDR7_PD                         *((volatile uint32_t*)(0x42DE43B4UL))
#define bFM_GPIO_DDR7_PE                          *((volatile uint32_t*)(0x42DE43B8UL))
#define bFM4_GPIO_DDR7_PE                         *((volatile uint32_t*)(0x42DE43B8UL))

#define bFM_GPIO_DDR8_P0                          *((volatile uint32_t*)(0x42DE4400UL))
#define bFM4_GPIO_DDR8_P0                         *((volatile uint32_t*)(0x42DE4400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile uint32_t*)(0x42DE4404UL))
#define bFM4_GPIO_DDR8_P1                         *((volatile uint32_t*)(0x42DE4404UL))
#define bFM_GPIO_DDR8_P2                          *((volatile uint32_t*)(0x42DE4408UL))
#define bFM4_GPIO_DDR8_P2                         *((volatile uint32_t*)(0x42DE4408UL))
#define bFM_GPIO_DDR8_P3                          *((volatile uint32_t*)(0x42DE440CUL))
#define bFM4_GPIO_DDR8_P3                         *((volatile uint32_t*)(0x42DE440CUL))

