neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_DDR9_P0                          *((volatile uint32_t*)(0x42DE4480UL))
#define bFM4_GPIO_DDR9_P0                         *((volatile uint32_t*)(0x42DE4480UL))
#define bFM_GPIO_DDR9_P1                          *((volatile uint32_t*)(0x42DE4484UL))
#define bFM4_GPIO_DDR9_P1                         *((volatile uint32_t*)(0x42DE4484UL))
#define bFM_GPIO_DDR9_P2                          *((volatile uint32_t*)(0x42DE4488UL))
#define bFM4_GPIO_DDR9_P2                         *((volatile uint32_t*)(0x42DE4488UL))
#define bFM_GPIO_DDR9_P3                          *((volatile uint32_t*)(0x42DE448CUL))
#define bFM4_GPIO_DDR9_P3                         *((volatile uint32_t*)(0x42DE448CUL))
#define bFM_GPIO_DDR9_P4                          *((volatile uint32_t*)(0x42DE4490UL))
#define bFM4_GPIO_DDR9_P4                         *((volatile uint32_t*)(0x42DE4490UL))
#define bFM_GPIO_DDR9_P5                          *((volatile uint32_t*)(0x42DE4494UL))
#define bFM4_GPIO_DDR9_P5                         *((volatile uint32_t*)(0x42DE4494UL))
#define bFM_GPIO_DDR9_P6                          *((volatile uint32_t*)(0x42DE4498UL))
#define bFM4_GPIO_DDR9_P6                         *((volatile uint32_t*)(0x42DE4498UL))
#define bFM_GPIO_DDR9_P7                          *((volatile uint32_t*)(0x42DE449CUL))
#define bFM4_GPIO_DDR9_P7                         *((volatile uint32_t*)(0x42DE449CUL))

#define bFM_GPIO_DDRA_P0                          *((volatile uint32_t*)(0x42DE4500UL))
#define bFM4_GPIO_DDRA_P0                         *((volatile uint32_t*)(0x42DE4500UL))
#define bFM_GPIO_DDRA_P1                          *((volatile uint32_t*)(0x42DE4504UL))
#define bFM4_GPIO_DDRA_P1                         *((volatile uint32_t*)(0x42DE4504UL))
#define bFM_GPIO_DDRA_P2                          *((volatile uint32_t*)(0x42DE4508UL))
#define bFM4_GPIO_DDRA_P2                         *((volatile uint32_t*)(0x42DE4508UL))
#define bFM_GPIO_DDRA_P3                          *((volatile uint32_t*)(0x42DE450CUL))
#define bFM4_GPIO_DDRA_P3                         *((volatile uint32_t*)(0x42DE450CUL))
#define bFM_GPIO_DDRA_P4                          *((volatile uint32_t*)(0x42DE4510UL))
#define bFM4_GPIO_DDRA_P4                         *((volatile uint32_t*)(0x42DE4510UL))
#define bFM_GPIO_DDRA_P5                          *((volatile uint32_t*)(0x42DE4514UL))
#define bFM4_GPIO_DDRA_P5                         *((volatile uint32_t*)(0x42DE4514UL))
#define bFM_GPIO_DDRA_P6                          *((volatile uint32_t*)(0x42DE4518UL))
#define bFM4_GPIO_DDRA_P6                         *((volatile uint32_t*)(0x42DE4518UL))
#define bFM_GPIO_DDRA_P7                          *((volatile uint32_t*)(0x42DE451CUL))
#define bFM4_GPIO_DDRA_P7                         *((volatile uint32_t*)(0x42DE451CUL))
#define bFM_GPIO_DDRA_P8                          *((volatile uint32_t*)(0x42DE4520UL))
#define bFM4_GPIO_DDRA_P8                         *((volatile uint32_t*)(0x42DE4520UL))
#define bFM_GPIO_DDRA_P9                          *((volatile uint32_t*)(0x42DE4524UL))
#define bFM4_GPIO_DDRA_P9                         *((volatile uint32_t*)(0x42DE4524UL))
#define bFM_GPIO_DDRA_PA                          *((volatile uint32_t*)(0x42DE4528UL))
#define bFM4_GPIO_DDRA_PA                         *((volatile uint32_t*)(0x42DE4528UL))
#define bFM_GPIO_DDRA_PB                          *((volatile uint32_t*)(0x42DE452CUL))
#define bFM4_GPIO_DDRA_PB                         *((volatile uint32_t*)(0x42DE452CUL))
#define bFM_GPIO_DDRA_PC                          *((volatile uint32_t*)(0x42DE4530UL))
#define bFM4_GPIO_DDRA_PC                         *((volatile uint32_t*)(0x42DE4530UL))
#define bFM_GPIO_DDRA_PD                          *((volatile uint32_t*)(0x42DE4534UL))
#define bFM4_GPIO_DDRA_PD                         *((volatile uint32_t*)(0x42DE4534UL))
#define bFM_GPIO_DDRA_PE                          *((volatile uint32_t*)(0x42DE4538UL))
#define bFM4_GPIO_DDRA_PE                         *((volatile uint32_t*)(0x42DE4538UL))
#define bFM_GPIO_DDRA_PF                          *((volatile uint32_t*)(0x42DE453CUL))
#define bFM4_GPIO_DDRA_PF                         *((volatile uint32_t*)(0x42DE453CUL))

#define bFM_GPIO_DDRB_P0                          *((volatile uint32_t*)(0x42DE4580UL))
#define bFM4_GPIO_DDRB_P0                         *((volatile uint32_t*)(0x42DE4580UL))
#define bFM_GPIO_DDRB_P1                          *((volatile uint32_t*)(0x42DE4584UL))
#define bFM4_GPIO_DDRB_P1                         *((volatile uint32_t*)(0x42DE4584UL))
#define bFM_GPIO_DDRB_P2                          *((volatile uint32_t*)(0x42DE4588UL))
#define bFM4_GPIO_DDRB_P2                         *((volatile uint32_t*)(0x42DE4588UL))
#define bFM_GPIO_DDRB_P3                          *((volatile uint32_t*)(0x42DE458CUL))
#define bFM4_GPIO_DDRB_P3                         *((volatile uint32_t*)(0x42DE458CUL))
#define bFM_GPIO_DDRB_P4                          *((volatile uint32_t*)(0x42DE4590UL))
#define bFM4_GPIO_DDRB_P4                         *((volatile uint32_t*)(0x42DE4590UL))
#define bFM_GPIO_DDRB_P5                          *((volatile uint32_t*)(0x42DE4594UL))
#define bFM4_GPIO_DDRB_P5                         *((volatile uint32_t*)(0x42DE4594UL))
#define bFM_GPIO_DDRB_P6                          *((volatile uint32_t*)(0x42DE4598UL))
#define bFM4_GPIO_DDRB_P6                         *((volatile uint32_t*)(0x42DE4598UL))
#define bFM_GPIO_DDRB_P7                          *((volatile uint32_t*)(0x42DE459CUL))
#define bFM4_GPIO_DDRB_P7                         *((volatile uint32_t*)(0x42DE459CUL))
#define bFM_GPIO_DDRB_P8                          *((volatile uint32_t*)(0x42DE45A0UL))
#define bFM4_GPIO_DDRB_P8                         *((volatile uint32_t*)(0x42DE45A0UL))
#define bFM_GPIO_DDRB_P9                          *((volatile uint32_t*)(0x42DE45A4UL))
#define bFM4_GPIO_DDRB_P9                         *((volatile uint32_t*)(0x42DE45A4UL))
#define bFM_GPIO_DDRB_PA                          *((volatile uint32_t*)(0x42DE45A8UL))
#define bFM4_GPIO_DDRB_PA                         *((volatile uint32_t*)(0x42DE45A8UL))
#define bFM_GPIO_DDRB_PB                          *((volatile uint32_t*)(0x42DE45ACUL))
#define bFM4_GPIO_DDRB_PB                         *((volatile uint32_t*)(0x42DE45ACUL))
#define bFM_GPIO_DDRB_PC                          *((volatile uint32_t*)(0x42DE45B0UL))
#define bFM4_GPIO_DDRB_PC                         *((volatile uint32_t*)(0x42DE45B0UL))
#define bFM_GPIO_DDRB_PD                          *((volatile uint32_t*)(0x42DE45B4UL))
#define bFM4_GPIO_DDRB_PD                         *((volatile uint32_t*)(0x42DE45B4UL))
#define bFM_GPIO_DDRB_PE                          *((volatile uint32_t*)(0x42DE45B8UL))
#define bFM4_GPIO_DDRB_PE                         *((volatile uint32_t*)(0x42DE45B8UL))
#define bFM_GPIO_DDRB_PF                          *((volatile uint32_t*)(0x42DE45BCUL))
#define bFM4_GPIO_DDRB_PF                         *((volatile uint32_t*)(0x42DE45BCUL))

#define bFM_GPIO_DDRC_P0                          *((volatile uint32_t*)(0x42DE4600UL))
#define bFM4_GPIO_DDRC_P0                         *((volatile uint32_t*)(0x42DE4600UL))
#define bFM_GPIO_DDRC_P1                          *((volatile uint32_t*)(0x42DE4604UL))
#define bFM4_GPIO_DDRC_P1                         *((volatile uint32_t*)(0x42DE4604UL))
#define bFM_GPIO_DDRC_P2                          *((volatile uint32_t*)(0x42DE4608UL))
#define bFM4_GPIO_DDRC_P2                         *((volatile uint32_t*)(0x42DE4608UL))
#define bFM_GPIO_DDRC_P3                          *((volatile uint32_t*)(0x42DE460CUL))
#define bFM4_GPIO_DDRC_P3                         *((volatile uint32_t*)(0x42DE460CUL))
#define bFM_GPIO_DDRC_P4                          *((volatile uint32_t*)(0x42DE4610UL))
#define bFM4_GPIO_DDRC_P4                         *((volatile uint32_t*)(0x42DE4610UL))
#define bFM_GPIO_DDRC_P5                          *((volatile uint32_t*)(0x42DE4614UL))
#define bFM4_GPIO_DDRC_P5                         *((volatile uint32_t*)(0x42DE4614UL))
#define bFM_GPIO_DDRC_P6                          *((volatile uint32_t*)(0x42DE4618UL))
#define bFM4_GPIO_DDRC_P6                         *((volatile uint32_t*)(0x42DE4618UL))
#define bFM_GPIO_DDRC_P7                          *((volatile uint32_t*)(0x42DE461CUL))
#define bFM4_GPIO_DDRC_P7                         *((volatile uint32_t*)(0x42DE461CUL))
#define bFM_GPIO_DDRC_P8                          *((volatile uint32_t*)(0x42DE4620UL))
#define bFM4_GPIO_DDRC_P8                         *((volatile uint32_t*)(0x42DE4620UL))
#define bFM_GPIO_DDRC_P9                          *((volatile uint32_t*)(0x42DE4624UL))
#define bFM4_GPIO_DDRC_P9                         *((volatile uint32_t*)(0x42DE4624UL))
#define bFM_GPIO_DDRC_PA                          *((volatile uint32_t*)(0x42DE4628UL))
#define bFM4_GPIO_DDRC_PA                         *((volatile uint32_t*)(0x42DE4628UL))
#define bFM_GPIO_DDRC_PB                          *((volatile uint32_t*)(0x42DE462CUL))
#define bFM4_GPIO_DDRC_PB                         *((volatile uint32_t*)(0x42DE462CUL))
#define bFM_GPIO_DDRC_PC                          *((volatile uint32_t*)(0x42DE4630UL))
#define bFM4_GPIO_DDRC_PC                         *((volatile uint32_t*)(0x42DE4630UL))
#define bFM_GPIO_DDRC_PD                          *((volatile uint32_t*)(0x42DE4634UL))
#define bFM4_GPIO_DDRC_PD                         *((volatile uint32_t*)(0x42DE4634UL))
#define bFM_GPIO_DDRC_PE                          *((volatile uint32_t*)(0x42DE4638UL))
#define bFM4_GPIO_DDRC_PE                         *((volatile uint32_t*)(0x42DE4638UL))
#define bFM_GPIO_DDRC_PF                          *((volatile uint32_t*)(0x42DE463CUL))
#define bFM4_GPIO_DDRC_PF                         *((volatile uint32_t*)(0x42DE463CUL))

#define bFM_GPIO_DDRD_P0                          *((volatile uint32_t*)(0x42DE4680UL))
#define bFM4_GPIO_DDRD_P0                         *((volatile uint32_t*)(0x42DE4680UL))
#define bFM_GPIO_DDRD_P1                          *((volatile uint32_t*)(0x42DE4684UL))
#define bFM4_GPIO_DDRD_P1                         *((volatile uint32_t*)(0x42DE4684UL))
#define bFM_GPIO_DDRD_P2                          *((volatile uint32_t*)(0x42DE4688UL))
#define bFM4_GPIO_DDRD_P2                         *((volatile uint32_t*)(0x42DE4688UL))

