neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_DDRE_P0                          *((volatile uint32_t*)(0x42DE4700UL))
#define bFM4_GPIO_DDRE_P0                         *((volatile uint32_t*)(0x42DE4700UL))
#define bFM_GPIO_DDRE_P2                          *((volatile uint32_t*)(0x42DE4708UL))
#define bFM4_GPIO_DDRE_P2                         *((volatile uint32_t*)(0x42DE4708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile uint32_t*)(0x42DE470CUL))
#define bFM4_GPIO_DDRE_P3                         *((volatile uint32_t*)(0x42DE470CUL))

#define bFM_GPIO_DDRF_P0                          *((volatile uint32_t*)(0x42DE4780UL))
#define bFM4_GPIO_DDRF_P0                         *((volatile uint32_t*)(0x42DE4780UL))
#define bFM_GPIO_DDRF_P1                          *((volatile uint32_t*)(0x42DE4784UL))
#define bFM4_GPIO_DDRF_P1                         *((volatile uint32_t*)(0x42DE4784UL))
#define bFM_GPIO_DDRF_P2                          *((volatile uint32_t*)(0x42DE4788UL))
#define bFM4_GPIO_DDRF_P2                         *((volatile uint32_t*)(0x42DE4788UL))
#define bFM_GPIO_DDRF_P3                          *((volatile uint32_t*)(0x42DE478CUL))
#define bFM4_GPIO_DDRF_P3                         *((volatile uint32_t*)(0x42DE478CUL))
#define bFM_GPIO_DDRF_P4                          *((volatile uint32_t*)(0x42DE4790UL))
#define bFM4_GPIO_DDRF_P4                         *((volatile uint32_t*)(0x42DE4790UL))
#define bFM_GPIO_DDRF_P5                          *((volatile uint32_t*)(0x42DE4794UL))
#define bFM4_GPIO_DDRF_P5                         *((volatile uint32_t*)(0x42DE4794UL))
#define bFM_GPIO_DDRF_P6                          *((volatile uint32_t*)(0x42DE4798UL))
#define bFM4_GPIO_DDRF_P6                         *((volatile uint32_t*)(0x42DE4798UL))
#define bFM_GPIO_DDRF_P7                          *((volatile uint32_t*)(0x42DE479CUL))
#define bFM4_GPIO_DDRF_P7                         *((volatile uint32_t*)(0x42DE479CUL))
#define bFM_GPIO_DDRF_P8                          *((volatile uint32_t*)(0x42DE47A0UL))
#define bFM4_GPIO_DDRF_P8                         *((volatile uint32_t*)(0x42DE47A0UL))
#define bFM_GPIO_DDRF_P9                          *((volatile uint32_t*)(0x42DE47A4UL))
#define bFM4_GPIO_DDRF_P9                         *((volatile uint32_t*)(0x42DE47A4UL))
#define bFM_GPIO_DDRF_PA                          *((volatile uint32_t*)(0x42DE47A8UL))
#define bFM4_GPIO_DDRF_PA                         *((volatile uint32_t*)(0x42DE47A8UL))
#define bFM_GPIO_DDRF_PB                          *((volatile uint32_t*)(0x42DE47ACUL))
#define bFM4_GPIO_DDRF_PB                         *((volatile uint32_t*)(0x42DE47ACUL))
#define bFM_GPIO_DDRF_PC                          *((volatile uint32_t*)(0x42DE47B0UL))
#define bFM4_GPIO_DDRF_PC                         *((volatile uint32_t*)(0x42DE47B0UL))

#define bFM_GPIO_EPFR00_NMIS                      *((volatile uint32_t*)(0x42DEC000UL))
#define bFM4_GPIO_EPFR00_NMIS                     *((volatile uint32_t*)(0x42DEC000UL))
#define bFM_GPIO_EPFR00_USBP0E                    *((volatile uint32_t*)(0x42DEC024UL))
#define bFM4_GPIO_EPFR00_USBP0E                   *((volatile uint32_t*)(0x42DEC024UL))
#define bFM_GPIO_EPFR00_USBP1E                    *((volatile uint32_t*)(0x42DEC034UL))
#define bFM4_GPIO_EPFR00_USBP1E                   *((volatile uint32_t*)(0x42DEC034UL))
#define bFM_GPIO_EPFR00_JTAGEN0B                  *((volatile uint32_t*)(0x42DEC040UL))
#define bFM4_GPIO_EPFR00_JTAGEN0B                 *((volatile uint32_t*)(0x42DEC040UL))
#define bFM_GPIO_EPFR00_JTAGEN1S                  *((volatile uint32_t*)(0x42DEC044UL))
#define bFM4_GPIO_EPFR00_JTAGEN1S                 *((volatile uint32_t*)(0x42DEC044UL))
#define bFM_GPIO_EPFR00_TRC0E                     *((volatile uint32_t*)(0x42DEC060UL))
#define bFM4_GPIO_EPFR00_TRC0E                    *((volatile uint32_t*)(0x42DEC060UL))
#define bFM_GPIO_EPFR00_TRC1E                     *((volatile uint32_t*)(0x42DEC064UL))
#define bFM4_GPIO_EPFR00_TRC1E                    *((volatile uint32_t*)(0x42DEC064UL))
#define bFM_GPIO_EPFR00_TRC2E                     *((volatile uint32_t*)(0x42DEC068UL))
#define bFM4_GPIO_EPFR00_TRC2E                    *((volatile uint32_t*)(0x42DEC068UL))
#define bFM_GPIO_EPFR00_TRC3E                     *((volatile uint32_t*)(0x42DEC06CUL))
#define bFM4_GPIO_EPFR00_TRC3E                    *((volatile uint32_t*)(0x42DEC06CUL))

#define bFM_GPIO_EPFR01_DTTI0C                    *((volatile uint32_t*)(0x42DEC0B0UL))
#define bFM4_GPIO_EPFR01_DTTI0C                   *((volatile uint32_t*)(0x42DEC0B0UL))

#define bFM_GPIO_EPFR02_DTTI1C                    *((volatile uint32_t*)(0x42DEC130UL))
#define bFM4_GPIO_EPFR02_DTTI1C                   *((volatile uint32_t*)(0x42DEC130UL))

#define bFM_GPIO_EPFR03_DTTI2C                    *((volatile uint32_t*)(0x42DEC1B0UL))
#define bFM4_GPIO_EPFR03_DTTI2C                   *((volatile uint32_t*)(0x42DEC1B0UL))

#define bFM_GPIO_EPFR10_UEDEFB                    *((volatile uint32_t*)(0x42DEC500UL))
#define bFM4_GPIO_EPFR10_UEDEFB                   *((volatile uint32_t*)(0x42DEC500UL))
#define bFM_GPIO_EPFR10_UEDTHB                    *((volatile uint32_t*)(0x42DEC504UL))
#define bFM4_GPIO_EPFR10_UEDTHB                   *((volatile uint32_t*)(0x42DEC504UL))
#define bFM_GPIO_EPFR10_UECLKE                    *((volatile uint32_t*)(0x42DEC508UL))
#define bFM4_GPIO_EPFR10_UECLKE                   *((volatile uint32_t*)(0x42DEC508UL))
#define bFM_GPIO_EPFR10_UEWEXE                    *((volatile uint32_t*)(0x42DEC50CUL))
#define bFM4_GPIO_EPFR10_UEWEXE                   *((volatile uint32_t*)(0x42DEC50CUL))
#define bFM_GPIO_EPFR10_UEDQME                    *((volatile uint32_t*)(0x42DEC510UL))
#define bFM4_GPIO_EPFR10_UEDQME                   *((volatile uint32_t*)(0x42DEC510UL))
#define bFM_GPIO_EPFR10_UEOEXE                    *((volatile uint32_t*)(0x42DEC514UL))
#define bFM4_GPIO_EPFR10_UEOEXE                   *((volatile uint32_t*)(0x42DEC514UL))
#define bFM_GPIO_EPFR10_UEFLSE                    *((volatile uint32_t*)(0x42DEC518UL))
#define bFM4_GPIO_EPFR10_UEFLSE                   *((volatile uint32_t*)(0x42DEC518UL))
#define bFM_GPIO_EPFR10_UECS1E                    *((volatile uint32_t*)(0x42DEC51CUL))
#define bFM4_GPIO_EPFR10_UECS1E                   *((volatile uint32_t*)(0x42DEC51CUL))
#define bFM_GPIO_EPFR10_UECS2E                    *((volatile uint32_t*)(0x42DEC520UL))
#define bFM4_GPIO_EPFR10_UECS2E                   *((volatile uint32_t*)(0x42DEC520UL))
#define bFM_GPIO_EPFR10_UECS3E                    *((volatile uint32_t*)(0x42DEC524UL))
#define bFM4_GPIO_EPFR10_UECS3E                   *((volatile uint32_t*)(0x42DEC524UL))
#define bFM_GPIO_EPFR10_UECS4E                    *((volatile uint32_t*)(0x42DEC528UL))
#define bFM4_GPIO_EPFR10_UECS4E                   *((volatile uint32_t*)(0x42DEC528UL))
#define bFM_GPIO_EPFR10_UECS5E                    *((volatile uint32_t*)(0x42DEC52CUL))
#define bFM4_GPIO_EPFR10_UECS5E                   *((volatile uint32_t*)(0x42DEC52CUL))
#define bFM_GPIO_EPFR10_UECS6E                    *((volatile uint32_t*)(0x42DEC530UL))
#define bFM4_GPIO_EPFR10_UECS6E                   *((volatile uint32_t*)(0x42DEC530UL))
#define bFM_GPIO_EPFR10_UECS7E                    *((volatile uint32_t*)(0x42DEC534UL))
#define bFM4_GPIO_EPFR10_UECS7E                   *((volatile uint32_t*)(0x42DEC534UL))
#define bFM_GPIO_EPFR10_UEAOOE                    *((volatile uint32_t*)(0x42DEC538UL))
#define bFM4_GPIO_EPFR10_UEAOOE                   *((volatile uint32_t*)(0x42DEC538UL))
#define bFM_GPIO_EPFR10_UEA08E                    *((volatile uint32_t*)(0x42DEC53CUL))
#define bFM4_GPIO_EPFR10_UEA08E                   *((volatile uint32_t*)(0x42DEC53CUL))
#define bFM_GPIO_EPFR10_UEA09E                    *((volatile uint32_t*)(0x42DEC540UL))
#define bFM4_GPIO_EPFR10_UEA09E                   *((volatile uint32_t*)(0x42DEC540UL))
#define bFM_GPIO_EPFR10_UEA10E                    *((volatile uint32_t*)(0x42DEC544UL))
#define bFM4_GPIO_EPFR10_UEA10E                   *((volatile uint32_t*)(0x42DEC544UL))
#define bFM_GPIO_EPFR10_UEA11E                    *((volatile uint32_t*)(0x42DEC548UL))
#define bFM4_GPIO_EPFR10_UEA11E                   *((volatile uint32_t*)(0x42DEC548UL))
#define bFM_GPIO_EPFR10_UEA12E                    *((volatile uint32_t*)(0x42DEC54CUL))
#define bFM4_GPIO_EPFR10_UEA12E                   *((volatile uint32_t*)(0x42DEC54CUL))
#define bFM_GPIO_EPFR10_UEA13E                    *((volatile uint32_t*)(0x42DEC550UL))
#define bFM4_GPIO_EPFR10_UEA13E                   *((volatile uint32_t*)(0x42DEC550UL))
#define bFM_GPIO_EPFR10_UEA14E                    *((volatile uint32_t*)(0x42DEC554UL))
#define bFM4_GPIO_EPFR10_UEA14E                   *((volatile uint32_t*)(0x42DEC554UL))
#define bFM_GPIO_EPFR10_UEA15E                    *((volatile uint32_t*)(0x42DEC558UL))
#define bFM4_GPIO_EPFR10_UEA15E                   *((volatile uint32_t*)(0x42DEC558UL))
#define bFM_GPIO_EPFR10_UEA16E                    *((volatile uint32_t*)(0x42DEC55CUL))
#define bFM4_GPIO_EPFR10_UEA16E                   *((volatile uint32_t*)(0x42DEC55CUL))
#define bFM_GPIO_EPFR10_UEA17E                    *((volatile uint32_t*)(0x42DEC560UL))
#define bFM4_GPIO_EPFR10_UEA17E                   *((volatile uint32_t*)(0x42DEC560UL))
#define bFM_GPIO_EPFR10_UEA18E                    *((volatile uint32_t*)(0x42DEC564UL))
#define bFM4_GPIO_EPFR10_UEA18E                   *((volatile uint32_t*)(0x42DEC564UL))
#define bFM_GPIO_EPFR10_UEA19E                    *((volatile uint32_t*)(0x42DEC568UL))
#define bFM4_GPIO_EPFR10_UEA19E                   *((volatile uint32_t*)(0x42DEC568UL))
#define bFM_GPIO_EPFR10_UEA20E                    *((volatile uint32_t*)(0x42DEC56CUL))
#define bFM4_GPIO_EPFR10_UEA20E                   *((volatile uint32_t*)(0x42DEC56CUL))
#define bFM_GPIO_EPFR10_UEA21E                    *((volatile uint32_t*)(0x42DEC570UL))
#define bFM4_GPIO_EPFR10_UEA21E                   *((volatile uint32_t*)(0x42DEC570UL))
#define bFM_GPIO_EPFR10_UEA22E                    *((volatile uint32_t*)(0x42DEC574UL))
#define bFM4_GPIO_EPFR10_UEA22E                   *((volatile uint32_t*)(0x42DEC574UL))
#define bFM_GPIO_EPFR10_UEA23E                    *((volatile uint32_t*)(0x42DEC578UL))
#define bFM4_GPIO_EPFR10_UEA23E                   *((volatile uint32_t*)(0x42DEC578UL))
#define bFM_GPIO_EPFR10_UEA24E                    *((volatile uint32_t*)(0x42DEC57CUL))
#define bFM4_GPIO_EPFR10_UEA24E                   *((volatile uint32_t*)(0x42DEC57CUL))

