neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_EPFR11_UEALEE                    *((volatile uint32_t*)(0x42DEC580UL))
#define bFM4_GPIO_EPFR11_UEALEE                   *((volatile uint32_t*)(0x42DEC580UL))
#define bFM_GPIO_EPFR11_UECS0E                    *((volatile uint32_t*)(0x42DEC584UL))
#define bFM4_GPIO_EPFR11_UECS0E                   *((volatile uint32_t*)(0x42DEC584UL))
#define bFM_GPIO_EPFR11_UEA01E                    *((volatile uint32_t*)(0x42DEC588UL))
#define bFM4_GPIO_EPFR11_UEA01E                   *((volatile uint32_t*)(0x42DEC588UL))
#define bFM_GPIO_EPFR11_UEA02E                    *((volatile uint32_t*)(0x42DEC58CUL))
#define bFM4_GPIO_EPFR11_UEA02E                   *((volatile uint32_t*)(0x42DEC58CUL))
#define bFM_GPIO_EPFR11_UEA03E                    *((volatile uint32_t*)(0x42DEC590UL))
#define bFM4_GPIO_EPFR11_UEA03E                   *((volatile uint32_t*)(0x42DEC590UL))
#define bFM_GPIO_EPFR11_UEA04E                    *((volatile uint32_t*)(0x42DEC594UL))
#define bFM4_GPIO_EPFR11_UEA04E                   *((volatile uint32_t*)(0x42DEC594UL))
#define bFM_GPIO_EPFR11_UEA05E                    *((volatile uint32_t*)(0x42DEC598UL))
#define bFM4_GPIO_EPFR11_UEA05E                   *((volatile uint32_t*)(0x42DEC598UL))
#define bFM_GPIO_EPFR11_UEA06E                    *((volatile uint32_t*)(0x42DEC59CUL))
#define bFM4_GPIO_EPFR11_UEA06E                   *((volatile uint32_t*)(0x42DEC59CUL))
#define bFM_GPIO_EPFR11_UEA07E                    *((volatile uint32_t*)(0x42DEC5A0UL))
#define bFM4_GPIO_EPFR11_UEA07E                   *((volatile uint32_t*)(0x42DEC5A0UL))
#define bFM_GPIO_EPFR11_UED00B                    *((volatile uint32_t*)(0x42DEC5A4UL))
#define bFM4_GPIO_EPFR11_UED00B                   *((volatile uint32_t*)(0x42DEC5A4UL))
#define bFM_GPIO_EPFR11_UED01B                    *((volatile uint32_t*)(0x42DEC5A8UL))
#define bFM4_GPIO_EPFR11_UED01B                   *((volatile uint32_t*)(0x42DEC5A8UL))
#define bFM_GPIO_EPFR11_UED02B                    *((volatile uint32_t*)(0x42DEC5ACUL))
#define bFM4_GPIO_EPFR11_UED02B                   *((volatile uint32_t*)(0x42DEC5ACUL))
#define bFM_GPIO_EPFR11_UED03B                    *((volatile uint32_t*)(0x42DEC5B0UL))
#define bFM4_GPIO_EPFR11_UED03B                   *((volatile uint32_t*)(0x42DEC5B0UL))
#define bFM_GPIO_EPFR11_UED04B                    *((volatile uint32_t*)(0x42DEC5B4UL))
#define bFM4_GPIO_EPFR11_UED04B                   *((volatile uint32_t*)(0x42DEC5B4UL))
#define bFM_GPIO_EPFR11_UED05B                    *((volatile uint32_t*)(0x42DEC5B8UL))
#define bFM4_GPIO_EPFR11_UED05B                   *((volatile uint32_t*)(0x42DEC5B8UL))
#define bFM_GPIO_EPFR11_UED06B                    *((volatile uint32_t*)(0x42DEC5BCUL))
#define bFM4_GPIO_EPFR11_UED06B                   *((volatile uint32_t*)(0x42DEC5BCUL))
#define bFM_GPIO_EPFR11_UED07B                    *((volatile uint32_t*)(0x42DEC5C0UL))
#define bFM4_GPIO_EPFR11_UED07B                   *((volatile uint32_t*)(0x42DEC5C0UL))
#define bFM_GPIO_EPFR11_UED08B                    *((volatile uint32_t*)(0x42DEC5C4UL))
#define bFM4_GPIO_EPFR11_UED08B                   *((volatile uint32_t*)(0x42DEC5C4UL))
#define bFM_GPIO_EPFR11_UED09B                    *((volatile uint32_t*)(0x42DEC5C8UL))
#define bFM4_GPIO_EPFR11_UED09B                   *((volatile uint32_t*)(0x42DEC5C8UL))
#define bFM_GPIO_EPFR11_UED10B                    *((volatile uint32_t*)(0x42DEC5CCUL))
#define bFM4_GPIO_EPFR11_UED10B                   *((volatile uint32_t*)(0x42DEC5CCUL))
#define bFM_GPIO_EPFR11_UED11B                    *((volatile uint32_t*)(0x42DEC5D0UL))
#define bFM4_GPIO_EPFR11_UED11B                   *((volatile uint32_t*)(0x42DEC5D0UL))
#define bFM_GPIO_EPFR11_UED12B                    *((volatile uint32_t*)(0x42DEC5D4UL))
#define bFM4_GPIO_EPFR11_UED12B                   *((volatile uint32_t*)(0x42DEC5D4UL))
#define bFM_GPIO_EPFR11_UED13B                    *((volatile uint32_t*)(0x42DEC5D8UL))
#define bFM4_GPIO_EPFR11_UED13B                   *((volatile uint32_t*)(0x42DEC5D8UL))
#define bFM_GPIO_EPFR11_UED14B                    *((volatile uint32_t*)(0x42DEC5DCUL))
#define bFM4_GPIO_EPFR11_UED14B                   *((volatile uint32_t*)(0x42DEC5DCUL))
#define bFM_GPIO_EPFR11_UED15B                    *((volatile uint32_t*)(0x42DEC5E0UL))
#define bFM4_GPIO_EPFR11_UED15B                   *((volatile uint32_t*)(0x42DEC5E0UL))
#define bFM_GPIO_EPFR11_UERLC                     *((volatile uint32_t*)(0x42DEC5E4UL))
#define bFM4_GPIO_EPFR11_UERLC                    *((volatile uint32_t*)(0x42DEC5E4UL))

#define bFM_GPIO_EPFR14_E_TD0E                    *((volatile uint32_t*)(0x42DEC748UL))
#define bFM4_GPIO_EPFR14_E_TD0E                   *((volatile uint32_t*)(0x42DEC748UL))
#define bFM_GPIO_EPFR14_E_TD1E                    *((volatile uint32_t*)(0x42DEC74CUL))
#define bFM4_GPIO_EPFR14_E_TD1E                   *((volatile uint32_t*)(0x42DEC74CUL))
#define bFM_GPIO_EPFR14_E_TE0E                    *((volatile uint32_t*)(0x42DEC750UL))
#define bFM4_GPIO_EPFR14_E_TE0E                   *((volatile uint32_t*)(0x42DEC750UL))
#define bFM_GPIO_EPFR14_E_TE1E                    *((volatile uint32_t*)(0x42DEC754UL))
#define bFM4_GPIO_EPFR14_E_TE1E                   *((volatile uint32_t*)(0x42DEC754UL))
#define bFM_GPIO_EPFR14_E_MC0E                    *((volatile uint32_t*)(0x42DEC758UL))
#define bFM4_GPIO_EPFR14_E_MC0E                   *((volatile uint32_t*)(0x42DEC758UL))
#define bFM_GPIO_EPFR14_E_MC1B                    *((volatile uint32_t*)(0x42DEC75CUL))
#define bFM4_GPIO_EPFR14_E_MC1B                   *((volatile uint32_t*)(0x42DEC75CUL))
#define bFM_GPIO_EPFR14_E_MD0B                    *((volatile uint32_t*)(0x42DEC760UL))
#define bFM4_GPIO_EPFR14_E_MD0B                   *((volatile uint32_t*)(0x42DEC760UL))
#define bFM_GPIO_EPFR14_E_MD1B                    *((volatile uint32_t*)(0x42DEC764UL))
#define bFM4_GPIO_EPFR14_E_MD1B                   *((volatile uint32_t*)(0x42DEC764UL))
#define bFM_GPIO_EPFR14_E_CKE                     *((volatile uint32_t*)(0x42DEC768UL))
#define bFM4_GPIO_EPFR14_E_CKE                    *((volatile uint32_t*)(0x42DEC768UL))
#define bFM_GPIO_EPFR14_E_PSE                     *((volatile uint32_t*)(0x42DEC76CUL))
#define bFM4_GPIO_EPFR14_E_PSE                    *((volatile uint32_t*)(0x42DEC76CUL))

