neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_EPFR16_SFMPAC                    *((volatile uint32_t*)(0x42DEC870UL))
#define bFM4_GPIO_EPFR16_SFMPAC                   *((volatile uint32_t*)(0x42DEC870UL))
#define bFM_GPIO_EPFR16_SFMPBC                    *((volatile uint32_t*)(0x42DEC874UL))
#define bFM4_GPIO_EPFR16_SFMPBC                   *((volatile uint32_t*)(0x42DEC874UL))

#define bFM_GPIO_EPFR20_UESMCKE                   *((volatile uint32_t*)(0x42DECA00UL))
#define bFM4_GPIO_EPFR20_UESMCKE                  *((volatile uint32_t*)(0x42DECA00UL))
#define bFM_GPIO_EPFR20_UESMCEE                   *((volatile uint32_t*)(0x42DECA04UL))
#define bFM4_GPIO_EPFR20_UESMCEE                  *((volatile uint32_t*)(0x42DECA04UL))
#define bFM_GPIO_EPFR20_UERASE                    *((volatile uint32_t*)(0x42DECA08UL))
#define bFM4_GPIO_EPFR20_UERASE                   *((volatile uint32_t*)(0x42DECA08UL))
#define bFM_GPIO_EPFR20_UECASE                    *((volatile uint32_t*)(0x42DECA0CUL))
#define bFM4_GPIO_EPFR20_UECASE                   *((volatile uint32_t*)(0x42DECA0CUL))
#define bFM_GPIO_EPFR20_UEDWEXE                   *((volatile uint32_t*)(0x42DECA10UL))
#define bFM4_GPIO_EPFR20_UEDWEXE                  *((volatile uint32_t*)(0x42DECA10UL))
#define bFM_GPIO_EPFR20_UECSXE                    *((volatile uint32_t*)(0x42DECA14UL))
#define bFM4_GPIO_EPFR20_UECSXE                   *((volatile uint32_t*)(0x42DECA14UL))
#define bFM_GPIO_EPFR20_UEDQM2E                   *((volatile uint32_t*)(0x42DECA18UL))
#define bFM4_GPIO_EPFR20_UEDQM2E                  *((volatile uint32_t*)(0x42DECA18UL))
#define bFM_GPIO_EPFR20_UEDQM3E                   *((volatile uint32_t*)(0x42DECA1CUL))
#define bFM4_GPIO_EPFR20_UEDQM3E                  *((volatile uint32_t*)(0x42DECA1CUL))
#define bFM_GPIO_EPFR20_UEDTHHB                   *((volatile uint32_t*)(0x42DECA20UL))
#define bFM4_GPIO_EPFR20_UEDTHHB                  *((volatile uint32_t*)(0x42DECA20UL))
#define bFM_GPIO_EPFR20_UED16B                    *((volatile uint32_t*)(0x42DECA24UL))
#define bFM4_GPIO_EPFR20_UED16B                   *((volatile uint32_t*)(0x42DECA24UL))
#define bFM_GPIO_EPFR20_UED17B                    *((volatile uint32_t*)(0x42DECA28UL))
#define bFM4_GPIO_EPFR20_UED17B                   *((volatile uint32_t*)(0x42DECA28UL))
#define bFM_GPIO_EPFR20_UED18B                    *((volatile uint32_t*)(0x42DECA2CUL))
#define bFM4_GPIO_EPFR20_UED18B                   *((volatile uint32_t*)(0x42DECA2CUL))
#define bFM_GPIO_EPFR20_UED19B                    *((volatile uint32_t*)(0x42DECA30UL))
#define bFM4_GPIO_EPFR20_UED19B                   *((volatile uint32_t*)(0x42DECA30UL))
#define bFM_GPIO_EPFR20_UED20B                    *((volatile uint32_t*)(0x42DECA34UL))
#define bFM4_GPIO_EPFR20_UED20B                   *((volatile uint32_t*)(0x42DECA34UL))
#define bFM_GPIO_EPFR20_UED21B                    *((volatile uint32_t*)(0x42DECA38UL))
#define bFM4_GPIO_EPFR20_UED21B                   *((volatile uint32_t*)(0x42DECA38UL))
#define bFM_GPIO_EPFR20_UED22B                    *((volatile uint32_t*)(0x42DECA3CUL))
#define bFM4_GPIO_EPFR20_UED22B                   *((volatile uint32_t*)(0x42DECA3CUL))
#define bFM_GPIO_EPFR20_UED23B                    *((volatile uint32_t*)(0x42DECA40UL))
#define bFM4_GPIO_EPFR20_UED23B                   *((volatile uint32_t*)(0x42DECA40UL))
#define bFM_GPIO_EPFR20_UED24B                    *((volatile uint32_t*)(0x42DECA44UL))
#define bFM4_GPIO_EPFR20_UED24B                   *((volatile uint32_t*)(0x42DECA44UL))
#define bFM_GPIO_EPFR20_UED25B                    *((volatile uint32_t*)(0x42DECA48UL))
#define bFM4_GPIO_EPFR20_UED25B                   *((volatile uint32_t*)(0x42DECA48UL))
#define bFM_GPIO_EPFR20_UED26B                    *((volatile uint32_t*)(0x42DECA4CUL))
#define bFM4_GPIO_EPFR20_UED26B                   *((volatile uint32_t*)(0x42DECA4CUL))
#define bFM_GPIO_EPFR20_UED27B                    *((volatile uint32_t*)(0x42DECA50UL))
#define bFM4_GPIO_EPFR20_UED27B                   *((volatile uint32_t*)(0x42DECA50UL))
#define bFM_GPIO_EPFR20_UED28B                    *((volatile uint32_t*)(0x42DECA54UL))
#define bFM4_GPIO_EPFR20_UED28B                   *((volatile uint32_t*)(0x42DECA54UL))
#define bFM_GPIO_EPFR20_UED29B                    *((volatile uint32_t*)(0x42DECA58UL))
#define bFM4_GPIO_EPFR20_UED29B                   *((volatile uint32_t*)(0x42DECA58UL))
#define bFM_GPIO_EPFR20_UED30B                    *((volatile uint32_t*)(0x42DECA5CUL))
#define bFM4_GPIO_EPFR20_UED30B                   *((volatile uint32_t*)(0x42DECA5CUL))
#define bFM_GPIO_EPFR20_UED31B                    *((volatile uint32_t*)(0x42DECA60UL))
#define bFM4_GPIO_EPFR20_UED31B                   *((volatile uint32_t*)(0x42DECA60UL))

#define bFM_GPIO_PCR0_P0                          *((volatile uint32_t*)(0x42DE2000UL))
#define bFM4_GPIO_PCR0_P0                         *((volatile uint32_t*)(0x42DE2000UL))
#define bFM_GPIO_PCR0_P1                          *((volatile uint32_t*)(0x42DE2004UL))
#define bFM4_GPIO_PCR0_P1                         *((volatile uint32_t*)(0x42DE2004UL))
#define bFM_GPIO_PCR0_P2                          *((volatile uint32_t*)(0x42DE2008UL))
#define bFM4_GPIO_PCR0_P2                         *((volatile uint32_t*)(0x42DE2008UL))
#define bFM_GPIO_PCR0_P3                          *((volatile uint32_t*)(0x42DE200CUL))
#define bFM4_GPIO_PCR0_P3                         *((volatile uint32_t*)(0x42DE200CUL))
#define bFM_GPIO_PCR0_P4                          *((volatile uint32_t*)(0x42DE2010UL))
#define bFM4_GPIO_PCR0_P4                         *((volatile uint32_t*)(0x42DE2010UL))
#define bFM_GPIO_PCR0_P8                          *((volatile uint32_t*)(0x42DE2020UL))
#define bFM4_GPIO_PCR0_P8                         *((volatile uint32_t*)(0x42DE2020UL))
#define bFM_GPIO_PCR0_P9                          *((volatile uint32_t*)(0x42DE2024UL))
#define bFM4_GPIO_PCR0_P9                         *((volatile uint32_t*)(0x42DE2024UL))
#define bFM_GPIO_PCR0_PA                          *((volatile uint32_t*)(0x42DE2028UL))
#define bFM4_GPIO_PCR0_PA                         *((volatile uint32_t*)(0x42DE2028UL))

#define bFM_GPIO_PCR1_P0                          *((volatile uint32_t*)(0x42DE2080UL))
#define bFM4_GPIO_PCR1_P0                         *((volatile uint32_t*)(0x42DE2080UL))
#define bFM_GPIO_PCR1_P1                          *((volatile uint32_t*)(0x42DE2084UL))
#define bFM4_GPIO_PCR1_P1                         *((volatile uint32_t*)(0x42DE2084UL))
#define bFM_GPIO_PCR1_P2                          *((volatile uint32_t*)(0x42DE2088UL))
#define bFM4_GPIO_PCR1_P2                         *((volatile uint32_t*)(0x42DE2088UL))
#define bFM_GPIO_PCR1_P3                          *((volatile uint32_t*)(0x42DE208CUL))
#define bFM4_GPIO_PCR1_P3                         *((volatile uint32_t*)(0x42DE208CUL))
#define bFM_GPIO_PCR1_P4                          *((volatile uint32_t*)(0x42DE2090UL))
#define bFM4_GPIO_PCR1_P4                         *((volatile uint32_t*)(0x42DE2090UL))
#define bFM_GPIO_PCR1_P5                          *((volatile uint32_t*)(0x42DE2094UL))
#define bFM4_GPIO_PCR1_P5                         *((volatile uint32_t*)(0x42DE2094UL))
#define bFM_GPIO_PCR1_P6                          *((volatile uint32_t*)(0x42DE2098UL))
#define bFM4_GPIO_PCR1_P6                         *((volatile uint32_t*)(0x42DE2098UL))
#define bFM_GPIO_PCR1_P7                          *((volatile uint32_t*)(0x42DE209CUL))
#define bFM4_GPIO_PCR1_P7                         *((volatile uint32_t*)(0x42DE209CUL))
#define bFM_GPIO_PCR1_P8                          *((volatile uint32_t*)(0x42DE20A0UL))
#define bFM4_GPIO_PCR1_P8                         *((volatile uint32_t*)(0x42DE20A0UL))
#define bFM_GPIO_PCR1_P9                          *((volatile uint32_t*)(0x42DE20A4UL))
#define bFM4_GPIO_PCR1_P9                         *((volatile uint32_t*)(0x42DE20A4UL))
#define bFM_GPIO_PCR1_PA                          *((volatile uint32_t*)(0x42DE20A8UL))
#define bFM4_GPIO_PCR1_PA                         *((volatile uint32_t*)(0x42DE20A8UL))
#define bFM_GPIO_PCR1_PB                          *((volatile uint32_t*)(0x42DE20ACUL))
#define bFM4_GPIO_PCR1_PB                         *((volatile uint32_t*)(0x42DE20ACUL))
#define bFM_GPIO_PCR1_PC                          *((volatile uint32_t*)(0x42DE20B0UL))
#define bFM4_GPIO_PCR1_PC                         *((volatile uint32_t*)(0x42DE20B0UL))
#define bFM_GPIO_PCR1_PD                          *((volatile uint32_t*)(0x42DE20B4UL))
#define bFM4_GPIO_PCR1_PD                         *((volatile uint32_t*)(0x42DE20B4UL))
#define bFM_GPIO_PCR1_PE                          *((volatile uint32_t*)(0x42DE20B8UL))
#define bFM4_GPIO_PCR1_PE                         *((volatile uint32_t*)(0x42DE20B8UL))
#define bFM_GPIO_PCR1_PF                          *((volatile uint32_t*)(0x42DE20BCUL))
#define bFM4_GPIO_PCR1_PF                         *((volatile uint32_t*)(0x42DE20BCUL))

#define bFM_GPIO_PCR2_P0                          *((volatile uint32_t*)(0x42DE2100UL))
#define bFM4_GPIO_PCR2_P0                         *((volatile uint32_t*)(0x42DE2100UL))
#define bFM_GPIO_PCR2_P1                          *((volatile uint32_t*)(0x42DE2104UL))
#define bFM4_GPIO_PCR2_P1                         *((volatile uint32_t*)(0x42DE2104UL))
#define bFM_GPIO_PCR2_P2                          *((volatile uint32_t*)(0x42DE2108UL))
#define bFM4_GPIO_PCR2_P2                         *((volatile uint32_t*)(0x42DE2108UL))
#define bFM_GPIO_PCR2_P3                          *((volatile uint32_t*)(0x42DE210CUL))
#define bFM4_GPIO_PCR2_P3                         *((volatile uint32_t*)(0x42DE210CUL))
#define bFM_GPIO_PCR2_P4                          *((volatile uint32_t*)(0x42DE2110UL))
#define bFM4_GPIO_PCR2_P4                         *((volatile uint32_t*)(0x42DE2110UL))
#define bFM_GPIO_PCR2_P5                          *((volatile uint32_t*)(0x42DE2114UL))
#define bFM4_GPIO_PCR2_P5                         *((volatile uint32_t*)(0x42DE2114UL))
#define bFM_GPIO_PCR2_P6                          *((volatile uint32_t*)(0x42DE2118UL))
#define bFM4_GPIO_PCR2_P6                         *((volatile uint32_t*)(0x42DE2118UL))
#define bFM_GPIO_PCR2_P7                          *((volatile uint32_t*)(0x42DE211CUL))
#define bFM4_GPIO_PCR2_P7                         *((volatile uint32_t*)(0x42DE211CUL))
#define bFM_GPIO_PCR2_P8                          *((volatile uint32_t*)(0x42DE2120UL))
#define bFM4_GPIO_PCR2_P8                         *((volatile uint32_t*)(0x42DE2120UL))
#define bFM_GPIO_PCR2_P9                          *((volatile uint32_t*)(0x42DE2124UL))
#define bFM4_GPIO_PCR2_P9                         *((volatile uint32_t*)(0x42DE2124UL))
#define bFM_GPIO_PCR2_PA                          *((volatile uint32_t*)(0x42DE2128UL))
#define bFM4_GPIO_PCR2_PA                         *((volatile uint32_t*)(0x42DE2128UL))

#define bFM_GPIO_PCR3_P0                          *((volatile uint32_t*)(0x42DE2180UL))
#define bFM4_GPIO_PCR3_P0                         *((volatile uint32_t*)(0x42DE2180UL))
#define bFM_GPIO_PCR3_P1                          *((volatile uint32_t*)(0x42DE2184UL))
#define bFM4_GPIO_PCR3_P1                         *((volatile uint32_t*)(0x42DE2184UL))
#define bFM_GPIO_PCR3_P2                          *((volatile uint32_t*)(0x42DE2188UL))
#define bFM4_GPIO_PCR3_P2                         *((volatile uint32_t*)(0x42DE2188UL))
#define bFM_GPIO_PCR3_P3                          *((volatile uint32_t*)(0x42DE218CUL))
#define bFM4_GPIO_PCR3_P3                         *((volatile uint32_t*)(0x42DE218CUL))
#define bFM_GPIO_PCR3_P4                          *((volatile uint32_t*)(0x42DE2190UL))
#define bFM4_GPIO_PCR3_P4                         *((volatile uint32_t*)(0x42DE2190UL))
#define bFM_GPIO_PCR3_P5                          *((volatile uint32_t*)(0x42DE2194UL))
#define bFM4_GPIO_PCR3_P5                         *((volatile uint32_t*)(0x42DE2194UL))
#define bFM_GPIO_PCR3_P6                          *((volatile uint32_t*)(0x42DE2198UL))
#define bFM4_GPIO_PCR3_P6                         *((volatile uint32_t*)(0x42DE2198UL))
#define bFM_GPIO_PCR3_P7                          *((volatile uint32_t*)(0x42DE219CUL))
#define bFM4_GPIO_PCR3_P7                         *((volatile uint32_t*)(0x42DE219CUL))
#define bFM_GPIO_PCR3_P8                          *((volatile uint32_t*)(0x42DE21A0UL))
#define bFM4_GPIO_PCR3_P8                         *((volatile uint32_t*)(0x42DE21A0UL))
#define bFM_GPIO_PCR3_P9                          *((volatile uint32_t*)(0x42DE21A4UL))
#define bFM4_GPIO_PCR3_P9                         *((volatile uint32_t*)(0x42DE21A4UL))
#define bFM_GPIO_PCR3_PA                          *((volatile uint32_t*)(0x42DE21A8UL))
#define bFM4_GPIO_PCR3_PA                         *((volatile uint32_t*)(0x42DE21A8UL))
#define bFM_GPIO_PCR3_PB                          *((volatile uint32_t*)(0x42DE21ACUL))
#define bFM4_GPIO_PCR3_PB                         *((volatile uint32_t*)(0x42DE21ACUL))
#define bFM_GPIO_PCR3_PC                          *((volatile uint32_t*)(0x42DE21B0UL))
#define bFM4_GPIO_PCR3_PC                         *((volatile uint32_t*)(0x42DE21B0UL))
#define bFM_GPIO_PCR3_PD                          *((volatile uint32_t*)(0x42DE21B4UL))
#define bFM4_GPIO_PCR3_PD                         *((volatile uint32_t*)(0x42DE21B4UL))
#define bFM_GPIO_PCR3_PE                          *((volatile uint32_t*)(0x42DE21B8UL))
#define bFM4_GPIO_PCR3_PE                         *((volatile uint32_t*)(0x42DE21B8UL))

