neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PCR4_P0                          *((volatile uint32_t*)(0x42DE2200UL))
#define bFM4_GPIO_PCR4_P0                         *((volatile uint32_t*)(0x42DE2200UL))
#define bFM_GPIO_PCR4_P1                          *((volatile uint32_t*)(0x42DE2204UL))
#define bFM4_GPIO_PCR4_P1                         *((volatile uint32_t*)(0x42DE2204UL))
#define bFM_GPIO_PCR4_P2                          *((volatile uint32_t*)(0x42DE2208UL))
#define bFM4_GPIO_PCR4_P2                         *((volatile uint32_t*)(0x42DE2208UL))
#define bFM_GPIO_PCR4_P3                          *((volatile uint32_t*)(0x42DE220CUL))
#define bFM4_GPIO_PCR4_P3                         *((volatile uint32_t*)(0x42DE220CUL))
#define bFM_GPIO_PCR4_P4                          *((volatile uint32_t*)(0x42DE2210UL))
#define bFM4_GPIO_PCR4_P4                         *((volatile uint32_t*)(0x42DE2210UL))
#define bFM_GPIO_PCR4_P5                          *((volatile uint32_t*)(0x42DE2214UL))
#define bFM4_GPIO_PCR4_P5                         *((volatile uint32_t*)(0x42DE2214UL))
#define bFM_GPIO_PCR4_P6                          *((volatile uint32_t*)(0x42DE2218UL))
#define bFM4_GPIO_PCR4_P6                         *((volatile uint32_t*)(0x42DE2218UL))
#define bFM_GPIO_PCR4_P7                          *((volatile uint32_t*)(0x42DE221CUL))
#define bFM4_GPIO_PCR4_P7                         *((volatile uint32_t*)(0x42DE221CUL))
#define bFM_GPIO_PCR4_P8                          *((volatile uint32_t*)(0x42DE2220UL))
#define bFM4_GPIO_PCR4_P8                         *((volatile uint32_t*)(0x42DE2220UL))
#define bFM_GPIO_PCR4_P9                          *((volatile uint32_t*)(0x42DE2224UL))
#define bFM4_GPIO_PCR4_P9                         *((volatile uint32_t*)(0x42DE2224UL))
#define bFM_GPIO_PCR4_PA                          *((volatile uint32_t*)(0x42DE2228UL))
#define bFM4_GPIO_PCR4_PA                         *((volatile uint32_t*)(0x42DE2228UL))
#define bFM_GPIO_PCR4_PB                          *((volatile uint32_t*)(0x42DE222CUL))
#define bFM4_GPIO_PCR4_PB                         *((volatile uint32_t*)(0x42DE222CUL))
#define bFM_GPIO_PCR4_PC                          *((volatile uint32_t*)(0x42DE2230UL))
#define bFM4_GPIO_PCR4_PC                         *((volatile uint32_t*)(0x42DE2230UL))
#define bFM_GPIO_PCR4_PD                          *((volatile uint32_t*)(0x42DE2234UL))
#define bFM4_GPIO_PCR4_PD                         *((volatile uint32_t*)(0x42DE2234UL))
#define bFM_GPIO_PCR4_PE                          *((volatile uint32_t*)(0x42DE2238UL))
#define bFM4_GPIO_PCR4_PE                         *((volatile uint32_t*)(0x42DE2238UL))

#define bFM_GPIO_PCR5_P0                          *((volatile uint32_t*)(0x42DE2280UL))
#define bFM4_GPIO_PCR5_P0                         *((volatile uint32_t*)(0x42DE2280UL))
#define bFM_GPIO_PCR5_P1                          *((volatile uint32_t*)(0x42DE2284UL))
#define bFM4_GPIO_PCR5_P1                         *((volatile uint32_t*)(0x42DE2284UL))
#define bFM_GPIO_PCR5_P2                          *((volatile uint32_t*)(0x42DE2288UL))
#define bFM4_GPIO_PCR5_P2                         *((volatile uint32_t*)(0x42DE2288UL))
#define bFM_GPIO_PCR5_P3                          *((volatile uint32_t*)(0x42DE228CUL))
#define bFM4_GPIO_PCR5_P3                         *((volatile uint32_t*)(0x42DE228CUL))
#define bFM_GPIO_PCR5_P4                          *((volatile uint32_t*)(0x42DE2290UL))
#define bFM4_GPIO_PCR5_P4                         *((volatile uint32_t*)(0x42DE2290UL))
#define bFM_GPIO_PCR5_P5                          *((volatile uint32_t*)(0x42DE2294UL))
#define bFM4_GPIO_PCR5_P5                         *((volatile uint32_t*)(0x42DE2294UL))
#define bFM_GPIO_PCR5_P6                          *((volatile uint32_t*)(0x42DE2298UL))
#define bFM4_GPIO_PCR5_P6                         *((volatile uint32_t*)(0x42DE2298UL))
#define bFM_GPIO_PCR5_P7                          *((volatile uint32_t*)(0x42DE229CUL))
#define bFM4_GPIO_PCR5_P7                         *((volatile uint32_t*)(0x42DE229CUL))
#define bFM_GPIO_PCR5_P8                          *((volatile uint32_t*)(0x42DE22A0UL))
#define bFM4_GPIO_PCR5_P8                         *((volatile uint32_t*)(0x42DE22A0UL))
#define bFM_GPIO_PCR5_P9                          *((volatile uint32_t*)(0x42DE22A4UL))
#define bFM4_GPIO_PCR5_P9                         *((volatile uint32_t*)(0x42DE22A4UL))
#define bFM_GPIO_PCR5_PA                          *((volatile uint32_t*)(0x42DE22A8UL))
#define bFM4_GPIO_PCR5_PA                         *((volatile uint32_t*)(0x42DE22A8UL))
#define bFM_GPIO_PCR5_PB                          *((volatile uint32_t*)(0x42DE22ACUL))
#define bFM4_GPIO_PCR5_PB                         *((volatile uint32_t*)(0x42DE22ACUL))
#define bFM_GPIO_PCR5_PC                          *((volatile uint32_t*)(0x42DE22B0UL))
#define bFM4_GPIO_PCR5_PC                         *((volatile uint32_t*)(0x42DE22B0UL))
#define bFM_GPIO_PCR5_PD                          *((volatile uint32_t*)(0x42DE22B4UL))
#define bFM4_GPIO_PCR5_PD                         *((volatile uint32_t*)(0x42DE22B4UL))
#define bFM_GPIO_PCR5_PE                          *((volatile uint32_t*)(0x42DE22B8UL))
#define bFM4_GPIO_PCR5_PE                         *((volatile uint32_t*)(0x42DE22B8UL))
#define bFM_GPIO_PCR5_PF                          *((volatile uint32_t*)(0x42DE22BCUL))
#define bFM4_GPIO_PCR5_PF                         *((volatile uint32_t*)(0x42DE22BCUL))

#define bFM_GPIO_PCR6_P0                          *((volatile uint32_t*)(0x42DE2300UL))
#define bFM4_GPIO_PCR6_P0                         *((volatile uint32_t*)(0x42DE2300UL))
#define bFM_GPIO_PCR6_P1                          *((volatile uint32_t*)(0x42DE2304UL))
#define bFM4_GPIO_PCR6_P1                         *((volatile uint32_t*)(0x42DE2304UL))
#define bFM_GPIO_PCR6_P2                          *((volatile uint32_t*)(0x42DE2308UL))
#define bFM4_GPIO_PCR6_P2                         *((volatile uint32_t*)(0x42DE2308UL))
#define bFM_GPIO_PCR6_P3                          *((volatile uint32_t*)(0x42DE230CUL))
#define bFM4_GPIO_PCR6_P3                         *((volatile uint32_t*)(0x42DE230CUL))
#define bFM_GPIO_PCR6_P4                          *((volatile uint32_t*)(0x42DE2310UL))
#define bFM4_GPIO_PCR6_P4                         *((volatile uint32_t*)(0x42DE2310UL))
#define bFM_GPIO_PCR6_P5                          *((volatile uint32_t*)(0x42DE2314UL))
#define bFM4_GPIO_PCR6_P5                         *((volatile uint32_t*)(0x42DE2314UL))
#define bFM_GPIO_PCR6_P6                          *((volatile uint32_t*)(0x42DE2318UL))
#define bFM4_GPIO_PCR6_P6                         *((volatile uint32_t*)(0x42DE2318UL))
#define bFM_GPIO_PCR6_P7                          *((volatile uint32_t*)(0x42DE231CUL))
#define bFM4_GPIO_PCR6_P7                         *((volatile uint32_t*)(0x42DE231CUL))
#define bFM_GPIO_PCR6_P8                          *((volatile uint32_t*)(0x42DE2320UL))
#define bFM4_GPIO_PCR6_P8                         *((volatile uint32_t*)(0x42DE2320UL))
#define bFM_GPIO_PCR6_P9                          *((volatile uint32_t*)(0x42DE2324UL))
#define bFM4_GPIO_PCR6_P9                         *((volatile uint32_t*)(0x42DE2324UL))
#define bFM_GPIO_PCR6_PA                          *((volatile uint32_t*)(0x42DE2328UL))
#define bFM4_GPIO_PCR6_PA                         *((volatile uint32_t*)(0x42DE2328UL))
#define bFM_GPIO_PCR6_PB                          *((volatile uint32_t*)(0x42DE232CUL))
#define bFM4_GPIO_PCR6_PB                         *((volatile uint32_t*)(0x42DE232CUL))
#define bFM_GPIO_PCR6_PC                          *((volatile uint32_t*)(0x42DE2330UL))
#define bFM4_GPIO_PCR6_PC                         *((volatile uint32_t*)(0x42DE2330UL))
#define bFM_GPIO_PCR6_PD                          *((volatile uint32_t*)(0x42DE2334UL))
#define bFM4_GPIO_PCR6_PD                         *((volatile uint32_t*)(0x42DE2334UL))
#define bFM_GPIO_PCR6_PE                          *((volatile uint32_t*)(0x42DE2338UL))
#define bFM4_GPIO_PCR6_PE                         *((volatile uint32_t*)(0x42DE2338UL))

