neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PCR7_P0                          *((volatile uint32_t*)(0x42DE2380UL))
#define bFM4_GPIO_PCR7_P0                         *((volatile uint32_t*)(0x42DE2380UL))
#define bFM_GPIO_PCR7_P1                          *((volatile uint32_t*)(0x42DE2384UL))
#define bFM4_GPIO_PCR7_P1                         *((volatile uint32_t*)(0x42DE2384UL))
#define bFM_GPIO_PCR7_P2                          *((volatile uint32_t*)(0x42DE2388UL))
#define bFM4_GPIO_PCR7_P2                         *((volatile uint32_t*)(0x42DE2388UL))
#define bFM_GPIO_PCR7_P3                          *((volatile uint32_t*)(0x42DE238CUL))
#define bFM4_GPIO_PCR7_P3                         *((volatile uint32_t*)(0x42DE238CUL))
#define bFM_GPIO_PCR7_P4                          *((volatile uint32_t*)(0x42DE2390UL))
#define bFM4_GPIO_PCR7_P4                         *((volatile uint32_t*)(0x42DE2390UL))
#define bFM_GPIO_PCR7_P5                          *((volatile uint32_t*)(0x42DE2394UL))
#define bFM4_GPIO_PCR7_P5                         *((volatile uint32_t*)(0x42DE2394UL))
#define bFM_GPIO_PCR7_P6                          *((volatile uint32_t*)(0x42DE2398UL))
#define bFM4_GPIO_PCR7_P6                         *((volatile uint32_t*)(0x42DE2398UL))
#define bFM_GPIO_PCR7_P7                          *((volatile uint32_t*)(0x42DE239CUL))
#define bFM4_GPIO_PCR7_P7                         *((volatile uint32_t*)(0x42DE239CUL))
#define bFM_GPIO_PCR7_P8                          *((volatile uint32_t*)(0x42DE23A0UL))
#define bFM4_GPIO_PCR7_P8                         *((volatile uint32_t*)(0x42DE23A0UL))
#define bFM_GPIO_PCR7_P9                          *((volatile uint32_t*)(0x42DE23A4UL))
#define bFM4_GPIO_PCR7_P9                         *((volatile uint32_t*)(0x42DE23A4UL))
#define bFM_GPIO_PCR7_PA                          *((volatile uint32_t*)(0x42DE23A8UL))
#define bFM4_GPIO_PCR7_PA                         *((volatile uint32_t*)(0x42DE23A8UL))
#define bFM_GPIO_PCR7_PB                          *((volatile uint32_t*)(0x42DE23ACUL))
#define bFM4_GPIO_PCR7_PB                         *((volatile uint32_t*)(0x42DE23ACUL))
#define bFM_GPIO_PCR7_PC                          *((volatile uint32_t*)(0x42DE23B0UL))
#define bFM4_GPIO_PCR7_PC                         *((volatile uint32_t*)(0x42DE23B0UL))
#define bFM_GPIO_PCR7_PD                          *((volatile uint32_t*)(0x42DE23B4UL))
#define bFM4_GPIO_PCR7_PD                         *((volatile uint32_t*)(0x42DE23B4UL))
#define bFM_GPIO_PCR7_PE                          *((volatile uint32_t*)(0x42DE23B8UL))
#define bFM4_GPIO_PCR7_PE                         *((volatile uint32_t*)(0x42DE23B8UL))

#define bFM_GPIO_PCR9_P0                          *((volatile uint32_t*)(0x42DE2480UL))
#define bFM4_GPIO_PCR9_P0                         *((volatile uint32_t*)(0x42DE2480UL))
#define bFM_GPIO_PCR9_P1                          *((volatile uint32_t*)(0x42DE2484UL))
#define bFM4_GPIO_PCR9_P1                         *((volatile uint32_t*)(0x42DE2484UL))
#define bFM_GPIO_PCR9_P2                          *((volatile uint32_t*)(0x42DE2488UL))
#define bFM4_GPIO_PCR9_P2                         *((volatile uint32_t*)(0x42DE2488UL))
#define bFM_GPIO_PCR9_P3                          *((volatile uint32_t*)(0x42DE248CUL))
#define bFM4_GPIO_PCR9_P3                         *((volatile uint32_t*)(0x42DE248CUL))
#define bFM_GPIO_PCR9_P4                          *((volatile uint32_t*)(0x42DE2490UL))
#define bFM4_GPIO_PCR9_P4                         *((volatile uint32_t*)(0x42DE2490UL))
#define bFM_GPIO_PCR9_P5                          *((volatile uint32_t*)(0x42DE2494UL))
#define bFM4_GPIO_PCR9_P5                         *((volatile uint32_t*)(0x42DE2494UL))
#define bFM_GPIO_PCR9_P6                          *((volatile uint32_t*)(0x42DE2498UL))
#define bFM4_GPIO_PCR9_P6                         *((volatile uint32_t*)(0x42DE2498UL))
#define bFM_GPIO_PCR9_P7                          *((volatile uint32_t*)(0x42DE249CUL))
#define bFM4_GPIO_PCR9_P7                         *((volatile uint32_t*)(0x42DE249CUL))

#define bFM_GPIO_PCRA_P0                          *((volatile uint32_t*)(0x42DE2500UL))
#define bFM4_GPIO_PCRA_P0                         *((volatile uint32_t*)(0x42DE2500UL))
#define bFM_GPIO_PCRA_P1                          *((volatile uint32_t*)(0x42DE2504UL))
#define bFM4_GPIO_PCRA_P1                         *((volatile uint32_t*)(0x42DE2504UL))
#define bFM_GPIO_PCRA_P2                          *((volatile uint32_t*)(0x42DE2508UL))
#define bFM4_GPIO_PCRA_P2                         *((volatile uint32_t*)(0x42DE2508UL))
#define bFM_GPIO_PCRA_P3                          *((volatile uint32_t*)(0x42DE250CUL))
#define bFM4_GPIO_PCRA_P3                         *((volatile uint32_t*)(0x42DE250CUL))
#define bFM_GPIO_PCRA_P4                          *((volatile uint32_t*)(0x42DE2510UL))
#define bFM4_GPIO_PCRA_P4                         *((volatile uint32_t*)(0x42DE2510UL))
#define bFM_GPIO_PCRA_P5                          *((volatile uint32_t*)(0x42DE2514UL))
#define bFM4_GPIO_PCRA_P5                         *((volatile uint32_t*)(0x42DE2514UL))
#define bFM_GPIO_PCRA_P6                          *((volatile uint32_t*)(0x42DE2518UL))
#define bFM4_GPIO_PCRA_P6                         *((volatile uint32_t*)(0x42DE2518UL))
#define bFM_GPIO_PCRA_P7                          *((volatile uint32_t*)(0x42DE251CUL))
#define bFM4_GPIO_PCRA_P7                         *((volatile uint32_t*)(0x42DE251CUL))
#define bFM_GPIO_PCRA_P8                          *((volatile uint32_t*)(0x42DE2520UL))
#define bFM4_GPIO_PCRA_P8                         *((volatile uint32_t*)(0x42DE2520UL))
#define bFM_GPIO_PCRA_P9                          *((volatile uint32_t*)(0x42DE2524UL))
#define bFM4_GPIO_PCRA_P9                         *((volatile uint32_t*)(0x42DE2524UL))
#define bFM_GPIO_PCRA_PA                          *((volatile uint32_t*)(0x42DE2528UL))
#define bFM4_GPIO_PCRA_PA                         *((volatile uint32_t*)(0x42DE2528UL))
#define bFM_GPIO_PCRA_PB                          *((volatile uint32_t*)(0x42DE252CUL))
#define bFM4_GPIO_PCRA_PB                         *((volatile uint32_t*)(0x42DE252CUL))
#define bFM_GPIO_PCRA_PC                          *((volatile uint32_t*)(0x42DE2530UL))
#define bFM4_GPIO_PCRA_PC                         *((volatile uint32_t*)(0x42DE2530UL))
#define bFM_GPIO_PCRA_PD                          *((volatile uint32_t*)(0x42DE2534UL))
#define bFM4_GPIO_PCRA_PD                         *((volatile uint32_t*)(0x42DE2534UL))
#define bFM_GPIO_PCRA_PE                          *((volatile uint32_t*)(0x42DE2538UL))
#define bFM4_GPIO_PCRA_PE                         *((volatile uint32_t*)(0x42DE2538UL))
#define bFM_GPIO_PCRA_PF                          *((volatile uint32_t*)(0x42DE253CUL))
#define bFM4_GPIO_PCRA_PF                         *((volatile uint32_t*)(0x42DE253CUL))

