neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PCRB_P0                          *((volatile uint32_t*)(0x42DE2580UL))
#define bFM4_GPIO_PCRB_P0                         *((volatile uint32_t*)(0x42DE2580UL))
#define bFM_GPIO_PCRB_P1                          *((volatile uint32_t*)(0x42DE2584UL))
#define bFM4_GPIO_PCRB_P1                         *((volatile uint32_t*)(0x42DE2584UL))
#define bFM_GPIO_PCRB_P2                          *((volatile uint32_t*)(0x42DE2588UL))
#define bFM4_GPIO_PCRB_P2                         *((volatile uint32_t*)(0x42DE2588UL))
#define bFM_GPIO_PCRB_P3                          *((volatile uint32_t*)(0x42DE258CUL))
#define bFM4_GPIO_PCRB_P3                         *((volatile uint32_t*)(0x42DE258CUL))
#define bFM_GPIO_PCRB_P4                          *((volatile uint32_t*)(0x42DE2590UL))
#define bFM4_GPIO_PCRB_P4                         *((volatile uint32_t*)(0x42DE2590UL))
#define bFM_GPIO_PCRB_P5                          *((volatile uint32_t*)(0x42DE2594UL))
#define bFM4_GPIO_PCRB_P5                         *((volatile uint32_t*)(0x42DE2594UL))
#define bFM_GPIO_PCRB_P6                          *((volatile uint32_t*)(0x42DE2598UL))
#define bFM4_GPIO_PCRB_P6                         *((volatile uint32_t*)(0x42DE2598UL))
#define bFM_GPIO_PCRB_P7                          *((volatile uint32_t*)(0x42DE259CUL))
#define bFM4_GPIO_PCRB_P7                         *((volatile uint32_t*)(0x42DE259CUL))
#define bFM_GPIO_PCRB_P8                          *((volatile uint32_t*)(0x42DE25A0UL))
#define bFM4_GPIO_PCRB_P8                         *((volatile uint32_t*)(0x42DE25A0UL))
#define bFM_GPIO_PCRB_P9                          *((volatile uint32_t*)(0x42DE25A4UL))
#define bFM4_GPIO_PCRB_P9                         *((volatile uint32_t*)(0x42DE25A4UL))
#define bFM_GPIO_PCRB_PA                          *((volatile uint32_t*)(0x42DE25A8UL))
#define bFM4_GPIO_PCRB_PA                         *((volatile uint32_t*)(0x42DE25A8UL))
#define bFM_GPIO_PCRB_PB                          *((volatile uint32_t*)(0x42DE25ACUL))
#define bFM4_GPIO_PCRB_PB                         *((volatile uint32_t*)(0x42DE25ACUL))
#define bFM_GPIO_PCRB_PC                          *((volatile uint32_t*)(0x42DE25B0UL))
#define bFM4_GPIO_PCRB_PC                         *((volatile uint32_t*)(0x42DE25B0UL))
#define bFM_GPIO_PCRB_PD                          *((volatile uint32_t*)(0x42DE25B4UL))
#define bFM4_GPIO_PCRB_PD                         *((volatile uint32_t*)(0x42DE25B4UL))
#define bFM_GPIO_PCRB_PE                          *((volatile uint32_t*)(0x42DE25B8UL))
#define bFM4_GPIO_PCRB_PE                         *((volatile uint32_t*)(0x42DE25B8UL))
#define bFM_GPIO_PCRB_PF                          *((volatile uint32_t*)(0x42DE25BCUL))
#define bFM4_GPIO_PCRB_PF                         *((volatile uint32_t*)(0x42DE25BCUL))

#define bFM_GPIO_PCRC_P0                          *((volatile uint32_t*)(0x42DE2600UL))
#define bFM4_GPIO_PCRC_P0                         *((volatile uint32_t*)(0x42DE2600UL))
#define bFM_GPIO_PCRC_P1                          *((volatile uint32_t*)(0x42DE2604UL))
#define bFM4_GPIO_PCRC_P1                         *((volatile uint32_t*)(0x42DE2604UL))
#define bFM_GPIO_PCRC_P2                          *((volatile uint32_t*)(0x42DE2608UL))
#define bFM4_GPIO_PCRC_P2                         *((volatile uint32_t*)(0x42DE2608UL))
#define bFM_GPIO_PCRC_P3                          *((volatile uint32_t*)(0x42DE260CUL))
#define bFM4_GPIO_PCRC_P3                         *((volatile uint32_t*)(0x42DE260CUL))
#define bFM_GPIO_PCRC_P4                          *((volatile uint32_t*)(0x42DE2610UL))
#define bFM4_GPIO_PCRC_P4                         *((volatile uint32_t*)(0x42DE2610UL))
#define bFM_GPIO_PCRC_P5                          *((volatile uint32_t*)(0x42DE2614UL))
#define bFM4_GPIO_PCRC_P5                         *((volatile uint32_t*)(0x42DE2614UL))
#define bFM_GPIO_PCRC_P6                          *((volatile uint32_t*)(0x42DE2618UL))
#define bFM4_GPIO_PCRC_P6                         *((volatile uint32_t*)(0x42DE2618UL))
#define bFM_GPIO_PCRC_P7                          *((volatile uint32_t*)(0x42DE261CUL))
#define bFM4_GPIO_PCRC_P7                         *((volatile uint32_t*)(0x42DE261CUL))
#define bFM_GPIO_PCRC_P8                          *((volatile uint32_t*)(0x42DE2620UL))
#define bFM4_GPIO_PCRC_P8                         *((volatile uint32_t*)(0x42DE2620UL))
#define bFM_GPIO_PCRC_P9                          *((volatile uint32_t*)(0x42DE2624UL))
#define bFM4_GPIO_PCRC_P9                         *((volatile uint32_t*)(0x42DE2624UL))
#define bFM_GPIO_PCRC_PA                          *((volatile uint32_t*)(0x42DE2628UL))
#define bFM4_GPIO_PCRC_PA                         *((volatile uint32_t*)(0x42DE2628UL))
#define bFM_GPIO_PCRC_PB                          *((volatile uint32_t*)(0x42DE262CUL))
#define bFM4_GPIO_PCRC_PB                         *((volatile uint32_t*)(0x42DE262CUL))
#define bFM_GPIO_PCRC_PC                          *((volatile uint32_t*)(0x42DE2630UL))
#define bFM4_GPIO_PCRC_PC                         *((volatile uint32_t*)(0x42DE2630UL))
#define bFM_GPIO_PCRC_PD                          *((volatile uint32_t*)(0x42DE2634UL))
#define bFM4_GPIO_PCRC_PD                         *((volatile uint32_t*)(0x42DE2634UL))
#define bFM_GPIO_PCRC_PE                          *((volatile uint32_t*)(0x42DE2638UL))
#define bFM4_GPIO_PCRC_PE                         *((volatile uint32_t*)(0x42DE2638UL))
#define bFM_GPIO_PCRC_PF                          *((volatile uint32_t*)(0x42DE263CUL))
#define bFM4_GPIO_PCRC_PF                         *((volatile uint32_t*)(0x42DE263CUL))

#define bFM_GPIO_PCRD_P0                          *((volatile uint32_t*)(0x42DE2680UL))
#define bFM4_GPIO_PCRD_P0                         *((volatile uint32_t*)(0x42DE2680UL))
#define bFM_GPIO_PCRD_P1                          *((volatile uint32_t*)(0x42DE2684UL))
#define bFM4_GPIO_PCRD_P1                         *((volatile uint32_t*)(0x42DE2684UL))
#define bFM_GPIO_PCRD_P2                          *((volatile uint32_t*)(0x42DE2688UL))
#define bFM4_GPIO_PCRD_P2                         *((volatile uint32_t*)(0x42DE2688UL))

#define bFM_GPIO_PCRE_P0                          *((volatile uint32_t*)(0x42DE2700UL))
#define bFM4_GPIO_PCRE_P0                         *((volatile uint32_t*)(0x42DE2700UL))
#define bFM_GPIO_PCRE_P2                          *((volatile uint32_t*)(0x42DE2708UL))
#define bFM4_GPIO_PCRE_P2                         *((volatile uint32_t*)(0x42DE2708UL))
#define bFM_GPIO_PCRE_P3                          *((volatile uint32_t*)(0x42DE270CUL))
#define bFM4_GPIO_PCRE_P3                         *((volatile uint32_t*)(0x42DE270CUL))

#define bFM_GPIO_PCRF_P0                          *((volatile uint32_t*)(0x42DE2780UL))
#define bFM4_GPIO_PCRF_P0                         *((volatile uint32_t*)(0x42DE2780UL))
#define bFM_GPIO_PCRF_P1                          *((volatile uint32_t*)(0x42DE2784UL))
#define bFM4_GPIO_PCRF_P1                         *((volatile uint32_t*)(0x42DE2784UL))
#define bFM_GPIO_PCRF_P2                          *((volatile uint32_t*)(0x42DE2788UL))
#define bFM4_GPIO_PCRF_P2                         *((volatile uint32_t*)(0x42DE2788UL))
#define bFM_GPIO_PCRF_P3                          *((volatile uint32_t*)(0x42DE278CUL))
#define bFM4_GPIO_PCRF_P3                         *((volatile uint32_t*)(0x42DE278CUL))
#define bFM_GPIO_PCRF_P4                          *((volatile uint32_t*)(0x42DE2790UL))
#define bFM4_GPIO_PCRF_P4                         *((volatile uint32_t*)(0x42DE2790UL))
#define bFM_GPIO_PCRF_P5                          *((volatile uint32_t*)(0x42DE2794UL))
#define bFM4_GPIO_PCRF_P5                         *((volatile uint32_t*)(0x42DE2794UL))
#define bFM_GPIO_PCRF_P6                          *((volatile uint32_t*)(0x42DE2798UL))
#define bFM4_GPIO_PCRF_P6                         *((volatile uint32_t*)(0x42DE2798UL))
#define bFM_GPIO_PCRF_P7                          *((volatile uint32_t*)(0x42DE279CUL))
#define bFM4_GPIO_PCRF_P7                         *((volatile uint32_t*)(0x42DE279CUL))
#define bFM_GPIO_PCRF_P8                          *((volatile uint32_t*)(0x42DE27A0UL))
#define bFM4_GPIO_PCRF_P8                         *((volatile uint32_t*)(0x42DE27A0UL))
#define bFM_GPIO_PCRF_P9                          *((volatile uint32_t*)(0x42DE27A4UL))
#define bFM4_GPIO_PCRF_P9                         *((volatile uint32_t*)(0x42DE27A4UL))
#define bFM_GPIO_PCRF_PA                          *((volatile uint32_t*)(0x42DE27A8UL))
#define bFM4_GPIO_PCRF_PA                         *((volatile uint32_t*)(0x42DE27A8UL))
#define bFM_GPIO_PCRF_PB                          *((volatile uint32_t*)(0x42DE27ACUL))
#define bFM4_GPIO_PCRF_PB                         *((volatile uint32_t*)(0x42DE27ACUL))
#define bFM_GPIO_PCRF_PC                          *((volatile uint32_t*)(0x42DE27B0UL))
#define bFM4_GPIO_PCRF_PC                         *((volatile uint32_t*)(0x42DE27B0UL))

