neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PDIR0_P0                         *((volatile uint32_t*)(0x42DE6000UL))
#define bFM4_GPIO_PDIR0_P0                        *((volatile uint32_t*)(0x42DE6000UL))
#define bFM_GPIO_PDIR0_P1                         *((volatile uint32_t*)(0x42DE6004UL))
#define bFM4_GPIO_PDIR0_P1                        *((volatile uint32_t*)(0x42DE6004UL))
#define bFM_GPIO_PDIR0_P2                         *((volatile uint32_t*)(0x42DE6008UL))
#define bFM4_GPIO_PDIR0_P2                        *((volatile uint32_t*)(0x42DE6008UL))
#define bFM_GPIO_PDIR0_P3                         *((volatile uint32_t*)(0x42DE600CUL))
#define bFM4_GPIO_PDIR0_P3                        *((volatile uint32_t*)(0x42DE600CUL))
#define bFM_GPIO_PDIR0_P4                         *((volatile uint32_t*)(0x42DE6010UL))
#define bFM4_GPIO_PDIR0_P4                        *((volatile uint32_t*)(0x42DE6010UL))
#define bFM_GPIO_PDIR0_P8                         *((volatile uint32_t*)(0x42DE6020UL))
#define bFM4_GPIO_PDIR0_P8                        *((volatile uint32_t*)(0x42DE6020UL))
#define bFM_GPIO_PDIR0_P9                         *((volatile uint32_t*)(0x42DE6024UL))
#define bFM4_GPIO_PDIR0_P9                        *((volatile uint32_t*)(0x42DE6024UL))
#define bFM_GPIO_PDIR0_PA                         *((volatile uint32_t*)(0x42DE6028UL))
#define bFM4_GPIO_PDIR0_PA                        *((volatile uint32_t*)(0x42DE6028UL))

#define bFM_GPIO_PDIR1_P0                         *((volatile uint32_t*)(0x42DE6080UL))
#define bFM4_GPIO_PDIR1_P0                        *((volatile uint32_t*)(0x42DE6080UL))
#define bFM_GPIO_PDIR1_P1                         *((volatile uint32_t*)(0x42DE6084UL))
#define bFM4_GPIO_PDIR1_P1                        *((volatile uint32_t*)(0x42DE6084UL))
#define bFM_GPIO_PDIR1_P2                         *((volatile uint32_t*)(0x42DE6088UL))
#define bFM4_GPIO_PDIR1_P2                        *((volatile uint32_t*)(0x42DE6088UL))
#define bFM_GPIO_PDIR1_P3                         *((volatile uint32_t*)(0x42DE608CUL))
#define bFM4_GPIO_PDIR1_P3                        *((volatile uint32_t*)(0x42DE608CUL))
#define bFM_GPIO_PDIR1_P4                         *((volatile uint32_t*)(0x42DE6090UL))
#define bFM4_GPIO_PDIR1_P4                        *((volatile uint32_t*)(0x42DE6090UL))
#define bFM_GPIO_PDIR1_P5                         *((volatile uint32_t*)(0x42DE6094UL))
#define bFM4_GPIO_PDIR1_P5                        *((volatile uint32_t*)(0x42DE6094UL))
#define bFM_GPIO_PDIR1_P6                         *((volatile uint32_t*)(0x42DE6098UL))
#define bFM4_GPIO_PDIR1_P6                        *((volatile uint32_t*)(0x42DE6098UL))
#define bFM_GPIO_PDIR1_P7                         *((volatile uint32_t*)(0x42DE609CUL))
#define bFM4_GPIO_PDIR1_P7                        *((volatile uint32_t*)(0x42DE609CUL))
#define bFM_GPIO_PDIR1_P8                         *((volatile uint32_t*)(0x42DE60A0UL))
#define bFM4_GPIO_PDIR1_P8                        *((volatile uint32_t*)(0x42DE60A0UL))
#define bFM_GPIO_PDIR1_P9                         *((volatile uint32_t*)(0x42DE60A4UL))
#define bFM4_GPIO_PDIR1_P9                        *((volatile uint32_t*)(0x42DE60A4UL))
#define bFM_GPIO_PDIR1_PA                         *((volatile uint32_t*)(0x42DE60A8UL))
#define bFM4_GPIO_PDIR1_PA                        *((volatile uint32_t*)(0x42DE60A8UL))
#define bFM_GPIO_PDIR1_PB                         *((volatile uint32_t*)(0x42DE60ACUL))
#define bFM4_GPIO_PDIR1_PB                        *((volatile uint32_t*)(0x42DE60ACUL))
#define bFM_GPIO_PDIR1_PC                         *((volatile uint32_t*)(0x42DE60B0UL))
#define bFM4_GPIO_PDIR1_PC                        *((volatile uint32_t*)(0x42DE60B0UL))
#define bFM_GPIO_PDIR1_PD                         *((volatile uint32_t*)(0x42DE60B4UL))
#define bFM4_GPIO_PDIR1_PD                        *((volatile uint32_t*)(0x42DE60B4UL))
#define bFM_GPIO_PDIR1_PE                         *((volatile uint32_t*)(0x42DE60B8UL))
#define bFM4_GPIO_PDIR1_PE                        *((volatile uint32_t*)(0x42DE60B8UL))
#define bFM_GPIO_PDIR1_PF                         *((volatile uint32_t*)(0x42DE60BCUL))
#define bFM4_GPIO_PDIR1_PF                        *((volatile uint32_t*)(0x42DE60BCUL))

#define bFM_GPIO_PDIR2_P0                         *((volatile uint32_t*)(0x42DE6100UL))
#define bFM4_GPIO_PDIR2_P0                        *((volatile uint32_t*)(0x42DE6100UL))
#define bFM_GPIO_PDIR2_P1                         *((volatile uint32_t*)(0x42DE6104UL))
#define bFM4_GPIO_PDIR2_P1                        *((volatile uint32_t*)(0x42DE6104UL))
#define bFM_GPIO_PDIR2_P2                         *((volatile uint32_t*)(0x42DE6108UL))
#define bFM4_GPIO_PDIR2_P2                        *((volatile uint32_t*)(0x42DE6108UL))
#define bFM_GPIO_PDIR2_P3                         *((volatile uint32_t*)(0x42DE610CUL))
#define bFM4_GPIO_PDIR2_P3                        *((volatile uint32_t*)(0x42DE610CUL))
#define bFM_GPIO_PDIR2_P4                         *((volatile uint32_t*)(0x42DE6110UL))
#define bFM4_GPIO_PDIR2_P4                        *((volatile uint32_t*)(0x42DE6110UL))
#define bFM_GPIO_PDIR2_P5                         *((volatile uint32_t*)(0x42DE6114UL))
#define bFM4_GPIO_PDIR2_P5                        *((volatile uint32_t*)(0x42DE6114UL))
#define bFM_GPIO_PDIR2_P6                         *((volatile uint32_t*)(0x42DE6118UL))
#define bFM4_GPIO_PDIR2_P6                        *((volatile uint32_t*)(0x42DE6118UL))
#define bFM_GPIO_PDIR2_P7                         *((volatile uint32_t*)(0x42DE611CUL))
#define bFM4_GPIO_PDIR2_P7                        *((volatile uint32_t*)(0x42DE611CUL))
#define bFM_GPIO_PDIR2_P8                         *((volatile uint32_t*)(0x42DE6120UL))
#define bFM4_GPIO_PDIR2_P8                        *((volatile uint32_t*)(0x42DE6120UL))
#define bFM_GPIO_PDIR2_P9                         *((volatile uint32_t*)(0x42DE6124UL))
#define bFM4_GPIO_PDIR2_P9                        *((volatile uint32_t*)(0x42DE6124UL))
#define bFM_GPIO_PDIR2_PA                         *((volatile uint32_t*)(0x42DE6128UL))
#define bFM4_GPIO_PDIR2_PA                        *((volatile uint32_t*)(0x42DE6128UL))

