neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PDIR3_P0                         *((volatile uint32_t*)(0x42DE6180UL))
#define bFM4_GPIO_PDIR3_P0                        *((volatile uint32_t*)(0x42DE6180UL))
#define bFM_GPIO_PDIR3_P1                         *((volatile uint32_t*)(0x42DE6184UL))
#define bFM4_GPIO_PDIR3_P1                        *((volatile uint32_t*)(0x42DE6184UL))
#define bFM_GPIO_PDIR3_P2                         *((volatile uint32_t*)(0x42DE6188UL))
#define bFM4_GPIO_PDIR3_P2                        *((volatile uint32_t*)(0x42DE6188UL))
#define bFM_GPIO_PDIR3_P3                         *((volatile uint32_t*)(0x42DE618CUL))
#define bFM4_GPIO_PDIR3_P3                        *((volatile uint32_t*)(0x42DE618CUL))
#define bFM_GPIO_PDIR3_P4                         *((volatile uint32_t*)(0x42DE6190UL))
#define bFM4_GPIO_PDIR3_P4                        *((volatile uint32_t*)(0x42DE6190UL))
#define bFM_GPIO_PDIR3_P5                         *((volatile uint32_t*)(0x42DE6194UL))
#define bFM4_GPIO_PDIR3_P5                        *((volatile uint32_t*)(0x42DE6194UL))
#define bFM_GPIO_PDIR3_P6                         *((volatile uint32_t*)(0x42DE6198UL))
#define bFM4_GPIO_PDIR3_P6                        *((volatile uint32_t*)(0x42DE6198UL))
#define bFM_GPIO_PDIR3_P7                         *((volatile uint32_t*)(0x42DE619CUL))
#define bFM4_GPIO_PDIR3_P7                        *((volatile uint32_t*)(0x42DE619CUL))
#define bFM_GPIO_PDIR3_P8                         *((volatile uint32_t*)(0x42DE61A0UL))
#define bFM4_GPIO_PDIR3_P8                        *((volatile uint32_t*)(0x42DE61A0UL))
#define bFM_GPIO_PDIR3_P9                         *((volatile uint32_t*)(0x42DE61A4UL))
#define bFM4_GPIO_PDIR3_P9                        *((volatile uint32_t*)(0x42DE61A4UL))
#define bFM_GPIO_PDIR3_PA                         *((volatile uint32_t*)(0x42DE61A8UL))
#define bFM4_GPIO_PDIR3_PA                        *((volatile uint32_t*)(0x42DE61A8UL))
#define bFM_GPIO_PDIR3_PB                         *((volatile uint32_t*)(0x42DE61ACUL))
#define bFM4_GPIO_PDIR3_PB                        *((volatile uint32_t*)(0x42DE61ACUL))
#define bFM_GPIO_PDIR3_PC                         *((volatile uint32_t*)(0x42DE61B0UL))
#define bFM4_GPIO_PDIR3_PC                        *((volatile uint32_t*)(0x42DE61B0UL))
#define bFM_GPIO_PDIR3_PD                         *((volatile uint32_t*)(0x42DE61B4UL))
#define bFM4_GPIO_PDIR3_PD                        *((volatile uint32_t*)(0x42DE61B4UL))
#define bFM_GPIO_PDIR3_PE                         *((volatile uint32_t*)(0x42DE61B8UL))
#define bFM4_GPIO_PDIR3_PE                        *((volatile uint32_t*)(0x42DE61B8UL))

#define bFM_GPIO_PDIR4_P0                         *((volatile uint32_t*)(0x42DE6200UL))
#define bFM4_GPIO_PDIR4_P0                        *((volatile uint32_t*)(0x42DE6200UL))
#define bFM_GPIO_PDIR4_P1                         *((volatile uint32_t*)(0x42DE6204UL))
#define bFM4_GPIO_PDIR4_P1                        *((volatile uint32_t*)(0x42DE6204UL))
#define bFM_GPIO_PDIR4_P2                         *((volatile uint32_t*)(0x42DE6208UL))
#define bFM4_GPIO_PDIR4_P2                        *((volatile uint32_t*)(0x42DE6208UL))
#define bFM_GPIO_PDIR4_P3                         *((volatile uint32_t*)(0x42DE620CUL))
#define bFM4_GPIO_PDIR4_P3                        *((volatile uint32_t*)(0x42DE620CUL))
#define bFM_GPIO_PDIR4_P4                         *((volatile uint32_t*)(0x42DE6210UL))
#define bFM4_GPIO_PDIR4_P4                        *((volatile uint32_t*)(0x42DE6210UL))
#define bFM_GPIO_PDIR4_P5                         *((volatile uint32_t*)(0x42DE6214UL))
#define bFM4_GPIO_PDIR4_P5                        *((volatile uint32_t*)(0x42DE6214UL))
#define bFM_GPIO_PDIR4_P6                         *((volatile uint32_t*)(0x42DE6218UL))
#define bFM4_GPIO_PDIR4_P6                        *((volatile uint32_t*)(0x42DE6218UL))
#define bFM_GPIO_PDIR4_P7                         *((volatile uint32_t*)(0x42DE621CUL))
#define bFM4_GPIO_PDIR4_P7                        *((volatile uint32_t*)(0x42DE621CUL))
#define bFM_GPIO_PDIR4_P8                         *((volatile uint32_t*)(0x42DE6220UL))
#define bFM4_GPIO_PDIR4_P8                        *((volatile uint32_t*)(0x42DE6220UL))
#define bFM_GPIO_PDIR4_P9                         *((volatile uint32_t*)(0x42DE6224UL))
#define bFM4_GPIO_PDIR4_P9                        *((volatile uint32_t*)(0x42DE6224UL))
#define bFM_GPIO_PDIR4_PA                         *((volatile uint32_t*)(0x42DE6228UL))
#define bFM4_GPIO_PDIR4_PA                        *((volatile uint32_t*)(0x42DE6228UL))
#define bFM_GPIO_PDIR4_PB                         *((volatile uint32_t*)(0x42DE622CUL))
#define bFM4_GPIO_PDIR4_PB                        *((volatile uint32_t*)(0x42DE622CUL))
#define bFM_GPIO_PDIR4_PC                         *((volatile uint32_t*)(0x42DE6230UL))
#define bFM4_GPIO_PDIR4_PC                        *((volatile uint32_t*)(0x42DE6230UL))
#define bFM_GPIO_PDIR4_PD                         *((volatile uint32_t*)(0x42DE6234UL))
#define bFM4_GPIO_PDIR4_PD                        *((volatile uint32_t*)(0x42DE6234UL))
#define bFM_GPIO_PDIR4_PE                         *((volatile uint32_t*)(0x42DE6238UL))
#define bFM4_GPIO_PDIR4_PE                        *((volatile uint32_t*)(0x42DE6238UL))

#define bFM_GPIO_PDIR5_P0                         *((volatile uint32_t*)(0x42DE6280UL))
#define bFM4_GPIO_PDIR5_P0                        *((volatile uint32_t*)(0x42DE6280UL))
#define bFM_GPIO_PDIR5_P1                         *((volatile uint32_t*)(0x42DE6284UL))
#define bFM4_GPIO_PDIR5_P1                        *((volatile uint32_t*)(0x42DE6284UL))
#define bFM_GPIO_PDIR5_P2                         *((volatile uint32_t*)(0x42DE6288UL))
#define bFM4_GPIO_PDIR5_P2                        *((volatile uint32_t*)(0x42DE6288UL))
#define bFM_GPIO_PDIR5_P3                         *((volatile uint32_t*)(0x42DE628CUL))
#define bFM4_GPIO_PDIR5_P3                        *((volatile uint32_t*)(0x42DE628CUL))
#define bFM_GPIO_PDIR5_P4                         *((volatile uint32_t*)(0x42DE6290UL))
#define bFM4_GPIO_PDIR5_P4                        *((volatile uint32_t*)(0x42DE6290UL))
#define bFM_GPIO_PDIR5_P5                         *((volatile uint32_t*)(0x42DE6294UL))
#define bFM4_GPIO_PDIR5_P5                        *((volatile uint32_t*)(0x42DE6294UL))
#define bFM_GPIO_PDIR5_P6                         *((volatile uint32_t*)(0x42DE6298UL))
#define bFM4_GPIO_PDIR5_P6                        *((volatile uint32_t*)(0x42DE6298UL))
#define bFM_GPIO_PDIR5_P7                         *((volatile uint32_t*)(0x42DE629CUL))
#define bFM4_GPIO_PDIR5_P7                        *((volatile uint32_t*)(0x42DE629CUL))
#define bFM_GPIO_PDIR5_P8                         *((volatile uint32_t*)(0x42DE62A0UL))
#define bFM4_GPIO_PDIR5_P8                        *((volatile uint32_t*)(0x42DE62A0UL))
#define bFM_GPIO_PDIR5_P9                         *((volatile uint32_t*)(0x42DE62A4UL))
#define bFM4_GPIO_PDIR5_P9                        *((volatile uint32_t*)(0x42DE62A4UL))
#define bFM_GPIO_PDIR5_PA                         *((volatile uint32_t*)(0x42DE62A8UL))
#define bFM4_GPIO_PDIR5_PA                        *((volatile uint32_t*)(0x42DE62A8UL))
#define bFM_GPIO_PDIR5_PB                         *((volatile uint32_t*)(0x42DE62ACUL))
#define bFM4_GPIO_PDIR5_PB                        *((volatile uint32_t*)(0x42DE62ACUL))
#define bFM_GPIO_PDIR5_PC                         *((volatile uint32_t*)(0x42DE62B0UL))
#define bFM4_GPIO_PDIR5_PC                        *((volatile uint32_t*)(0x42DE62B0UL))
#define bFM_GPIO_PDIR5_PD                         *((volatile uint32_t*)(0x42DE62B4UL))
#define bFM4_GPIO_PDIR5_PD                        *((volatile uint32_t*)(0x42DE62B4UL))
#define bFM_GPIO_PDIR5_PE                         *((volatile uint32_t*)(0x42DE62B8UL))
#define bFM4_GPIO_PDIR5_PE                        *((volatile uint32_t*)(0x42DE62B8UL))
#define bFM_GPIO_PDIR5_PF                         *((volatile uint32_t*)(0x42DE62BCUL))
#define bFM4_GPIO_PDIR5_PF                        *((volatile uint32_t*)(0x42DE62BCUL))

#define bFM_GPIO_PDIR6_P0                         *((volatile uint32_t*)(0x42DE6300UL))
#define bFM4_GPIO_PDIR6_P0                        *((volatile uint32_t*)(0x42DE6300UL))
#define bFM_GPIO_PDIR6_P1                         *((volatile uint32_t*)(0x42DE6304UL))
#define bFM4_GPIO_PDIR6_P1                        *((volatile uint32_t*)(0x42DE6304UL))
#define bFM_GPIO_PDIR6_P2                         *((volatile uint32_t*)(0x42DE6308UL))
#define bFM4_GPIO_PDIR6_P2                        *((volatile uint32_t*)(0x42DE6308UL))
#define bFM_GPIO_PDIR6_P3                         *((volatile uint32_t*)(0x42DE630CUL))
#define bFM4_GPIO_PDIR6_P3                        *((volatile uint32_t*)(0x42DE630CUL))
#define bFM_GPIO_PDIR6_P4                         *((volatile uint32_t*)(0x42DE6310UL))
#define bFM4_GPIO_PDIR6_P4                        *((volatile uint32_t*)(0x42DE6310UL))
#define bFM_GPIO_PDIR6_P5                         *((volatile uint32_t*)(0x42DE6314UL))
#define bFM4_GPIO_PDIR6_P5                        *((volatile uint32_t*)(0x42DE6314UL))
#define bFM_GPIO_PDIR6_P6                         *((volatile uint32_t*)(0x42DE6318UL))
#define bFM4_GPIO_PDIR6_P6                        *((volatile uint32_t*)(0x42DE6318UL))
#define bFM_GPIO_PDIR6_P7                         *((volatile uint32_t*)(0x42DE631CUL))
#define bFM4_GPIO_PDIR6_P7                        *((volatile uint32_t*)(0x42DE631CUL))
#define bFM_GPIO_PDIR6_P8                         *((volatile uint32_t*)(0x42DE6320UL))
#define bFM4_GPIO_PDIR6_P8                        *((volatile uint32_t*)(0x42DE6320UL))
#define bFM_GPIO_PDIR6_P9                         *((volatile uint32_t*)(0x42DE6324UL))
#define bFM4_GPIO_PDIR6_P9                        *((volatile uint32_t*)(0x42DE6324UL))
#define bFM_GPIO_PDIR6_PA                         *((volatile uint32_t*)(0x42DE6328UL))
#define bFM4_GPIO_PDIR6_PA                        *((volatile uint32_t*)(0x42DE6328UL))
#define bFM_GPIO_PDIR6_PB                         *((volatile uint32_t*)(0x42DE632CUL))
#define bFM4_GPIO_PDIR6_PB                        *((volatile uint32_t*)(0x42DE632CUL))
#define bFM_GPIO_PDIR6_PC                         *((volatile uint32_t*)(0x42DE6330UL))
#define bFM4_GPIO_PDIR6_PC                        *((volatile uint32_t*)(0x42DE6330UL))
#define bFM_GPIO_PDIR6_PD                         *((volatile uint32_t*)(0x42DE6334UL))
#define bFM4_GPIO_PDIR6_PD                        *((volatile uint32_t*)(0x42DE6334UL))
#define bFM_GPIO_PDIR6_PE                         *((volatile uint32_t*)(0x42DE6338UL))
#define bFM4_GPIO_PDIR6_PE                        *((volatile uint32_t*)(0x42DE6338UL))

