neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PDIR7_P0                         *((volatile uint32_t*)(0x42DE6380UL))
#define bFM4_GPIO_PDIR7_P0                        *((volatile uint32_t*)(0x42DE6380UL))
#define bFM_GPIO_PDIR7_P1                         *((volatile uint32_t*)(0x42DE6384UL))
#define bFM4_GPIO_PDIR7_P1                        *((volatile uint32_t*)(0x42DE6384UL))
#define bFM_GPIO_PDIR7_P2                         *((volatile uint32_t*)(0x42DE6388UL))
#define bFM4_GPIO_PDIR7_P2                        *((volatile uint32_t*)(0x42DE6388UL))
#define bFM_GPIO_PDIR7_P3                         *((volatile uint32_t*)(0x42DE638CUL))
#define bFM4_GPIO_PDIR7_P3                        *((volatile uint32_t*)(0x42DE638CUL))
#define bFM_GPIO_PDIR7_P4                         *((volatile uint32_t*)(0x42DE6390UL))
#define bFM4_GPIO_PDIR7_P4                        *((volatile uint32_t*)(0x42DE6390UL))
#define bFM_GPIO_PDIR7_P5                         *((volatile uint32_t*)(0x42DE6394UL))
#define bFM4_GPIO_PDIR7_P5                        *((volatile uint32_t*)(0x42DE6394UL))
#define bFM_GPIO_PDIR7_P6                         *((volatile uint32_t*)(0x42DE6398UL))
#define bFM4_GPIO_PDIR7_P6                        *((volatile uint32_t*)(0x42DE6398UL))
#define bFM_GPIO_PDIR7_P7                         *((volatile uint32_t*)(0x42DE639CUL))
#define bFM4_GPIO_PDIR7_P7                        *((volatile uint32_t*)(0x42DE639CUL))
#define bFM_GPIO_PDIR7_P8                         *((volatile uint32_t*)(0x42DE63A0UL))
#define bFM4_GPIO_PDIR7_P8                        *((volatile uint32_t*)(0x42DE63A0UL))
#define bFM_GPIO_PDIR7_P9                         *((volatile uint32_t*)(0x42DE63A4UL))
#define bFM4_GPIO_PDIR7_P9                        *((volatile uint32_t*)(0x42DE63A4UL))
#define bFM_GPIO_PDIR7_PA                         *((volatile uint32_t*)(0x42DE63A8UL))
#define bFM4_GPIO_PDIR7_PA                        *((volatile uint32_t*)(0x42DE63A8UL))
#define bFM_GPIO_PDIR7_PB                         *((volatile uint32_t*)(0x42DE63ACUL))
#define bFM4_GPIO_PDIR7_PB                        *((volatile uint32_t*)(0x42DE63ACUL))
#define bFM_GPIO_PDIR7_PC                         *((volatile uint32_t*)(0x42DE63B0UL))
#define bFM4_GPIO_PDIR7_PC                        *((volatile uint32_t*)(0x42DE63B0UL))
#define bFM_GPIO_PDIR7_PD                         *((volatile uint32_t*)(0x42DE63B4UL))
#define bFM4_GPIO_PDIR7_PD                        *((volatile uint32_t*)(0x42DE63B4UL))
#define bFM_GPIO_PDIR7_PE                         *((volatile uint32_t*)(0x42DE63B8UL))
#define bFM4_GPIO_PDIR7_PE                        *((volatile uint32_t*)(0x42DE63B8UL))

#define bFM_GPIO_PDIR8_P0                         *((volatile uint32_t*)(0x42DE6400UL))
#define bFM4_GPIO_PDIR8_P0                        *((volatile uint32_t*)(0x42DE6400UL))
#define bFM_GPIO_PDIR8_P1                         *((volatile uint32_t*)(0x42DE6404UL))
#define bFM4_GPIO_PDIR8_P1                        *((volatile uint32_t*)(0x42DE6404UL))
#define bFM_GPIO_PDIR8_P2                         *((volatile uint32_t*)(0x42DE6408UL))
#define bFM4_GPIO_PDIR8_P2                        *((volatile uint32_t*)(0x42DE6408UL))
#define bFM_GPIO_PDIR8_P3                         *((volatile uint32_t*)(0x42DE640CUL))
#define bFM4_GPIO_PDIR8_P3                        *((volatile uint32_t*)(0x42DE640CUL))

#define bFM_GPIO_PDIR9_P0                         *((volatile uint32_t*)(0x42DE6480UL))
#define bFM4_GPIO_PDIR9_P0                        *((volatile uint32_t*)(0x42DE6480UL))
#define bFM_GPIO_PDIR9_P1                         *((volatile uint32_t*)(0x42DE6484UL))
#define bFM4_GPIO_PDIR9_P1                        *((volatile uint32_t*)(0x42DE6484UL))
#define bFM_GPIO_PDIR9_P2                         *((volatile uint32_t*)(0x42DE6488UL))
#define bFM4_GPIO_PDIR9_P2                        *((volatile uint32_t*)(0x42DE6488UL))
#define bFM_GPIO_PDIR9_P3                         *((volatile uint32_t*)(0x42DE648CUL))
#define bFM4_GPIO_PDIR9_P3                        *((volatile uint32_t*)(0x42DE648CUL))
#define bFM_GPIO_PDIR9_P4                         *((volatile uint32_t*)(0x42DE6490UL))
#define bFM4_GPIO_PDIR9_P4                        *((volatile uint32_t*)(0x42DE6490UL))
#define bFM_GPIO_PDIR9_P5                         *((volatile uint32_t*)(0x42DE6494UL))
#define bFM4_GPIO_PDIR9_P5                        *((volatile uint32_t*)(0x42DE6494UL))
#define bFM_GPIO_PDIR9_P6                         *((volatile uint32_t*)(0x42DE6498UL))
#define bFM4_GPIO_PDIR9_P6                        *((volatile uint32_t*)(0x42DE6498UL))
#define bFM_GPIO_PDIR9_P7                         *((volatile uint32_t*)(0x42DE649CUL))
#define bFM4_GPIO_PDIR9_P7                        *((volatile uint32_t*)(0x42DE649CUL))

#define bFM_GPIO_PDIRA_P0                         *((volatile uint32_t*)(0x42DE6500UL))
#define bFM4_GPIO_PDIRA_P0                        *((volatile uint32_t*)(0x42DE6500UL))
#define bFM_GPIO_PDIRA_P1                         *((volatile uint32_t*)(0x42DE6504UL))
#define bFM4_GPIO_PDIRA_P1                        *((volatile uint32_t*)(0x42DE6504UL))
#define bFM_GPIO_PDIRA_P2                         *((volatile uint32_t*)(0x42DE6508UL))
#define bFM4_GPIO_PDIRA_P2                        *((volatile uint32_t*)(0x42DE6508UL))
#define bFM_GPIO_PDIRA_P3                         *((volatile uint32_t*)(0x42DE650CUL))
#define bFM4_GPIO_PDIRA_P3                        *((volatile uint32_t*)(0x42DE650CUL))
#define bFM_GPIO_PDIRA_P4                         *((volatile uint32_t*)(0x42DE6510UL))
#define bFM4_GPIO_PDIRA_P4                        *((volatile uint32_t*)(0x42DE6510UL))
#define bFM_GPIO_PDIRA_P5                         *((volatile uint32_t*)(0x42DE6514UL))
#define bFM4_GPIO_PDIRA_P5                        *((volatile uint32_t*)(0x42DE6514UL))
#define bFM_GPIO_PDIRA_P6                         *((volatile uint32_t*)(0x42DE6518UL))
#define bFM4_GPIO_PDIRA_P6                        *((volatile uint32_t*)(0x42DE6518UL))
#define bFM_GPIO_PDIRA_P7                         *((volatile uint32_t*)(0x42DE651CUL))
#define bFM4_GPIO_PDIRA_P7                        *((volatile uint32_t*)(0x42DE651CUL))
#define bFM_GPIO_PDIRA_P8                         *((volatile uint32_t*)(0x42DE6520UL))
#define bFM4_GPIO_PDIRA_P8                        *((volatile uint32_t*)(0x42DE6520UL))
#define bFM_GPIO_PDIRA_P9                         *((volatile uint32_t*)(0x42DE6524UL))
#define bFM4_GPIO_PDIRA_P9                        *((volatile uint32_t*)(0x42DE6524UL))
#define bFM_GPIO_PDIRA_PA                         *((volatile uint32_t*)(0x42DE6528UL))
#define bFM4_GPIO_PDIRA_PA                        *((volatile uint32_t*)(0x42DE6528UL))
#define bFM_GPIO_PDIRA_PB                         *((volatile uint32_t*)(0x42DE652CUL))
#define bFM4_GPIO_PDIRA_PB                        *((volatile uint32_t*)(0x42DE652CUL))
#define bFM_GPIO_PDIRA_PC                         *((volatile uint32_t*)(0x42DE6530UL))
#define bFM4_GPIO_PDIRA_PC                        *((volatile uint32_t*)(0x42DE6530UL))
#define bFM_GPIO_PDIRA_PD                         *((volatile uint32_t*)(0x42DE6534UL))
#define bFM4_GPIO_PDIRA_PD                        *((volatile uint32_t*)(0x42DE6534UL))
#define bFM_GPIO_PDIRA_PE                         *((volatile uint32_t*)(0x42DE6538UL))
#define bFM4_GPIO_PDIRA_PE                        *((volatile uint32_t*)(0x42DE6538UL))
#define bFM_GPIO_PDIRA_PF                         *((volatile uint32_t*)(0x42DE653CUL))
#define bFM4_GPIO_PDIRA_PF                        *((volatile uint32_t*)(0x42DE653CUL))

#define bFM_GPIO_PDIRB_P0                         *((volatile uint32_t*)(0x42DE6580UL))
#define bFM4_GPIO_PDIRB_P0                        *((volatile uint32_t*)(0x42DE6580UL))
#define bFM_GPIO_PDIRB_P1                         *((volatile uint32_t*)(0x42DE6584UL))
#define bFM4_GPIO_PDIRB_P1                        *((volatile uint32_t*)(0x42DE6584UL))
#define bFM_GPIO_PDIRB_P2                         *((volatile uint32_t*)(0x42DE6588UL))
#define bFM4_GPIO_PDIRB_P2                        *((volatile uint32_t*)(0x42DE6588UL))
#define bFM_GPIO_PDIRB_P3                         *((volatile uint32_t*)(0x42DE658CUL))
#define bFM4_GPIO_PDIRB_P3                        *((volatile uint32_t*)(0x42DE658CUL))
#define bFM_GPIO_PDIRB_P4                         *((volatile uint32_t*)(0x42DE6590UL))
#define bFM4_GPIO_PDIRB_P4                        *((volatile uint32_t*)(0x42DE6590UL))
#define bFM_GPIO_PDIRB_P5                         *((volatile uint32_t*)(0x42DE6594UL))
#define bFM4_GPIO_PDIRB_P5                        *((volatile uint32_t*)(0x42DE6594UL))
#define bFM_GPIO_PDIRB_P6                         *((volatile uint32_t*)(0x42DE6598UL))
#define bFM4_GPIO_PDIRB_P6                        *((volatile uint32_t*)(0x42DE6598UL))
#define bFM_GPIO_PDIRB_P7                         *((volatile uint32_t*)(0x42DE659CUL))
#define bFM4_GPIO_PDIRB_P7                        *((volatile uint32_t*)(0x42DE659CUL))
#define bFM_GPIO_PDIRB_P8                         *((volatile uint32_t*)(0x42DE65A0UL))
#define bFM4_GPIO_PDIRB_P8                        *((volatile uint32_t*)(0x42DE65A0UL))
#define bFM_GPIO_PDIRB_P9                         *((volatile uint32_t*)(0x42DE65A4UL))
#define bFM4_GPIO_PDIRB_P9                        *((volatile uint32_t*)(0x42DE65A4UL))
#define bFM_GPIO_PDIRB_PA                         *((volatile uint32_t*)(0x42DE65A8UL))
#define bFM4_GPIO_PDIRB_PA                        *((volatile uint32_t*)(0x42DE65A8UL))
#define bFM_GPIO_PDIRB_PB                         *((volatile uint32_t*)(0x42DE65ACUL))
#define bFM4_GPIO_PDIRB_PB                        *((volatile uint32_t*)(0x42DE65ACUL))
#define bFM_GPIO_PDIRB_PC                         *((volatile uint32_t*)(0x42DE65B0UL))
#define bFM4_GPIO_PDIRB_PC                        *((volatile uint32_t*)(0x42DE65B0UL))
#define bFM_GPIO_PDIRB_PD                         *((volatile uint32_t*)(0x42DE65B4UL))
#define bFM4_GPIO_PDIRB_PD                        *((volatile uint32_t*)(0x42DE65B4UL))
#define bFM_GPIO_PDIRB_PE                         *((volatile uint32_t*)(0x42DE65B8UL))
#define bFM4_GPIO_PDIRB_PE                        *((volatile uint32_t*)(0x42DE65B8UL))
#define bFM_GPIO_PDIRB_PF                         *((volatile uint32_t*)(0x42DE65BCUL))
#define bFM4_GPIO_PDIRB_PF                        *((volatile uint32_t*)(0x42DE65BCUL))

