neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PDIRC_P0                         *((volatile uint32_t*)(0x42DE6600UL))
#define bFM4_GPIO_PDIRC_P0                        *((volatile uint32_t*)(0x42DE6600UL))
#define bFM_GPIO_PDIRC_P1                         *((volatile uint32_t*)(0x42DE6604UL))
#define bFM4_GPIO_PDIRC_P1                        *((volatile uint32_t*)(0x42DE6604UL))
#define bFM_GPIO_PDIRC_P2                         *((volatile uint32_t*)(0x42DE6608UL))
#define bFM4_GPIO_PDIRC_P2                        *((volatile uint32_t*)(0x42DE6608UL))
#define bFM_GPIO_PDIRC_P3                         *((volatile uint32_t*)(0x42DE660CUL))
#define bFM4_GPIO_PDIRC_P3                        *((volatile uint32_t*)(0x42DE660CUL))
#define bFM_GPIO_PDIRC_P4                         *((volatile uint32_t*)(0x42DE6610UL))
#define bFM4_GPIO_PDIRC_P4                        *((volatile uint32_t*)(0x42DE6610UL))
#define bFM_GPIO_PDIRC_P5                         *((volatile uint32_t*)(0x42DE6614UL))
#define bFM4_GPIO_PDIRC_P5                        *((volatile uint32_t*)(0x42DE6614UL))
#define bFM_GPIO_PDIRC_P6                         *((volatile uint32_t*)(0x42DE6618UL))
#define bFM4_GPIO_PDIRC_P6                        *((volatile uint32_t*)(0x42DE6618UL))
#define bFM_GPIO_PDIRC_P7                         *((volatile uint32_t*)(0x42DE661CUL))
#define bFM4_GPIO_PDIRC_P7                        *((volatile uint32_t*)(0x42DE661CUL))
#define bFM_GPIO_PDIRC_P8                         *((volatile uint32_t*)(0x42DE6620UL))
#define bFM4_GPIO_PDIRC_P8                        *((volatile uint32_t*)(0x42DE6620UL))
#define bFM_GPIO_PDIRC_P9                         *((volatile uint32_t*)(0x42DE6624UL))
#define bFM4_GPIO_PDIRC_P9                        *((volatile uint32_t*)(0x42DE6624UL))
#define bFM_GPIO_PDIRC_PA                         *((volatile uint32_t*)(0x42DE6628UL))
#define bFM4_GPIO_PDIRC_PA                        *((volatile uint32_t*)(0x42DE6628UL))
#define bFM_GPIO_PDIRC_PB                         *((volatile uint32_t*)(0x42DE662CUL))
#define bFM4_GPIO_PDIRC_PB                        *((volatile uint32_t*)(0x42DE662CUL))
#define bFM_GPIO_PDIRC_PC                         *((volatile uint32_t*)(0x42DE6630UL))
#define bFM4_GPIO_PDIRC_PC                        *((volatile uint32_t*)(0x42DE6630UL))
#define bFM_GPIO_PDIRC_PD                         *((volatile uint32_t*)(0x42DE6634UL))
#define bFM4_GPIO_PDIRC_PD                        *((volatile uint32_t*)(0x42DE6634UL))
#define bFM_GPIO_PDIRC_PE                         *((volatile uint32_t*)(0x42DE6638UL))
#define bFM4_GPIO_PDIRC_PE                        *((volatile uint32_t*)(0x42DE6638UL))
#define bFM_GPIO_PDIRC_PF                         *((volatile uint32_t*)(0x42DE663CUL))
#define bFM4_GPIO_PDIRC_PF                        *((volatile uint32_t*)(0x42DE663CUL))

#define bFM_GPIO_PDIRD_P0                         *((volatile uint32_t*)(0x42DE6680UL))
#define bFM4_GPIO_PDIRD_P0                        *((volatile uint32_t*)(0x42DE6680UL))
#define bFM_GPIO_PDIRD_P1                         *((volatile uint32_t*)(0x42DE6684UL))
#define bFM4_GPIO_PDIRD_P1                        *((volatile uint32_t*)(0x42DE6684UL))
#define bFM_GPIO_PDIRD_P2                         *((volatile uint32_t*)(0x42DE6688UL))
#define bFM4_GPIO_PDIRD_P2                        *((volatile uint32_t*)(0x42DE6688UL))

#define bFM_GPIO_PDIRE_P0                         *((volatile uint32_t*)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_P0                        *((volatile uint32_t*)(0x42DE6700UL))
#define bFM_GPIO_PDIRE_P2                         *((volatile uint32_t*)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_P2                        *((volatile uint32_t*)(0x42DE6708UL))
#define bFM_GPIO_PDIRE_P3                         *((volatile uint32_t*)(0x42DE670CUL))
#define bFM4_GPIO_PDIRE_P3                        *((volatile uint32_t*)(0x42DE670CUL))

#define bFM_GPIO_PDIRF_P0                         *((volatile uint32_t*)(0x42DE6780UL))
#define bFM4_GPIO_PDIRF_P0                        *((volatile uint32_t*)(0x42DE6780UL))
#define bFM_GPIO_PDIRF_P1                         *((volatile uint32_t*)(0x42DE6784UL))
#define bFM4_GPIO_PDIRF_P1                        *((volatile uint32_t*)(0x42DE6784UL))
#define bFM_GPIO_PDIRF_P2                         *((volatile uint32_t*)(0x42DE6788UL))
#define bFM4_GPIO_PDIRF_P2                        *((volatile uint32_t*)(0x42DE6788UL))
#define bFM_GPIO_PDIRF_P3                         *((volatile uint32_t*)(0x42DE678CUL))
#define bFM4_GPIO_PDIRF_P3                        *((volatile uint32_t*)(0x42DE678CUL))
#define bFM_GPIO_PDIRF_P4                         *((volatile uint32_t*)(0x42DE6790UL))
#define bFM4_GPIO_PDIRF_P4                        *((volatile uint32_t*)(0x42DE6790UL))
#define bFM_GPIO_PDIRF_P5                         *((volatile uint32_t*)(0x42DE6794UL))
#define bFM4_GPIO_PDIRF_P5                        *((volatile uint32_t*)(0x42DE6794UL))
#define bFM_GPIO_PDIRF_P6                         *((volatile uint32_t*)(0x42DE6798UL))
#define bFM4_GPIO_PDIRF_P6                        *((volatile uint32_t*)(0x42DE6798UL))
#define bFM_GPIO_PDIRF_P7                         *((volatile uint32_t*)(0x42DE679CUL))
#define bFM4_GPIO_PDIRF_P7                        *((volatile uint32_t*)(0x42DE679CUL))
#define bFM_GPIO_PDIRF_P8                         *((volatile uint32_t*)(0x42DE67A0UL))
#define bFM4_GPIO_PDIRF_P8                        *((volatile uint32_t*)(0x42DE67A0UL))
#define bFM_GPIO_PDIRF_P9                         *((volatile uint32_t*)(0x42DE67A4UL))
#define bFM4_GPIO_PDIRF_P9                        *((volatile uint32_t*)(0x42DE67A4UL))
#define bFM_GPIO_PDIRF_PA                         *((volatile uint32_t*)(0x42DE67A8UL))
#define bFM4_GPIO_PDIRF_PA                        *((volatile uint32_t*)(0x42DE67A8UL))
#define bFM_GPIO_PDIRF_PB                         *((volatile uint32_t*)(0x42DE67ACUL))
#define bFM4_GPIO_PDIRF_PB                        *((volatile uint32_t*)(0x42DE67ACUL))
#define bFM_GPIO_PDIRF_PC                         *((volatile uint32_t*)(0x42DE67B0UL))
#define bFM4_GPIO_PDIRF_PC                        *((volatile uint32_t*)(0x42DE67B0UL))

#define bFM_GPIO_PDOR0_P0                         *((volatile uint32_t*)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P0                        *((volatile uint32_t*)(0x42DE8000UL))
#define bFM_GPIO_PDOR0_P1                         *((volatile uint32_t*)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P1                        *((volatile uint32_t*)(0x42DE8004UL))
#define bFM_GPIO_PDOR0_P2                         *((volatile uint32_t*)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P2                        *((volatile uint32_t*)(0x42DE8008UL))
#define bFM_GPIO_PDOR0_P3                         *((volatile uint32_t*)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P3                        *((volatile uint32_t*)(0x42DE800CUL))
#define bFM_GPIO_PDOR0_P4                         *((volatile uint32_t*)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P4                        *((volatile uint32_t*)(0x42DE8010UL))
#define bFM_GPIO_PDOR0_P8                         *((volatile uint32_t*)(0x42DE8020UL))
#define bFM4_GPIO_PDOR0_P8                        *((volatile uint32_t*)(0x42DE8020UL))
#define bFM_GPIO_PDOR0_P9                         *((volatile uint32_t*)(0x42DE8024UL))
#define bFM4_GPIO_PDOR0_P9                        *((volatile uint32_t*)(0x42DE8024UL))
#define bFM_GPIO_PDOR0_PA                         *((volatile uint32_t*)(0x42DE8028UL))
#define bFM4_GPIO_PDOR0_PA                        *((volatile uint32_t*)(0x42DE8028UL))

#define bFM_GPIO_PDOR1_P0                         *((volatile uint32_t*)(0x42DE8080UL))
#define bFM4_GPIO_PDOR1_P0                        *((volatile uint32_t*)(0x42DE8080UL))
#define bFM_GPIO_PDOR1_P1                         *((volatile uint32_t*)(0x42DE8084UL))
#define bFM4_GPIO_PDOR1_P1                        *((volatile uint32_t*)(0x42DE8084UL))
#define bFM_GPIO_PDOR1_P2                         *((volatile uint32_t*)(0x42DE8088UL))
#define bFM4_GPIO_PDOR1_P2                        *((volatile uint32_t*)(0x42DE8088UL))
#define bFM_GPIO_PDOR1_P3                         *((volatile uint32_t*)(0x42DE808CUL))
#define bFM4_GPIO_PDOR1_P3                        *((volatile uint32_t*)(0x42DE808CUL))
#define bFM_GPIO_PDOR1_P4                         *((volatile uint32_t*)(0x42DE8090UL))
#define bFM4_GPIO_PDOR1_P4                        *((volatile uint32_t*)(0x42DE8090UL))
#define bFM_GPIO_PDOR1_P5                         *((volatile uint32_t*)(0x42DE8094UL))
#define bFM4_GPIO_PDOR1_P5                        *((volatile uint32_t*)(0x42DE8094UL))
#define bFM_GPIO_PDOR1_P6                         *((volatile uint32_t*)(0x42DE8098UL))
#define bFM4_GPIO_PDOR1_P6                        *((volatile uint32_t*)(0x42DE8098UL))
#define bFM_GPIO_PDOR1_P7                         *((volatile uint32_t*)(0x42DE809CUL))
#define bFM4_GPIO_PDOR1_P7                        *((volatile uint32_t*)(0x42DE809CUL))
#define bFM_GPIO_PDOR1_P8                         *((volatile uint32_t*)(0x42DE80A0UL))
#define bFM4_GPIO_PDOR1_P8                        *((volatile uint32_t*)(0x42DE80A0UL))
#define bFM_GPIO_PDOR1_P9                         *((volatile uint32_t*)(0x42DE80A4UL))
#define bFM4_GPIO_PDOR1_P9                        *((volatile uint32_t*)(0x42DE80A4UL))
#define bFM_GPIO_PDOR1_PA                         *((volatile uint32_t*)(0x42DE80A8UL))
#define bFM4_GPIO_PDOR1_PA                        *((volatile uint32_t*)(0x42DE80A8UL))
#define bFM_GPIO_PDOR1_PB                         *((volatile uint32_t*)(0x42DE80ACUL))
#define bFM4_GPIO_PDOR1_PB                        *((volatile uint32_t*)(0x42DE80ACUL))
#define bFM_GPIO_PDOR1_PC                         *((volatile uint32_t*)(0x42DE80B0UL))
#define bFM4_GPIO_PDOR1_PC                        *((volatile uint32_t*)(0x42DE80B0UL))
#define bFM_GPIO_PDOR1_PD                         *((volatile uint32_t*)(0x42DE80B4UL))
#define bFM4_GPIO_PDOR1_PD                        *((volatile uint32_t*)(0x42DE80B4UL))
#define bFM_GPIO_PDOR1_PE                         *((volatile uint32_t*)(0x42DE80B8UL))
#define bFM4_GPIO_PDOR1_PE                        *((volatile uint32_t*)(0x42DE80B8UL))
#define bFM_GPIO_PDOR1_PF                         *((volatile uint32_t*)(0x42DE80BCUL))
#define bFM4_GPIO_PDOR1_PF                        *((volatile uint32_t*)(0x42DE80BCUL))

#define bFM_GPIO_PDOR2_P0                         *((volatile uint32_t*)(0x42DE8100UL))
#define bFM4_GPIO_PDOR2_P0                        *((volatile uint32_t*)(0x42DE8100UL))
#define bFM_GPIO_PDOR2_P1                         *((volatile uint32_t*)(0x42DE8104UL))
#define bFM4_GPIO_PDOR2_P1                        *((volatile uint32_t*)(0x42DE8104UL))
#define bFM_GPIO_PDOR2_P2                         *((volatile uint32_t*)(0x42DE8108UL))
#define bFM4_GPIO_PDOR2_P2                        *((volatile uint32_t*)(0x42DE8108UL))
#define bFM_GPIO_PDOR2_P3                         *((volatile uint32_t*)(0x42DE810CUL))
#define bFM4_GPIO_PDOR2_P3                        *((volatile uint32_t*)(0x42DE810CUL))
#define bFM_GPIO_PDOR2_P4                         *((volatile uint32_t*)(0x42DE8110UL))
#define bFM4_GPIO_PDOR2_P4                        *((volatile uint32_t*)(0x42DE8110UL))
#define bFM_GPIO_PDOR2_P5                         *((volatile uint32_t*)(0x42DE8114UL))
#define bFM4_GPIO_PDOR2_P5                        *((volatile uint32_t*)(0x42DE8114UL))
#define bFM_GPIO_PDOR2_P6                         *((volatile uint32_t*)(0x42DE8118UL))
#define bFM4_GPIO_PDOR2_P6                        *((volatile uint32_t*)(0x42DE8118UL))
#define bFM_GPIO_PDOR2_P7                         *((volatile uint32_t*)(0x42DE811CUL))
#define bFM4_GPIO_PDOR2_P7                        *((volatile uint32_t*)(0x42DE811CUL))
#define bFM_GPIO_PDOR2_P8                         *((volatile uint32_t*)(0x42DE8120UL))
#define bFM4_GPIO_PDOR2_P8                        *((volatile uint32_t*)(0x42DE8120UL))
#define bFM_GPIO_PDOR2_P9                         *((volatile uint32_t*)(0x42DE8124UL))
#define bFM4_GPIO_PDOR2_P9                        *((volatile uint32_t*)(0x42DE8124UL))
#define bFM_GPIO_PDOR2_PA                         *((volatile uint32_t*)(0x42DE8128UL))
#define bFM4_GPIO_PDOR2_PA                        *((volatile uint32_t*)(0x42DE8128UL))

#define bFM_GPIO_PDOR3_P0                         *((volatile uint32_t*)(0x42DE8180UL))
#define bFM4_GPIO_PDOR3_P0                        *((volatile uint32_t*)(0x42DE8180UL))
#define bFM_GPIO_PDOR3_P1                         *((volatile uint32_t*)(0x42DE8184UL))
#define bFM4_GPIO_PDOR3_P1                        *((volatile uint32_t*)(0x42DE8184UL))
#define bFM_GPIO_PDOR3_P2                         *((volatile uint32_t*)(0x42DE8188UL))
#define bFM4_GPIO_PDOR3_P2                        *((volatile uint32_t*)(0x42DE8188UL))
#define bFM_GPIO_PDOR3_P3                         *((volatile uint32_t*)(0x42DE818CUL))
#define bFM4_GPIO_PDOR3_P3                        *((volatile uint32_t*)(0x42DE818CUL))
#define bFM_GPIO_PDOR3_P4                         *((volatile uint32_t*)(0x42DE8190UL))
#define bFM4_GPIO_PDOR3_P4                        *((volatile uint32_t*)(0x42DE8190UL))
#define bFM_GPIO_PDOR3_P5                         *((volatile uint32_t*)(0x42DE8194UL))
#define bFM4_GPIO_PDOR3_P5                        *((volatile uint32_t*)(0x42DE8194UL))
#define bFM_GPIO_PDOR3_P6                         *((volatile uint32_t*)(0x42DE8198UL))
#define bFM4_GPIO_PDOR3_P6                        *((volatile uint32_t*)(0x42DE8198UL))
#define bFM_GPIO_PDOR3_P7                         *((volatile uint32_t*)(0x42DE819CUL))
#define bFM4_GPIO_PDOR3_P7                        *((volatile uint32_t*)(0x42DE819CUL))
#define bFM_GPIO_PDOR3_P8                         *((volatile uint32_t*)(0x42DE81A0UL))
#define bFM4_GPIO_PDOR3_P8                        *((volatile uint32_t*)(0x42DE81A0UL))
#define bFM_GPIO_PDOR3_P9                         *((volatile uint32_t*)(0x42DE81A4UL))
#define bFM4_GPIO_PDOR3_P9                        *((volatile uint32_t*)(0x42DE81A4UL))
#define bFM_GPIO_PDOR3_PA                         *((volatile uint32_t*)(0x42DE81A8UL))
#define bFM4_GPIO_PDOR3_PA                        *((volatile uint32_t*)(0x42DE81A8UL))
#define bFM_GPIO_PDOR3_PB                         *((volatile uint32_t*)(0x42DE81ACUL))
#define bFM4_GPIO_PDOR3_PB                        *((volatile uint32_t*)(0x42DE81ACUL))
#define bFM_GPIO_PDOR3_PC                         *((volatile uint32_t*)(0x42DE81B0UL))
#define bFM4_GPIO_PDOR3_PC                        *((volatile uint32_t*)(0x42DE81B0UL))
#define bFM_GPIO_PDOR3_PD                         *((volatile uint32_t*)(0x42DE81B4UL))
#define bFM4_GPIO_PDOR3_PD                        *((volatile uint32_t*)(0x42DE81B4UL))
#define bFM_GPIO_PDOR3_PE                         *((volatile uint32_t*)(0x42DE81B8UL))
#define bFM4_GPIO_PDOR3_PE                        *((volatile uint32_t*)(0x42DE81B8UL))

#define bFM_GPIO_PDOR4_P0                         *((volatile uint32_t*)(0x42DE8200UL))
#define bFM4_GPIO_PDOR4_P0                        *((volatile uint32_t*)(0x42DE8200UL))
#define bFM_GPIO_PDOR4_P1                         *((volatile uint32_t*)(0x42DE8204UL))
#define bFM4_GPIO_PDOR4_P1                        *((volatile uint32_t*)(0x42DE8204UL))
#define bFM_GPIO_PDOR4_P2                         *((volatile uint32_t*)(0x42DE8208UL))
#define bFM4_GPIO_PDOR4_P2                        *((volatile uint32_t*)(0x42DE8208UL))
#define bFM_GPIO_PDOR4_P3                         *((volatile uint32_t*)(0x42DE820CUL))
#define bFM4_GPIO_PDOR4_P3                        *((volatile uint32_t*)(0x42DE820CUL))
#define bFM_GPIO_PDOR4_P4                         *((volatile uint32_t*)(0x42DE8210UL))
#define bFM4_GPIO_PDOR4_P4                        *((volatile uint32_t*)(0x42DE8210UL))
#define bFM_GPIO_PDOR4_P5                         *((volatile uint32_t*)(0x42DE8214UL))
#define bFM4_GPIO_PDOR4_P5                        *((volatile uint32_t*)(0x42DE8214UL))
#define bFM_GPIO_PDOR4_P6                         *((volatile uint32_t*)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P6                        *((volatile uint32_t*)(0x42DE8218UL))
#define bFM_GPIO_PDOR4_P7                         *((volatile uint32_t*)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P7                        *((volatile uint32_t*)(0x42DE821CUL))
#define bFM_GPIO_PDOR4_P8                         *((volatile uint32_t*)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P8                        *((volatile uint32_t*)(0x42DE8220UL))
#define bFM_GPIO_PDOR4_P9                         *((volatile uint32_t*)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_P9                        *((volatile uint32_t*)(0x42DE8224UL))
#define bFM_GPIO_PDOR4_PA                         *((volatile uint32_t*)(0x42DE8228UL))
#define bFM4_GPIO_PDOR4_PA                        *((volatile uint32_t*)(0x42DE8228UL))
#define bFM_GPIO_PDOR4_PB                         *((volatile uint32_t*)(0x42DE822CUL))
#define bFM4_GPIO_PDOR4_PB                        *((volatile uint32_t*)(0x42DE822CUL))
#define bFM_GPIO_PDOR4_PC                         *((volatile uint32_t*)(0x42DE8230UL))
#define bFM4_GPIO_PDOR4_PC                        *((volatile uint32_t*)(0x42DE8230UL))
#define bFM_GPIO_PDOR4_PD                         *((volatile uint32_t*)(0x42DE8234UL))
#define bFM4_GPIO_PDOR4_PD                        *((volatile uint32_t*)(0x42DE8234UL))
#define bFM_GPIO_PDOR4_PE                         *((volatile uint32_t*)(0x42DE8238UL))
#define bFM4_GPIO_PDOR4_PE                        *((volatile uint32_t*)(0x42DE8238UL))

#define bFM_GPIO_PDOR5_P0                         *((volatile uint32_t*)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P0                        *((volatile uint32_t*)(0x42DE8280UL))
#define bFM_GPIO_PDOR5_P1                         *((volatile uint32_t*)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P1                        *((volatile uint32_t*)(0x42DE8284UL))
#define bFM_GPIO_PDOR5_P2                         *((volatile uint32_t*)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P2                        *((volatile uint32_t*)(0x42DE8288UL))
#define bFM_GPIO_PDOR5_P3                         *((volatile uint32_t*)(0x42DE828CUL))
#define bFM4_GPIO_PDOR5_P3                        *((volatile uint32_t*)(0x42DE828CUL))
#define bFM_GPIO_PDOR5_P4                         *((volatile uint32_t*)(0x42DE8290UL))
#define bFM4_GPIO_PDOR5_P4                        *((volatile uint32_t*)(0x42DE8290UL))
#define bFM_GPIO_PDOR5_P5                         *((volatile uint32_t*)(0x42DE8294UL))
#define bFM4_GPIO_PDOR5_P5                        *((volatile uint32_t*)(0x42DE8294UL))
#define bFM_GPIO_PDOR5_P6                         *((volatile uint32_t*)(0x42DE8298UL))
#define bFM4_GPIO_PDOR5_P6                        *((volatile uint32_t*)(0x42DE8298UL))
#define bFM_GPIO_PDOR5_P7                         *((volatile uint32_t*)(0x42DE829CUL))
#define bFM4_GPIO_PDOR5_P7                        *((volatile uint32_t*)(0x42DE829CUL))
#define bFM_GPIO_PDOR5_P8                         *((volatile uint32_t*)(0x42DE82A0UL))
#define bFM4_GPIO_PDOR5_P8                        *((volatile uint32_t*)(0x42DE82A0UL))
#define bFM_GPIO_PDOR5_P9                         *((volatile uint32_t*)(0x42DE82A4UL))
#define bFM4_GPIO_PDOR5_P9                        *((volatile uint32_t*)(0x42DE82A4UL))
#define bFM_GPIO_PDOR5_PA                         *((volatile uint32_t*)(0x42DE82A8UL))
#define bFM4_GPIO_PDOR5_PA                        *((volatile uint32_t*)(0x42DE82A8UL))
#define bFM_GPIO_PDOR5_PB                         *((volatile uint32_t*)(0x42DE82ACUL))
#define bFM4_GPIO_PDOR5_PB                        *((volatile uint32_t*)(0x42DE82ACUL))
#define bFM_GPIO_PDOR5_PC                         *((volatile uint32_t*)(0x42DE82B0UL))
#define bFM4_GPIO_PDOR5_PC                        *((volatile uint32_t*)(0x42DE82B0UL))
#define bFM_GPIO_PDOR5_PD                         *((volatile uint32_t*)(0x42DE82B4UL))
#define bFM4_GPIO_PDOR5_PD                        *((volatile uint32_t*)(0x42DE82B4UL))
#define bFM_GPIO_PDOR5_PE                         *((volatile uint32_t*)(0x42DE82B8UL))
#define bFM4_GPIO_PDOR5_PE                        *((volatile uint32_t*)(0x42DE82B8UL))
#define bFM_GPIO_PDOR5_PF                         *((volatile uint32_t*)(0x42DE82BCUL))
#define bFM4_GPIO_PDOR5_PF                        *((volatile uint32_t*)(0x42DE82BCUL))

#define bFM_GPIO_PDOR6_P0                         *((volatile uint32_t*)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P0                        *((volatile uint32_t*)(0x42DE8300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile uint32_t*)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P1                        *((volatile uint32_t*)(0x42DE8304UL))
#define bFM_GPIO_PDOR6_P2                         *((volatile uint32_t*)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P2                        *((volatile uint32_t*)(0x42DE8308UL))
#define bFM_GPIO_PDOR6_P3                         *((volatile uint32_t*)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P3                        *((volatile uint32_t*)(0x42DE830CUL))
#define bFM_GPIO_PDOR6_P4                         *((volatile uint32_t*)(0x42DE8310UL))
#define bFM4_GPIO_PDOR6_P4                        *((volatile uint32_t*)(0x42DE8310UL))
#define bFM_GPIO_PDOR6_P5                         *((volatile uint32_t*)(0x42DE8314UL))
#define bFM4_GPIO_PDOR6_P5                        *((volatile uint32_t*)(0x42DE8314UL))
#define bFM_GPIO_PDOR6_P6                         *((volatile uint32_t*)(0x42DE8318UL))
#define bFM4_GPIO_PDOR6_P6                        *((volatile uint32_t*)(0x42DE8318UL))
#define bFM_GPIO_PDOR6_P7                         *((volatile uint32_t*)(0x42DE831CUL))
#define bFM4_GPIO_PDOR6_P7                        *((volatile uint32_t*)(0x42DE831CUL))
#define bFM_GPIO_PDOR6_P8                         *((volatile uint32_t*)(0x42DE8320UL))
#define bFM4_GPIO_PDOR6_P8                        *((volatile uint32_t*)(0x42DE8320UL))
#define bFM_GPIO_PDOR6_P9                         *((volatile uint32_t*)(0x42DE8324UL))
#define bFM4_GPIO_PDOR6_P9                        *((volatile uint32_t*)(0x42DE8324UL))
#define bFM_GPIO_PDOR6_PA                         *((volatile uint32_t*)(0x42DE8328UL))
#define bFM4_GPIO_PDOR6_PA                        *((volatile uint32_t*)(0x42DE8328UL))
#define bFM_GPIO_PDOR6_PB                         *((volatile uint32_t*)(0x42DE832CUL))
#define bFM4_GPIO_PDOR6_PB                        *((volatile uint32_t*)(0x42DE832CUL))
#define bFM_GPIO_PDOR6_PC                         *((volatile uint32_t*)(0x42DE8330UL))
#define bFM4_GPIO_PDOR6_PC                        *((volatile uint32_t*)(0x42DE8330UL))
#define bFM_GPIO_PDOR6_PD                         *((volatile uint32_t*)(0x42DE8334UL))
#define bFM4_GPIO_PDOR6_PD                        *((volatile uint32_t*)(0x42DE8334UL))
#define bFM_GPIO_PDOR6_PE                         *((volatile uint32_t*)(0x42DE8338UL))
#define bFM4_GPIO_PDOR6_PE                        *((volatile uint32_t*)(0x42DE8338UL))

