neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PDORE_P0                         *((volatile uint32_t*)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P0                        *((volatile uint32_t*)(0x42DE8700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile uint32_t*)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P2                        *((volatile uint32_t*)(0x42DE8708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile uint32_t*)(0x42DE870CUL))
#define bFM4_GPIO_PDORE_P3                        *((volatile uint32_t*)(0x42DE870CUL))

#define bFM_GPIO_PDORF_P0                         *((volatile uint32_t*)(0x42DE8780UL))
#define bFM4_GPIO_PDORF_P0                        *((volatile uint32_t*)(0x42DE8780UL))
#define bFM_GPIO_PDORF_P1                         *((volatile uint32_t*)(0x42DE8784UL))
#define bFM4_GPIO_PDORF_P1                        *((volatile uint32_t*)(0x42DE8784UL))
#define bFM_GPIO_PDORF_P2                         *((volatile uint32_t*)(0x42DE8788UL))
#define bFM4_GPIO_PDORF_P2                        *((volatile uint32_t*)(0x42DE8788UL))
#define bFM_GPIO_PDORF_P3                         *((volatile uint32_t*)(0x42DE878CUL))
#define bFM4_GPIO_PDORF_P3                        *((volatile uint32_t*)(0x42DE878CUL))
#define bFM_GPIO_PDORF_P4                         *((volatile uint32_t*)(0x42DE8790UL))
#define bFM4_GPIO_PDORF_P4                        *((volatile uint32_t*)(0x42DE8790UL))
#define bFM_GPIO_PDORF_P5                         *((volatile uint32_t*)(0x42DE8794UL))
#define bFM4_GPIO_PDORF_P5                        *((volatile uint32_t*)(0x42DE8794UL))
#define bFM_GPIO_PDORF_P6                         *((volatile uint32_t*)(0x42DE8798UL))
#define bFM4_GPIO_PDORF_P6                        *((volatile uint32_t*)(0x42DE8798UL))
#define bFM_GPIO_PDORF_P7                         *((volatile uint32_t*)(0x42DE879CUL))
#define bFM4_GPIO_PDORF_P7                        *((volatile uint32_t*)(0x42DE879CUL))
#define bFM_GPIO_PDORF_P8                         *((volatile uint32_t*)(0x42DE87A0UL))
#define bFM4_GPIO_PDORF_P8                        *((volatile uint32_t*)(0x42DE87A0UL))
#define bFM_GPIO_PDORF_P9                         *((volatile uint32_t*)(0x42DE87A4UL))
#define bFM4_GPIO_PDORF_P9                        *((volatile uint32_t*)(0x42DE87A4UL))
#define bFM_GPIO_PDORF_PA                         *((volatile uint32_t*)(0x42DE87A8UL))
#define bFM4_GPIO_PDORF_PA                        *((volatile uint32_t*)(0x42DE87A8UL))
#define bFM_GPIO_PDORF_PB                         *((volatile uint32_t*)(0x42DE87ACUL))
#define bFM4_GPIO_PDORF_PB                        *((volatile uint32_t*)(0x42DE87ACUL))
#define bFM_GPIO_PDORF_PC                         *((volatile uint32_t*)(0x42DE87B0UL))
#define bFM4_GPIO_PDORF_PC                        *((volatile uint32_t*)(0x42DE87B0UL))

#define bFM_GPIO_PDSR0_P0                         *((volatile uint32_t*)(0x42DEE800UL))
#define bFM4_GPIO_PDSR0_P0                        *((volatile uint32_t*)(0x42DEE800UL))
#define bFM_GPIO_PDSR0_P1                         *((volatile uint32_t*)(0x42DEE804UL))
#define bFM4_GPIO_PDSR0_P1                        *((volatile uint32_t*)(0x42DEE804UL))
#define bFM_GPIO_PDSR0_P2                         *((volatile uint32_t*)(0x42DEE808UL))
#define bFM4_GPIO_PDSR0_P2                        *((volatile uint32_t*)(0x42DEE808UL))
#define bFM_GPIO_PDSR0_P3                         *((volatile uint32_t*)(0x42DEE80CUL))
#define bFM4_GPIO_PDSR0_P3                        *((volatile uint32_t*)(0x42DEE80CUL))
#define bFM_GPIO_PDSR0_P4                         *((volatile uint32_t*)(0x42DEE810UL))
#define bFM4_GPIO_PDSR0_P4                        *((volatile uint32_t*)(0x42DEE810UL))
#define bFM_GPIO_PDSR0_P8                         *((volatile uint32_t*)(0x42DEE820UL))
#define bFM4_GPIO_PDSR0_P8                        *((volatile uint32_t*)(0x42DEE820UL))
#define bFM_GPIO_PDSR0_P9                         *((volatile uint32_t*)(0x42DEE824UL))
#define bFM4_GPIO_PDSR0_P9                        *((volatile uint32_t*)(0x42DEE824UL))
#define bFM_GPIO_PDSR0_PA                         *((volatile uint32_t*)(0x42DEE828UL))
#define bFM4_GPIO_PDSR0_PA                        *((volatile uint32_t*)(0x42DEE828UL))

#define bFM_GPIO_PDSR1_P0                         *((volatile uint32_t*)(0x42DEE880UL))
#define bFM4_GPIO_PDSR1_P0                        *((volatile uint32_t*)(0x42DEE880UL))
#define bFM_GPIO_PDSR1_P1                         *((volatile uint32_t*)(0x42DEE884UL))
#define bFM4_GPIO_PDSR1_P1                        *((volatile uint32_t*)(0x42DEE884UL))
#define bFM_GPIO_PDSR1_P2                         *((volatile uint32_t*)(0x42DEE888UL))
#define bFM4_GPIO_PDSR1_P2                        *((volatile uint32_t*)(0x42DEE888UL))
#define bFM_GPIO_PDSR1_P3                         *((volatile uint32_t*)(0x42DEE88CUL))
#define bFM4_GPIO_PDSR1_P3                        *((volatile uint32_t*)(0x42DEE88CUL))
#define bFM_GPIO_PDSR1_P4                         *((volatile uint32_t*)(0x42DEE890UL))
#define bFM4_GPIO_PDSR1_P4                        *((volatile uint32_t*)(0x42DEE890UL))
#define bFM_GPIO_PDSR1_P5                         *((volatile uint32_t*)(0x42DEE894UL))
#define bFM4_GPIO_PDSR1_P5                        *((volatile uint32_t*)(0x42DEE894UL))
#define bFM_GPIO_PDSR1_P6                         *((volatile uint32_t*)(0x42DEE898UL))
#define bFM4_GPIO_PDSR1_P6                        *((volatile uint32_t*)(0x42DEE898UL))
#define bFM_GPIO_PDSR1_P7                         *((volatile uint32_t*)(0x42DEE89CUL))
#define bFM4_GPIO_PDSR1_P7                        *((volatile uint32_t*)(0x42DEE89CUL))
#define bFM_GPIO_PDSR1_P8                         *((volatile uint32_t*)(0x42DEE8A0UL))
#define bFM4_GPIO_PDSR1_P8                        *((volatile uint32_t*)(0x42DEE8A0UL))
#define bFM_GPIO_PDSR1_P9                         *((volatile uint32_t*)(0x42DEE8A4UL))
#define bFM4_GPIO_PDSR1_P9                        *((volatile uint32_t*)(0x42DEE8A4UL))
#define bFM_GPIO_PDSR1_PA                         *((volatile uint32_t*)(0x42DEE8A8UL))
#define bFM4_GPIO_PDSR1_PA                        *((volatile uint32_t*)(0x42DEE8A8UL))
#define bFM_GPIO_PDSR1_PB                         *((volatile uint32_t*)(0x42DEE8ACUL))
#define bFM4_GPIO_PDSR1_PB                        *((volatile uint32_t*)(0x42DEE8ACUL))
#define bFM_GPIO_PDSR1_PC                         *((volatile uint32_t*)(0x42DEE8B0UL))
#define bFM4_GPIO_PDSR1_PC                        *((volatile uint32_t*)(0x42DEE8B0UL))
#define bFM_GPIO_PDSR1_PD                         *((volatile uint32_t*)(0x42DEE8B4UL))
#define bFM4_GPIO_PDSR1_PD                        *((volatile uint32_t*)(0x42DEE8B4UL))
#define bFM_GPIO_PDSR1_PE                         *((volatile uint32_t*)(0x42DEE8B8UL))
#define bFM4_GPIO_PDSR1_PE                        *((volatile uint32_t*)(0x42DEE8B8UL))
#define bFM_GPIO_PDSR1_PF                         *((volatile uint32_t*)(0x42DEE8BCUL))
#define bFM4_GPIO_PDSR1_PF                        *((volatile uint32_t*)(0x42DEE8BCUL))

#define bFM_GPIO_PDSR2_P0                         *((volatile uint32_t*)(0x42DEE900UL))
#define bFM4_GPIO_PDSR2_P0                        *((volatile uint32_t*)(0x42DEE900UL))
#define bFM_GPIO_PDSR2_P1                         *((volatile uint32_t*)(0x42DEE904UL))
#define bFM4_GPIO_PDSR2_P1                        *((volatile uint32_t*)(0x42DEE904UL))
#define bFM_GPIO_PDSR2_P2                         *((volatile uint32_t*)(0x42DEE908UL))
#define bFM4_GPIO_PDSR2_P2                        *((volatile uint32_t*)(0x42DEE908UL))
#define bFM_GPIO_PDSR2_P3                         *((volatile uint32_t*)(0x42DEE90CUL))
#define bFM4_GPIO_PDSR2_P3                        *((volatile uint32_t*)(0x42DEE90CUL))
#define bFM_GPIO_PDSR2_P4                         *((volatile uint32_t*)(0x42DEE910UL))
#define bFM4_GPIO_PDSR2_P4                        *((volatile uint32_t*)(0x42DEE910UL))
#define bFM_GPIO_PDSR2_P5                         *((volatile uint32_t*)(0x42DEE914UL))
#define bFM4_GPIO_PDSR2_P5                        *((volatile uint32_t*)(0x42DEE914UL))
#define bFM_GPIO_PDSR2_P6                         *((volatile uint32_t*)(0x42DEE918UL))
#define bFM4_GPIO_PDSR2_P6                        *((volatile uint32_t*)(0x42DEE918UL))
#define bFM_GPIO_PDSR2_P7                         *((volatile uint32_t*)(0x42DEE91CUL))
#define bFM4_GPIO_PDSR2_P7                        *((volatile uint32_t*)(0x42DEE91CUL))
#define bFM_GPIO_PDSR2_P8                         *((volatile uint32_t*)(0x42DEE920UL))
#define bFM4_GPIO_PDSR2_P8                        *((volatile uint32_t*)(0x42DEE920UL))
#define bFM_GPIO_PDSR2_P9                         *((volatile uint32_t*)(0x42DEE924UL))
#define bFM4_GPIO_PDSR2_P9                        *((volatile uint32_t*)(0x42DEE924UL))
#define bFM_GPIO_PDSR2_PA                         *((volatile uint32_t*)(0x42DEE928UL))
#define bFM4_GPIO_PDSR2_PA                        *((volatile uint32_t*)(0x42DEE928UL))

#define bFM_GPIO_PDSR3_P0                         *((volatile uint32_t*)(0x42DEE980UL))
#define bFM4_GPIO_PDSR3_P0                        *((volatile uint32_t*)(0x42DEE980UL))
#define bFM_GPIO_PDSR3_P1                         *((volatile uint32_t*)(0x42DEE984UL))
#define bFM4_GPIO_PDSR3_P1                        *((volatile uint32_t*)(0x42DEE984UL))
#define bFM_GPIO_PDSR3_P2                         *((volatile uint32_t*)(0x42DEE988UL))
#define bFM4_GPIO_PDSR3_P2                        *((volatile uint32_t*)(0x42DEE988UL))
#define bFM_GPIO_PDSR3_P3                         *((volatile uint32_t*)(0x42DEE98CUL))
#define bFM4_GPIO_PDSR3_P3                        *((volatile uint32_t*)(0x42DEE98CUL))
#define bFM_GPIO_PDSR3_P4                         *((volatile uint32_t*)(0x42DEE990UL))
#define bFM4_GPIO_PDSR3_P4                        *((volatile uint32_t*)(0x42DEE990UL))
#define bFM_GPIO_PDSR3_P5                         *((volatile uint32_t*)(0x42DEE994UL))
#define bFM4_GPIO_PDSR3_P5                        *((volatile uint32_t*)(0x42DEE994UL))
#define bFM_GPIO_PDSR3_P6                         *((volatile uint32_t*)(0x42DEE998UL))
#define bFM4_GPIO_PDSR3_P6                        *((volatile uint32_t*)(0x42DEE998UL))
#define bFM_GPIO_PDSR3_P7                         *((volatile uint32_t*)(0x42DEE99CUL))
#define bFM4_GPIO_PDSR3_P7                        *((volatile uint32_t*)(0x42DEE99CUL))
#define bFM_GPIO_PDSR3_P8                         *((volatile uint32_t*)(0x42DEE9A0UL))
#define bFM4_GPIO_PDSR3_P8                        *((volatile uint32_t*)(0x42DEE9A0UL))
#define bFM_GPIO_PDSR3_P9                         *((volatile uint32_t*)(0x42DEE9A4UL))
#define bFM4_GPIO_PDSR3_P9                        *((volatile uint32_t*)(0x42DEE9A4UL))
#define bFM_GPIO_PDSR3_PA                         *((volatile uint32_t*)(0x42DEE9A8UL))
#define bFM4_GPIO_PDSR3_PA                        *((volatile uint32_t*)(0x42DEE9A8UL))
#define bFM_GPIO_PDSR3_PB                         *((volatile uint32_t*)(0x42DEE9ACUL))
#define bFM4_GPIO_PDSR3_PB                        *((volatile uint32_t*)(0x42DEE9ACUL))
#define bFM_GPIO_PDSR3_PC                         *((volatile uint32_t*)(0x42DEE9B0UL))
#define bFM4_GPIO_PDSR3_PC                        *((volatile uint32_t*)(0x42DEE9B0UL))
#define bFM_GPIO_PDSR3_PD                         *((volatile uint32_t*)(0x42DEE9B4UL))
#define bFM4_GPIO_PDSR3_PD                        *((volatile uint32_t*)(0x42DEE9B4UL))
#define bFM_GPIO_PDSR3_PE                         *((volatile uint32_t*)(0x42DEE9B8UL))
#define bFM4_GPIO_PDSR3_PE                        *((volatile uint32_t*)(0x42DEE9B8UL))

#define bFM_GPIO_PDSR4_P0                         *((volatile uint32_t*)(0x42DEEA00UL))
#define bFM4_GPIO_PDSR4_P0                        *((volatile uint32_t*)(0x42DEEA00UL))
#define bFM_GPIO_PDSR4_P1                         *((volatile uint32_t*)(0x42DEEA04UL))
#define bFM4_GPIO_PDSR4_P1                        *((volatile uint32_t*)(0x42DEEA04UL))
#define bFM_GPIO_PDSR4_P2                         *((volatile uint32_t*)(0x42DEEA08UL))
#define bFM4_GPIO_PDSR4_P2                        *((volatile uint32_t*)(0x42DEEA08UL))
#define bFM_GPIO_PDSR4_P3                         *((volatile uint32_t*)(0x42DEEA0CUL))
#define bFM4_GPIO_PDSR4_P3                        *((volatile uint32_t*)(0x42DEEA0CUL))
#define bFM_GPIO_PDSR4_P4                         *((volatile uint32_t*)(0x42DEEA10UL))
#define bFM4_GPIO_PDSR4_P4                        *((volatile uint32_t*)(0x42DEEA10UL))
#define bFM_GPIO_PDSR4_P5                         *((volatile uint32_t*)(0x42DEEA14UL))
#define bFM4_GPIO_PDSR4_P5                        *((volatile uint32_t*)(0x42DEEA14UL))
#define bFM_GPIO_PDSR4_P6                         *((volatile uint32_t*)(0x42DEEA18UL))
#define bFM4_GPIO_PDSR4_P6                        *((volatile uint32_t*)(0x42DEEA18UL))
#define bFM_GPIO_PDSR4_P7                         *((volatile uint32_t*)(0x42DEEA1CUL))
#define bFM4_GPIO_PDSR4_P7                        *((volatile uint32_t*)(0x42DEEA1CUL))
#define bFM_GPIO_PDSR4_P8                         *((volatile uint32_t*)(0x42DEEA20UL))
#define bFM4_GPIO_PDSR4_P8                        *((volatile uint32_t*)(0x42DEEA20UL))
#define bFM_GPIO_PDSR4_P9                         *((volatile uint32_t*)(0x42DEEA24UL))
#define bFM4_GPIO_PDSR4_P9                        *((volatile uint32_t*)(0x42DEEA24UL))
#define bFM_GPIO_PDSR4_PA                         *((volatile uint32_t*)(0x42DEEA28UL))
#define bFM4_GPIO_PDSR4_PA                        *((volatile uint32_t*)(0x42DEEA28UL))
#define bFM_GPIO_PDSR4_PB                         *((volatile uint32_t*)(0x42DEEA2CUL))
#define bFM4_GPIO_PDSR4_PB                        *((volatile uint32_t*)(0x42DEEA2CUL))
#define bFM_GPIO_PDSR4_PC                         *((volatile uint32_t*)(0x42DEEA30UL))
#define bFM4_GPIO_PDSR4_PC                        *((volatile uint32_t*)(0x42DEEA30UL))
#define bFM_GPIO_PDSR4_PD                         *((volatile uint32_t*)(0x42DEEA34UL))
#define bFM4_GPIO_PDSR4_PD                        *((volatile uint32_t*)(0x42DEEA34UL))
#define bFM_GPIO_PDSR4_PE                         *((volatile uint32_t*)(0x42DEEA38UL))
#define bFM4_GPIO_PDSR4_PE                        *((volatile uint32_t*)(0x42DEEA38UL))

