neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PDSR5_P0                         *((volatile uint32_t*)(0x42DEEA80UL))
#define bFM4_GPIO_PDSR5_P0                        *((volatile uint32_t*)(0x42DEEA80UL))
#define bFM_GPIO_PDSR5_P1                         *((volatile uint32_t*)(0x42DEEA84UL))
#define bFM4_GPIO_PDSR5_P1                        *((volatile uint32_t*)(0x42DEEA84UL))
#define bFM_GPIO_PDSR5_P2                         *((volatile uint32_t*)(0x42DEEA88UL))
#define bFM4_GPIO_PDSR5_P2                        *((volatile uint32_t*)(0x42DEEA88UL))
#define bFM_GPIO_PDSR5_P3                         *((volatile uint32_t*)(0x42DEEA8CUL))
#define bFM4_GPIO_PDSR5_P3                        *((volatile uint32_t*)(0x42DEEA8CUL))
#define bFM_GPIO_PDSR5_P4                         *((volatile uint32_t*)(0x42DEEA90UL))
#define bFM4_GPIO_PDSR5_P4                        *((volatile uint32_t*)(0x42DEEA90UL))
#define bFM_GPIO_PDSR5_P5                         *((volatile uint32_t*)(0x42DEEA94UL))
#define bFM4_GPIO_PDSR5_P5                        *((volatile uint32_t*)(0x42DEEA94UL))
#define bFM_GPIO_PDSR5_P6                         *((volatile uint32_t*)(0x42DEEA98UL))
#define bFM4_GPIO_PDSR5_P6                        *((volatile uint32_t*)(0x42DEEA98UL))
#define bFM_GPIO_PDSR5_P7                         *((volatile uint32_t*)(0x42DEEA9CUL))
#define bFM4_GPIO_PDSR5_P7                        *((volatile uint32_t*)(0x42DEEA9CUL))
#define bFM_GPIO_PDSR5_P8                         *((volatile uint32_t*)(0x42DEEAA0UL))
#define bFM4_GPIO_PDSR5_P8                        *((volatile uint32_t*)(0x42DEEAA0UL))
#define bFM_GPIO_PDSR5_P9                         *((volatile uint32_t*)(0x42DEEAA4UL))
#define bFM4_GPIO_PDSR5_P9                        *((volatile uint32_t*)(0x42DEEAA4UL))
#define bFM_GPIO_PDSR5_PA                         *((volatile uint32_t*)(0x42DEEAA8UL))
#define bFM4_GPIO_PDSR5_PA                        *((volatile uint32_t*)(0x42DEEAA8UL))
#define bFM_GPIO_PDSR5_PB                         *((volatile uint32_t*)(0x42DEEAACUL))
#define bFM4_GPIO_PDSR5_PB                        *((volatile uint32_t*)(0x42DEEAACUL))
#define bFM_GPIO_PDSR5_PC                         *((volatile uint32_t*)(0x42DEEAB0UL))
#define bFM4_GPIO_PDSR5_PC                        *((volatile uint32_t*)(0x42DEEAB0UL))
#define bFM_GPIO_PDSR5_PD                         *((volatile uint32_t*)(0x42DEEAB4UL))
#define bFM4_GPIO_PDSR5_PD                        *((volatile uint32_t*)(0x42DEEAB4UL))
#define bFM_GPIO_PDSR5_PE                         *((volatile uint32_t*)(0x42DEEAB8UL))
#define bFM4_GPIO_PDSR5_PE                        *((volatile uint32_t*)(0x42DEEAB8UL))
#define bFM_GPIO_PDSR5_PF                         *((volatile uint32_t*)(0x42DEEABCUL))
#define bFM4_GPIO_PDSR5_PF                        *((volatile uint32_t*)(0x42DEEABCUL))

#define bFM_GPIO_PDSR6_P0                         *((volatile uint32_t*)(0x42DEEB00UL))
#define bFM4_GPIO_PDSR6_P0                        *((volatile uint32_t*)(0x42DEEB00UL))
#define bFM_GPIO_PDSR6_P1                         *((volatile uint32_t*)(0x42DEEB04UL))
#define bFM4_GPIO_PDSR6_P1                        *((volatile uint32_t*)(0x42DEEB04UL))
#define bFM_GPIO_PDSR6_P2                         *((volatile uint32_t*)(0x42DEEB08UL))
#define bFM4_GPIO_PDSR6_P2                        *((volatile uint32_t*)(0x42DEEB08UL))
#define bFM_GPIO_PDSR6_P3                         *((volatile uint32_t*)(0x42DEEB0CUL))
#define bFM4_GPIO_PDSR6_P3                        *((volatile uint32_t*)(0x42DEEB0CUL))
#define bFM_GPIO_PDSR6_P4                         *((volatile uint32_t*)(0x42DEEB10UL))
#define bFM4_GPIO_PDSR6_P4                        *((volatile uint32_t*)(0x42DEEB10UL))
#define bFM_GPIO_PDSR6_P5                         *((volatile uint32_t*)(0x42DEEB14UL))
#define bFM4_GPIO_PDSR6_P5                        *((volatile uint32_t*)(0x42DEEB14UL))
#define bFM_GPIO_PDSR6_P6                         *((volatile uint32_t*)(0x42DEEB18UL))
#define bFM4_GPIO_PDSR6_P6                        *((volatile uint32_t*)(0x42DEEB18UL))
#define bFM_GPIO_PDSR6_P7                         *((volatile uint32_t*)(0x42DEEB1CUL))
#define bFM4_GPIO_PDSR6_P7                        *((volatile uint32_t*)(0x42DEEB1CUL))
#define bFM_GPIO_PDSR6_P8                         *((volatile uint32_t*)(0x42DEEB20UL))
#define bFM4_GPIO_PDSR6_P8                        *((volatile uint32_t*)(0x42DEEB20UL))
#define bFM_GPIO_PDSR6_P9                         *((volatile uint32_t*)(0x42DEEB24UL))
#define bFM4_GPIO_PDSR6_P9                        *((volatile uint32_t*)(0x42DEEB24UL))
#define bFM_GPIO_PDSR6_PA                         *((volatile uint32_t*)(0x42DEEB28UL))
#define bFM4_GPIO_PDSR6_PA                        *((volatile uint32_t*)(0x42DEEB28UL))
#define bFM_GPIO_PDSR6_PB                         *((volatile uint32_t*)(0x42DEEB2CUL))
#define bFM4_GPIO_PDSR6_PB                        *((volatile uint32_t*)(0x42DEEB2CUL))
#define bFM_GPIO_PDSR6_PC                         *((volatile uint32_t*)(0x42DEEB30UL))
#define bFM4_GPIO_PDSR6_PC                        *((volatile uint32_t*)(0x42DEEB30UL))
#define bFM_GPIO_PDSR6_PD                         *((volatile uint32_t*)(0x42DEEB34UL))
#define bFM4_GPIO_PDSR6_PD                        *((volatile uint32_t*)(0x42DEEB34UL))
#define bFM_GPIO_PDSR6_PE                         *((volatile uint32_t*)(0x42DEEB38UL))
#define bFM4_GPIO_PDSR6_PE                        *((volatile uint32_t*)(0x42DEEB38UL))

#define bFM_GPIO_PDSR7_P0                         *((volatile uint32_t*)(0x42DEEB80UL))
#define bFM4_GPIO_PDSR7_P0                        *((volatile uint32_t*)(0x42DEEB80UL))
#define bFM_GPIO_PDSR7_P1                         *((volatile uint32_t*)(0x42DEEB84UL))
#define bFM4_GPIO_PDSR7_P1                        *((volatile uint32_t*)(0x42DEEB84UL))
#define bFM_GPIO_PDSR7_P2                         *((volatile uint32_t*)(0x42DEEB88UL))
#define bFM4_GPIO_PDSR7_P2                        *((volatile uint32_t*)(0x42DEEB88UL))
#define bFM_GPIO_PDSR7_P3                         *((volatile uint32_t*)(0x42DEEB8CUL))
#define bFM4_GPIO_PDSR7_P3                        *((volatile uint32_t*)(0x42DEEB8CUL))
#define bFM_GPIO_PDSR7_P4                         *((volatile uint32_t*)(0x42DEEB90UL))
#define bFM4_GPIO_PDSR7_P4                        *((volatile uint32_t*)(0x42DEEB90UL))
#define bFM_GPIO_PDSR7_P5                         *((volatile uint32_t*)(0x42DEEB94UL))
#define bFM4_GPIO_PDSR7_P5                        *((volatile uint32_t*)(0x42DEEB94UL))
#define bFM_GPIO_PDSR7_P6                         *((volatile uint32_t*)(0x42DEEB98UL))
#define bFM4_GPIO_PDSR7_P6                        *((volatile uint32_t*)(0x42DEEB98UL))
#define bFM_GPIO_PDSR7_P7                         *((volatile uint32_t*)(0x42DEEB9CUL))
#define bFM4_GPIO_PDSR7_P7                        *((volatile uint32_t*)(0x42DEEB9CUL))
#define bFM_GPIO_PDSR7_P8                         *((volatile uint32_t*)(0x42DEEBA0UL))
#define bFM4_GPIO_PDSR7_P8                        *((volatile uint32_t*)(0x42DEEBA0UL))
#define bFM_GPIO_PDSR7_P9                         *((volatile uint32_t*)(0x42DEEBA4UL))
#define bFM4_GPIO_PDSR7_P9                        *((volatile uint32_t*)(0x42DEEBA4UL))
#define bFM_GPIO_PDSR7_PA                         *((volatile uint32_t*)(0x42DEEBA8UL))
#define bFM4_GPIO_PDSR7_PA                        *((volatile uint32_t*)(0x42DEEBA8UL))
#define bFM_GPIO_PDSR7_PB                         *((volatile uint32_t*)(0x42DEEBACUL))
#define bFM4_GPIO_PDSR7_PB                        *((volatile uint32_t*)(0x42DEEBACUL))
#define bFM_GPIO_PDSR7_PC                         *((volatile uint32_t*)(0x42DEEBB0UL))
#define bFM4_GPIO_PDSR7_PC                        *((volatile uint32_t*)(0x42DEEBB0UL))
#define bFM_GPIO_PDSR7_PD                         *((volatile uint32_t*)(0x42DEEBB4UL))
#define bFM4_GPIO_PDSR7_PD                        *((volatile uint32_t*)(0x42DEEBB4UL))
#define bFM_GPIO_PDSR7_PE                         *((volatile uint32_t*)(0x42DEEBB8UL))
#define bFM4_GPIO_PDSR7_PE                        *((volatile uint32_t*)(0x42DEEBB8UL))

#define bFM_GPIO_PDSR8_P0                         *((volatile uint32_t*)(0x42DEEC00UL))
#define bFM4_GPIO_PDSR8_P0                        *((volatile uint32_t*)(0x42DEEC00UL))
#define bFM_GPIO_PDSR8_P1                         *((volatile uint32_t*)(0x42DEEC04UL))
#define bFM4_GPIO_PDSR8_P1                        *((volatile uint32_t*)(0x42DEEC04UL))
#define bFM_GPIO_PDSR8_P2                         *((volatile uint32_t*)(0x42DEEC08UL))
#define bFM4_GPIO_PDSR8_P2                        *((volatile uint32_t*)(0x42DEEC08UL))
#define bFM_GPIO_PDSR8_P3                         *((volatile uint32_t*)(0x42DEEC0CUL))
#define bFM4_GPIO_PDSR8_P3                        *((volatile uint32_t*)(0x42DEEC0CUL))

#define bFM_GPIO_PDSR9_P0                         *((volatile uint32_t*)(0x42DEEC80UL))
#define bFM4_GPIO_PDSR9_P0                        *((volatile uint32_t*)(0x42DEEC80UL))
#define bFM_GPIO_PDSR9_P1                         *((volatile uint32_t*)(0x42DEEC84UL))
#define bFM4_GPIO_PDSR9_P1                        *((volatile uint32_t*)(0x42DEEC84UL))
#define bFM_GPIO_PDSR9_P2                         *((volatile uint32_t*)(0x42DEEC88UL))
#define bFM4_GPIO_PDSR9_P2                        *((volatile uint32_t*)(0x42DEEC88UL))
#define bFM_GPIO_PDSR9_P3                         *((volatile uint32_t*)(0x42DEEC8CUL))
#define bFM4_GPIO_PDSR9_P3                        *((volatile uint32_t*)(0x42DEEC8CUL))
#define bFM_GPIO_PDSR9_P4                         *((volatile uint32_t*)(0x42DEEC90UL))
#define bFM4_GPIO_PDSR9_P4                        *((volatile uint32_t*)(0x42DEEC90UL))
#define bFM_GPIO_PDSR9_P5                         *((volatile uint32_t*)(0x42DEEC94UL))
#define bFM4_GPIO_PDSR9_P5                        *((volatile uint32_t*)(0x42DEEC94UL))
#define bFM_GPIO_PDSR9_P6                         *((volatile uint32_t*)(0x42DEEC98UL))
#define bFM4_GPIO_PDSR9_P6                        *((volatile uint32_t*)(0x42DEEC98UL))
#define bFM_GPIO_PDSR9_P7                         *((volatile uint32_t*)(0x42DEEC9CUL))
#define bFM4_GPIO_PDSR9_P7                        *((volatile uint32_t*)(0x42DEEC9CUL))

