neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PDSRA_P0                         *((volatile uint32_t*)(0x42DEED00UL))
#define bFM4_GPIO_PDSRA_P0                        *((volatile uint32_t*)(0x42DEED00UL))
#define bFM_GPIO_PDSRA_P1                         *((volatile uint32_t*)(0x42DEED04UL))
#define bFM4_GPIO_PDSRA_P1                        *((volatile uint32_t*)(0x42DEED04UL))
#define bFM_GPIO_PDSRA_P2                         *((volatile uint32_t*)(0x42DEED08UL))
#define bFM4_GPIO_PDSRA_P2                        *((volatile uint32_t*)(0x42DEED08UL))
#define bFM_GPIO_PDSRA_P3                         *((volatile uint32_t*)(0x42DEED0CUL))
#define bFM4_GPIO_PDSRA_P3                        *((volatile uint32_t*)(0x42DEED0CUL))
#define bFM_GPIO_PDSRA_P4                         *((volatile uint32_t*)(0x42DEED10UL))
#define bFM4_GPIO_PDSRA_P4                        *((volatile uint32_t*)(0x42DEED10UL))
#define bFM_GPIO_PDSRA_P5                         *((volatile uint32_t*)(0x42DEED14UL))
#define bFM4_GPIO_PDSRA_P5                        *((volatile uint32_t*)(0x42DEED14UL))
#define bFM_GPIO_PDSRA_P6                         *((volatile uint32_t*)(0x42DEED18UL))
#define bFM4_GPIO_PDSRA_P6                        *((volatile uint32_t*)(0x42DEED18UL))
#define bFM_GPIO_PDSRA_P7                         *((volatile uint32_t*)(0x42DEED1CUL))
#define bFM4_GPIO_PDSRA_P7                        *((volatile uint32_t*)(0x42DEED1CUL))
#define bFM_GPIO_PDSRA_P8                         *((volatile uint32_t*)(0x42DEED20UL))
#define bFM4_GPIO_PDSRA_P8                        *((volatile uint32_t*)(0x42DEED20UL))
#define bFM_GPIO_PDSRA_P9                         *((volatile uint32_t*)(0x42DEED24UL))
#define bFM4_GPIO_PDSRA_P9                        *((volatile uint32_t*)(0x42DEED24UL))
#define bFM_GPIO_PDSRA_PA                         *((volatile uint32_t*)(0x42DEED28UL))
#define bFM4_GPIO_PDSRA_PA                        *((volatile uint32_t*)(0x42DEED28UL))
#define bFM_GPIO_PDSRA_PB                         *((volatile uint32_t*)(0x42DEED2CUL))
#define bFM4_GPIO_PDSRA_PB                        *((volatile uint32_t*)(0x42DEED2CUL))
#define bFM_GPIO_PDSRA_PC                         *((volatile uint32_t*)(0x42DEED30UL))
#define bFM4_GPIO_PDSRA_PC                        *((volatile uint32_t*)(0x42DEED30UL))
#define bFM_GPIO_PDSRA_PD                         *((volatile uint32_t*)(0x42DEED34UL))
#define bFM4_GPIO_PDSRA_PD                        *((volatile uint32_t*)(0x42DEED34UL))
#define bFM_GPIO_PDSRA_PE                         *((volatile uint32_t*)(0x42DEED38UL))
#define bFM4_GPIO_PDSRA_PE                        *((volatile uint32_t*)(0x42DEED38UL))
#define bFM_GPIO_PDSRA_PF                         *((volatile uint32_t*)(0x42DEED3CUL))
#define bFM4_GPIO_PDSRA_PF                        *((volatile uint32_t*)(0x42DEED3CUL))

#define bFM_GPIO_PDSRB_P0                         *((volatile uint32_t*)(0x42DEED80UL))
#define bFM4_GPIO_PDSRB_P0                        *((volatile uint32_t*)(0x42DEED80UL))
#define bFM_GPIO_PDSRB_P1                         *((volatile uint32_t*)(0x42DEED84UL))
#define bFM4_GPIO_PDSRB_P1                        *((volatile uint32_t*)(0x42DEED84UL))
#define bFM_GPIO_PDSRB_P2                         *((volatile uint32_t*)(0x42DEED88UL))
#define bFM4_GPIO_PDSRB_P2                        *((volatile uint32_t*)(0x42DEED88UL))
#define bFM_GPIO_PDSRB_P3                         *((volatile uint32_t*)(0x42DEED8CUL))
#define bFM4_GPIO_PDSRB_P3                        *((volatile uint32_t*)(0x42DEED8CUL))
#define bFM_GPIO_PDSRB_P4                         *((volatile uint32_t*)(0x42DEED90UL))
#define bFM4_GPIO_PDSRB_P4                        *((volatile uint32_t*)(0x42DEED90UL))
#define bFM_GPIO_PDSRB_P5                         *((volatile uint32_t*)(0x42DEED94UL))
#define bFM4_GPIO_PDSRB_P5                        *((volatile uint32_t*)(0x42DEED94UL))
#define bFM_GPIO_PDSRB_P6                         *((volatile uint32_t*)(0x42DEED98UL))
#define bFM4_GPIO_PDSRB_P6                        *((volatile uint32_t*)(0x42DEED98UL))
#define bFM_GPIO_PDSRB_P7                         *((volatile uint32_t*)(0x42DEED9CUL))
#define bFM4_GPIO_PDSRB_P7                        *((volatile uint32_t*)(0x42DEED9CUL))
#define bFM_GPIO_PDSRB_P8                         *((volatile uint32_t*)(0x42DEEDA0UL))
#define bFM4_GPIO_PDSRB_P8                        *((volatile uint32_t*)(0x42DEEDA0UL))
#define bFM_GPIO_PDSRB_P9                         *((volatile uint32_t*)(0x42DEEDA4UL))
#define bFM4_GPIO_PDSRB_P9                        *((volatile uint32_t*)(0x42DEEDA4UL))
#define bFM_GPIO_PDSRB_PA                         *((volatile uint32_t*)(0x42DEEDA8UL))
#define bFM4_GPIO_PDSRB_PA                        *((volatile uint32_t*)(0x42DEEDA8UL))
#define bFM_GPIO_PDSRB_PB                         *((volatile uint32_t*)(0x42DEEDACUL))
#define bFM4_GPIO_PDSRB_PB                        *((volatile uint32_t*)(0x42DEEDACUL))
#define bFM_GPIO_PDSRB_PC                         *((volatile uint32_t*)(0x42DEEDB0UL))
#define bFM4_GPIO_PDSRB_PC                        *((volatile uint32_t*)(0x42DEEDB0UL))
#define bFM_GPIO_PDSRB_PD                         *((volatile uint32_t*)(0x42DEEDB4UL))
#define bFM4_GPIO_PDSRB_PD                        *((volatile uint32_t*)(0x42DEEDB4UL))
#define bFM_GPIO_PDSRB_PE                         *((volatile uint32_t*)(0x42DEEDB8UL))
#define bFM4_GPIO_PDSRB_PE                        *((volatile uint32_t*)(0x42DEEDB8UL))
#define bFM_GPIO_PDSRB_PF                         *((volatile uint32_t*)(0x42DEEDBCUL))
#define bFM4_GPIO_PDSRB_PF                        *((volatile uint32_t*)(0x42DEEDBCUL))

#define bFM_GPIO_PDSRC_P0                         *((volatile uint32_t*)(0x42DEEE00UL))
#define bFM4_GPIO_PDSRC_P0                        *((volatile uint32_t*)(0x42DEEE00UL))
#define bFM_GPIO_PDSRC_P1                         *((volatile uint32_t*)(0x42DEEE04UL))
#define bFM4_GPIO_PDSRC_P1                        *((volatile uint32_t*)(0x42DEEE04UL))
#define bFM_GPIO_PDSRC_P2                         *((volatile uint32_t*)(0x42DEEE08UL))
#define bFM4_GPIO_PDSRC_P2                        *((volatile uint32_t*)(0x42DEEE08UL))
#define bFM_GPIO_PDSRC_P3                         *((volatile uint32_t*)(0x42DEEE0CUL))
#define bFM4_GPIO_PDSRC_P3                        *((volatile uint32_t*)(0x42DEEE0CUL))
#define bFM_GPIO_PDSRC_P4                         *((volatile uint32_t*)(0x42DEEE10UL))
#define bFM4_GPIO_PDSRC_P4                        *((volatile uint32_t*)(0x42DEEE10UL))
#define bFM_GPIO_PDSRC_P5                         *((volatile uint32_t*)(0x42DEEE14UL))
#define bFM4_GPIO_PDSRC_P5                        *((volatile uint32_t*)(0x42DEEE14UL))
#define bFM_GPIO_PDSRC_P6                         *((volatile uint32_t*)(0x42DEEE18UL))
#define bFM4_GPIO_PDSRC_P6                        *((volatile uint32_t*)(0x42DEEE18UL))
#define bFM_GPIO_PDSRC_P7                         *((volatile uint32_t*)(0x42DEEE1CUL))
#define bFM4_GPIO_PDSRC_P7                        *((volatile uint32_t*)(0x42DEEE1CUL))
#define bFM_GPIO_PDSRC_P8                         *((volatile uint32_t*)(0x42DEEE20UL))
#define bFM4_GPIO_PDSRC_P8                        *((volatile uint32_t*)(0x42DEEE20UL))
#define bFM_GPIO_PDSRC_P9                         *((volatile uint32_t*)(0x42DEEE24UL))
#define bFM4_GPIO_PDSRC_P9                        *((volatile uint32_t*)(0x42DEEE24UL))
#define bFM_GPIO_PDSRC_PA                         *((volatile uint32_t*)(0x42DEEE28UL))
#define bFM4_GPIO_PDSRC_PA                        *((volatile uint32_t*)(0x42DEEE28UL))
#define bFM_GPIO_PDSRC_PB                         *((volatile uint32_t*)(0x42DEEE2CUL))
#define bFM4_GPIO_PDSRC_PB                        *((volatile uint32_t*)(0x42DEEE2CUL))
#define bFM_GPIO_PDSRC_PC                         *((volatile uint32_t*)(0x42DEEE30UL))
#define bFM4_GPIO_PDSRC_PC                        *((volatile uint32_t*)(0x42DEEE30UL))
#define bFM_GPIO_PDSRC_PD                         *((volatile uint32_t*)(0x42DEEE34UL))
#define bFM4_GPIO_PDSRC_PD                        *((volatile uint32_t*)(0x42DEEE34UL))
#define bFM_GPIO_PDSRC_PE                         *((volatile uint32_t*)(0x42DEEE38UL))
#define bFM4_GPIO_PDSRC_PE                        *((volatile uint32_t*)(0x42DEEE38UL))
#define bFM_GPIO_PDSRC_PF                         *((volatile uint32_t*)(0x42DEEE3CUL))
#define bFM4_GPIO_PDSRC_PF                        *((volatile uint32_t*)(0x42DEEE3CUL))

#define bFM_GPIO_PDSRD_P0                         *((volatile uint32_t*)(0x42DEEE80UL))
#define bFM4_GPIO_PDSRD_P0                        *((volatile uint32_t*)(0x42DEEE80UL))
#define bFM_GPIO_PDSRD_P1                         *((volatile uint32_t*)(0x42DEEE84UL))
#define bFM4_GPIO_PDSRD_P1                        *((volatile uint32_t*)(0x42DEEE84UL))
#define bFM_GPIO_PDSRD_P2                         *((volatile uint32_t*)(0x42DEEE88UL))
#define bFM4_GPIO_PDSRD_P2                        *((volatile uint32_t*)(0x42DEEE88UL))

