neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PFR2_P0                          *((volatile uint32_t*)(0x42DE0100UL))
#define bFM4_GPIO_PFR2_P0                         *((volatile uint32_t*)(0x42DE0100UL))
#define bFM_GPIO_PFR2_P1                          *((volatile uint32_t*)(0x42DE0104UL))
#define bFM4_GPIO_PFR2_P1                         *((volatile uint32_t*)(0x42DE0104UL))
#define bFM_GPIO_PFR2_P2                          *((volatile uint32_t*)(0x42DE0108UL))
#define bFM4_GPIO_PFR2_P2                         *((volatile uint32_t*)(0x42DE0108UL))
#define bFM_GPIO_PFR2_P3                          *((volatile uint32_t*)(0x42DE010CUL))
#define bFM4_GPIO_PFR2_P3                         *((volatile uint32_t*)(0x42DE010CUL))
#define bFM_GPIO_PFR2_P4                          *((volatile uint32_t*)(0x42DE0110UL))
#define bFM4_GPIO_PFR2_P4                         *((volatile uint32_t*)(0x42DE0110UL))
#define bFM_GPIO_PFR2_P5                          *((volatile uint32_t*)(0x42DE0114UL))
#define bFM4_GPIO_PFR2_P5                         *((volatile uint32_t*)(0x42DE0114UL))
#define bFM_GPIO_PFR2_P6                          *((volatile uint32_t*)(0x42DE0118UL))
#define bFM4_GPIO_PFR2_P6                         *((volatile uint32_t*)(0x42DE0118UL))
#define bFM_GPIO_PFR2_P7                          *((volatile uint32_t*)(0x42DE011CUL))
#define bFM4_GPIO_PFR2_P7                         *((volatile uint32_t*)(0x42DE011CUL))
#define bFM_GPIO_PFR2_P8                          *((volatile uint32_t*)(0x42DE0120UL))
#define bFM4_GPIO_PFR2_P8                         *((volatile uint32_t*)(0x42DE0120UL))
#define bFM_GPIO_PFR2_P9                          *((volatile uint32_t*)(0x42DE0124UL))
#define bFM4_GPIO_PFR2_P9                         *((volatile uint32_t*)(0x42DE0124UL))
#define bFM_GPIO_PFR2_PA                          *((volatile uint32_t*)(0x42DE0128UL))
#define bFM4_GPIO_PFR2_PA                         *((volatile uint32_t*)(0x42DE0128UL))

#define bFM_GPIO_PFR3_P0                          *((volatile uint32_t*)(0x42DE0180UL))
#define bFM4_GPIO_PFR3_P0                         *((volatile uint32_t*)(0x42DE0180UL))
#define bFM_GPIO_PFR3_P1                          *((volatile uint32_t*)(0x42DE0184UL))
#define bFM4_GPIO_PFR3_P1                         *((volatile uint32_t*)(0x42DE0184UL))
#define bFM_GPIO_PFR3_P2                          *((volatile uint32_t*)(0x42DE0188UL))
#define bFM4_GPIO_PFR3_P2                         *((volatile uint32_t*)(0x42DE0188UL))
#define bFM_GPIO_PFR3_P3                          *((volatile uint32_t*)(0x42DE018CUL))
#define bFM4_GPIO_PFR3_P3                         *((volatile uint32_t*)(0x42DE018CUL))
#define bFM_GPIO_PFR3_P4                          *((volatile uint32_t*)(0x42DE0190UL))
#define bFM4_GPIO_PFR3_P4                         *((volatile uint32_t*)(0x42DE0190UL))
#define bFM_GPIO_PFR3_P5                          *((volatile uint32_t*)(0x42DE0194UL))
#define bFM4_GPIO_PFR3_P5                         *((volatile uint32_t*)(0x42DE0194UL))
#define bFM_GPIO_PFR3_P6                          *((volatile uint32_t*)(0x42DE0198UL))
#define bFM4_GPIO_PFR3_P6                         *((volatile uint32_t*)(0x42DE0198UL))
#define bFM_GPIO_PFR3_P7                          *((volatile uint32_t*)(0x42DE019CUL))
#define bFM4_GPIO_PFR3_P7                         *((volatile uint32_t*)(0x42DE019CUL))
#define bFM_GPIO_PFR3_P8                          *((volatile uint32_t*)(0x42DE01A0UL))
#define bFM4_GPIO_PFR3_P8                         *((volatile uint32_t*)(0x42DE01A0UL))
#define bFM_GPIO_PFR3_P9                          *((volatile uint32_t*)(0x42DE01A4UL))
#define bFM4_GPIO_PFR3_P9                         *((volatile uint32_t*)(0x42DE01A4UL))
#define bFM_GPIO_PFR3_PA                          *((volatile uint32_t*)(0x42DE01A8UL))
#define bFM4_GPIO_PFR3_PA                         *((volatile uint32_t*)(0x42DE01A8UL))
#define bFM_GPIO_PFR3_PB                          *((volatile uint32_t*)(0x42DE01ACUL))
#define bFM4_GPIO_PFR3_PB                         *((volatile uint32_t*)(0x42DE01ACUL))
#define bFM_GPIO_PFR3_PC                          *((volatile uint32_t*)(0x42DE01B0UL))
#define bFM4_GPIO_PFR3_PC                         *((volatile uint32_t*)(0x42DE01B0UL))
#define bFM_GPIO_PFR3_PD                          *((volatile uint32_t*)(0x42DE01B4UL))
#define bFM4_GPIO_PFR3_PD                         *((volatile uint32_t*)(0x42DE01B4UL))
#define bFM_GPIO_PFR3_PE                          *((volatile uint32_t*)(0x42DE01B8UL))
#define bFM4_GPIO_PFR3_PE                         *((volatile uint32_t*)(0x42DE01B8UL))

#define bFM_GPIO_PFR4_P0                          *((volatile uint32_t*)(0x42DE0200UL))
#define bFM4_GPIO_PFR4_P0                         *((volatile uint32_t*)(0x42DE0200UL))
#define bFM_GPIO_PFR4_P1                          *((volatile uint32_t*)(0x42DE0204UL))
#define bFM4_GPIO_PFR4_P1                         *((volatile uint32_t*)(0x42DE0204UL))
#define bFM_GPIO_PFR4_P2                          *((volatile uint32_t*)(0x42DE0208UL))
#define bFM4_GPIO_PFR4_P2                         *((volatile uint32_t*)(0x42DE0208UL))
#define bFM_GPIO_PFR4_P3                          *((volatile uint32_t*)(0x42DE020CUL))
#define bFM4_GPIO_PFR4_P3                         *((volatile uint32_t*)(0x42DE020CUL))
#define bFM_GPIO_PFR4_P4                          *((volatile uint32_t*)(0x42DE0210UL))
#define bFM4_GPIO_PFR4_P4                         *((volatile uint32_t*)(0x42DE0210UL))
#define bFM_GPIO_PFR4_P5                          *((volatile uint32_t*)(0x42DE0214UL))
#define bFM4_GPIO_PFR4_P5                         *((volatile uint32_t*)(0x42DE0214UL))
#define bFM_GPIO_PFR4_P6                          *((volatile uint32_t*)(0x42DE0218UL))
#define bFM4_GPIO_PFR4_P6                         *((volatile uint32_t*)(0x42DE0218UL))
#define bFM_GPIO_PFR4_P7                          *((volatile uint32_t*)(0x42DE021CUL))
#define bFM4_GPIO_PFR4_P7                         *((volatile uint32_t*)(0x42DE021CUL))
#define bFM_GPIO_PFR4_P8                          *((volatile uint32_t*)(0x42DE0220UL))
#define bFM4_GPIO_PFR4_P8                         *((volatile uint32_t*)(0x42DE0220UL))
#define bFM_GPIO_PFR4_P9                          *((volatile uint32_t*)(0x42DE0224UL))
#define bFM4_GPIO_PFR4_P9                         *((volatile uint32_t*)(0x42DE0224UL))
#define bFM_GPIO_PFR4_PA                          *((volatile uint32_t*)(0x42DE0228UL))
#define bFM4_GPIO_PFR4_PA                         *((volatile uint32_t*)(0x42DE0228UL))
#define bFM_GPIO_PFR4_PB                          *((volatile uint32_t*)(0x42DE022CUL))
#define bFM4_GPIO_PFR4_PB                         *((volatile uint32_t*)(0x42DE022CUL))
#define bFM_GPIO_PFR4_PC                          *((volatile uint32_t*)(0x42DE0230UL))
#define bFM4_GPIO_PFR4_PC                         *((volatile uint32_t*)(0x42DE0230UL))
#define bFM_GPIO_PFR4_PD                          *((volatile uint32_t*)(0x42DE0234UL))
#define bFM4_GPIO_PFR4_PD                         *((volatile uint32_t*)(0x42DE0234UL))
#define bFM_GPIO_PFR4_PE                          *((volatile uint32_t*)(0x42DE0238UL))
#define bFM4_GPIO_PFR4_PE                         *((volatile uint32_t*)(0x42DE0238UL))

#define bFM_GPIO_PFR5_P0                          *((volatile uint32_t*)(0x42DE0280UL))
#define bFM4_GPIO_PFR5_P0                         *((volatile uint32_t*)(0x42DE0280UL))
#define bFM_GPIO_PFR5_P1                          *((volatile uint32_t*)(0x42DE0284UL))
#define bFM4_GPIO_PFR5_P1                         *((volatile uint32_t*)(0x42DE0284UL))
#define bFM_GPIO_PFR5_P2                          *((volatile uint32_t*)(0x42DE0288UL))
#define bFM4_GPIO_PFR5_P2                         *((volatile uint32_t*)(0x42DE0288UL))
#define bFM_GPIO_PFR5_P3                          *((volatile uint32_t*)(0x42DE028CUL))
#define bFM4_GPIO_PFR5_P3                         *((volatile uint32_t*)(0x42DE028CUL))
#define bFM_GPIO_PFR5_P4                          *((volatile uint32_t*)(0x42DE0290UL))
#define bFM4_GPIO_PFR5_P4                         *((volatile uint32_t*)(0x42DE0290UL))
#define bFM_GPIO_PFR5_P5                          *((volatile uint32_t*)(0x42DE0294UL))
#define bFM4_GPIO_PFR5_P5                         *((volatile uint32_t*)(0x42DE0294UL))
#define bFM_GPIO_PFR5_P6                          *((volatile uint32_t*)(0x42DE0298UL))
#define bFM4_GPIO_PFR5_P6                         *((volatile uint32_t*)(0x42DE0298UL))
#define bFM_GPIO_PFR5_P7                          *((volatile uint32_t*)(0x42DE029CUL))
#define bFM4_GPIO_PFR5_P7                         *((volatile uint32_t*)(0x42DE029CUL))
#define bFM_GPIO_PFR5_P8                          *((volatile uint32_t*)(0x42DE02A0UL))
#define bFM4_GPIO_PFR5_P8                         *((volatile uint32_t*)(0x42DE02A0UL))
#define bFM_GPIO_PFR5_P9                          *((volatile uint32_t*)(0x42DE02A4UL))
#define bFM4_GPIO_PFR5_P9                         *((volatile uint32_t*)(0x42DE02A4UL))
#define bFM_GPIO_PFR5_PA                          *((volatile uint32_t*)(0x42DE02A8UL))
#define bFM4_GPIO_PFR5_PA                         *((volatile uint32_t*)(0x42DE02A8UL))
#define bFM_GPIO_PFR5_PB                          *((volatile uint32_t*)(0x42DE02ACUL))
#define bFM4_GPIO_PFR5_PB                         *((volatile uint32_t*)(0x42DE02ACUL))
#define bFM_GPIO_PFR5_PC                          *((volatile uint32_t*)(0x42DE02B0UL))
#define bFM4_GPIO_PFR5_PC                         *((volatile uint32_t*)(0x42DE02B0UL))
#define bFM_GPIO_PFR5_PD                          *((volatile uint32_t*)(0x42DE02B4UL))
#define bFM4_GPIO_PFR5_PD                         *((volatile uint32_t*)(0x42DE02B4UL))
#define bFM_GPIO_PFR5_PE                          *((volatile uint32_t*)(0x42DE02B8UL))
#define bFM4_GPIO_PFR5_PE                         *((volatile uint32_t*)(0x42DE02B8UL))
#define bFM_GPIO_PFR5_PF                          *((volatile uint32_t*)(0x42DE02BCUL))
#define bFM4_GPIO_PFR5_PF                         *((volatile uint32_t*)(0x42DE02BCUL))

#define bFM_GPIO_PFR6_P0                          *((volatile uint32_t*)(0x42DE0300UL))
#define bFM4_GPIO_PFR6_P0                         *((volatile uint32_t*)(0x42DE0300UL))
#define bFM_GPIO_PFR6_P1                          *((volatile uint32_t*)(0x42DE0304UL))
#define bFM4_GPIO_PFR6_P1                         *((volatile uint32_t*)(0x42DE0304UL))
#define bFM_GPIO_PFR6_P2                          *((volatile uint32_t*)(0x42DE0308UL))
#define bFM4_GPIO_PFR6_P2                         *((volatile uint32_t*)(0x42DE0308UL))
#define bFM_GPIO_PFR6_P3                          *((volatile uint32_t*)(0x42DE030CUL))
#define bFM4_GPIO_PFR6_P3                         *((volatile uint32_t*)(0x42DE030CUL))
#define bFM_GPIO_PFR6_P4                          *((volatile uint32_t*)(0x42DE0310UL))
#define bFM4_GPIO_PFR6_P4                         *((volatile uint32_t*)(0x42DE0310UL))
#define bFM_GPIO_PFR6_P5                          *((volatile uint32_t*)(0x42DE0314UL))
#define bFM4_GPIO_PFR6_P5                         *((volatile uint32_t*)(0x42DE0314UL))
#define bFM_GPIO_PFR6_P6                          *((volatile uint32_t*)(0x42DE0318UL))
#define bFM4_GPIO_PFR6_P6                         *((volatile uint32_t*)(0x42DE0318UL))
#define bFM_GPIO_PFR6_P7                          *((volatile uint32_t*)(0x42DE031CUL))
#define bFM4_GPIO_PFR6_P7                         *((volatile uint32_t*)(0x42DE031CUL))
#define bFM_GPIO_PFR6_P8                          *((volatile uint32_t*)(0x42DE0320UL))
#define bFM4_GPIO_PFR6_P8                         *((volatile uint32_t*)(0x42DE0320UL))
#define bFM_GPIO_PFR6_P9                          *((volatile uint32_t*)(0x42DE0324UL))
#define bFM4_GPIO_PFR6_P9                         *((volatile uint32_t*)(0x42DE0324UL))
#define bFM_GPIO_PFR6_PA                          *((volatile uint32_t*)(0x42DE0328UL))
#define bFM4_GPIO_PFR6_PA                         *((volatile uint32_t*)(0x42DE0328UL))
#define bFM_GPIO_PFR6_PB                          *((volatile uint32_t*)(0x42DE032CUL))
#define bFM4_GPIO_PFR6_PB                         *((volatile uint32_t*)(0x42DE032CUL))
#define bFM_GPIO_PFR6_PC                          *((volatile uint32_t*)(0x42DE0330UL))
#define bFM4_GPIO_PFR6_PC                         *((volatile uint32_t*)(0x42DE0330UL))
#define bFM_GPIO_PFR6_PD                          *((volatile uint32_t*)(0x42DE0334UL))
#define bFM4_GPIO_PFR6_PD                         *((volatile uint32_t*)(0x42DE0334UL))
#define bFM_GPIO_PFR6_PE                          *((volatile uint32_t*)(0x42DE0338UL))
#define bFM4_GPIO_PFR6_PE                         *((volatile uint32_t*)(0x42DE0338UL))

#define bFM_GPIO_PFR7_P0                          *((volatile uint32_t*)(0x42DE0380UL))
#define bFM4_GPIO_PFR7_P0                         *((volatile uint32_t*)(0x42DE0380UL))
#define bFM_GPIO_PFR7_P1                          *((volatile uint32_t*)(0x42DE0384UL))
#define bFM4_GPIO_PFR7_P1                         *((volatile uint32_t*)(0x42DE0384UL))
#define bFM_GPIO_PFR7_P2                          *((volatile uint32_t*)(0x42DE0388UL))
#define bFM4_GPIO_PFR7_P2                         *((volatile uint32_t*)(0x42DE0388UL))
#define bFM_GPIO_PFR7_P3                          *((volatile uint32_t*)(0x42DE038CUL))
#define bFM4_GPIO_PFR7_P3                         *((volatile uint32_t*)(0x42DE038CUL))
#define bFM_GPIO_PFR7_P4                          *((volatile uint32_t*)(0x42DE0390UL))
#define bFM4_GPIO_PFR7_P4                         *((volatile uint32_t*)(0x42DE0390UL))
#define bFM_GPIO_PFR7_P5                          *((volatile uint32_t*)(0x42DE0394UL))
#define bFM4_GPIO_PFR7_P5                         *((volatile uint32_t*)(0x42DE0394UL))
#define bFM_GPIO_PFR7_P6                          *((volatile uint32_t*)(0x42DE0398UL))
#define bFM4_GPIO_PFR7_P6                         *((volatile uint32_t*)(0x42DE0398UL))
#define bFM_GPIO_PFR7_P7                          *((volatile uint32_t*)(0x42DE039CUL))
#define bFM4_GPIO_PFR7_P7                         *((volatile uint32_t*)(0x42DE039CUL))
#define bFM_GPIO_PFR7_P8                          *((volatile uint32_t*)(0x42DE03A0UL))
#define bFM4_GPIO_PFR7_P8                         *((volatile uint32_t*)(0x42DE03A0UL))
#define bFM_GPIO_PFR7_P9                          *((volatile uint32_t*)(0x42DE03A4UL))
#define bFM4_GPIO_PFR7_P9                         *((volatile uint32_t*)(0x42DE03A4UL))
#define bFM_GPIO_PFR7_PA                          *((volatile uint32_t*)(0x42DE03A8UL))
#define bFM4_GPIO_PFR7_PA                         *((volatile uint32_t*)(0x42DE03A8UL))
#define bFM_GPIO_PFR7_PB                          *((volatile uint32_t*)(0x42DE03ACUL))
#define bFM4_GPIO_PFR7_PB                         *((volatile uint32_t*)(0x42DE03ACUL))
#define bFM_GPIO_PFR7_PC                          *((volatile uint32_t*)(0x42DE03B0UL))
#define bFM4_GPIO_PFR7_PC                         *((volatile uint32_t*)(0x42DE03B0UL))
#define bFM_GPIO_PFR7_PD                          *((volatile uint32_t*)(0x42DE03B4UL))
#define bFM4_GPIO_PFR7_PD                         *((volatile uint32_t*)(0x42DE03B4UL))
#define bFM_GPIO_PFR7_PE                          *((volatile uint32_t*)(0x42DE03B8UL))
#define bFM4_GPIO_PFR7_PE                         *((volatile uint32_t*)(0x42DE03B8UL))

