neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PFR8_P0                          *((volatile uint32_t*)(0x42DE0400UL))
#define bFM4_GPIO_PFR8_P0                         *((volatile uint32_t*)(0x42DE0400UL))
#define bFM_GPIO_PFR8_P1                          *((volatile uint32_t*)(0x42DE0404UL))
#define bFM4_GPIO_PFR8_P1                         *((volatile uint32_t*)(0x42DE0404UL))
#define bFM_GPIO_PFR8_P2                          *((volatile uint32_t*)(0x42DE0408UL))
#define bFM4_GPIO_PFR8_P2                         *((volatile uint32_t*)(0x42DE0408UL))
#define bFM_GPIO_PFR8_P3                          *((volatile uint32_t*)(0x42DE040CUL))
#define bFM4_GPIO_PFR8_P3                         *((volatile uint32_t*)(0x42DE040CUL))

#define bFM_GPIO_PFR9_P0                          *((volatile uint32_t*)(0x42DE0480UL))
#define bFM4_GPIO_PFR9_P0                         *((volatile uint32_t*)(0x42DE0480UL))
#define bFM_GPIO_PFR9_P1                          *((volatile uint32_t*)(0x42DE0484UL))
#define bFM4_GPIO_PFR9_P1                         *((volatile uint32_t*)(0x42DE0484UL))
#define bFM_GPIO_PFR9_P2                          *((volatile uint32_t*)(0x42DE0488UL))
#define bFM4_GPIO_PFR9_P2                         *((volatile uint32_t*)(0x42DE0488UL))
#define bFM_GPIO_PFR9_P3                          *((volatile uint32_t*)(0x42DE048CUL))
#define bFM4_GPIO_PFR9_P3                         *((volatile uint32_t*)(0x42DE048CUL))
#define bFM_GPIO_PFR9_P4                          *((volatile uint32_t*)(0x42DE0490UL))
#define bFM4_GPIO_PFR9_P4                         *((volatile uint32_t*)(0x42DE0490UL))
#define bFM_GPIO_PFR9_P5                          *((volatile uint32_t*)(0x42DE0494UL))
#define bFM4_GPIO_PFR9_P5                         *((volatile uint32_t*)(0x42DE0494UL))
#define bFM_GPIO_PFR9_P6                          *((volatile uint32_t*)(0x42DE0498UL))
#define bFM4_GPIO_PFR9_P6                         *((volatile uint32_t*)(0x42DE0498UL))
#define bFM_GPIO_PFR9_P7                          *((volatile uint32_t*)(0x42DE049CUL))
#define bFM4_GPIO_PFR9_P7                         *((volatile uint32_t*)(0x42DE049CUL))

#define bFM_GPIO_PFRA_P0                          *((volatile uint32_t*)(0x42DE0500UL))
#define bFM4_GPIO_PFRA_P0                         *((volatile uint32_t*)(0x42DE0500UL))
#define bFM_GPIO_PFRA_P1                          *((volatile uint32_t*)(0x42DE0504UL))
#define bFM4_GPIO_PFRA_P1                         *((volatile uint32_t*)(0x42DE0504UL))
#define bFM_GPIO_PFRA_P2                          *((volatile uint32_t*)(0x42DE0508UL))
#define bFM4_GPIO_PFRA_P2                         *((volatile uint32_t*)(0x42DE0508UL))
#define bFM_GPIO_PFRA_P3                          *((volatile uint32_t*)(0x42DE050CUL))
#define bFM4_GPIO_PFRA_P3                         *((volatile uint32_t*)(0x42DE050CUL))
#define bFM_GPIO_PFRA_P4                          *((volatile uint32_t*)(0x42DE0510UL))
#define bFM4_GPIO_PFRA_P4                         *((volatile uint32_t*)(0x42DE0510UL))
#define bFM_GPIO_PFRA_P5                          *((volatile uint32_t*)(0x42DE0514UL))
#define bFM4_GPIO_PFRA_P5                         *((volatile uint32_t*)(0x42DE0514UL))
#define bFM_GPIO_PFRA_P6                          *((volatile uint32_t*)(0x42DE0518UL))
#define bFM4_GPIO_PFRA_P6                         *((volatile uint32_t*)(0x42DE0518UL))
#define bFM_GPIO_PFRA_P7                          *((volatile uint32_t*)(0x42DE051CUL))
#define bFM4_GPIO_PFRA_P7                         *((volatile uint32_t*)(0x42DE051CUL))
#define bFM_GPIO_PFRA_P8                          *((volatile uint32_t*)(0x42DE0520UL))
#define bFM4_GPIO_PFRA_P8                         *((volatile uint32_t*)(0x42DE0520UL))
#define bFM_GPIO_PFRA_P9                          *((volatile uint32_t*)(0x42DE0524UL))
#define bFM4_GPIO_PFRA_P9                         *((volatile uint32_t*)(0x42DE0524UL))
#define bFM_GPIO_PFRA_PA                          *((volatile uint32_t*)(0x42DE0528UL))
#define bFM4_GPIO_PFRA_PA                         *((volatile uint32_t*)(0x42DE0528UL))
#define bFM_GPIO_PFRA_PB                          *((volatile uint32_t*)(0x42DE052CUL))
#define bFM4_GPIO_PFRA_PB                         *((volatile uint32_t*)(0x42DE052CUL))
#define bFM_GPIO_PFRA_PC                          *((volatile uint32_t*)(0x42DE0530UL))
#define bFM4_GPIO_PFRA_PC                         *((volatile uint32_t*)(0x42DE0530UL))
#define bFM_GPIO_PFRA_PD                          *((volatile uint32_t*)(0x42DE0534UL))
#define bFM4_GPIO_PFRA_PD                         *((volatile uint32_t*)(0x42DE0534UL))
#define bFM_GPIO_PFRA_PE                          *((volatile uint32_t*)(0x42DE0538UL))
#define bFM4_GPIO_PFRA_PE                         *((volatile uint32_t*)(0x42DE0538UL))
#define bFM_GPIO_PFRA_PF                          *((volatile uint32_t*)(0x42DE053CUL))
#define bFM4_GPIO_PFRA_PF                         *((volatile uint32_t*)(0x42DE053CUL))

#define bFM_GPIO_PFRB_P0                          *((volatile uint32_t*)(0x42DE0580UL))
#define bFM4_GPIO_PFRB_P0                         *((volatile uint32_t*)(0x42DE0580UL))
#define bFM_GPIO_PFRB_P1                          *((volatile uint32_t*)(0x42DE0584UL))
#define bFM4_GPIO_PFRB_P1                         *((volatile uint32_t*)(0x42DE0584UL))
#define bFM_GPIO_PFRB_P2                          *((volatile uint32_t*)(0x42DE0588UL))
#define bFM4_GPIO_PFRB_P2                         *((volatile uint32_t*)(0x42DE0588UL))
#define bFM_GPIO_PFRB_P3                          *((volatile uint32_t*)(0x42DE058CUL))
#define bFM4_GPIO_PFRB_P3                         *((volatile uint32_t*)(0x42DE058CUL))
#define bFM_GPIO_PFRB_P4                          *((volatile uint32_t*)(0x42DE0590UL))
#define bFM4_GPIO_PFRB_P4                         *((volatile uint32_t*)(0x42DE0590UL))
#define bFM_GPIO_PFRB_P5                          *((volatile uint32_t*)(0x42DE0594UL))
#define bFM4_GPIO_PFRB_P5                         *((volatile uint32_t*)(0x42DE0594UL))
#define bFM_GPIO_PFRB_P6                          *((volatile uint32_t*)(0x42DE0598UL))
#define bFM4_GPIO_PFRB_P6                         *((volatile uint32_t*)(0x42DE0598UL))
#define bFM_GPIO_PFRB_P7                          *((volatile uint32_t*)(0x42DE059CUL))
#define bFM4_GPIO_PFRB_P7                         *((volatile uint32_t*)(0x42DE059CUL))
#define bFM_GPIO_PFRB_P8                          *((volatile uint32_t*)(0x42DE05A0UL))
#define bFM4_GPIO_PFRB_P8                         *((volatile uint32_t*)(0x42DE05A0UL))
#define bFM_GPIO_PFRB_P9                          *((volatile uint32_t*)(0x42DE05A4UL))
#define bFM4_GPIO_PFRB_P9                         *((volatile uint32_t*)(0x42DE05A4UL))
#define bFM_GPIO_PFRB_PA                          *((volatile uint32_t*)(0x42DE05A8UL))
#define bFM4_GPIO_PFRB_PA                         *((volatile uint32_t*)(0x42DE05A8UL))
#define bFM_GPIO_PFRB_PB                          *((volatile uint32_t*)(0x42DE05ACUL))
#define bFM4_GPIO_PFRB_PB                         *((volatile uint32_t*)(0x42DE05ACUL))
#define bFM_GPIO_PFRB_PC                          *((volatile uint32_t*)(0x42DE05B0UL))
#define bFM4_GPIO_PFRB_PC                         *((volatile uint32_t*)(0x42DE05B0UL))
#define bFM_GPIO_PFRB_PD                          *((volatile uint32_t*)(0x42DE05B4UL))
#define bFM4_GPIO_PFRB_PD                         *((volatile uint32_t*)(0x42DE05B4UL))
#define bFM_GPIO_PFRB_PE                          *((volatile uint32_t*)(0x42DE05B8UL))
#define bFM4_GPIO_PFRB_PE                         *((volatile uint32_t*)(0x42DE05B8UL))
#define bFM_GPIO_PFRB_PF                          *((volatile uint32_t*)(0x42DE05BCUL))
#define bFM4_GPIO_PFRB_PF                         *((volatile uint32_t*)(0x42DE05BCUL))

#define bFM_GPIO_PFRC_P0                          *((volatile uint32_t*)(0x42DE0600UL))
#define bFM4_GPIO_PFRC_P0                         *((volatile uint32_t*)(0x42DE0600UL))
#define bFM_GPIO_PFRC_P1                          *((volatile uint32_t*)(0x42DE0604UL))
#define bFM4_GPIO_PFRC_P1                         *((volatile uint32_t*)(0x42DE0604UL))
#define bFM_GPIO_PFRC_P2                          *((volatile uint32_t*)(0x42DE0608UL))
#define bFM4_GPIO_PFRC_P2                         *((volatile uint32_t*)(0x42DE0608UL))
#define bFM_GPIO_PFRC_P3                          *((volatile uint32_t*)(0x42DE060CUL))
#define bFM4_GPIO_PFRC_P3                         *((volatile uint32_t*)(0x42DE060CUL))
#define bFM_GPIO_PFRC_P4                          *((volatile uint32_t*)(0x42DE0610UL))
#define bFM4_GPIO_PFRC_P4                         *((volatile uint32_t*)(0x42DE0610UL))
#define bFM_GPIO_PFRC_P5                          *((volatile uint32_t*)(0x42DE0614UL))
#define bFM4_GPIO_PFRC_P5                         *((volatile uint32_t*)(0x42DE0614UL))
#define bFM_GPIO_PFRC_P6                          *((volatile uint32_t*)(0x42DE0618UL))
#define bFM4_GPIO_PFRC_P6                         *((volatile uint32_t*)(0x42DE0618UL))
#define bFM_GPIO_PFRC_P7                          *((volatile uint32_t*)(0x42DE061CUL))
#define bFM4_GPIO_PFRC_P7                         *((volatile uint32_t*)(0x42DE061CUL))
#define bFM_GPIO_PFRC_P8                          *((volatile uint32_t*)(0x42DE0620UL))
#define bFM4_GPIO_PFRC_P8                         *((volatile uint32_t*)(0x42DE0620UL))
#define bFM_GPIO_PFRC_P9                          *((volatile uint32_t*)(0x42DE0624UL))
#define bFM4_GPIO_PFRC_P9                         *((volatile uint32_t*)(0x42DE0624UL))
#define bFM_GPIO_PFRC_PA                          *((volatile uint32_t*)(0x42DE0628UL))
#define bFM4_GPIO_PFRC_PA                         *((volatile uint32_t*)(0x42DE0628UL))
#define bFM_GPIO_PFRC_PB                          *((volatile uint32_t*)(0x42DE062CUL))
#define bFM4_GPIO_PFRC_PB                         *((volatile uint32_t*)(0x42DE062CUL))
#define bFM_GPIO_PFRC_PC                          *((volatile uint32_t*)(0x42DE0630UL))
#define bFM4_GPIO_PFRC_PC                         *((volatile uint32_t*)(0x42DE0630UL))
#define bFM_GPIO_PFRC_PD                          *((volatile uint32_t*)(0x42DE0634UL))
#define bFM4_GPIO_PFRC_PD                         *((volatile uint32_t*)(0x42DE0634UL))
#define bFM_GPIO_PFRC_PE                          *((volatile uint32_t*)(0x42DE0638UL))
#define bFM4_GPIO_PFRC_PE                         *((volatile uint32_t*)(0x42DE0638UL))
#define bFM_GPIO_PFRC_PF                          *((volatile uint32_t*)(0x42DE063CUL))
#define bFM4_GPIO_PFRC_PF                         *((volatile uint32_t*)(0x42DE063CUL))

