neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PFRD_P0                          *((volatile uint32_t*)(0x42DE0680UL))
#define bFM4_GPIO_PFRD_P0                         *((volatile uint32_t*)(0x42DE0680UL))
#define bFM_GPIO_PFRD_P1                          *((volatile uint32_t*)(0x42DE0684UL))
#define bFM4_GPIO_PFRD_P1                         *((volatile uint32_t*)(0x42DE0684UL))
#define bFM_GPIO_PFRD_P2                          *((volatile uint32_t*)(0x42DE0688UL))
#define bFM4_GPIO_PFRD_P2                         *((volatile uint32_t*)(0x42DE0688UL))

#define bFM_GPIO_PFRE_P0                          *((volatile uint32_t*)(0x42DE0700UL))
#define bFM4_GPIO_PFRE_P0                         *((volatile uint32_t*)(0x42DE0700UL))
#define bFM_GPIO_PFRE_P2                          *((volatile uint32_t*)(0x42DE0708UL))
#define bFM4_GPIO_PFRE_P2                         *((volatile uint32_t*)(0x42DE0708UL))
#define bFM_GPIO_PFRE_P3                          *((volatile uint32_t*)(0x42DE070CUL))
#define bFM4_GPIO_PFRE_P3                         *((volatile uint32_t*)(0x42DE070CUL))

#define bFM_GPIO_PFRF_P0                          *((volatile uint32_t*)(0x42DE0780UL))
#define bFM4_GPIO_PFRF_P0                         *((volatile uint32_t*)(0x42DE0780UL))
#define bFM_GPIO_PFRF_P1                          *((volatile uint32_t*)(0x42DE0784UL))
#define bFM4_GPIO_PFRF_P1                         *((volatile uint32_t*)(0x42DE0784UL))
#define bFM_GPIO_PFRF_P2                          *((volatile uint32_t*)(0x42DE0788UL))
#define bFM4_GPIO_PFRF_P2                         *((volatile uint32_t*)(0x42DE0788UL))
#define bFM_GPIO_PFRF_P3                          *((volatile uint32_t*)(0x42DE078CUL))
#define bFM4_GPIO_PFRF_P3                         *((volatile uint32_t*)(0x42DE078CUL))
#define bFM_GPIO_PFRF_P4                          *((volatile uint32_t*)(0x42DE0790UL))
#define bFM4_GPIO_PFRF_P4                         *((volatile uint32_t*)(0x42DE0790UL))
#define bFM_GPIO_PFRF_P5                          *((volatile uint32_t*)(0x42DE0794UL))
#define bFM4_GPIO_PFRF_P5                         *((volatile uint32_t*)(0x42DE0794UL))
#define bFM_GPIO_PFRF_P6                          *((volatile uint32_t*)(0x42DE0798UL))
#define bFM4_GPIO_PFRF_P6                         *((volatile uint32_t*)(0x42DE0798UL))
#define bFM_GPIO_PFRF_P7                          *((volatile uint32_t*)(0x42DE079CUL))
#define bFM4_GPIO_PFRF_P7                         *((volatile uint32_t*)(0x42DE079CUL))
#define bFM_GPIO_PFRF_P8                          *((volatile uint32_t*)(0x42DE07A0UL))
#define bFM4_GPIO_PFRF_P8                         *((volatile uint32_t*)(0x42DE07A0UL))
#define bFM_GPIO_PFRF_P9                          *((volatile uint32_t*)(0x42DE07A4UL))
#define bFM4_GPIO_PFRF_P9                         *((volatile uint32_t*)(0x42DE07A4UL))
#define bFM_GPIO_PFRF_PA                          *((volatile uint32_t*)(0x42DE07A8UL))
#define bFM4_GPIO_PFRF_PA                         *((volatile uint32_t*)(0x42DE07A8UL))
#define bFM_GPIO_PFRF_PB                          *((volatile uint32_t*)(0x42DE07ACUL))
#define bFM4_GPIO_PFRF_PB                         *((volatile uint32_t*)(0x42DE07ACUL))
#define bFM_GPIO_PFRF_PC                          *((volatile uint32_t*)(0x42DE07B0UL))
#define bFM4_GPIO_PFRF_PC                         *((volatile uint32_t*)(0x42DE07B0UL))

#define bFM_GPIO_PZR0_P0                          *((volatile uint32_t*)(0x42DEE000UL))
#define bFM4_GPIO_PZR0_P0                         *((volatile uint32_t*)(0x42DEE000UL))
#define bFM_GPIO_PZR0_P1                          *((volatile uint32_t*)(0x42DEE004UL))
#define bFM4_GPIO_PZR0_P1                         *((volatile uint32_t*)(0x42DEE004UL))
#define bFM_GPIO_PZR0_P2                          *((volatile uint32_t*)(0x42DEE008UL))
#define bFM4_GPIO_PZR0_P2                         *((volatile uint32_t*)(0x42DEE008UL))
#define bFM_GPIO_PZR0_P3                          *((volatile uint32_t*)(0x42DEE00CUL))
#define bFM4_GPIO_PZR0_P3                         *((volatile uint32_t*)(0x42DEE00CUL))
#define bFM_GPIO_PZR0_P4                          *((volatile uint32_t*)(0x42DEE010UL))
#define bFM4_GPIO_PZR0_P4                         *((volatile uint32_t*)(0x42DEE010UL))
#define bFM_GPIO_PZR0_P8                          *((volatile uint32_t*)(0x42DEE020UL))
#define bFM4_GPIO_PZR0_P8                         *((volatile uint32_t*)(0x42DEE020UL))
#define bFM_GPIO_PZR0_P9                          *((volatile uint32_t*)(0x42DEE024UL))
#define bFM4_GPIO_PZR0_P9                         *((volatile uint32_t*)(0x42DEE024UL))
#define bFM_GPIO_PZR0_PA                          *((volatile uint32_t*)(0x42DEE028UL))
#define bFM4_GPIO_PZR0_PA                         *((volatile uint32_t*)(0x42DEE028UL))

#define bFM_GPIO_PZR1_P0                          *((volatile uint32_t*)(0x42DEE080UL))
#define bFM4_GPIO_PZR1_P0                         *((volatile uint32_t*)(0x42DEE080UL))
#define bFM_GPIO_PZR1_P1                          *((volatile uint32_t*)(0x42DEE084UL))
#define bFM4_GPIO_PZR1_P1                         *((volatile uint32_t*)(0x42DEE084UL))
#define bFM_GPIO_PZR1_P2                          *((volatile uint32_t*)(0x42DEE088UL))
#define bFM4_GPIO_PZR1_P2                         *((volatile uint32_t*)(0x42DEE088UL))
#define bFM_GPIO_PZR1_P3                          *((volatile uint32_t*)(0x42DEE08CUL))
#define bFM4_GPIO_PZR1_P3                         *((volatile uint32_t*)(0x42DEE08CUL))
#define bFM_GPIO_PZR1_P4                          *((volatile uint32_t*)(0x42DEE090UL))
#define bFM4_GPIO_PZR1_P4                         *((volatile uint32_t*)(0x42DEE090UL))
#define bFM_GPIO_PZR1_P5                          *((volatile uint32_t*)(0x42DEE094UL))
#define bFM4_GPIO_PZR1_P5                         *((volatile uint32_t*)(0x42DEE094UL))
#define bFM_GPIO_PZR1_P6                          *((volatile uint32_t*)(0x42DEE098UL))
#define bFM4_GPIO_PZR1_P6                         *((volatile uint32_t*)(0x42DEE098UL))
#define bFM_GPIO_PZR1_P7                          *((volatile uint32_t*)(0x42DEE09CUL))
#define bFM4_GPIO_PZR1_P7                         *((volatile uint32_t*)(0x42DEE09CUL))
#define bFM_GPIO_PZR1_P8                          *((volatile uint32_t*)(0x42DEE0A0UL))
#define bFM4_GPIO_PZR1_P8                         *((volatile uint32_t*)(0x42DEE0A0UL))
#define bFM_GPIO_PZR1_P9                          *((volatile uint32_t*)(0x42DEE0A4UL))
#define bFM4_GPIO_PZR1_P9                         *((volatile uint32_t*)(0x42DEE0A4UL))
#define bFM_GPIO_PZR1_PA                          *((volatile uint32_t*)(0x42DEE0A8UL))
#define bFM4_GPIO_PZR1_PA                         *((volatile uint32_t*)(0x42DEE0A8UL))
#define bFM_GPIO_PZR1_PB                          *((volatile uint32_t*)(0x42DEE0ACUL))
#define bFM4_GPIO_PZR1_PB                         *((volatile uint32_t*)(0x42DEE0ACUL))
#define bFM_GPIO_PZR1_PC                          *((volatile uint32_t*)(0x42DEE0B0UL))
#define bFM4_GPIO_PZR1_PC                         *((volatile uint32_t*)(0x42DEE0B0UL))
#define bFM_GPIO_PZR1_PD                          *((volatile uint32_t*)(0x42DEE0B4UL))
#define bFM4_GPIO_PZR1_PD                         *((volatile uint32_t*)(0x42DEE0B4UL))
#define bFM_GPIO_PZR1_PE                          *((volatile uint32_t*)(0x42DEE0B8UL))
#define bFM4_GPIO_PZR1_PE                         *((volatile uint32_t*)(0x42DEE0B8UL))
#define bFM_GPIO_PZR1_PF                          *((volatile uint32_t*)(0x42DEE0BCUL))
#define bFM4_GPIO_PZR1_PF                         *((volatile uint32_t*)(0x42DEE0BCUL))

#define bFM_GPIO_PZR2_P0                          *((volatile uint32_t*)(0x42DEE100UL))
#define bFM4_GPIO_PZR2_P0                         *((volatile uint32_t*)(0x42DEE100UL))
#define bFM_GPIO_PZR2_P1                          *((volatile uint32_t*)(0x42DEE104UL))
#define bFM4_GPIO_PZR2_P1                         *((volatile uint32_t*)(0x42DEE104UL))
#define bFM_GPIO_PZR2_P2                          *((volatile uint32_t*)(0x42DEE108UL))
#define bFM4_GPIO_PZR2_P2                         *((volatile uint32_t*)(0x42DEE108UL))
#define bFM_GPIO_PZR2_P3                          *((volatile uint32_t*)(0x42DEE10CUL))
#define bFM4_GPIO_PZR2_P3                         *((volatile uint32_t*)(0x42DEE10CUL))
#define bFM_GPIO_PZR2_P4                          *((volatile uint32_t*)(0x42DEE110UL))
#define bFM4_GPIO_PZR2_P4                         *((volatile uint32_t*)(0x42DEE110UL))
#define bFM_GPIO_PZR2_P5                          *((volatile uint32_t*)(0x42DEE114UL))
#define bFM4_GPIO_PZR2_P5                         *((volatile uint32_t*)(0x42DEE114UL))
#define bFM_GPIO_PZR2_P6                          *((volatile uint32_t*)(0x42DEE118UL))
#define bFM4_GPIO_PZR2_P6                         *((volatile uint32_t*)(0x42DEE118UL))
#define bFM_GPIO_PZR2_P7                          *((volatile uint32_t*)(0x42DEE11CUL))
#define bFM4_GPIO_PZR2_P7                         *((volatile uint32_t*)(0x42DEE11CUL))
#define bFM_GPIO_PZR2_P8                          *((volatile uint32_t*)(0x42DEE120UL))
#define bFM4_GPIO_PZR2_P8                         *((volatile uint32_t*)(0x42DEE120UL))
#define bFM_GPIO_PZR2_P9                          *((volatile uint32_t*)(0x42DEE124UL))
#define bFM4_GPIO_PZR2_P9                         *((volatile uint32_t*)(0x42DEE124UL))
#define bFM_GPIO_PZR2_PA                          *((volatile uint32_t*)(0x42DEE128UL))
#define bFM4_GPIO_PZR2_PA                         *((volatile uint32_t*)(0x42DEE128UL))

