neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PZR3_P0                          *((volatile uint32_t*)(0x42DEE180UL))
#define bFM4_GPIO_PZR3_P0                         *((volatile uint32_t*)(0x42DEE180UL))
#define bFM_GPIO_PZR3_P1                          *((volatile uint32_t*)(0x42DEE184UL))
#define bFM4_GPIO_PZR3_P1                         *((volatile uint32_t*)(0x42DEE184UL))
#define bFM_GPIO_PZR3_P2                          *((volatile uint32_t*)(0x42DEE188UL))
#define bFM4_GPIO_PZR3_P2                         *((volatile uint32_t*)(0x42DEE188UL))
#define bFM_GPIO_PZR3_P3                          *((volatile uint32_t*)(0x42DEE18CUL))
#define bFM4_GPIO_PZR3_P3                         *((volatile uint32_t*)(0x42DEE18CUL))
#define bFM_GPIO_PZR3_P4                          *((volatile uint32_t*)(0x42DEE190UL))
#define bFM4_GPIO_PZR3_P4                         *((volatile uint32_t*)(0x42DEE190UL))
#define bFM_GPIO_PZR3_P5                          *((volatile uint32_t*)(0x42DEE194UL))
#define bFM4_GPIO_PZR3_P5                         *((volatile uint32_t*)(0x42DEE194UL))
#define bFM_GPIO_PZR3_P6                          *((volatile uint32_t*)(0x42DEE198UL))
#define bFM4_GPIO_PZR3_P6                         *((volatile uint32_t*)(0x42DEE198UL))
#define bFM_GPIO_PZR3_P7                          *((volatile uint32_t*)(0x42DEE19CUL))
#define bFM4_GPIO_PZR3_P7                         *((volatile uint32_t*)(0x42DEE19CUL))
#define bFM_GPIO_PZR3_P8                          *((volatile uint32_t*)(0x42DEE1A0UL))
#define bFM4_GPIO_PZR3_P8                         *((volatile uint32_t*)(0x42DEE1A0UL))
#define bFM_GPIO_PZR3_P9                          *((volatile uint32_t*)(0x42DEE1A4UL))
#define bFM4_GPIO_PZR3_P9                         *((volatile uint32_t*)(0x42DEE1A4UL))
#define bFM_GPIO_PZR3_PA                          *((volatile uint32_t*)(0x42DEE1A8UL))
#define bFM4_GPIO_PZR3_PA                         *((volatile uint32_t*)(0x42DEE1A8UL))
#define bFM_GPIO_PZR3_PB                          *((volatile uint32_t*)(0x42DEE1ACUL))
#define bFM4_GPIO_PZR3_PB                         *((volatile uint32_t*)(0x42DEE1ACUL))
#define bFM_GPIO_PZR3_PC                          *((volatile uint32_t*)(0x42DEE1B0UL))
#define bFM4_GPIO_PZR3_PC                         *((volatile uint32_t*)(0x42DEE1B0UL))
#define bFM_GPIO_PZR3_PD                          *((volatile uint32_t*)(0x42DEE1B4UL))
#define bFM4_GPIO_PZR3_PD                         *((volatile uint32_t*)(0x42DEE1B4UL))
#define bFM_GPIO_PZR3_PE                          *((volatile uint32_t*)(0x42DEE1B8UL))
#define bFM4_GPIO_PZR3_PE                         *((volatile uint32_t*)(0x42DEE1B8UL))

#define bFM_GPIO_PZR4_P0                          *((volatile uint32_t*)(0x42DEE200UL))
#define bFM4_GPIO_PZR4_P0                         *((volatile uint32_t*)(0x42DEE200UL))
#define bFM_GPIO_PZR4_P1                          *((volatile uint32_t*)(0x42DEE204UL))
#define bFM4_GPIO_PZR4_P1                         *((volatile uint32_t*)(0x42DEE204UL))
#define bFM_GPIO_PZR4_P2                          *((volatile uint32_t*)(0x42DEE208UL))
#define bFM4_GPIO_PZR4_P2                         *((volatile uint32_t*)(0x42DEE208UL))
#define bFM_GPIO_PZR4_P3                          *((volatile uint32_t*)(0x42DEE20CUL))
#define bFM4_GPIO_PZR4_P3                         *((volatile uint32_t*)(0x42DEE20CUL))
#define bFM_GPIO_PZR4_P4                          *((volatile uint32_t*)(0x42DEE210UL))
#define bFM4_GPIO_PZR4_P4                         *((volatile uint32_t*)(0x42DEE210UL))
#define bFM_GPIO_PZR4_P5                          *((volatile uint32_t*)(0x42DEE214UL))
#define bFM4_GPIO_PZR4_P5                         *((volatile uint32_t*)(0x42DEE214UL))
#define bFM_GPIO_PZR4_P6                          *((volatile uint32_t*)(0x42DEE218UL))
#define bFM4_GPIO_PZR4_P6                         *((volatile uint32_t*)(0x42DEE218UL))
#define bFM_GPIO_PZR4_P7                          *((volatile uint32_t*)(0x42DEE21CUL))
#define bFM4_GPIO_PZR4_P7                         *((volatile uint32_t*)(0x42DEE21CUL))
#define bFM_GPIO_PZR4_P8                          *((volatile uint32_t*)(0x42DEE220UL))
#define bFM4_GPIO_PZR4_P8                         *((volatile uint32_t*)(0x42DEE220UL))
#define bFM_GPIO_PZR4_P9                          *((volatile uint32_t*)(0x42DEE224UL))
#define bFM4_GPIO_PZR4_P9                         *((volatile uint32_t*)(0x42DEE224UL))
#define bFM_GPIO_PZR4_PA                          *((volatile uint32_t*)(0x42DEE228UL))
#define bFM4_GPIO_PZR4_PA                         *((volatile uint32_t*)(0x42DEE228UL))
#define bFM_GPIO_PZR4_PB                          *((volatile uint32_t*)(0x42DEE22CUL))
#define bFM4_GPIO_PZR4_PB                         *((volatile uint32_t*)(0x42DEE22CUL))
#define bFM_GPIO_PZR4_PC                          *((volatile uint32_t*)(0x42DEE230UL))
#define bFM4_GPIO_PZR4_PC                         *((volatile uint32_t*)(0x42DEE230UL))
#define bFM_GPIO_PZR4_PD                          *((volatile uint32_t*)(0x42DEE234UL))
#define bFM4_GPIO_PZR4_PD                         *((volatile uint32_t*)(0x42DEE234UL))
#define bFM_GPIO_PZR4_PE                          *((volatile uint32_t*)(0x42DEE238UL))
#define bFM4_GPIO_PZR4_PE                         *((volatile uint32_t*)(0x42DEE238UL))

#define bFM_GPIO_PZR5_P0                          *((volatile uint32_t*)(0x42DEE280UL))
#define bFM4_GPIO_PZR5_P0                         *((volatile uint32_t*)(0x42DEE280UL))
#define bFM_GPIO_PZR5_P1                          *((volatile uint32_t*)(0x42DEE284UL))
#define bFM4_GPIO_PZR5_P1                         *((volatile uint32_t*)(0x42DEE284UL))
#define bFM_GPIO_PZR5_P2                          *((volatile uint32_t*)(0x42DEE288UL))
#define bFM4_GPIO_PZR5_P2                         *((volatile uint32_t*)(0x42DEE288UL))
#define bFM_GPIO_PZR5_P3                          *((volatile uint32_t*)(0x42DEE28CUL))
#define bFM4_GPIO_PZR5_P3                         *((volatile uint32_t*)(0x42DEE28CUL))
#define bFM_GPIO_PZR5_P4                          *((volatile uint32_t*)(0x42DEE290UL))
#define bFM4_GPIO_PZR5_P4                         *((volatile uint32_t*)(0x42DEE290UL))
#define bFM_GPIO_PZR5_P5                          *((volatile uint32_t*)(0x42DEE294UL))
#define bFM4_GPIO_PZR5_P5                         *((volatile uint32_t*)(0x42DEE294UL))
#define bFM_GPIO_PZR5_P6                          *((volatile uint32_t*)(0x42DEE298UL))
#define bFM4_GPIO_PZR5_P6                         *((volatile uint32_t*)(0x42DEE298UL))
#define bFM_GPIO_PZR5_P7                          *((volatile uint32_t*)(0x42DEE29CUL))
#define bFM4_GPIO_PZR5_P7                         *((volatile uint32_t*)(0x42DEE29CUL))
#define bFM_GPIO_PZR5_P8                          *((volatile uint32_t*)(0x42DEE2A0UL))
#define bFM4_GPIO_PZR5_P8                         *((volatile uint32_t*)(0x42DEE2A0UL))
#define bFM_GPIO_PZR5_P9                          *((volatile uint32_t*)(0x42DEE2A4UL))
#define bFM4_GPIO_PZR5_P9                         *((volatile uint32_t*)(0x42DEE2A4UL))
#define bFM_GPIO_PZR5_PA                          *((volatile uint32_t*)(0x42DEE2A8UL))
#define bFM4_GPIO_PZR5_PA                         *((volatile uint32_t*)(0x42DEE2A8UL))
#define bFM_GPIO_PZR5_PB                          *((volatile uint32_t*)(0x42DEE2ACUL))
#define bFM4_GPIO_PZR5_PB                         *((volatile uint32_t*)(0x42DEE2ACUL))
#define bFM_GPIO_PZR5_PC                          *((volatile uint32_t*)(0x42DEE2B0UL))
#define bFM4_GPIO_PZR5_PC                         *((volatile uint32_t*)(0x42DEE2B0UL))
#define bFM_GPIO_PZR5_PD                          *((volatile uint32_t*)(0x42DEE2B4UL))
#define bFM4_GPIO_PZR5_PD                         *((volatile uint32_t*)(0x42DEE2B4UL))
#define bFM_GPIO_PZR5_PE                          *((volatile uint32_t*)(0x42DEE2B8UL))
#define bFM4_GPIO_PZR5_PE                         *((volatile uint32_t*)(0x42DEE2B8UL))
#define bFM_GPIO_PZR5_PF                          *((volatile uint32_t*)(0x42DEE2BCUL))
#define bFM4_GPIO_PZR5_PF                         *((volatile uint32_t*)(0x42DEE2BCUL))

#define bFM_GPIO_PZR6_P0                          *((volatile uint32_t*)(0x42DEE300UL))
#define bFM4_GPIO_PZR6_P0                         *((volatile uint32_t*)(0x42DEE300UL))
#define bFM_GPIO_PZR6_P1                          *((volatile uint32_t*)(0x42DEE304UL))
#define bFM4_GPIO_PZR6_P1                         *((volatile uint32_t*)(0x42DEE304UL))
#define bFM_GPIO_PZR6_P2                          *((volatile uint32_t*)(0x42DEE308UL))
#define bFM4_GPIO_PZR6_P2                         *((volatile uint32_t*)(0x42DEE308UL))
#define bFM_GPIO_PZR6_P3                          *((volatile uint32_t*)(0x42DEE30CUL))
#define bFM4_GPIO_PZR6_P3                         *((volatile uint32_t*)(0x42DEE30CUL))
#define bFM_GPIO_PZR6_P4                          *((volatile uint32_t*)(0x42DEE310UL))
#define bFM4_GPIO_PZR6_P4                         *((volatile uint32_t*)(0x42DEE310UL))
#define bFM_GPIO_PZR6_P5                          *((volatile uint32_t*)(0x42DEE314UL))
#define bFM4_GPIO_PZR6_P5                         *((volatile uint32_t*)(0x42DEE314UL))
#define bFM_GPIO_PZR6_P6                          *((volatile uint32_t*)(0x42DEE318UL))
#define bFM4_GPIO_PZR6_P6                         *((volatile uint32_t*)(0x42DEE318UL))
#define bFM_GPIO_PZR6_P7                          *((volatile uint32_t*)(0x42DEE31CUL))
#define bFM4_GPIO_PZR6_P7                         *((volatile uint32_t*)(0x42DEE31CUL))
#define bFM_GPIO_PZR6_P8                          *((volatile uint32_t*)(0x42DEE320UL))
#define bFM4_GPIO_PZR6_P8                         *((volatile uint32_t*)(0x42DEE320UL))
#define bFM_GPIO_PZR6_P9                          *((volatile uint32_t*)(0x42DEE324UL))
#define bFM4_GPIO_PZR6_P9                         *((volatile uint32_t*)(0x42DEE324UL))
#define bFM_GPIO_PZR6_PA                          *((volatile uint32_t*)(0x42DEE328UL))
#define bFM4_GPIO_PZR6_PA                         *((volatile uint32_t*)(0x42DEE328UL))
#define bFM_GPIO_PZR6_PB                          *((volatile uint32_t*)(0x42DEE32CUL))
#define bFM4_GPIO_PZR6_PB                         *((volatile uint32_t*)(0x42DEE32CUL))
#define bFM_GPIO_PZR6_PC                          *((volatile uint32_t*)(0x42DEE330UL))
#define bFM4_GPIO_PZR6_PC                         *((volatile uint32_t*)(0x42DEE330UL))
#define bFM_GPIO_PZR6_PD                          *((volatile uint32_t*)(0x42DEE334UL))
#define bFM4_GPIO_PZR6_PD                         *((volatile uint32_t*)(0x42DEE334UL))
#define bFM_GPIO_PZR6_PE                          *((volatile uint32_t*)(0x42DEE338UL))
#define bFM4_GPIO_PZR6_PE                         *((volatile uint32_t*)(0x42DEE338UL))

#define bFM_GPIO_PZR7_P0                          *((volatile uint32_t*)(0x42DEE380UL))
#define bFM4_GPIO_PZR7_P0                         *((volatile uint32_t*)(0x42DEE380UL))
#define bFM_GPIO_PZR7_P1                          *((volatile uint32_t*)(0x42DEE384UL))
#define bFM4_GPIO_PZR7_P1                         *((volatile uint32_t*)(0x42DEE384UL))
#define bFM_GPIO_PZR7_P2                          *((volatile uint32_t*)(0x42DEE388UL))
#define bFM4_GPIO_PZR7_P2                         *((volatile uint32_t*)(0x42DEE388UL))
#define bFM_GPIO_PZR7_P3                          *((volatile uint32_t*)(0x42DEE38CUL))
#define bFM4_GPIO_PZR7_P3                         *((volatile uint32_t*)(0x42DEE38CUL))
#define bFM_GPIO_PZR7_P4                          *((volatile uint32_t*)(0x42DEE390UL))
#define bFM4_GPIO_PZR7_P4                         *((volatile uint32_t*)(0x42DEE390UL))
#define bFM_GPIO_PZR7_P5                          *((volatile uint32_t*)(0x42DEE394UL))
#define bFM4_GPIO_PZR7_P5                         *((volatile uint32_t*)(0x42DEE394UL))
#define bFM_GPIO_PZR7_P6                          *((volatile uint32_t*)(0x42DEE398UL))
#define bFM4_GPIO_PZR7_P6                         *((volatile uint32_t*)(0x42DEE398UL))
#define bFM_GPIO_PZR7_P7                          *((volatile uint32_t*)(0x42DEE39CUL))
#define bFM4_GPIO_PZR7_P7                         *((volatile uint32_t*)(0x42DEE39CUL))
#define bFM_GPIO_PZR7_P8                          *((volatile uint32_t*)(0x42DEE3A0UL))
#define bFM4_GPIO_PZR7_P8                         *((volatile uint32_t*)(0x42DEE3A0UL))
#define bFM_GPIO_PZR7_P9                          *((volatile uint32_t*)(0x42DEE3A4UL))
#define bFM4_GPIO_PZR7_P9                         *((volatile uint32_t*)(0x42DEE3A4UL))
#define bFM_GPIO_PZR7_PA                          *((volatile uint32_t*)(0x42DEE3A8UL))
#define bFM4_GPIO_PZR7_PA                         *((volatile uint32_t*)(0x42DEE3A8UL))
#define bFM_GPIO_PZR7_PB                          *((volatile uint32_t*)(0x42DEE3ACUL))
#define bFM4_GPIO_PZR7_PB                         *((volatile uint32_t*)(0x42DEE3ACUL))
#define bFM_GPIO_PZR7_PC                          *((volatile uint32_t*)(0x42DEE3B0UL))
#define bFM4_GPIO_PZR7_PC                         *((volatile uint32_t*)(0x42DEE3B0UL))
#define bFM_GPIO_PZR7_PD                          *((volatile uint32_t*)(0x42DEE3B4UL))
#define bFM4_GPIO_PZR7_PD                         *((volatile uint32_t*)(0x42DEE3B4UL))
#define bFM_GPIO_PZR7_PE                          *((volatile uint32_t*)(0x42DEE3B8UL))
#define bFM4_GPIO_PZR7_PE                         *((volatile uint32_t*)(0x42DEE3B8UL))

#define bFM_GPIO_PZR8_P0                          *((volatile uint32_t*)(0x42DEE400UL))
#define bFM4_GPIO_PZR8_P0                         *((volatile uint32_t*)(0x42DEE400UL))
#define bFM_GPIO_PZR8_P1                          *((volatile uint32_t*)(0x42DEE404UL))
#define bFM4_GPIO_PZR8_P1                         *((volatile uint32_t*)(0x42DEE404UL))
#define bFM_GPIO_PZR8_P2                          *((volatile uint32_t*)(0x42DEE408UL))
#define bFM4_GPIO_PZR8_P2                         *((volatile uint32_t*)(0x42DEE408UL))
#define bFM_GPIO_PZR8_P3                          *((volatile uint32_t*)(0x42DEE40CUL))
#define bFM4_GPIO_PZR8_P3                         *((volatile uint32_t*)(0x42DEE40CUL))

