neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_GPIO_PZRE_P0                          *((volatile uint32_t*)(0x42DEE700UL))
#define bFM4_GPIO_PZRE_P0                         *((volatile uint32_t*)(0x42DEE700UL))
#define bFM_GPIO_PZRE_P2                          *((volatile uint32_t*)(0x42DEE708UL))
#define bFM4_GPIO_PZRE_P2                         *((volatile uint32_t*)(0x42DEE708UL))
#define bFM_GPIO_PZRE_P3                          *((volatile uint32_t*)(0x42DEE70CUL))
#define bFM4_GPIO_PZRE_P3                         *((volatile uint32_t*)(0x42DEE70CUL))

#define bFM_GPIO_PZRF_P0                          *((volatile uint32_t*)(0x42DEE780UL))
#define bFM4_GPIO_PZRF_P0                         *((volatile uint32_t*)(0x42DEE780UL))
#define bFM_GPIO_PZRF_P1                          *((volatile uint32_t*)(0x42DEE784UL))
#define bFM4_GPIO_PZRF_P1                         *((volatile uint32_t*)(0x42DEE784UL))
#define bFM_GPIO_PZRF_P2                          *((volatile uint32_t*)(0x42DEE788UL))
#define bFM4_GPIO_PZRF_P2                         *((volatile uint32_t*)(0x42DEE788UL))
#define bFM_GPIO_PZRF_P3                          *((volatile uint32_t*)(0x42DEE78CUL))
#define bFM4_GPIO_PZRF_P3                         *((volatile uint32_t*)(0x42DEE78CUL))
#define bFM_GPIO_PZRF_P4                          *((volatile uint32_t*)(0x42DEE790UL))
#define bFM4_GPIO_PZRF_P4                         *((volatile uint32_t*)(0x42DEE790UL))
#define bFM_GPIO_PZRF_P5                          *((volatile uint32_t*)(0x42DEE794UL))
#define bFM4_GPIO_PZRF_P5                         *((volatile uint32_t*)(0x42DEE794UL))
#define bFM_GPIO_PZRF_P6                          *((volatile uint32_t*)(0x42DEE798UL))
#define bFM4_GPIO_PZRF_P6                         *((volatile uint32_t*)(0x42DEE798UL))
#define bFM_GPIO_PZRF_P7                          *((volatile uint32_t*)(0x42DEE79CUL))
#define bFM4_GPIO_PZRF_P7                         *((volatile uint32_t*)(0x42DEE79CUL))
#define bFM_GPIO_PZRF_P8                          *((volatile uint32_t*)(0x42DEE7A0UL))
#define bFM4_GPIO_PZRF_P8                         *((volatile uint32_t*)(0x42DEE7A0UL))
#define bFM_GPIO_PZRF_P9                          *((volatile uint32_t*)(0x42DEE7A4UL))
#define bFM4_GPIO_PZRF_P9                         *((volatile uint32_t*)(0x42DEE7A4UL))
#define bFM_GPIO_PZRF_PA                          *((volatile uint32_t*)(0x42DEE7A8UL))
#define bFM4_GPIO_PZRF_PA                         *((volatile uint32_t*)(0x42DEE7A8UL))
#define bFM_GPIO_PZRF_PB                          *((volatile uint32_t*)(0x42DEE7ACUL))
#define bFM4_GPIO_PZRF_PB                         *((volatile uint32_t*)(0x42DEE7ACUL))
#define bFM_GPIO_PZRF_PC                          *((volatile uint32_t*)(0x42DEE7B0UL))
#define bFM4_GPIO_PZRF_PC                         *((volatile uint32_t*)(0x42DEE7B0UL))

#define bFM_GPIO_SPSR_USB0C                       *((volatile uint32_t*)(0x42DEB010UL))
#define bFM4_GPIO_SPSR_USB0C                      *((volatile uint32_t*)(0x42DEB010UL))
#define bFM_GPIO_SPSR_USB1C                       *((volatile uint32_t*)(0x42DEB014UL))
#define bFM4_GPIO_SPSR_USB1C                      *((volatile uint32_t*)(0x42DEB014UL))


/******************************************************************************
 ** HSSPI Registers HSSPI
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** HWWDT Registers HWWDT
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_HWWDT_WDG_CTL_INTEN                   *((volatile uint32_t*)(0x42220100UL))
#define bFM4_HWWDT_WDG_CTL_INTEN                  *((volatile uint32_t*)(0x42220100UL))
#define bFM_HWWDT_WDG_CTL_RESEN                   *((volatile uint32_t*)(0x42220104UL))
#define bFM4_HWWDT_WDG_CTL_RESEN                  *((volatile uint32_t*)(0x42220104UL))

#define bFM_HWWDT_WDG_RIS_RIS                     *((volatile uint32_t*)(0x42220200UL))
#define bFM4_HWWDT_WDG_RIS_RIS                    *((volatile uint32_t*)(0x42220200UL))


/******************************************************************************
 ** I2S Registers I2S0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_I2S0_CNTREG_FSPL                      *((volatile uint32_t*)(0x42D80100UL))
#define bFM4_I2S0_CNTREG_FSPL                     *((volatile uint32_t*)(0x42D80100UL))
#define bFM_I2S0_CNTREG_FSLN                      *((volatile uint32_t*)(0x42D80104UL))
#define bFM4_I2S0_CNTREG_FSLN                     *((volatile uint32_t*)(0x42D80104UL))
#define bFM_I2S0_CNTREG_FSPH                      *((volatile uint32_t*)(0x42D80108UL))
#define bFM4_I2S0_CNTREG_FSPH                     *((volatile uint32_t*)(0x42D80108UL))
#define bFM_I2S0_CNTREG_CPOL                      *((volatile uint32_t*)(0x42D8010CUL))
#define bFM4_I2S0_CNTREG_CPOL                     *((volatile uint32_t*)(0x42D8010CUL))
#define bFM_I2S0_CNTREG_SMPL                      *((volatile uint32_t*)(0x42D80110UL))
#define bFM4_I2S0_CNTREG_SMPL                     *((volatile uint32_t*)(0x42D80110UL))
#define bFM_I2S0_CNTREG_RXDIS                     *((volatile uint32_t*)(0x42D80114UL))
#define bFM4_I2S0_CNTREG_RXDIS                    *((volatile uint32_t*)(0x42D80114UL))
#define bFM_I2S0_CNTREG_TXDIS                     *((volatile uint32_t*)(0x42D80118UL))
#define bFM4_I2S0_CNTREG_TXDIS                    *((volatile uint32_t*)(0x42D80118UL))
#define bFM_I2S0_CNTREG_MLSB                      *((volatile uint32_t*)(0x42D8011CUL))
#define bFM4_I2S0_CNTREG_MLSB                     *((volatile uint32_t*)(0x42D8011CUL))
#define bFM_I2S0_CNTREG_FRUN                      *((volatile uint32_t*)(0x42D80120UL))
#define bFM4_I2S0_CNTREG_FRUN                     *((volatile uint32_t*)(0x42D80120UL))
#define bFM_I2S0_CNTREG_BEXT                      *((volatile uint32_t*)(0x42D80124UL))
#define bFM4_I2S0_CNTREG_BEXT                     *((volatile uint32_t*)(0x42D80124UL))
#define bFM_I2S0_CNTREG_ECKM                      *((volatile uint32_t*)(0x42D80128UL))
#define bFM4_I2S0_CNTREG_ECKM                     *((volatile uint32_t*)(0x42D80128UL))
#define bFM_I2S0_CNTREG_RHLL                      *((volatile uint32_t*)(0x42D8012CUL))
#define bFM4_I2S0_CNTREG_RHLL                     *((volatile uint32_t*)(0x42D8012CUL))
#define bFM_I2S0_CNTREG_SBFN                      *((volatile uint32_t*)(0x42D80130UL))
#define bFM4_I2S0_CNTREG_SBFN                     *((volatile uint32_t*)(0x42D80130UL))
#define bFM_I2S0_CNTREG_MSMD                      *((volatile uint32_t*)(0x42D80134UL))
#define bFM4_I2S0_CNTREG_MSMD                     *((volatile uint32_t*)(0x42D80134UL))
#define bFM_I2S0_CNTREG_MSKB                      *((volatile uint32_t*)(0x42D80138UL))
#define bFM4_I2S0_CNTREG_MSKB                     *((volatile uint32_t*)(0x42D80138UL))

#define bFM_I2S0_DMAACT_RDMACT                    *((volatile uint32_t*)(0x42D80500UL))
#define bFM4_I2S0_DMAACT_RDMACT                   *((volatile uint32_t*)(0x42D80500UL))
#define bFM_I2S0_DMAACT_RL1E0                     *((volatile uint32_t*)(0x42D80520UL))
#define bFM4_I2S0_DMAACT_RL1E0                    *((volatile uint32_t*)(0x42D80520UL))
#define bFM_I2S0_DMAACT_TDMACT                    *((volatile uint32_t*)(0x42D80540UL))
#define bFM4_I2S0_DMAACT_TDMACT                   *((volatile uint32_t*)(0x42D80540UL))
#define bFM_I2S0_DMAACT_TL1E0                     *((volatile uint32_t*)(0x42D80560UL))
#define bFM4_I2S0_DMAACT_TL1E0                    *((volatile uint32_t*)(0x42D80560UL))

