neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_I2S0_INTCNT_RXFIM                     *((volatile uint32_t*)(0x42D80440UL))
#define bFM4_I2S0_INTCNT_RXFIM                    *((volatile uint32_t*)(0x42D80440UL))
#define bFM_I2S0_INTCNT_RXFDM                     *((volatile uint32_t*)(0x42D80444UL))
#define bFM4_I2S0_INTCNT_RXFDM                    *((volatile uint32_t*)(0x42D80444UL))
#define bFM_I2S0_INTCNT_EOPM                      *((volatile uint32_t*)(0x42D80448UL))
#define bFM4_I2S0_INTCNT_EOPM                     *((volatile uint32_t*)(0x42D80448UL))
#define bFM_I2S0_INTCNT_RXOVM                     *((volatile uint32_t*)(0x42D8044CUL))
#define bFM4_I2S0_INTCNT_RXOVM                    *((volatile uint32_t*)(0x42D8044CUL))
#define bFM_I2S0_INTCNT_RXUDM                     *((volatile uint32_t*)(0x42D80450UL))
#define bFM4_I2S0_INTCNT_RXUDM                    *((volatile uint32_t*)(0x42D80450UL))
#define bFM_I2S0_INTCNT_RBERM                     *((volatile uint32_t*)(0x42D80454UL))
#define bFM4_I2S0_INTCNT_RBERM                    *((volatile uint32_t*)(0x42D80454UL))
#define bFM_I2S0_INTCNT_TXFIM                     *((volatile uint32_t*)(0x42D80460UL))
#define bFM4_I2S0_INTCNT_TXFIM                    *((volatile uint32_t*)(0x42D80460UL))
#define bFM_I2S0_INTCNT_TXFDM                     *((volatile uint32_t*)(0x42D80464UL))
#define bFM4_I2S0_INTCNT_TXFDM                    *((volatile uint32_t*)(0x42D80464UL))
#define bFM_I2S0_INTCNT_TXOVM                     *((volatile uint32_t*)(0x42D80468UL))
#define bFM4_I2S0_INTCNT_TXOVM                    *((volatile uint32_t*)(0x42D80468UL))
#define bFM_I2S0_INTCNT_TXUD0M                    *((volatile uint32_t*)(0x42D8046CUL))
#define bFM4_I2S0_INTCNT_TXUD0M                   *((volatile uint32_t*)(0x42D8046CUL))
#define bFM_I2S0_INTCNT_FERRM                     *((volatile uint32_t*)(0x42D80470UL))
#define bFM4_I2S0_INTCNT_FERRM                    *((volatile uint32_t*)(0x42D80470UL))
#define bFM_I2S0_INTCNT_TBERM                     *((volatile uint32_t*)(0x42D80474UL))
#define bFM4_I2S0_INTCNT_TBERM                    *((volatile uint32_t*)(0x42D80474UL))
#define bFM_I2S0_INTCNT_TXUD1M                    *((volatile uint32_t*)(0x42D80478UL))
#define bFM4_I2S0_INTCNT_TXUD1M                   *((volatile uint32_t*)(0x42D80478UL))

#define bFM_I2S0_MCR1REG_S0CH00                   *((volatile uint32_t*)(0x42D80200UL))
#define bFM4_I2S0_MCR1REG_S0CH00                  *((volatile uint32_t*)(0x42D80200UL))
#define bFM_I2S0_MCR1REG_S0CH01                   *((volatile uint32_t*)(0x42D80204UL))
#define bFM4_I2S0_MCR1REG_S0CH01                  *((volatile uint32_t*)(0x42D80204UL))
#define bFM_I2S0_MCR1REG_S0CH02                   *((volatile uint32_t*)(0x42D80208UL))
#define bFM4_I2S0_MCR1REG_S0CH02                  *((volatile uint32_t*)(0x42D80208UL))
#define bFM_I2S0_MCR1REG_S0CH03                   *((volatile uint32_t*)(0x42D8020CUL))
#define bFM4_I2S0_MCR1REG_S0CH03                  *((volatile uint32_t*)(0x42D8020CUL))
#define bFM_I2S0_MCR1REG_S0CH04                   *((volatile uint32_t*)(0x42D80210UL))
#define bFM4_I2S0_MCR1REG_S0CH04                  *((volatile uint32_t*)(0x42D80210UL))
#define bFM_I2S0_MCR1REG_S0CH05                   *((volatile uint32_t*)(0x42D80214UL))
#define bFM4_I2S0_MCR1REG_S0CH05                  *((volatile uint32_t*)(0x42D80214UL))
#define bFM_I2S0_MCR1REG_S0CH06                   *((volatile uint32_t*)(0x42D80218UL))
#define bFM4_I2S0_MCR1REG_S0CH06                  *((volatile uint32_t*)(0x42D80218UL))
#define bFM_I2S0_MCR1REG_S0CH07                   *((volatile uint32_t*)(0x42D8021CUL))
#define bFM4_I2S0_MCR1REG_S0CH07                  *((volatile uint32_t*)(0x42D8021CUL))
#define bFM_I2S0_MCR1REG_S0CH08                   *((volatile uint32_t*)(0x42D80220UL))
#define bFM4_I2S0_MCR1REG_S0CH08                  *((volatile uint32_t*)(0x42D80220UL))
#define bFM_I2S0_MCR1REG_S0CH09                   *((volatile uint32_t*)(0x42D80224UL))
#define bFM4_I2S0_MCR1REG_S0CH09                  *((volatile uint32_t*)(0x42D80224UL))
#define bFM_I2S0_MCR1REG_S0CH10                   *((volatile uint32_t*)(0x42D80228UL))
#define bFM4_I2S0_MCR1REG_S0CH10                  *((volatile uint32_t*)(0x42D80228UL))
#define bFM_I2S0_MCR1REG_S0CH11                   *((volatile uint32_t*)(0x42D8022CUL))
#define bFM4_I2S0_MCR1REG_S0CH11                  *((volatile uint32_t*)(0x42D8022CUL))
#define bFM_I2S0_MCR1REG_S0CH12                   *((volatile uint32_t*)(0x42D80230UL))
#define bFM4_I2S0_MCR1REG_S0CH12                  *((volatile uint32_t*)(0x42D80230UL))
#define bFM_I2S0_MCR1REG_S0CH13                   *((volatile uint32_t*)(0x42D80234UL))
#define bFM4_I2S0_MCR1REG_S0CH13                  *((volatile uint32_t*)(0x42D80234UL))
#define bFM_I2S0_MCR1REG_S0CH14                   *((volatile uint32_t*)(0x42D80238UL))
#define bFM4_I2S0_MCR1REG_S0CH14                  *((volatile uint32_t*)(0x42D80238UL))
#define bFM_I2S0_MCR1REG_S0CH15                   *((volatile uint32_t*)(0x42D8023CUL))
#define bFM4_I2S0_MCR1REG_S0CH15                  *((volatile uint32_t*)(0x42D8023CUL))
#define bFM_I2S0_MCR1REG_S0CH16                   *((volatile uint32_t*)(0x42D80240UL))
#define bFM4_I2S0_MCR1REG_S0CH16                  *((volatile uint32_t*)(0x42D80240UL))
#define bFM_I2S0_MCR1REG_S0CH17                   *((volatile uint32_t*)(0x42D80244UL))
#define bFM4_I2S0_MCR1REG_S0CH17                  *((volatile uint32_t*)(0x42D80244UL))
#define bFM_I2S0_MCR1REG_S0CH18                   *((volatile uint32_t*)(0x42D80248UL))
#define bFM4_I2S0_MCR1REG_S0CH18                  *((volatile uint32_t*)(0x42D80248UL))
#define bFM_I2S0_MCR1REG_S0CH19                   *((volatile uint32_t*)(0x42D8024CUL))
#define bFM4_I2S0_MCR1REG_S0CH19                  *((volatile uint32_t*)(0x42D8024CUL))
#define bFM_I2S0_MCR1REG_S0CH20                   *((volatile uint32_t*)(0x42D80250UL))
#define bFM4_I2S0_MCR1REG_S0CH20                  *((volatile uint32_t*)(0x42D80250UL))
#define bFM_I2S0_MCR1REG_S0CH21                   *((volatile uint32_t*)(0x42D80254UL))
#define bFM4_I2S0_MCR1REG_S0CH21                  *((volatile uint32_t*)(0x42D80254UL))
#define bFM_I2S0_MCR1REG_S0CH22                   *((volatile uint32_t*)(0x42D80258UL))
#define bFM4_I2S0_MCR1REG_S0CH22                  *((volatile uint32_t*)(0x42D80258UL))
#define bFM_I2S0_MCR1REG_S0CH23                   *((volatile uint32_t*)(0x42D8025CUL))
#define bFM4_I2S0_MCR1REG_S0CH23                  *((volatile uint32_t*)(0x42D8025CUL))
#define bFM_I2S0_MCR1REG_S0CH24                   *((volatile uint32_t*)(0x42D80260UL))
#define bFM4_I2S0_MCR1REG_S0CH24                  *((volatile uint32_t*)(0x42D80260UL))
#define bFM_I2S0_MCR1REG_S0CH25                   *((volatile uint32_t*)(0x42D80264UL))
#define bFM4_I2S0_MCR1REG_S0CH25                  *((volatile uint32_t*)(0x42D80264UL))
#define bFM_I2S0_MCR1REG_S0CH26                   *((volatile uint32_t*)(0x42D80268UL))
#define bFM4_I2S0_MCR1REG_S0CH26                  *((volatile uint32_t*)(0x42D80268UL))
#define bFM_I2S0_MCR1REG_S0CH27                   *((volatile uint32_t*)(0x42D8026CUL))
#define bFM4_I2S0_MCR1REG_S0CH27                  *((volatile uint32_t*)(0x42D8026CUL))
#define bFM_I2S0_MCR1REG_S0CH28                   *((volatile uint32_t*)(0x42D80270UL))
#define bFM4_I2S0_MCR1REG_S0CH28                  *((volatile uint32_t*)(0x42D80270UL))
#define bFM_I2S0_MCR1REG_S0CH29                   *((volatile uint32_t*)(0x42D80274UL))
#define bFM4_I2S0_MCR1REG_S0CH29                  *((volatile uint32_t*)(0x42D80274UL))
#define bFM_I2S0_MCR1REG_S0CH30                   *((volatile uint32_t*)(0x42D80278UL))
#define bFM4_I2S0_MCR1REG_S0CH30                  *((volatile uint32_t*)(0x42D80278UL))
#define bFM_I2S0_MCR1REG_S0CH31                   *((volatile uint32_t*)(0x42D8027CUL))
#define bFM4_I2S0_MCR1REG_S0CH31                  *((volatile uint32_t*)(0x42D8027CUL))

