neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_I2S0_MCR2REG_S1CH00                   *((volatile uint32_t*)(0x42D80280UL))
#define bFM4_I2S0_MCR2REG_S1CH00                  *((volatile uint32_t*)(0x42D80280UL))
#define bFM_I2S0_MCR2REG_S1CH01                   *((volatile uint32_t*)(0x42D80284UL))
#define bFM4_I2S0_MCR2REG_S1CH01                  *((volatile uint32_t*)(0x42D80284UL))
#define bFM_I2S0_MCR2REG_S1CH02                   *((volatile uint32_t*)(0x42D80288UL))
#define bFM4_I2S0_MCR2REG_S1CH02                  *((volatile uint32_t*)(0x42D80288UL))
#define bFM_I2S0_MCR2REG_S1CH03                   *((volatile uint32_t*)(0x42D8028CUL))
#define bFM4_I2S0_MCR2REG_S1CH03                  *((volatile uint32_t*)(0x42D8028CUL))
#define bFM_I2S0_MCR2REG_S1CH04                   *((volatile uint32_t*)(0x42D80290UL))
#define bFM4_I2S0_MCR2REG_S1CH04                  *((volatile uint32_t*)(0x42D80290UL))
#define bFM_I2S0_MCR2REG_S1CH05                   *((volatile uint32_t*)(0x42D80294UL))
#define bFM4_I2S0_MCR2REG_S1CH05                  *((volatile uint32_t*)(0x42D80294UL))
#define bFM_I2S0_MCR2REG_S1CH06                   *((volatile uint32_t*)(0x42D80298UL))
#define bFM4_I2S0_MCR2REG_S1CH06                  *((volatile uint32_t*)(0x42D80298UL))
#define bFM_I2S0_MCR2REG_S1CH07                   *((volatile uint32_t*)(0x42D8029CUL))
#define bFM4_I2S0_MCR2REG_S1CH07                  *((volatile uint32_t*)(0x42D8029CUL))
#define bFM_I2S0_MCR2REG_S1CH08                   *((volatile uint32_t*)(0x42D802A0UL))
#define bFM4_I2S0_MCR2REG_S1CH08                  *((volatile uint32_t*)(0x42D802A0UL))
#define bFM_I2S0_MCR2REG_S1CH09                   *((volatile uint32_t*)(0x42D802A4UL))
#define bFM4_I2S0_MCR2REG_S1CH09                  *((volatile uint32_t*)(0x42D802A4UL))
#define bFM_I2S0_MCR2REG_S1CH10                   *((volatile uint32_t*)(0x42D802A8UL))
#define bFM4_I2S0_MCR2REG_S1CH10                  *((volatile uint32_t*)(0x42D802A8UL))
#define bFM_I2S0_MCR2REG_S1CH11                   *((volatile uint32_t*)(0x42D802ACUL))
#define bFM4_I2S0_MCR2REG_S1CH11                  *((volatile uint32_t*)(0x42D802ACUL))
#define bFM_I2S0_MCR2REG_S1CH12                   *((volatile uint32_t*)(0x42D802B0UL))
#define bFM4_I2S0_MCR2REG_S1CH12                  *((volatile uint32_t*)(0x42D802B0UL))
#define bFM_I2S0_MCR2REG_S1CH13                   *((volatile uint32_t*)(0x42D802B4UL))
#define bFM4_I2S0_MCR2REG_S1CH13                  *((volatile uint32_t*)(0x42D802B4UL))
#define bFM_I2S0_MCR2REG_S1CH14                   *((volatile uint32_t*)(0x42D802B8UL))
#define bFM4_I2S0_MCR2REG_S1CH14                  *((volatile uint32_t*)(0x42D802B8UL))
#define bFM_I2S0_MCR2REG_S1CH15                   *((volatile uint32_t*)(0x42D802BCUL))
#define bFM4_I2S0_MCR2REG_S1CH15                  *((volatile uint32_t*)(0x42D802BCUL))
#define bFM_I2S0_MCR2REG_S1CH16                   *((volatile uint32_t*)(0x42D802C0UL))
#define bFM4_I2S0_MCR2REG_S1CH16                  *((volatile uint32_t*)(0x42D802C0UL))
#define bFM_I2S0_MCR2REG_S1CH17                   *((volatile uint32_t*)(0x42D802C4UL))
#define bFM4_I2S0_MCR2REG_S1CH17                  *((volatile uint32_t*)(0x42D802C4UL))
#define bFM_I2S0_MCR2REG_S1CH18                   *((volatile uint32_t*)(0x42D802C8UL))
#define bFM4_I2S0_MCR2REG_S1CH18                  *((volatile uint32_t*)(0x42D802C8UL))
#define bFM_I2S0_MCR2REG_S1CH19                   *((volatile uint32_t*)(0x42D802CCUL))
#define bFM4_I2S0_MCR2REG_S1CH19                  *((volatile uint32_t*)(0x42D802CCUL))
#define bFM_I2S0_MCR2REG_S1CH20                   *((volatile uint32_t*)(0x42D802D0UL))
#define bFM4_I2S0_MCR2REG_S1CH20                  *((volatile uint32_t*)(0x42D802D0UL))
#define bFM_I2S0_MCR2REG_S1CH21                   *((volatile uint32_t*)(0x42D802D4UL))
#define bFM4_I2S0_MCR2REG_S1CH21                  *((volatile uint32_t*)(0x42D802D4UL))
#define bFM_I2S0_MCR2REG_S1CH22                   *((volatile uint32_t*)(0x42D802D8UL))
#define bFM4_I2S0_MCR2REG_S1CH22                  *((volatile uint32_t*)(0x42D802D8UL))
#define bFM_I2S0_MCR2REG_S1CH23                   *((volatile uint32_t*)(0x42D802DCUL))
#define bFM4_I2S0_MCR2REG_S1CH23                  *((volatile uint32_t*)(0x42D802DCUL))
#define bFM_I2S0_MCR2REG_S1CH24                   *((volatile uint32_t*)(0x42D802E0UL))
#define bFM4_I2S0_MCR2REG_S1CH24                  *((volatile uint32_t*)(0x42D802E0UL))
#define bFM_I2S0_MCR2REG_S1CH25                   *((volatile uint32_t*)(0x42D802E4UL))
#define bFM4_I2S0_MCR2REG_S1CH25                  *((volatile uint32_t*)(0x42D802E4UL))
#define bFM_I2S0_MCR2REG_S1CH26                   *((volatile uint32_t*)(0x42D802E8UL))
#define bFM4_I2S0_MCR2REG_S1CH26                  *((volatile uint32_t*)(0x42D802E8UL))
#define bFM_I2S0_MCR2REG_S1CH27                   *((volatile uint32_t*)(0x42D802ECUL))
#define bFM4_I2S0_MCR2REG_S1CH27                  *((volatile uint32_t*)(0x42D802ECUL))
#define bFM_I2S0_MCR2REG_S1CH28                   *((volatile uint32_t*)(0x42D802F0UL))
#define bFM4_I2S0_MCR2REG_S1CH28                  *((volatile uint32_t*)(0x42D802F0UL))
#define bFM_I2S0_MCR2REG_S1CH29                   *((volatile uint32_t*)(0x42D802F4UL))
#define bFM4_I2S0_MCR2REG_S1CH29                  *((volatile uint32_t*)(0x42D802F4UL))
#define bFM_I2S0_MCR2REG_S1CH30                   *((volatile uint32_t*)(0x42D802F8UL))
#define bFM4_I2S0_MCR2REG_S1CH30                  *((volatile uint32_t*)(0x42D802F8UL))
#define bFM_I2S0_MCR2REG_S1CH31                   *((volatile uint32_t*)(0x42D802FCUL))
#define bFM4_I2S0_MCR2REG_S1CH31                  *((volatile uint32_t*)(0x42D802FCUL))

#define bFM_I2S0_OPRREG_START                     *((volatile uint32_t*)(0x42D80300UL))
#define bFM4_I2S0_OPRREG_START                    *((volatile uint32_t*)(0x42D80300UL))
#define bFM_I2S0_OPRREG_TXENB                     *((volatile uint32_t*)(0x42D80340UL))
#define bFM4_I2S0_OPRREG_TXENB                    *((volatile uint32_t*)(0x42D80340UL))
#define bFM_I2S0_OPRREG_RXENB                     *((volatile uint32_t*)(0x42D80360UL))
#define bFM4_I2S0_OPRREG_RXENB                    *((volatile uint32_t*)(0x42D80360UL))

#define bFM_I2S0_SRST_SRST                        *((volatile uint32_t*)(0x42D80380UL))
#define bFM4_I2S0_SRST_SRST                       *((volatile uint32_t*)(0x42D80380UL))

