neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_I2S0_STATUS_RXFI                      *((volatile uint32_t*)(0x42D804C0UL))
#define bFM4_I2S0_STATUS_RXFI                     *((volatile uint32_t*)(0x42D804C0UL))
#define bFM_I2S0_STATUS_TXFI                      *((volatile uint32_t*)(0x42D804C4UL))
#define bFM4_I2S0_STATUS_TXFI                     *((volatile uint32_t*)(0x42D804C4UL))
#define bFM_I2S0_STATUS_BSY                       *((volatile uint32_t*)(0x42D804C8UL))
#define bFM4_I2S0_STATUS_BSY                      *((volatile uint32_t*)(0x42D804C8UL))
#define bFM_I2S0_STATUS_EOPI                      *((volatile uint32_t*)(0x42D804CCUL))
#define bFM4_I2S0_STATUS_EOPI                     *((volatile uint32_t*)(0x42D804CCUL))
#define bFM_I2S0_STATUS_RXOVR                     *((volatile uint32_t*)(0x42D804E0UL))
#define bFM4_I2S0_STATUS_RXOVR                    *((volatile uint32_t*)(0x42D804E0UL))
#define bFM_I2S0_STATUS_RXUDR                     *((volatile uint32_t*)(0x42D804E4UL))
#define bFM4_I2S0_STATUS_RXUDR                    *((volatile uint32_t*)(0x42D804E4UL))
#define bFM_I2S0_STATUS_TXOVR                     *((volatile uint32_t*)(0x42D804E8UL))
#define bFM4_I2S0_STATUS_TXOVR                    *((volatile uint32_t*)(0x42D804E8UL))
#define bFM_I2S0_STATUS_TXUDR0                    *((volatile uint32_t*)(0x42D804ECUL))
#define bFM4_I2S0_STATUS_TXUDR0                   *((volatile uint32_t*)(0x42D804ECUL))
#define bFM_I2S0_STATUS_TXUDR1                    *((volatile uint32_t*)(0x42D804F0UL))
#define bFM4_I2S0_STATUS_TXUDR1                   *((volatile uint32_t*)(0x42D804F0UL))
#define bFM_I2S0_STATUS_FERR                      *((volatile uint32_t*)(0x42D804F4UL))
#define bFM4_I2S0_STATUS_FERR                     *((volatile uint32_t*)(0x42D804F4UL))
#define bFM_I2S0_STATUS_RBERR                     *((volatile uint32_t*)(0x42D804F8UL))
#define bFM4_I2S0_STATUS_RBERR                    *((volatile uint32_t*)(0x42D804F8UL))
#define bFM_I2S0_STATUS_TBERR                     *((volatile uint32_t*)(0x42D804FCUL))
#define bFM4_I2S0_STATUS_TBERR                    *((volatile uint32_t*)(0x42D804FCUL))

#define bFM_I2S0_TSTREG_LBMD                      *((volatile uint32_t*)(0x42D80580UL))
#define bFM4_I2S0_TSTREG_LBMD                     *((volatile uint32_t*)(0x42D80580UL))


/******************************************************************************
 ** I2SPRE Registers I2SPRE
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_I2SPRE_ICCR_I2SEN                     *((volatile uint32_t*)(0x427A0000UL))
#define bFM4_I2SPRE_ICCR_I2SEN                    *((volatile uint32_t*)(0x427A0000UL))
#define bFM_I2SPRE_ICCR_ICSEL                     *((volatile uint32_t*)(0x427A0004UL))
#define bFM4_I2SPRE_ICCR_ICSEL                    *((volatile uint32_t*)(0x427A0004UL))

#define bFM_I2SPRE_IP_STR_IPRDY                   *((volatile uint32_t*)(0x427A0280UL))
#define bFM4_I2SPRE_IP_STR_IPRDY                  *((volatile uint32_t*)(0x427A0280UL))

#define bFM_I2SPRE_IPCR1_IPLLEN                   *((volatile uint32_t*)(0x427A0080UL))
#define bFM4_I2SPRE_IPCR1_IPLLEN                  *((volatile uint32_t*)(0x427A0080UL))

#define bFM_I2SPRE_IPINT_CLR_IPCSC                *((volatile uint32_t*)(0x427A0380UL))
#define bFM4_I2SPRE_IPINT_CLR_IPCSC               *((volatile uint32_t*)(0x427A0380UL))

#define bFM_I2SPRE_IPINT_ENR_IPCSE                *((volatile uint32_t*)(0x427A0300UL))
#define bFM4_I2SPRE_IPINT_ENR_IPCSE               *((volatile uint32_t*)(0x427A0300UL))

#define bFM_I2SPRE_IPINT_STR_IPCSI                *((volatile uint32_t*)(0x427A0400UL))
#define bFM4_I2SPRE_IPINT_STR_IPCSI               *((volatile uint32_t*)(0x427A0400UL))


/******************************************************************************
 ** INTREQ Registers INTREQ
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_INTREQ_DRQSEL_USBEP1                  *((volatile uint32_t*)(0x42620000UL))
#define bFM4_INTREQ_DRQSEL_USBEP1                 *((volatile uint32_t*)(0x42620000UL))
#define bFM_INTREQ_DRQSEL_USBEP2                  *((volatile uint32_t*)(0x42620004UL))
#define bFM4_INTREQ_DRQSEL_USBEP2                 *((volatile uint32_t*)(0x42620004UL))
#define bFM_INTREQ_DRQSEL_USBEP3                  *((volatile uint32_t*)(0x42620008UL))
#define bFM4_INTREQ_DRQSEL_USBEP3                 *((volatile uint32_t*)(0x42620008UL))
#define bFM_INTREQ_DRQSEL_USBEP4                  *((volatile uint32_t*)(0x4262000CUL))
#define bFM4_INTREQ_DRQSEL_USBEP4                 *((volatile uint32_t*)(0x4262000CUL))
#define bFM_INTREQ_DRQSEL_USBEP5                  *((volatile uint32_t*)(0x42620010UL))
#define bFM4_INTREQ_DRQSEL_USBEP5                 *((volatile uint32_t*)(0x42620010UL))
#define bFM_INTREQ_DRQSEL_ADCSCAN0                *((volatile uint32_t*)(0x42620014UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN0               *((volatile uint32_t*)(0x42620014UL))
#define bFM_INTREQ_DRQSEL_ADCSCAN1                *((volatile uint32_t*)(0x42620018UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN1               *((volatile uint32_t*)(0x42620018UL))
#define bFM_INTREQ_DRQSEL_ADCSCAN2                *((volatile uint32_t*)(0x4262001CUL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN2               *((volatile uint32_t*)(0x4262001CUL))
#define bFM_INTREQ_DRQSEL_IRQ0BT0                 *((volatile uint32_t*)(0x42620020UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT0                *((volatile uint32_t*)(0x42620020UL))
#define bFM_INTREQ_DRQSEL_IRQ0BT2                 *((volatile uint32_t*)(0x42620024UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT2                *((volatile uint32_t*)(0x42620024UL))
#define bFM_INTREQ_DRQSEL_IRQ0BT4                 *((volatile uint32_t*)(0x42620028UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT4                *((volatile uint32_t*)(0x42620028UL))
#define bFM_INTREQ_DRQSEL_IRQ0BT6                 *((volatile uint32_t*)(0x4262002CUL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT6                *((volatile uint32_t*)(0x4262002CUL))
#define bFM_INTREQ_DRQSEL_MFS0RX                  *((volatile uint32_t*)(0x42620030UL))
#define bFM4_INTREQ_DRQSEL_MFS0RX                 *((volatile uint32_t*)(0x42620030UL))
#define bFM_INTREQ_DRQSEL_MFS0TX                  *((volatile uint32_t*)(0x42620034UL))
#define bFM4_INTREQ_DRQSEL_MFS0TX                 *((volatile uint32_t*)(0x42620034UL))
#define bFM_INTREQ_DRQSEL_MFS1RX                  *((volatile uint32_t*)(0x42620038UL))
#define bFM4_INTREQ_DRQSEL_MFS1RX                 *((volatile uint32_t*)(0x42620038UL))
#define bFM_INTREQ_DRQSEL_MFS1TX                  *((volatile uint32_t*)(0x4262003CUL))
#define bFM4_INTREQ_DRQSEL_MFS1TX                 *((volatile uint32_t*)(0x4262003CUL))
#define bFM_INTREQ_DRQSEL_MFS2RX                  *((volatile uint32_t*)(0x42620040UL))
#define bFM4_INTREQ_DRQSEL_MFS2RX                 *((volatile uint32_t*)(0x42620040UL))
#define bFM_INTREQ_DRQSEL_MFS2TX                  *((volatile uint32_t*)(0x42620044UL))
#define bFM4_INTREQ_DRQSEL_MFS2TX                 *((volatile uint32_t*)(0x42620044UL))
#define bFM_INTREQ_DRQSEL_MFS3RX                  *((volatile uint32_t*)(0x42620048UL))
#define bFM4_INTREQ_DRQSEL_MFS3RX                 *((volatile uint32_t*)(0x42620048UL))
#define bFM_INTREQ_DRQSEL_MFS3TX                  *((volatile uint32_t*)(0x4262004CUL))
#define bFM4_INTREQ_DRQSEL_MFS3TX                 *((volatile uint32_t*)(0x4262004CUL))
#define bFM_INTREQ_DRQSEL_MFS4RX                  *((volatile uint32_t*)(0x42620050UL))
#define bFM4_INTREQ_DRQSEL_MFS4RX                 *((volatile uint32_t*)(0x42620050UL))
#define bFM_INTREQ_DRQSEL_MFS4TX                  *((volatile uint32_t*)(0x42620054UL))
#define bFM4_INTREQ_DRQSEL_MFS4TX                 *((volatile uint32_t*)(0x42620054UL))
#define bFM_INTREQ_DRQSEL_MFS5RX                  *((volatile uint32_t*)(0x42620058UL))
#define bFM4_INTREQ_DRQSEL_MFS5RX                 *((volatile uint32_t*)(0x42620058UL))
#define bFM_INTREQ_DRQSEL_MFS5TX                  *((volatile uint32_t*)(0x4262005CUL))
#define bFM4_INTREQ_DRQSEL_MFS5TX                 *((volatile uint32_t*)(0x4262005CUL))
#define bFM_INTREQ_DRQSEL_MFS6RX                  *((volatile uint32_t*)(0x42620060UL))
#define bFM4_INTREQ_DRQSEL_MFS6RX                 *((volatile uint32_t*)(0x42620060UL))
#define bFM_INTREQ_DRQSEL_MFS6TX                  *((volatile uint32_t*)(0x42620064UL))
#define bFM4_INTREQ_DRQSEL_MFS6TX                 *((volatile uint32_t*)(0x42620064UL))
#define bFM_INTREQ_DRQSEL_MFS7RX                  *((volatile uint32_t*)(0x42620068UL))
#define bFM4_INTREQ_DRQSEL_MFS7RX                 *((volatile uint32_t*)(0x42620068UL))
#define bFM_INTREQ_DRQSEL_MFS7TX                  *((volatile uint32_t*)(0x4262006CUL))
#define bFM4_INTREQ_DRQSEL_MFS7TX                 *((volatile uint32_t*)(0x4262006CUL))
#define bFM_INTREQ_DRQSEL_EXINT0                  *((volatile uint32_t*)(0x42620070UL))
#define bFM4_INTREQ_DRQSEL_EXINT0                 *((volatile uint32_t*)(0x42620070UL))
#define bFM_INTREQ_DRQSEL_EXINT1                  *((volatile uint32_t*)(0x42620074UL))
#define bFM4_INTREQ_DRQSEL_EXINT1                 *((volatile uint32_t*)(0x42620074UL))
#define bFM_INTREQ_DRQSEL_EXINT2                  *((volatile uint32_t*)(0x42620078UL))
#define bFM4_INTREQ_DRQSEL_EXINT2                 *((volatile uint32_t*)(0x42620078UL))
#define bFM_INTREQ_DRQSEL_EXINT3                  *((volatile uint32_t*)(0x4262007CUL))
#define bFM4_INTREQ_DRQSEL_EXINT3                 *((volatile uint32_t*)(0x4262007CUL))

#define bFM_INTREQ_EXC02MON_NMI                   *((volatile uint32_t*)(0x42624000UL))
#define bFM4_INTREQ_EXC02MON_NMI                  *((volatile uint32_t*)(0x42624000UL))
#define bFM_INTREQ_EXC02MON_HWINT                 *((volatile uint32_t*)(0x42624004UL))
#define bFM4_INTREQ_EXC02MON_HWINT                *((volatile uint32_t*)(0x42624004UL))

#define bFM_INTREQ_IRQ000MON_FCSINT               *((volatile uint32_t*)(0x42624080UL))
#define bFM4_INTREQ_IRQ000MON_FCSINT              *((volatile uint32_t*)(0x42624080UL))

#define bFM_INTREQ_IRQ001MON_SWWDTINT             *((volatile uint32_t*)(0x42624100UL))
#define bFM4_INTREQ_IRQ001MON_SWWDTINT            *((volatile uint32_t*)(0x42624100UL))

#define bFM_INTREQ_IRQ002MON_LVDINT               *((volatile uint32_t*)(0x42624180UL))
#define bFM4_INTREQ_IRQ002MON_LVDINT              *((volatile uint32_t*)(0x42624180UL))

#define bFM_INTREQ_IRQ003MON_IRQBIT0              *((volatile uint32_t*)(0x42624200UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT0             *((volatile uint32_t*)(0x42624200UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT1              *((volatile uint32_t*)(0x42624204UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT1             *((volatile uint32_t*)(0x42624204UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT2              *((volatile uint32_t*)(0x42624208UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT2             *((volatile uint32_t*)(0x42624208UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT3              *((volatile uint32_t*)(0x4262420CUL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT3             *((volatile uint32_t*)(0x4262420CUL))
#define bFM_INTREQ_IRQ003MON_IRQBIT4              *((volatile uint32_t*)(0x42624210UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT4             *((volatile uint32_t*)(0x42624210UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT5              *((volatile uint32_t*)(0x42624214UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT5             *((volatile uint32_t*)(0x42624214UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT6              *((volatile uint32_t*)(0x42624218UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT6             *((volatile uint32_t*)(0x42624218UL))
#define bFM_INTREQ_IRQ003MON_IRQBIT7              *((volatile uint32_t*)(0x4262421CUL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT7             *((volatile uint32_t*)(0x4262421CUL))

#define bFM_INTREQ_IRQ003SEL_SELBIT0              *((volatile uint32_t*)(0x42622240UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT0             *((volatile uint32_t*)(0x42622240UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT1              *((volatile uint32_t*)(0x42622244UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT1             *((volatile uint32_t*)(0x42622244UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT2              *((volatile uint32_t*)(0x42622248UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT2             *((volatile uint32_t*)(0x42622248UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT3              *((volatile uint32_t*)(0x4262224CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT3             *((volatile uint32_t*)(0x4262224CUL))
#define bFM_INTREQ_IRQ003SEL_SELBIT4              *((volatile uint32_t*)(0x42622250UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT4             *((volatile uint32_t*)(0x42622250UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT5              *((volatile uint32_t*)(0x42622254UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT5             *((volatile uint32_t*)(0x42622254UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT6              *((volatile uint32_t*)(0x42622258UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT6             *((volatile uint32_t*)(0x42622258UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT7              *((volatile uint32_t*)(0x4262225CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT7             *((volatile uint32_t*)(0x4262225CUL))
#define bFM_INTREQ_IRQ003SEL_SELBIT8              *((volatile uint32_t*)(0x42622260UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT8             *((volatile uint32_t*)(0x42622260UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT9              *((volatile uint32_t*)(0x42622264UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT9             *((volatile uint32_t*)(0x42622264UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT10             *((volatile uint32_t*)(0x42622268UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT10            *((volatile uint32_t*)(0x42622268UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT11             *((volatile uint32_t*)(0x4262226CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT11            *((volatile uint32_t*)(0x4262226CUL))
#define bFM_INTREQ_IRQ003SEL_SELBIT12             *((volatile uint32_t*)(0x42622270UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT12            *((volatile uint32_t*)(0x42622270UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT13             *((volatile uint32_t*)(0x42622274UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT13            *((volatile uint32_t*)(0x42622274UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT14             *((volatile uint32_t*)(0x42622278UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT14            *((volatile uint32_t*)(0x42622278UL))
#define bFM_INTREQ_IRQ003SEL_SELBIT15             *((volatile uint32_t*)(0x4262227CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT15            *((volatile uint32_t*)(0x4262227CUL))

#define bFM_INTREQ_IRQ004MON_IRQBIT0              *((volatile uint32_t*)(0x42624280UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT0             *((volatile uint32_t*)(0x42624280UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT1              *((volatile uint32_t*)(0x42624284UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT1             *((volatile uint32_t*)(0x42624284UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT2              *((volatile uint32_t*)(0x42624288UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT2             *((volatile uint32_t*)(0x42624288UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT3              *((volatile uint32_t*)(0x4262428CUL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT3             *((volatile uint32_t*)(0x4262428CUL))
#define bFM_INTREQ_IRQ004MON_IRQBIT4              *((volatile uint32_t*)(0x42624290UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT4             *((volatile uint32_t*)(0x42624290UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT5              *((volatile uint32_t*)(0x42624294UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT5             *((volatile uint32_t*)(0x42624294UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT6              *((volatile uint32_t*)(0x42624298UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT6             *((volatile uint32_t*)(0x42624298UL))
#define bFM_INTREQ_IRQ004MON_IRQBIT7              *((volatile uint32_t*)(0x4262429CUL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT7             *((volatile uint32_t*)(0x4262429CUL))

#define bFM_INTREQ_IRQ004SEL_SELBIT0              *((volatile uint32_t*)(0x426222C0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT0             *((volatile uint32_t*)(0x426222C0UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT1              *((volatile uint32_t*)(0x426222C4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT1             *((volatile uint32_t*)(0x426222C4UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT2              *((volatile uint32_t*)(0x426222C8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT2             *((volatile uint32_t*)(0x426222C8UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT3              *((volatile uint32_t*)(0x426222CCUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT3             *((volatile uint32_t*)(0x426222CCUL))
#define bFM_INTREQ_IRQ004SEL_SELBIT4              *((volatile uint32_t*)(0x426222D0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT4             *((volatile uint32_t*)(0x426222D0UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT5              *((volatile uint32_t*)(0x426222D4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT5             *((volatile uint32_t*)(0x426222D4UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT6              *((volatile uint32_t*)(0x426222D8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT6             *((volatile uint32_t*)(0x426222D8UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT7              *((volatile uint32_t*)(0x426222DCUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT7             *((volatile uint32_t*)(0x426222DCUL))
#define bFM_INTREQ_IRQ004SEL_SELBIT8              *((volatile uint32_t*)(0x426222E0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT8             *((volatile uint32_t*)(0x426222E0UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT9              *((volatile uint32_t*)(0x426222E4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT9             *((volatile uint32_t*)(0x426222E4UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT10             *((volatile uint32_t*)(0x426222E8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT10            *((volatile uint32_t*)(0x426222E8UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT11             *((volatile uint32_t*)(0x426222ECUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT11            *((volatile uint32_t*)(0x426222ECUL))
#define bFM_INTREQ_IRQ004SEL_SELBIT12             *((volatile uint32_t*)(0x426222F0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT12            *((volatile uint32_t*)(0x426222F0UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT13             *((volatile uint32_t*)(0x426222F4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT13            *((volatile uint32_t*)(0x426222F4UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT14             *((volatile uint32_t*)(0x426222F8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT14            *((volatile uint32_t*)(0x426222F8UL))
#define bFM_INTREQ_IRQ004SEL_SELBIT15             *((volatile uint32_t*)(0x426222FCUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT15            *((volatile uint32_t*)(0x426222FCUL))

#define bFM_INTREQ_IRQ005MON_IRQBIT0              *((volatile uint32_t*)(0x42624300UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT0             *((volatile uint32_t*)(0x42624300UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT1              *((volatile uint32_t*)(0x42624304UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT1             *((volatile uint32_t*)(0x42624304UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT2              *((volatile uint32_t*)(0x42624308UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT2             *((volatile uint32_t*)(0x42624308UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT3              *((volatile uint32_t*)(0x4262430CUL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT3             *((volatile uint32_t*)(0x4262430CUL))
#define bFM_INTREQ_IRQ005MON_IRQBIT4              *((volatile uint32_t*)(0x42624310UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT4             *((volatile uint32_t*)(0x42624310UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT5              *((volatile uint32_t*)(0x42624314UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT5             *((volatile uint32_t*)(0x42624314UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT6              *((volatile uint32_t*)(0x42624318UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT6             *((volatile uint32_t*)(0x42624318UL))
#define bFM_INTREQ_IRQ005MON_IRQBIT7              *((volatile uint32_t*)(0x4262431CUL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT7             *((volatile uint32_t*)(0x4262431CUL))

#define bFM_INTREQ_IRQ005SEL_SELBIT0              *((volatile uint32_t*)(0x42622340UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT0             *((volatile uint32_t*)(0x42622340UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT1              *((volatile uint32_t*)(0x42622344UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT1             *((volatile uint32_t*)(0x42622344UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT2              *((volatile uint32_t*)(0x42622348UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT2             *((volatile uint32_t*)(0x42622348UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT3              *((volatile uint32_t*)(0x4262234CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT3             *((volatile uint32_t*)(0x4262234CUL))
#define bFM_INTREQ_IRQ005SEL_SELBIT4              *((volatile uint32_t*)(0x42622350UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT4             *((volatile uint32_t*)(0x42622350UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT5              *((volatile uint32_t*)(0x42622354UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT5             *((volatile uint32_t*)(0x42622354UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT6              *((volatile uint32_t*)(0x42622358UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT6             *((volatile uint32_t*)(0x42622358UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT7              *((volatile uint32_t*)(0x4262235CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT7             *((volatile uint32_t*)(0x4262235CUL))
#define bFM_INTREQ_IRQ005SEL_SELBIT8              *((volatile uint32_t*)(0x42622360UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT8             *((volatile uint32_t*)(0x42622360UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT9              *((volatile uint32_t*)(0x42622364UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT9             *((volatile uint32_t*)(0x42622364UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT10             *((volatile uint32_t*)(0x42622368UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT10            *((volatile uint32_t*)(0x42622368UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT11             *((volatile uint32_t*)(0x4262236CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT11            *((volatile uint32_t*)(0x4262236CUL))
#define bFM_INTREQ_IRQ005SEL_SELBIT12             *((volatile uint32_t*)(0x42622370UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT12            *((volatile uint32_t*)(0x42622370UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT13             *((volatile uint32_t*)(0x42622374UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT13            *((volatile uint32_t*)(0x42622374UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT14             *((volatile uint32_t*)(0x42622378UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT14            *((volatile uint32_t*)(0x42622378UL))
#define bFM_INTREQ_IRQ005SEL_SELBIT15             *((volatile uint32_t*)(0x4262237CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT15            *((volatile uint32_t*)(0x4262237CUL))

