neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_INTREQ_IRQ006MON_IRQBIT0              *((volatile uint32_t*)(0x42624380UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT0             *((volatile uint32_t*)(0x42624380UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT1              *((volatile uint32_t*)(0x42624384UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT1             *((volatile uint32_t*)(0x42624384UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT2              *((volatile uint32_t*)(0x42624388UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT2             *((volatile uint32_t*)(0x42624388UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT3              *((volatile uint32_t*)(0x4262438CUL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT3             *((volatile uint32_t*)(0x4262438CUL))
#define bFM_INTREQ_IRQ006MON_IRQBIT4              *((volatile uint32_t*)(0x42624390UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT4             *((volatile uint32_t*)(0x42624390UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT5              *((volatile uint32_t*)(0x42624394UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT5             *((volatile uint32_t*)(0x42624394UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT6              *((volatile uint32_t*)(0x42624398UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT6             *((volatile uint32_t*)(0x42624398UL))
#define bFM_INTREQ_IRQ006MON_IRQBIT7              *((volatile uint32_t*)(0x4262439CUL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT7             *((volatile uint32_t*)(0x4262439CUL))

#define bFM_INTREQ_IRQ006SEL_SELBIT0              *((volatile uint32_t*)(0x426223C0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT0             *((volatile uint32_t*)(0x426223C0UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT1              *((volatile uint32_t*)(0x426223C4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT1             *((volatile uint32_t*)(0x426223C4UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT2              *((volatile uint32_t*)(0x426223C8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT2             *((volatile uint32_t*)(0x426223C8UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT3              *((volatile uint32_t*)(0x426223CCUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT3             *((volatile uint32_t*)(0x426223CCUL))
#define bFM_INTREQ_IRQ006SEL_SELBIT4              *((volatile uint32_t*)(0x426223D0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT4             *((volatile uint32_t*)(0x426223D0UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT5              *((volatile uint32_t*)(0x426223D4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT5             *((volatile uint32_t*)(0x426223D4UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT6              *((volatile uint32_t*)(0x426223D8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT6             *((volatile uint32_t*)(0x426223D8UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT7              *((volatile uint32_t*)(0x426223DCUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT7             *((volatile uint32_t*)(0x426223DCUL))
#define bFM_INTREQ_IRQ006SEL_SELBIT8              *((volatile uint32_t*)(0x426223E0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT8             *((volatile uint32_t*)(0x426223E0UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT9              *((volatile uint32_t*)(0x426223E4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT9             *((volatile uint32_t*)(0x426223E4UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT10             *((volatile uint32_t*)(0x426223E8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT10            *((volatile uint32_t*)(0x426223E8UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT11             *((volatile uint32_t*)(0x426223ECUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT11            *((volatile uint32_t*)(0x426223ECUL))
#define bFM_INTREQ_IRQ006SEL_SELBIT12             *((volatile uint32_t*)(0x426223F0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT12            *((volatile uint32_t*)(0x426223F0UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT13             *((volatile uint32_t*)(0x426223F4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT13            *((volatile uint32_t*)(0x426223F4UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT14             *((volatile uint32_t*)(0x426223F8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT14            *((volatile uint32_t*)(0x426223F8UL))
#define bFM_INTREQ_IRQ006SEL_SELBIT15             *((volatile uint32_t*)(0x426223FCUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT15            *((volatile uint32_t*)(0x426223FCUL))

#define bFM_INTREQ_IRQ007MON_IRQBIT0              *((volatile uint32_t*)(0x42624400UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT0             *((volatile uint32_t*)(0x42624400UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT1              *((volatile uint32_t*)(0x42624404UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT1             *((volatile uint32_t*)(0x42624404UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT2              *((volatile uint32_t*)(0x42624408UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT2             *((volatile uint32_t*)(0x42624408UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT3              *((volatile uint32_t*)(0x4262440CUL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT3             *((volatile uint32_t*)(0x4262440CUL))
#define bFM_INTREQ_IRQ007MON_IRQBIT4              *((volatile uint32_t*)(0x42624410UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT4             *((volatile uint32_t*)(0x42624410UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT5              *((volatile uint32_t*)(0x42624414UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT5             *((volatile uint32_t*)(0x42624414UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT6              *((volatile uint32_t*)(0x42624418UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT6             *((volatile uint32_t*)(0x42624418UL))
#define bFM_INTREQ_IRQ007MON_IRQBIT7              *((volatile uint32_t*)(0x4262441CUL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT7             *((volatile uint32_t*)(0x4262441CUL))

#define bFM_INTREQ_IRQ007SEL_SELBIT0              *((volatile uint32_t*)(0x42622440UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT0             *((volatile uint32_t*)(0x42622440UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT1              *((volatile uint32_t*)(0x42622444UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT1             *((volatile uint32_t*)(0x42622444UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT2              *((volatile uint32_t*)(0x42622448UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT2             *((volatile uint32_t*)(0x42622448UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT3              *((volatile uint32_t*)(0x4262244CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT3             *((volatile uint32_t*)(0x4262244CUL))
#define bFM_INTREQ_IRQ007SEL_SELBIT4              *((volatile uint32_t*)(0x42622450UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT4             *((volatile uint32_t*)(0x42622450UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT5              *((volatile uint32_t*)(0x42622454UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT5             *((volatile uint32_t*)(0x42622454UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT6              *((volatile uint32_t*)(0x42622458UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT6             *((volatile uint32_t*)(0x42622458UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT7              *((volatile uint32_t*)(0x4262245CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT7             *((volatile uint32_t*)(0x4262245CUL))
#define bFM_INTREQ_IRQ007SEL_SELBIT8              *((volatile uint32_t*)(0x42622460UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT8             *((volatile uint32_t*)(0x42622460UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT9              *((volatile uint32_t*)(0x42622464UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT9             *((volatile uint32_t*)(0x42622464UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT10             *((volatile uint32_t*)(0x42622468UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT10            *((volatile uint32_t*)(0x42622468UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT11             *((volatile uint32_t*)(0x4262246CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT11            *((volatile uint32_t*)(0x4262246CUL))
#define bFM_INTREQ_IRQ007SEL_SELBIT12             *((volatile uint32_t*)(0x42622470UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT12            *((volatile uint32_t*)(0x42622470UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT13             *((volatile uint32_t*)(0x42622474UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT13            *((volatile uint32_t*)(0x42622474UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT14             *((volatile uint32_t*)(0x42622478UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT14            *((volatile uint32_t*)(0x42622478UL))
#define bFM_INTREQ_IRQ007SEL_SELBIT15             *((volatile uint32_t*)(0x4262247CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT15            *((volatile uint32_t*)(0x4262247CUL))

#define bFM_INTREQ_IRQ008MON_IRQBIT0              *((volatile uint32_t*)(0x42624480UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT0             *((volatile uint32_t*)(0x42624480UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT1              *((volatile uint32_t*)(0x42624484UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT1             *((volatile uint32_t*)(0x42624484UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT2              *((volatile uint32_t*)(0x42624488UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT2             *((volatile uint32_t*)(0x42624488UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT3              *((volatile uint32_t*)(0x4262448CUL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT3             *((volatile uint32_t*)(0x4262448CUL))
#define bFM_INTREQ_IRQ008MON_IRQBIT4              *((volatile uint32_t*)(0x42624490UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT4             *((volatile uint32_t*)(0x42624490UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT5              *((volatile uint32_t*)(0x42624494UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT5             *((volatile uint32_t*)(0x42624494UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT6              *((volatile uint32_t*)(0x42624498UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT6             *((volatile uint32_t*)(0x42624498UL))
#define bFM_INTREQ_IRQ008MON_IRQBIT7              *((volatile uint32_t*)(0x4262449CUL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT7             *((volatile uint32_t*)(0x4262449CUL))

#define bFM_INTREQ_IRQ008SEL_SELBIT0              *((volatile uint32_t*)(0x426224C0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT0             *((volatile uint32_t*)(0x426224C0UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT1              *((volatile uint32_t*)(0x426224C4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT1             *((volatile uint32_t*)(0x426224C4UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT2              *((volatile uint32_t*)(0x426224C8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT2             *((volatile uint32_t*)(0x426224C8UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT3              *((volatile uint32_t*)(0x426224CCUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT3             *((volatile uint32_t*)(0x426224CCUL))
#define bFM_INTREQ_IRQ008SEL_SELBIT4              *((volatile uint32_t*)(0x426224D0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT4             *((volatile uint32_t*)(0x426224D0UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT5              *((volatile uint32_t*)(0x426224D4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT5             *((volatile uint32_t*)(0x426224D4UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT6              *((volatile uint32_t*)(0x426224D8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT6             *((volatile uint32_t*)(0x426224D8UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT7              *((volatile uint32_t*)(0x426224DCUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT7             *((volatile uint32_t*)(0x426224DCUL))
#define bFM_INTREQ_IRQ008SEL_SELBIT8              *((volatile uint32_t*)(0x426224E0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT8             *((volatile uint32_t*)(0x426224E0UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT9              *((volatile uint32_t*)(0x426224E4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT9             *((volatile uint32_t*)(0x426224E4UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT10             *((volatile uint32_t*)(0x426224E8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT10            *((volatile uint32_t*)(0x426224E8UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT11             *((volatile uint32_t*)(0x426224ECUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT11            *((volatile uint32_t*)(0x426224ECUL))
#define bFM_INTREQ_IRQ008SEL_SELBIT12             *((volatile uint32_t*)(0x426224F0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT12            *((volatile uint32_t*)(0x426224F0UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT13             *((volatile uint32_t*)(0x426224F4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT13            *((volatile uint32_t*)(0x426224F4UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT14             *((volatile uint32_t*)(0x426224F8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT14            *((volatile uint32_t*)(0x426224F8UL))
#define bFM_INTREQ_IRQ008SEL_SELBIT15             *((volatile uint32_t*)(0x426224FCUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT15            *((volatile uint32_t*)(0x426224FCUL))

#define bFM_INTREQ_IRQ009MON_IRQBIT0              *((volatile uint32_t*)(0x42624500UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT0             *((volatile uint32_t*)(0x42624500UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT1              *((volatile uint32_t*)(0x42624504UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT1             *((volatile uint32_t*)(0x42624504UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT2              *((volatile uint32_t*)(0x42624508UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT2             *((volatile uint32_t*)(0x42624508UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT3              *((volatile uint32_t*)(0x4262450CUL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT3             *((volatile uint32_t*)(0x4262450CUL))
#define bFM_INTREQ_IRQ009MON_IRQBIT4              *((volatile uint32_t*)(0x42624510UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT4             *((volatile uint32_t*)(0x42624510UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT5              *((volatile uint32_t*)(0x42624514UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT5             *((volatile uint32_t*)(0x42624514UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT6              *((volatile uint32_t*)(0x42624518UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT6             *((volatile uint32_t*)(0x42624518UL))
#define bFM_INTREQ_IRQ009MON_IRQBIT7              *((volatile uint32_t*)(0x4262451CUL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT7             *((volatile uint32_t*)(0x4262451CUL))

#define bFM_INTREQ_IRQ009SEL_SELBIT0              *((volatile uint32_t*)(0x42622540UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT0             *((volatile uint32_t*)(0x42622540UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT1              *((volatile uint32_t*)(0x42622544UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT1             *((volatile uint32_t*)(0x42622544UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT2              *((volatile uint32_t*)(0x42622548UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT2             *((volatile uint32_t*)(0x42622548UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT3              *((volatile uint32_t*)(0x4262254CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT3             *((volatile uint32_t*)(0x4262254CUL))
#define bFM_INTREQ_IRQ009SEL_SELBIT4              *((volatile uint32_t*)(0x42622550UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT4             *((volatile uint32_t*)(0x42622550UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT5              *((volatile uint32_t*)(0x42622554UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT5             *((volatile uint32_t*)(0x42622554UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT6              *((volatile uint32_t*)(0x42622558UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT6             *((volatile uint32_t*)(0x42622558UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT7              *((volatile uint32_t*)(0x4262255CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT7             *((volatile uint32_t*)(0x4262255CUL))
#define bFM_INTREQ_IRQ009SEL_SELBIT8              *((volatile uint32_t*)(0x42622560UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT8             *((volatile uint32_t*)(0x42622560UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT9              *((volatile uint32_t*)(0x42622564UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT9             *((volatile uint32_t*)(0x42622564UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT10             *((volatile uint32_t*)(0x42622568UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT10            *((volatile uint32_t*)(0x42622568UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT11             *((volatile uint32_t*)(0x4262256CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT11            *((volatile uint32_t*)(0x4262256CUL))
#define bFM_INTREQ_IRQ009SEL_SELBIT12             *((volatile uint32_t*)(0x42622570UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT12            *((volatile uint32_t*)(0x42622570UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT13             *((volatile uint32_t*)(0x42622574UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT13            *((volatile uint32_t*)(0x42622574UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT14             *((volatile uint32_t*)(0x42622578UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT14            *((volatile uint32_t*)(0x42622578UL))
#define bFM_INTREQ_IRQ009SEL_SELBIT15             *((volatile uint32_t*)(0x4262257CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT15            *((volatile uint32_t*)(0x4262257CUL))

#define bFM_INTREQ_IRQ010MON_IRQBIT0              *((volatile uint32_t*)(0x42624580UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT0             *((volatile uint32_t*)(0x42624580UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT1              *((volatile uint32_t*)(0x42624584UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT1             *((volatile uint32_t*)(0x42624584UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT2              *((volatile uint32_t*)(0x42624588UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT2             *((volatile uint32_t*)(0x42624588UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT3              *((volatile uint32_t*)(0x4262458CUL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT3             *((volatile uint32_t*)(0x4262458CUL))
#define bFM_INTREQ_IRQ010MON_IRQBIT4              *((volatile uint32_t*)(0x42624590UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT4             *((volatile uint32_t*)(0x42624590UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT5              *((volatile uint32_t*)(0x42624594UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT5             *((volatile uint32_t*)(0x42624594UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT6              *((volatile uint32_t*)(0x42624598UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT6             *((volatile uint32_t*)(0x42624598UL))
#define bFM_INTREQ_IRQ010MON_IRQBIT7              *((volatile uint32_t*)(0x4262459CUL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT7             *((volatile uint32_t*)(0x4262459CUL))

#define bFM_INTREQ_IRQ010SEL_SELBIT0              *((volatile uint32_t*)(0x426225C0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT0             *((volatile uint32_t*)(0x426225C0UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT1              *((volatile uint32_t*)(0x426225C4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT1             *((volatile uint32_t*)(0x426225C4UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT2              *((volatile uint32_t*)(0x426225C8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT2             *((volatile uint32_t*)(0x426225C8UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT3              *((volatile uint32_t*)(0x426225CCUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT3             *((volatile uint32_t*)(0x426225CCUL))
#define bFM_INTREQ_IRQ010SEL_SELBIT4              *((volatile uint32_t*)(0x426225D0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT4             *((volatile uint32_t*)(0x426225D0UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT5              *((volatile uint32_t*)(0x426225D4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT5             *((volatile uint32_t*)(0x426225D4UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT6              *((volatile uint32_t*)(0x426225D8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT6             *((volatile uint32_t*)(0x426225D8UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT7              *((volatile uint32_t*)(0x426225DCUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT7             *((volatile uint32_t*)(0x426225DCUL))
#define bFM_INTREQ_IRQ010SEL_SELBIT8              *((volatile uint32_t*)(0x426225E0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT8             *((volatile uint32_t*)(0x426225E0UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT9              *((volatile uint32_t*)(0x426225E4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT9             *((volatile uint32_t*)(0x426225E4UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT10             *((volatile uint32_t*)(0x426225E8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT10            *((volatile uint32_t*)(0x426225E8UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT11             *((volatile uint32_t*)(0x426225ECUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT11            *((volatile uint32_t*)(0x426225ECUL))
#define bFM_INTREQ_IRQ010SEL_SELBIT12             *((volatile uint32_t*)(0x426225F0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT12            *((volatile uint32_t*)(0x426225F0UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT13             *((volatile uint32_t*)(0x426225F4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT13            *((volatile uint32_t*)(0x426225F4UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT14             *((volatile uint32_t*)(0x426225F8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT14            *((volatile uint32_t*)(0x426225F8UL))
#define bFM_INTREQ_IRQ010SEL_SELBIT15             *((volatile uint32_t*)(0x426225FCUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT15            *((volatile uint32_t*)(0x426225FCUL))

#define bFM_INTREQ_IRQ011MON_EXTINT               *((volatile uint32_t*)(0x42624600UL))
#define bFM4_INTREQ_IRQ011MON_EXTINT              *((volatile uint32_t*)(0x42624600UL))

#define bFM_INTREQ_IRQ012MON_EXTINT               *((volatile uint32_t*)(0x42624680UL))
#define bFM4_INTREQ_IRQ012MON_EXTINT              *((volatile uint32_t*)(0x42624680UL))

#define bFM_INTREQ_IRQ013MON_EXTINT               *((volatile uint32_t*)(0x42624700UL))
#define bFM4_INTREQ_IRQ013MON_EXTINT              *((volatile uint32_t*)(0x42624700UL))

#define bFM_INTREQ_IRQ014MON_EXTINT               *((volatile uint32_t*)(0x42624780UL))
#define bFM4_INTREQ_IRQ014MON_EXTINT              *((volatile uint32_t*)(0x42624780UL))

#define bFM_INTREQ_IRQ015MON_EXTINT               *((volatile uint32_t*)(0x42624800UL))
#define bFM4_INTREQ_IRQ015MON_EXTINT              *((volatile uint32_t*)(0x42624800UL))

#define bFM_INTREQ_IRQ016MON_EXTINT               *((volatile uint32_t*)(0x42624880UL))
#define bFM4_INTREQ_IRQ016MON_EXTINT              *((volatile uint32_t*)(0x42624880UL))

#define bFM_INTREQ_IRQ017MON_EXTINT               *((volatile uint32_t*)(0x42624900UL))
#define bFM4_INTREQ_IRQ017MON_EXTINT              *((volatile uint32_t*)(0x42624900UL))

#define bFM_INTREQ_IRQ018MON_EXTINT               *((volatile uint32_t*)(0x42624980UL))
#define bFM4_INTREQ_IRQ018MON_EXTINT              *((volatile uint32_t*)(0x42624980UL))

#define bFM_INTREQ_IRQ019MON_QPRCINT0             *((volatile uint32_t*)(0x42624A00UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT0            *((volatile uint32_t*)(0x42624A00UL))
#define bFM_INTREQ_IRQ019MON_QPRCINT1             *((volatile uint32_t*)(0x42624A04UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT1            *((volatile uint32_t*)(0x42624A04UL))
#define bFM_INTREQ_IRQ019MON_QPRCINT2             *((volatile uint32_t*)(0x42624A08UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT2            *((volatile uint32_t*)(0x42624A08UL))
#define bFM_INTREQ_IRQ019MON_QPRCINT3             *((volatile uint32_t*)(0x42624A0CUL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT3            *((volatile uint32_t*)(0x42624A0CUL))
#define bFM_INTREQ_IRQ019MON_QPRCINT4             *((volatile uint32_t*)(0x42624A10UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT4            *((volatile uint32_t*)(0x42624A10UL))
#define bFM_INTREQ_IRQ019MON_QPRCINT5             *((volatile uint32_t*)(0x42624A14UL))
#define bFM4_INTREQ_IRQ019MON_QPRCINT5            *((volatile uint32_t*)(0x42624A14UL))

