neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_INTREQ_IRQ020MON_QPRCINT0             *((volatile uint32_t*)(0x42624A80UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT0            *((volatile uint32_t*)(0x42624A80UL))
#define bFM_INTREQ_IRQ020MON_QPRCINT1             *((volatile uint32_t*)(0x42624A84UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT1            *((volatile uint32_t*)(0x42624A84UL))
#define bFM_INTREQ_IRQ020MON_QPRCINT2             *((volatile uint32_t*)(0x42624A88UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT2            *((volatile uint32_t*)(0x42624A88UL))
#define bFM_INTREQ_IRQ020MON_QPRCINT3             *((volatile uint32_t*)(0x42624A8CUL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT3            *((volatile uint32_t*)(0x42624A8CUL))
#define bFM_INTREQ_IRQ020MON_QPRCINT4             *((volatile uint32_t*)(0x42624A90UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT4            *((volatile uint32_t*)(0x42624A90UL))
#define bFM_INTREQ_IRQ020MON_QPRCINT5             *((volatile uint32_t*)(0x42624A94UL))
#define bFM4_INTREQ_IRQ020MON_QPRCINT5            *((volatile uint32_t*)(0x42624A94UL))

#define bFM_INTREQ_IRQ021MON_WAVEINT0             *((volatile uint32_t*)(0x42624B00UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT0            *((volatile uint32_t*)(0x42624B00UL))
#define bFM_INTREQ_IRQ021MON_WAVEINT1             *((volatile uint32_t*)(0x42624B04UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT1            *((volatile uint32_t*)(0x42624B04UL))
#define bFM_INTREQ_IRQ021MON_WAVEINT2             *((volatile uint32_t*)(0x42624B08UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT2            *((volatile uint32_t*)(0x42624B08UL))
#define bFM_INTREQ_IRQ021MON_WAVEINT3             *((volatile uint32_t*)(0x42624B0CUL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT3            *((volatile uint32_t*)(0x42624B0CUL))

#define bFM_INTREQ_IRQ022MON_WAVEINT0             *((volatile uint32_t*)(0x42624B80UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT0            *((volatile uint32_t*)(0x42624B80UL))
#define bFM_INTREQ_IRQ022MON_WAVEINT1             *((volatile uint32_t*)(0x42624B84UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT1            *((volatile uint32_t*)(0x42624B84UL))
#define bFM_INTREQ_IRQ022MON_WAVEINT2             *((volatile uint32_t*)(0x42624B88UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT2            *((volatile uint32_t*)(0x42624B88UL))
#define bFM_INTREQ_IRQ022MON_WAVEINT3             *((volatile uint32_t*)(0x42624B8CUL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT3            *((volatile uint32_t*)(0x42624B8CUL))

#define bFM_INTREQ_IRQ023MON_WAVEINT0             *((volatile uint32_t*)(0x42624C00UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT0            *((volatile uint32_t*)(0x42624C00UL))
#define bFM_INTREQ_IRQ023MON_WAVEINT1             *((volatile uint32_t*)(0x42624C04UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT1            *((volatile uint32_t*)(0x42624C04UL))
#define bFM_INTREQ_IRQ023MON_WAVEINT2             *((volatile uint32_t*)(0x42624C08UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT2            *((volatile uint32_t*)(0x42624C08UL))
#define bFM_INTREQ_IRQ023MON_WAVEINT3             *((volatile uint32_t*)(0x42624C0CUL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT3            *((volatile uint32_t*)(0x42624C0CUL))

#define bFM_INTREQ_IRQ024MON_FRT_PEAK_INT0        *((volatile uint32_t*)(0x42624C80UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT0       *((volatile uint32_t*)(0x42624C80UL))
#define bFM_INTREQ_IRQ024MON_FRT_PEAK_INT1        *((volatile uint32_t*)(0x42624C84UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT1       *((volatile uint32_t*)(0x42624C84UL))
#define bFM_INTREQ_IRQ024MON_FRT_PEAK_INT2        *((volatile uint32_t*)(0x42624C88UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT2       *((volatile uint32_t*)(0x42624C88UL))

#define bFM_INTREQ_IRQ025MON_FRT_ZERO_INT0        *((volatile uint32_t*)(0x42624D00UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT0       *((volatile uint32_t*)(0x42624D00UL))
#define bFM_INTREQ_IRQ025MON_FRT_ZERO_INT1        *((volatile uint32_t*)(0x42624D04UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT1       *((volatile uint32_t*)(0x42624D04UL))
#define bFM_INTREQ_IRQ025MON_FRT_ZERO_INT2        *((volatile uint32_t*)(0x42624D08UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT2       *((volatile uint32_t*)(0x42624D08UL))

#define bFM_INTREQ_IRQ026MON_ICUINT0              *((volatile uint32_t*)(0x42624D80UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT0             *((volatile uint32_t*)(0x42624D80UL))
#define bFM_INTREQ_IRQ026MON_ICUINT1              *((volatile uint32_t*)(0x42624D84UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT1             *((volatile uint32_t*)(0x42624D84UL))
#define bFM_INTREQ_IRQ026MON_ICUINT2              *((volatile uint32_t*)(0x42624D88UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT2             *((volatile uint32_t*)(0x42624D88UL))
#define bFM_INTREQ_IRQ026MON_ICUINT3              *((volatile uint32_t*)(0x42624D8CUL))
#define bFM4_INTREQ_IRQ026MON_ICUINT3             *((volatile uint32_t*)(0x42624D8CUL))

#define bFM_INTREQ_IRQ027MON_OCUINT0              *((volatile uint32_t*)(0x42624E00UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT0             *((volatile uint32_t*)(0x42624E00UL))
#define bFM_INTREQ_IRQ027MON_OCUINT1              *((volatile uint32_t*)(0x42624E04UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT1             *((volatile uint32_t*)(0x42624E04UL))
#define bFM_INTREQ_IRQ027MON_OCUINT2              *((volatile uint32_t*)(0x42624E08UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT2             *((volatile uint32_t*)(0x42624E08UL))
#define bFM_INTREQ_IRQ027MON_OCUINT3              *((volatile uint32_t*)(0x42624E0CUL))
#define bFM4_INTREQ_IRQ027MON_OCUINT3             *((volatile uint32_t*)(0x42624E0CUL))
#define bFM_INTREQ_IRQ027MON_OCUINT4              *((volatile uint32_t*)(0x42624E10UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT4             *((volatile uint32_t*)(0x42624E10UL))
#define bFM_INTREQ_IRQ027MON_OCUINT5              *((volatile uint32_t*)(0x42624E14UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT5             *((volatile uint32_t*)(0x42624E14UL))

#define bFM_INTREQ_IRQ028MON_FRT_PEAK_INT0        *((volatile uint32_t*)(0x42624E80UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT0       *((volatile uint32_t*)(0x42624E80UL))
#define bFM_INTREQ_IRQ028MON_FRT_PEAK_INT1        *((volatile uint32_t*)(0x42624E84UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT1       *((volatile uint32_t*)(0x42624E84UL))
#define bFM_INTREQ_IRQ028MON_FRT_PEAK_INT2        *((volatile uint32_t*)(0x42624E88UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT2       *((volatile uint32_t*)(0x42624E88UL))

