neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_INTREQ_IRQ039MON_BTINT0               *((volatile uint32_t*)(0x42625400UL))
#define bFM4_INTREQ_IRQ039MON_BTINT0              *((volatile uint32_t*)(0x42625400UL))
#define bFM_INTREQ_IRQ039MON_BTINT1               *((volatile uint32_t*)(0x42625404UL))
#define bFM4_INTREQ_IRQ039MON_BTINT1              *((volatile uint32_t*)(0x42625404UL))

#define bFM_INTREQ_IRQ040MON_BTINT0               *((volatile uint32_t*)(0x42625480UL))
#define bFM4_INTREQ_IRQ040MON_BTINT0              *((volatile uint32_t*)(0x42625480UL))
#define bFM_INTREQ_IRQ040MON_BTINT1               *((volatile uint32_t*)(0x42625484UL))
#define bFM4_INTREQ_IRQ040MON_BTINT1              *((volatile uint32_t*)(0x42625484UL))

#define bFM_INTREQ_IRQ041MON_BTINT0               *((volatile uint32_t*)(0x42625500UL))
#define bFM4_INTREQ_IRQ041MON_BTINT0              *((volatile uint32_t*)(0x42625500UL))
#define bFM_INTREQ_IRQ041MON_BTINT1               *((volatile uint32_t*)(0x42625504UL))
#define bFM4_INTREQ_IRQ041MON_BTINT1              *((volatile uint32_t*)(0x42625504UL))

#define bFM_INTREQ_IRQ042MON_BTINT0               *((volatile uint32_t*)(0x42625580UL))
#define bFM4_INTREQ_IRQ042MON_BTINT0              *((volatile uint32_t*)(0x42625580UL))
#define bFM_INTREQ_IRQ042MON_BTINT1               *((volatile uint32_t*)(0x42625584UL))
#define bFM4_INTREQ_IRQ042MON_BTINT1              *((volatile uint32_t*)(0x42625584UL))

#define bFM_INTREQ_IRQ043MON_BTINT0               *((volatile uint32_t*)(0x42625600UL))
#define bFM4_INTREQ_IRQ043MON_BTINT0              *((volatile uint32_t*)(0x42625600UL))
#define bFM_INTREQ_IRQ043MON_BTINT1               *((volatile uint32_t*)(0x42625604UL))
#define bFM4_INTREQ_IRQ043MON_BTINT1              *((volatile uint32_t*)(0x42625604UL))

#define bFM_INTREQ_IRQ044MON_BTINT0               *((volatile uint32_t*)(0x42625680UL))
#define bFM4_INTREQ_IRQ044MON_BTINT0              *((volatile uint32_t*)(0x42625680UL))
#define bFM_INTREQ_IRQ044MON_BTINT1               *((volatile uint32_t*)(0x42625684UL))
#define bFM4_INTREQ_IRQ044MON_BTINT1              *((volatile uint32_t*)(0x42625684UL))

#define bFM_INTREQ_IRQ045MON_BTINT0               *((volatile uint32_t*)(0x42625700UL))
#define bFM4_INTREQ_IRQ045MON_BTINT0              *((volatile uint32_t*)(0x42625700UL))
#define bFM_INTREQ_IRQ045MON_BTINT1               *((volatile uint32_t*)(0x42625704UL))
#define bFM4_INTREQ_IRQ045MON_BTINT1              *((volatile uint32_t*)(0x42625704UL))

#define bFM_INTREQ_IRQ046MON_BTINT0               *((volatile uint32_t*)(0x42625780UL))
#define bFM4_INTREQ_IRQ046MON_BTINT0              *((volatile uint32_t*)(0x42625780UL))
#define bFM_INTREQ_IRQ046MON_BTINT1               *((volatile uint32_t*)(0x42625784UL))
#define bFM4_INTREQ_IRQ046MON_BTINT1              *((volatile uint32_t*)(0x42625784UL))

#define bFM_INTREQ_IRQ047MON_TIMINT1              *((volatile uint32_t*)(0x42625800UL))
#define bFM4_INTREQ_IRQ047MON_TIMINT1             *((volatile uint32_t*)(0x42625800UL))
#define bFM_INTREQ_IRQ047MON_TIMINT2              *((volatile uint32_t*)(0x42625804UL))
#define bFM4_INTREQ_IRQ047MON_TIMINT2             *((volatile uint32_t*)(0x42625804UL))

#define bFM_INTREQ_IRQ048MON_WCINT                *((volatile uint32_t*)(0x42625880UL))
#define bFM4_INTREQ_IRQ048MON_WCINT               *((volatile uint32_t*)(0x42625880UL))

#define bFM_INTREQ_IRQ049MON_BMEMCS               *((volatile uint32_t*)(0x42625900UL))
#define bFM4_INTREQ_IRQ049MON_BMEMCS              *((volatile uint32_t*)(0x42625900UL))

#define bFM_INTREQ_IRQ050MON_RTCINT               *((volatile uint32_t*)(0x42625980UL))
#define bFM4_INTREQ_IRQ050MON_RTCINT              *((volatile uint32_t*)(0x42625980UL))

#define bFM_INTREQ_IRQ051MON_EXTINT               *((volatile uint32_t*)(0x42625A00UL))
#define bFM4_INTREQ_IRQ051MON_EXTINT              *((volatile uint32_t*)(0x42625A00UL))

#define bFM_INTREQ_IRQ052MON_EXTINT               *((volatile uint32_t*)(0x42625A80UL))
#define bFM4_INTREQ_IRQ052MON_EXTINT              *((volatile uint32_t*)(0x42625A80UL))

#define bFM_INTREQ_IRQ053MON_EXTINT               *((volatile uint32_t*)(0x42625B00UL))
#define bFM4_INTREQ_IRQ053MON_EXTINT              *((volatile uint32_t*)(0x42625B00UL))

#define bFM_INTREQ_IRQ054MON_EXTINT               *((volatile uint32_t*)(0x42625B80UL))
#define bFM4_INTREQ_IRQ054MON_EXTINT              *((volatile uint32_t*)(0x42625B80UL))

#define bFM_INTREQ_IRQ055MON_EXTINT               *((volatile uint32_t*)(0x42625C00UL))
#define bFM4_INTREQ_IRQ055MON_EXTINT              *((volatile uint32_t*)(0x42625C00UL))

#define bFM_INTREQ_IRQ056MON_EXTINT               *((volatile uint32_t*)(0x42625C80UL))
#define bFM4_INTREQ_IRQ056MON_EXTINT              *((volatile uint32_t*)(0x42625C80UL))

#define bFM_INTREQ_IRQ057MON_EXTINT               *((volatile uint32_t*)(0x42625D00UL))
#define bFM4_INTREQ_IRQ057MON_EXTINT              *((volatile uint32_t*)(0x42625D00UL))

#define bFM_INTREQ_IRQ058MON_EXTINT               *((volatile uint32_t*)(0x42625D80UL))
#define bFM4_INTREQ_IRQ058MON_EXTINT              *((volatile uint32_t*)(0x42625D80UL))

#define bFM_INTREQ_IRQ059MON_MOSCINT              *((volatile uint32_t*)(0x42625E00UL))
#define bFM4_INTREQ_IRQ059MON_MOSCINT             *((volatile uint32_t*)(0x42625E00UL))
#define bFM_INTREQ_IRQ059MON_SOSCINT              *((volatile uint32_t*)(0x42625E04UL))
#define bFM4_INTREQ_IRQ059MON_SOSCINT             *((volatile uint32_t*)(0x42625E04UL))
#define bFM_INTREQ_IRQ059MON_MPLLINT              *((volatile uint32_t*)(0x42625E08UL))
#define bFM4_INTREQ_IRQ059MON_MPLLINT             *((volatile uint32_t*)(0x42625E08UL))
#define bFM_INTREQ_IRQ059MON_UPLLINT              *((volatile uint32_t*)(0x42625E0CUL))
#define bFM4_INTREQ_IRQ059MON_UPLLINT             *((volatile uint32_t*)(0x42625E0CUL))
#define bFM_INTREQ_IRQ059MON_IPLLINT              *((volatile uint32_t*)(0x42625E10UL))
#define bFM4_INTREQ_IRQ059MON_IPLLINT             *((volatile uint32_t*)(0x42625E10UL))

#define bFM_INTREQ_IRQ060MON_MFSINT0_RX           *((volatile uint32_t*)(0x42625E80UL))
#define bFM4_INTREQ_IRQ060MON_MFSINT0_RX          *((volatile uint32_t*)(0x42625E80UL))

#define bFM_INTREQ_IRQ061MON_MFSINT0_TX           *((volatile uint32_t*)(0x42625F00UL))
#define bFM4_INTREQ_IRQ061MON_MFSINT0_TX          *((volatile uint32_t*)(0x42625F00UL))
#define bFM_INTREQ_IRQ061MON_MFSINT0_STATUS       *((volatile uint32_t*)(0x42625F04UL))
#define bFM4_INTREQ_IRQ061MON_MFSINT0_STATUS      *((volatile uint32_t*)(0x42625F04UL))

#define bFM_INTREQ_IRQ062MON_MFSINT1_RX           *((volatile uint32_t*)(0x42625F80UL))
#define bFM4_INTREQ_IRQ062MON_MFSINT1_RX          *((volatile uint32_t*)(0x42625F80UL))

#define bFM_INTREQ_IRQ063MON_MFSINT1_TX           *((volatile uint32_t*)(0x42626000UL))
#define bFM4_INTREQ_IRQ063MON_MFSINT1_TX          *((volatile uint32_t*)(0x42626000UL))
#define bFM_INTREQ_IRQ063MON_MFSINT1_STATUS       *((volatile uint32_t*)(0x42626004UL))
#define bFM4_INTREQ_IRQ063MON_MFSINT1_STATUS      *((volatile uint32_t*)(0x42626004UL))

#define bFM_INTREQ_IRQ064MON_MFSINT2_RX           *((volatile uint32_t*)(0x42626080UL))
#define bFM4_INTREQ_IRQ064MON_MFSINT2_RX          *((volatile uint32_t*)(0x42626080UL))

