neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_INTREQ_IRQ065MON_MFSINT2_TX           *((volatile uint32_t*)(0x42626100UL))
#define bFM4_INTREQ_IRQ065MON_MFSINT2_TX          *((volatile uint32_t*)(0x42626100UL))
#define bFM_INTREQ_IRQ065MON_MFSINT2_STATUS       *((volatile uint32_t*)(0x42626104UL))
#define bFM4_INTREQ_IRQ065MON_MFSINT2_STATUS      *((volatile uint32_t*)(0x42626104UL))

#define bFM_INTREQ_IRQ066MON_MFSINT3_RX           *((volatile uint32_t*)(0x42626180UL))
#define bFM4_INTREQ_IRQ066MON_MFSINT3_RX          *((volatile uint32_t*)(0x42626180UL))

#define bFM_INTREQ_IRQ067MON_MFSINT3_TX           *((volatile uint32_t*)(0x42626200UL))
#define bFM4_INTREQ_IRQ067MON_MFSINT3_TX          *((volatile uint32_t*)(0x42626200UL))
#define bFM_INTREQ_IRQ067MON_MFSINT3_STATUS       *((volatile uint32_t*)(0x42626204UL))
#define bFM4_INTREQ_IRQ067MON_MFSINT3_STATUS      *((volatile uint32_t*)(0x42626204UL))

#define bFM_INTREQ_IRQ068MON_MFSINT4_RX           *((volatile uint32_t*)(0x42626280UL))
#define bFM4_INTREQ_IRQ068MON_MFSINT4_RX          *((volatile uint32_t*)(0x42626280UL))

#define bFM_INTREQ_IRQ069MON_MFSINT4_TX           *((volatile uint32_t*)(0x42626300UL))
#define bFM4_INTREQ_IRQ069MON_MFSINT4_TX          *((volatile uint32_t*)(0x42626300UL))
#define bFM_INTREQ_IRQ069MON_MFSINT4_STATUS       *((volatile uint32_t*)(0x42626304UL))
#define bFM4_INTREQ_IRQ069MON_MFSINT4_STATUS      *((volatile uint32_t*)(0x42626304UL))

#define bFM_INTREQ_IRQ070MON_MFSINT5_RX           *((volatile uint32_t*)(0x42626380UL))
#define bFM4_INTREQ_IRQ070MON_MFSINT5_RX          *((volatile uint32_t*)(0x42626380UL))

#define bFM_INTREQ_IRQ071MON_MFSINT5_TX           *((volatile uint32_t*)(0x42626400UL))
#define bFM4_INTREQ_IRQ071MON_MFSINT5_TX          *((volatile uint32_t*)(0x42626400UL))
#define bFM_INTREQ_IRQ071MON_MFSINT5_STATUS       *((volatile uint32_t*)(0x42626404UL))
#define bFM4_INTREQ_IRQ071MON_MFSINT5_STATUS      *((volatile uint32_t*)(0x42626404UL))

#define bFM_INTREQ_IRQ072MON_MFSINT6_RX           *((volatile uint32_t*)(0x42626480UL))
#define bFM4_INTREQ_IRQ072MON_MFSINT6_RX          *((volatile uint32_t*)(0x42626480UL))

#define bFM_INTREQ_IRQ073MON_MFSINT6_TX           *((volatile uint32_t*)(0x42626500UL))
#define bFM4_INTREQ_IRQ073MON_MFSINT6_TX          *((volatile uint32_t*)(0x42626500UL))
#define bFM_INTREQ_IRQ073MON_MFSINT6_STATUS       *((volatile uint32_t*)(0x42626504UL))
#define bFM4_INTREQ_IRQ073MON_MFSINT6_STATUS      *((volatile uint32_t*)(0x42626504UL))

#define bFM_INTREQ_IRQ074MON_MFSINT7_RX           *((volatile uint32_t*)(0x42626580UL))
#define bFM4_INTREQ_IRQ074MON_MFSINT7_RX          *((volatile uint32_t*)(0x42626580UL))

#define bFM_INTREQ_IRQ075MON_MFSINT7_TX           *((volatile uint32_t*)(0x42626600UL))
#define bFM4_INTREQ_IRQ075MON_MFSINT7_TX          *((volatile uint32_t*)(0x42626600UL))
#define bFM_INTREQ_IRQ075MON_MFSINT7_STATUS       *((volatile uint32_t*)(0x42626604UL))
#define bFM4_INTREQ_IRQ075MON_MFSINT7_STATUS      *((volatile uint32_t*)(0x42626604UL))

#define bFM_INTREQ_IRQ076MON_ADCINT0              *((volatile uint32_t*)(0x42626680UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT0             *((volatile uint32_t*)(0x42626680UL))
#define bFM_INTREQ_IRQ076MON_ADCINT1              *((volatile uint32_t*)(0x42626684UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT1             *((volatile uint32_t*)(0x42626684UL))
#define bFM_INTREQ_IRQ076MON_ADCINT2              *((volatile uint32_t*)(0x42626688UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT2             *((volatile uint32_t*)(0x42626688UL))
#define bFM_INTREQ_IRQ076MON_ADCINT3              *((volatile uint32_t*)(0x4262668CUL))
#define bFM4_INTREQ_IRQ076MON_ADCINT3             *((volatile uint32_t*)(0x4262668CUL))
#define bFM_INTREQ_IRQ076MON_ADCINT4              *((volatile uint32_t*)(0x42626690UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT4             *((volatile uint32_t*)(0x42626690UL))

#define bFM_INTREQ_IRQ077MON_ADCINT0              *((volatile uint32_t*)(0x42626700UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT0             *((volatile uint32_t*)(0x42626700UL))
#define bFM_INTREQ_IRQ077MON_ADCINT1              *((volatile uint32_t*)(0x42626704UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT1             *((volatile uint32_t*)(0x42626704UL))
#define bFM_INTREQ_IRQ077MON_ADCINT2              *((volatile uint32_t*)(0x42626708UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT2             *((volatile uint32_t*)(0x42626708UL))
#define bFM_INTREQ_IRQ077MON_ADCINT3              *((volatile uint32_t*)(0x4262670CUL))
#define bFM4_INTREQ_IRQ077MON_ADCINT3             *((volatile uint32_t*)(0x4262670CUL))
#define bFM_INTREQ_IRQ077MON_ADCINT4              *((volatile uint32_t*)(0x42626710UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT4             *((volatile uint32_t*)(0x42626710UL))

#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT0         *((volatile uint32_t*)(0x42626780UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT0        *((volatile uint32_t*)(0x42626780UL))
#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT1         *((volatile uint32_t*)(0x42626784UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT1        *((volatile uint32_t*)(0x42626784UL))
#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT2         *((volatile uint32_t*)(0x42626788UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT2        *((volatile uint32_t*)(0x42626788UL))
#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT3         *((volatile uint32_t*)(0x4262678CUL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT3        *((volatile uint32_t*)(0x4262678CUL))
#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT4         *((volatile uint32_t*)(0x42626790UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT4        *((volatile uint32_t*)(0x42626790UL))

#define bFM_INTREQ_IRQ079MON_USB_INT0             *((volatile uint32_t*)(0x42626800UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT0            *((volatile uint32_t*)(0x42626800UL))
#define bFM_INTREQ_IRQ079MON_USB_INT1             *((volatile uint32_t*)(0x42626804UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT1            *((volatile uint32_t*)(0x42626804UL))
#define bFM_INTREQ_IRQ079MON_USB_INT2             *((volatile uint32_t*)(0x42626808UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT2            *((volatile uint32_t*)(0x42626808UL))
#define bFM_INTREQ_IRQ079MON_USB_INT3             *((volatile uint32_t*)(0x4262680CUL))
#define bFM4_INTREQ_IRQ079MON_USB_INT3            *((volatile uint32_t*)(0x4262680CUL))
#define bFM_INTREQ_IRQ079MON_USB_INT4             *((volatile uint32_t*)(0x42626810UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT4            *((volatile uint32_t*)(0x42626810UL))
#define bFM_INTREQ_IRQ079MON_USB_INT5             *((volatile uint32_t*)(0x42626814UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT5            *((volatile uint32_t*)(0x42626814UL))

#define bFM_INTREQ_IRQ080MON_CANINT               *((volatile uint32_t*)(0x42626880UL))
#define bFM4_INTREQ_IRQ080MON_CANINT              *((volatile uint32_t*)(0x42626880UL))

