neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_INTREQ_IRQ081MON_CANINT               *((volatile uint32_t*)(0x42626900UL))
#define bFM4_INTREQ_IRQ081MON_CANINT              *((volatile uint32_t*)(0x42626900UL))
#define bFM_INTREQ_IRQ081MON_CANDEINT             *((volatile uint32_t*)(0x42626904UL))
#define bFM4_INTREQ_IRQ081MON_CANDEINT            *((volatile uint32_t*)(0x42626904UL))
#define bFM_INTREQ_IRQ081MON_CANSEINT             *((volatile uint32_t*)(0x42626908UL))
#define bFM4_INTREQ_IRQ081MON_CANSEINT            *((volatile uint32_t*)(0x42626908UL))
#define bFM_INTREQ_IRQ081MON_CAN0INT              *((volatile uint32_t*)(0x4262690CUL))
#define bFM4_INTREQ_IRQ081MON_CAN0INT             *((volatile uint32_t*)(0x4262690CUL))
#define bFM_INTREQ_IRQ081MON_CAN1INT              *((volatile uint32_t*)(0x42626910UL))
#define bFM4_INTREQ_IRQ081MON_CAN1INT             *((volatile uint32_t*)(0x42626910UL))

#define bFM_INTREQ_IRQ082MON_MACSBD               *((volatile uint32_t*)(0x42626980UL))
#define bFM4_INTREQ_IRQ082MON_MACSBD              *((volatile uint32_t*)(0x42626980UL))
#define bFM_INTREQ_IRQ082MON_MACPMT               *((volatile uint32_t*)(0x42626984UL))
#define bFM4_INTREQ_IRQ082MON_MACPMT              *((volatile uint32_t*)(0x42626984UL))
#define bFM_INTREQ_IRQ082MON_MACLPI               *((volatile uint32_t*)(0x42626988UL))
#define bFM4_INTREQ_IRQ082MON_MACLPI              *((volatile uint32_t*)(0x42626988UL))

#define bFM_INTREQ_IRQ083MON_DMACINT              *((volatile uint32_t*)(0x42626A00UL))
#define bFM4_INTREQ_IRQ083MON_DMACINT             *((volatile uint32_t*)(0x42626A00UL))

#define bFM_INTREQ_IRQ084MON_DMACINT              *((volatile uint32_t*)(0x42626A80UL))
#define bFM4_INTREQ_IRQ084MON_DMACINT             *((volatile uint32_t*)(0x42626A80UL))

#define bFM_INTREQ_IRQ085MON_DMACINT              *((volatile uint32_t*)(0x42626B00UL))
#define bFM4_INTREQ_IRQ085MON_DMACINT             *((volatile uint32_t*)(0x42626B00UL))

#define bFM_INTREQ_IRQ086MON_DMACINT              *((volatile uint32_t*)(0x42626B80UL))
#define bFM4_INTREQ_IRQ086MON_DMACINT             *((volatile uint32_t*)(0x42626B80UL))

#define bFM_INTREQ_IRQ087MON_DMACINT              *((volatile uint32_t*)(0x42626C00UL))
#define bFM4_INTREQ_IRQ087MON_DMACINT             *((volatile uint32_t*)(0x42626C00UL))

#define bFM_INTREQ_IRQ088MON_DMACINT              *((volatile uint32_t*)(0x42626C80UL))
#define bFM4_INTREQ_IRQ088MON_DMACINT             *((volatile uint32_t*)(0x42626C80UL))

#define bFM_INTREQ_IRQ089MON_DMACINT              *((volatile uint32_t*)(0x42626D00UL))
#define bFM4_INTREQ_IRQ089MON_DMACINT             *((volatile uint32_t*)(0x42626D00UL))

#define bFM_INTREQ_IRQ090MON_DMACINT              *((volatile uint32_t*)(0x42626D80UL))
#define bFM4_INTREQ_IRQ090MON_DMACINT             *((volatile uint32_t*)(0x42626D80UL))

#define bFM_INTREQ_IRQ091MON_DSTCINT0             *((volatile uint32_t*)(0x42626E00UL))
#define bFM4_INTREQ_IRQ091MON_DSTCINT0            *((volatile uint32_t*)(0x42626E00UL))
#define bFM_INTREQ_IRQ091MON_DSTCINT1             *((volatile uint32_t*)(0x42626E04UL))
#define bFM4_INTREQ_IRQ091MON_DSTCINT1            *((volatile uint32_t*)(0x42626E04UL))

#define bFM_INTREQ_IRQ092MON_EXTINT0              *((volatile uint32_t*)(0x42626E80UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT0             *((volatile uint32_t*)(0x42626E80UL))
#define bFM_INTREQ_IRQ092MON_EXTINT1              *((volatile uint32_t*)(0x42626E84UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT1             *((volatile uint32_t*)(0x42626E84UL))
#define bFM_INTREQ_IRQ092MON_EXTINT2              *((volatile uint32_t*)(0x42626E88UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT2             *((volatile uint32_t*)(0x42626E88UL))
#define bFM_INTREQ_IRQ092MON_EXTINT3              *((volatile uint32_t*)(0x42626E8CUL))
#define bFM4_INTREQ_IRQ092MON_EXTINT3             *((volatile uint32_t*)(0x42626E8CUL))

#define bFM_INTREQ_IRQ093MON_EXTINT0              *((volatile uint32_t*)(0x42626F00UL))
#define bFM4_INTREQ_IRQ093MON_EXTINT0             *((volatile uint32_t*)(0x42626F00UL))
#define bFM_INTREQ_IRQ093MON_EXTINT1              *((volatile uint32_t*)(0x42626F04UL))
#define bFM4_INTREQ_IRQ093MON_EXTINT1             *((volatile uint32_t*)(0x42626F04UL))
#define bFM_INTREQ_IRQ093MON_EXTINT2              *((volatile uint32_t*)(0x42626F08UL))
#define bFM4_INTREQ_IRQ093MON_EXTINT2             *((volatile uint32_t*)(0x42626F08UL))
#define bFM_INTREQ_IRQ093MON_EXTINT3              *((volatile uint32_t*)(0x42626F0CUL))
#define bFM4_INTREQ_IRQ093MON_EXTINT3             *((volatile uint32_t*)(0x42626F0CUL))

#define bFM_INTREQ_IRQ094MON_EXTINT0              *((volatile uint32_t*)(0x42626F80UL))
#define bFM4_INTREQ_IRQ094MON_EXTINT0             *((volatile uint32_t*)(0x42626F80UL))
#define bFM_INTREQ_IRQ094MON_EXTINT1              *((volatile uint32_t*)(0x42626F84UL))
#define bFM4_INTREQ_IRQ094MON_EXTINT1             *((volatile uint32_t*)(0x42626F84UL))
#define bFM_INTREQ_IRQ094MON_EXTINT2              *((volatile uint32_t*)(0x42626F88UL))
#define bFM4_INTREQ_IRQ094MON_EXTINT2             *((volatile uint32_t*)(0x42626F88UL))
#define bFM_INTREQ_IRQ094MON_EXTINT3              *((volatile uint32_t*)(0x42626F8CUL))
#define bFM4_INTREQ_IRQ094MON_EXTINT3             *((volatile uint32_t*)(0x42626F8CUL))

#define bFM_INTREQ_IRQ095MON_EXTINT0              *((volatile uint32_t*)(0x42627000UL))
#define bFM4_INTREQ_IRQ095MON_EXTINT0             *((volatile uint32_t*)(0x42627000UL))
#define bFM_INTREQ_IRQ095MON_EXTINT1              *((volatile uint32_t*)(0x42627004UL))
#define bFM4_INTREQ_IRQ095MON_EXTINT1             *((volatile uint32_t*)(0x42627004UL))
#define bFM_INTREQ_IRQ095MON_EXTINT2              *((volatile uint32_t*)(0x42627008UL))
#define bFM4_INTREQ_IRQ095MON_EXTINT2             *((volatile uint32_t*)(0x42627008UL))
#define bFM_INTREQ_IRQ095MON_EXTINT3              *((volatile uint32_t*)(0x4262700CUL))
#define bFM4_INTREQ_IRQ095MON_EXTINT3             *((volatile uint32_t*)(0x4262700CUL))

#define bFM_INTREQ_IRQ096MON_QPRCINT0             *((volatile uint32_t*)(0x42627080UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT0            *((volatile uint32_t*)(0x42627080UL))
#define bFM_INTREQ_IRQ096MON_QPRCINT1             *((volatile uint32_t*)(0x42627084UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT1            *((volatile uint32_t*)(0x42627084UL))
#define bFM_INTREQ_IRQ096MON_QPRCINT2             *((volatile uint32_t*)(0x42627088UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT2            *((volatile uint32_t*)(0x42627088UL))
#define bFM_INTREQ_IRQ096MON_QPRCINT3             *((volatile uint32_t*)(0x4262708CUL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT3            *((volatile uint32_t*)(0x4262708CUL))
#define bFM_INTREQ_IRQ096MON_QPRCINT4             *((volatile uint32_t*)(0x42627090UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT4            *((volatile uint32_t*)(0x42627090UL))
#define bFM_INTREQ_IRQ096MON_QPRCINT5             *((volatile uint32_t*)(0x42627094UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT5            *((volatile uint32_t*)(0x42627094UL))

#define bFM_INTREQ_IRQ097MON_QPRCINT0             *((volatile uint32_t*)(0x42627100UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT0            *((volatile uint32_t*)(0x42627100UL))
#define bFM_INTREQ_IRQ097MON_QPRCINT1             *((volatile uint32_t*)(0x42627104UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT1            *((volatile uint32_t*)(0x42627104UL))
#define bFM_INTREQ_IRQ097MON_QPRCINT2             *((volatile uint32_t*)(0x42627108UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT2            *((volatile uint32_t*)(0x42627108UL))
#define bFM_INTREQ_IRQ097MON_QPRCINT3             *((volatile uint32_t*)(0x4262710CUL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT3            *((volatile uint32_t*)(0x4262710CUL))
#define bFM_INTREQ_IRQ097MON_QPRCINT4             *((volatile uint32_t*)(0x42627110UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT4            *((volatile uint32_t*)(0x42627110UL))
#define bFM_INTREQ_IRQ097MON_QPRCINT5             *((volatile uint32_t*)(0x42627114UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT5            *((volatile uint32_t*)(0x42627114UL))

#define bFM_INTREQ_IRQ098MON_BTINT0               *((volatile uint32_t*)(0x42627180UL))
#define bFM4_INTREQ_IRQ098MON_BTINT0              *((volatile uint32_t*)(0x42627180UL))
#define bFM_INTREQ_IRQ098MON_BTINT1               *((volatile uint32_t*)(0x42627184UL))
#define bFM4_INTREQ_IRQ098MON_BTINT1              *((volatile uint32_t*)(0x42627184UL))

#define bFM_INTREQ_IRQ099MON_BTINT0               *((volatile uint32_t*)(0x42627200UL))
#define bFM4_INTREQ_IRQ099MON_BTINT0              *((volatile uint32_t*)(0x42627200UL))
#define bFM_INTREQ_IRQ099MON_BTINT1               *((volatile uint32_t*)(0x42627204UL))
#define bFM4_INTREQ_IRQ099MON_BTINT1              *((volatile uint32_t*)(0x42627204UL))

#define bFM_INTREQ_IRQ100MON_BTINT0               *((volatile uint32_t*)(0x42627280UL))
#define bFM4_INTREQ_IRQ100MON_BTINT0              *((volatile uint32_t*)(0x42627280UL))
#define bFM_INTREQ_IRQ100MON_BTINT1               *((volatile uint32_t*)(0x42627284UL))
#define bFM4_INTREQ_IRQ100MON_BTINT1              *((volatile uint32_t*)(0x42627284UL))

