neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_INTREQ_IRQ101MON_BTINT0               *((volatile uint32_t*)(0x42627300UL))
#define bFM4_INTREQ_IRQ101MON_BTINT0              *((volatile uint32_t*)(0x42627300UL))
#define bFM_INTREQ_IRQ101MON_BTINT1               *((volatile uint32_t*)(0x42627304UL))
#define bFM4_INTREQ_IRQ101MON_BTINT1              *((volatile uint32_t*)(0x42627304UL))

#define bFM_INTREQ_IRQ102MON_BTINT0               *((volatile uint32_t*)(0x42627380UL))
#define bFM4_INTREQ_IRQ102MON_BTINT0              *((volatile uint32_t*)(0x42627380UL))
#define bFM_INTREQ_IRQ102MON_BTINT1               *((volatile uint32_t*)(0x42627384UL))
#define bFM4_INTREQ_IRQ102MON_BTINT1              *((volatile uint32_t*)(0x42627384UL))
#define bFM_INTREQ_IRQ102MON_BTINT2               *((volatile uint32_t*)(0x42627388UL))
#define bFM4_INTREQ_IRQ102MON_BTINT2              *((volatile uint32_t*)(0x42627388UL))
#define bFM_INTREQ_IRQ102MON_BTINT3               *((volatile uint32_t*)(0x4262738CUL))
#define bFM4_INTREQ_IRQ102MON_BTINT3              *((volatile uint32_t*)(0x4262738CUL))
#define bFM_INTREQ_IRQ102MON_BTINT4               *((volatile uint32_t*)(0x42627390UL))
#define bFM4_INTREQ_IRQ102MON_BTINT4              *((volatile uint32_t*)(0x42627390UL))
#define bFM_INTREQ_IRQ102MON_BTINT5               *((volatile uint32_t*)(0x42627394UL))
#define bFM4_INTREQ_IRQ102MON_BTINT5              *((volatile uint32_t*)(0x42627394UL))
#define bFM_INTREQ_IRQ102MON_BTINT6               *((volatile uint32_t*)(0x42627398UL))
#define bFM4_INTREQ_IRQ102MON_BTINT6              *((volatile uint32_t*)(0x42627398UL))
#define bFM_INTREQ_IRQ102MON_BTINT7               *((volatile uint32_t*)(0x4262739CUL))
#define bFM4_INTREQ_IRQ102MON_BTINT7              *((volatile uint32_t*)(0x4262739CUL))

#define bFM_INTREQ_IRQ103MON_MFSINT8_RX           *((volatile uint32_t*)(0x42627400UL))
#define bFM4_INTREQ_IRQ103MON_MFSINT8_RX          *((volatile uint32_t*)(0x42627400UL))

#define bFM_INTREQ_IRQ104MON_MFSINT8_TX           *((volatile uint32_t*)(0x42627480UL))
#define bFM4_INTREQ_IRQ104MON_MFSINT8_TX          *((volatile uint32_t*)(0x42627480UL))
#define bFM_INTREQ_IRQ104MON_MFSINT8_STATUS       *((volatile uint32_t*)(0x42627484UL))
#define bFM4_INTREQ_IRQ104MON_MFSINT8_STATUS      *((volatile uint32_t*)(0x42627484UL))

#define bFM_INTREQ_IRQ105MON_MFSINT9_RX           *((volatile uint32_t*)(0x42627500UL))
#define bFM4_INTREQ_IRQ105MON_MFSINT9_RX          *((volatile uint32_t*)(0x42627500UL))

#define bFM_INTREQ_IRQ106MON_MFSINT9_TX           *((volatile uint32_t*)(0x42627580UL))
#define bFM4_INTREQ_IRQ106MON_MFSINT9_TX          *((volatile uint32_t*)(0x42627580UL))
#define bFM_INTREQ_IRQ106MON_MFSINT9_STATUS       *((volatile uint32_t*)(0x42627584UL))
#define bFM4_INTREQ_IRQ106MON_MFSINT9_STATUS      *((volatile uint32_t*)(0x42627584UL))

#define bFM_INTREQ_IRQ107MON_MFSINT10_RX          *((volatile uint32_t*)(0x42627600UL))
#define bFM4_INTREQ_IRQ107MON_MFSINT10_RX         *((volatile uint32_t*)(0x42627600UL))

#define bFM_INTREQ_IRQ108MON_MFSINT10_TX          *((volatile uint32_t*)(0x42627680UL))
#define bFM4_INTREQ_IRQ108MON_MFSINT10_TX         *((volatile uint32_t*)(0x42627680UL))
#define bFM_INTREQ_IRQ108MON_MFSINT10_STATUS      *((volatile uint32_t*)(0x42627684UL))
#define bFM4_INTREQ_IRQ108MON_MFSINT10_STATUS     *((volatile uint32_t*)(0x42627684UL))

#define bFM_INTREQ_IRQ109MON_MFSINT11_RX          *((volatile uint32_t*)(0x42627700UL))
#define bFM4_INTREQ_IRQ109MON_MFSINT11_RX         *((volatile uint32_t*)(0x42627700UL))

#define bFM_INTREQ_IRQ110MON_MFSINT11_TX          *((volatile uint32_t*)(0x42627780UL))
#define bFM4_INTREQ_IRQ110MON_MFSINT11_TX         *((volatile uint32_t*)(0x42627780UL))
#define bFM_INTREQ_IRQ110MON_MFSINT11_STATUS      *((volatile uint32_t*)(0x42627784UL))
#define bFM4_INTREQ_IRQ110MON_MFSINT11_STATUS     *((volatile uint32_t*)(0x42627784UL))

#define bFM_INTREQ_IRQ111MON_ADCINT0              *((volatile uint32_t*)(0x42627800UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT0             *((volatile uint32_t*)(0x42627800UL))
#define bFM_INTREQ_IRQ111MON_ADCINT1              *((volatile uint32_t*)(0x42627804UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT1             *((volatile uint32_t*)(0x42627804UL))
#define bFM_INTREQ_IRQ111MON_ADCINT2              *((volatile uint32_t*)(0x42627808UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT2             *((volatile uint32_t*)(0x42627808UL))
#define bFM_INTREQ_IRQ111MON_ADCINT3              *((volatile uint32_t*)(0x4262780CUL))
#define bFM4_INTREQ_IRQ111MON_ADCINT3             *((volatile uint32_t*)(0x4262780CUL))
#define bFM_INTREQ_IRQ111MON_ADCINT4              *((volatile uint32_t*)(0x42627810UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT4             *((volatile uint32_t*)(0x42627810UL))

#define bFM_INTREQ_IRQ112MON_I2SDINT0             *((volatile uint32_t*)(0x42627880UL))
#define bFM4_INTREQ_IRQ112MON_I2SDINT0            *((volatile uint32_t*)(0x42627880UL))
#define bFM_INTREQ_IRQ112MON_I2SDINT1             *((volatile uint32_t*)(0x42627884UL))
#define bFM4_INTREQ_IRQ112MON_I2SDINT1            *((volatile uint32_t*)(0x42627884UL))
#define bFM_INTREQ_IRQ112MON_HSSPIDINT0           *((volatile uint32_t*)(0x42627888UL))
#define bFM4_INTREQ_IRQ112MON_HSSPIDINT0          *((volatile uint32_t*)(0x42627888UL))
#define bFM_INTREQ_IRQ112MON_HSSPIDINT1           *((volatile uint32_t*)(0x4262788CUL))
#define bFM4_INTREQ_IRQ112MON_HSSPIDINT1          *((volatile uint32_t*)(0x4262788CUL))
#define bFM_INTREQ_IRQ112MON_PCRCDINT             *((volatile uint32_t*)(0x42627890UL))
#define bFM4_INTREQ_IRQ112MON_PCRCDINT            *((volatile uint32_t*)(0x42627890UL))
#define bFM_INTREQ_IRQ112MON_CANDINT              *((volatile uint32_t*)(0x42627894UL))
#define bFM4_INTREQ_IRQ112MON_CANDINT             *((volatile uint32_t*)(0x42627894UL))

#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT0         *((volatile uint32_t*)(0x42627900UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT0        *((volatile uint32_t*)(0x42627900UL))
#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT1         *((volatile uint32_t*)(0x42627904UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT1        *((volatile uint32_t*)(0x42627904UL))
#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT2         *((volatile uint32_t*)(0x42627908UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT2        *((volatile uint32_t*)(0x42627908UL))
#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT3         *((volatile uint32_t*)(0x4262790CUL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT3        *((volatile uint32_t*)(0x4262790CUL))
#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT4         *((volatile uint32_t*)(0x42627910UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT4        *((volatile uint32_t*)(0x42627910UL))
#define bFM_INTREQ_IRQ113MON_RCEC0INT             *((volatile uint32_t*)(0x42627914UL))
#define bFM4_INTREQ_IRQ113MON_RCEC0INT            *((volatile uint32_t*)(0x42627914UL))

#define bFM_INTREQ_IRQ114MON_USB_INT0             *((volatile uint32_t*)(0x42627980UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT0            *((volatile uint32_t*)(0x42627980UL))
#define bFM_INTREQ_IRQ114MON_USB_INT1             *((volatile uint32_t*)(0x42627984UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT1            *((volatile uint32_t*)(0x42627984UL))
#define bFM_INTREQ_IRQ114MON_USB_INT2             *((volatile uint32_t*)(0x42627988UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT2            *((volatile uint32_t*)(0x42627988UL))
#define bFM_INTREQ_IRQ114MON_USB_INT3             *((volatile uint32_t*)(0x4262798CUL))
#define bFM4_INTREQ_IRQ114MON_USB_INT3            *((volatile uint32_t*)(0x4262798CUL))
#define bFM_INTREQ_IRQ114MON_USB_INT4             *((volatile uint32_t*)(0x42627990UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT4            *((volatile uint32_t*)(0x42627990UL))
#define bFM_INTREQ_IRQ114MON_USB_INT5             *((volatile uint32_t*)(0x42627994UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT5            *((volatile uint32_t*)(0x42627994UL))
#define bFM_INTREQ_IRQ114MON_RCEC1INT             *((volatile uint32_t*)(0x42627998UL))
#define bFM4_INTREQ_IRQ114MON_RCEC1INT            *((volatile uint32_t*)(0x42627998UL))

