neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_INTREQ_IRQ115MON_HSSPIINT0            *((volatile uint32_t*)(0x42627A00UL))
#define bFM4_INTREQ_IRQ115MON_HSSPIINT0           *((volatile uint32_t*)(0x42627A00UL))
#define bFM_INTREQ_IRQ115MON_HSSPIINT1            *((volatile uint32_t*)(0x42627A04UL))
#define bFM4_INTREQ_IRQ115MON_HSSPIINT1           *((volatile uint32_t*)(0x42627A04UL))
#define bFM_INTREQ_IRQ115MON_HSSPIINT2            *((volatile uint32_t*)(0x42627A08UL))
#define bFM4_INTREQ_IRQ115MON_HSSPIINT2           *((volatile uint32_t*)(0x42627A08UL))

#define bFM_INTREQ_IRQ117MON_I2SINT               *((volatile uint32_t*)(0x42627B00UL))
#define bFM4_INTREQ_IRQ117MON_I2SINT              *((volatile uint32_t*)(0x42627B00UL))
#define bFM_INTREQ_IRQ117MON_PCRC                 *((volatile uint32_t*)(0x42627B04UL))
#define bFM4_INTREQ_IRQ117MON_PCRC                *((volatile uint32_t*)(0x42627B04UL))

#define bFM_INTREQ_IRQ118MON_SDINT0               *((volatile uint32_t*)(0x42627B80UL))
#define bFM4_INTREQ_IRQ118MON_SDINT0              *((volatile uint32_t*)(0x42627B80UL))
#define bFM_INTREQ_IRQ118MON_SDINT1               *((volatile uint32_t*)(0x42627B84UL))
#define bFM4_INTREQ_IRQ118MON_SDINT1              *((volatile uint32_t*)(0x42627B84UL))

#define bFM_INTREQ_IRQ119MON_FLINT                *((volatile uint32_t*)(0x42627C00UL))
#define bFM4_INTREQ_IRQ119MON_FLINT               *((volatile uint32_t*)(0x42627C00UL))

#define bFM_INTREQ_IRQ120MON_MFSINT12_RX          *((volatile uint32_t*)(0x42627C80UL))
#define bFM4_INTREQ_IRQ120MON_MFSINT12_RX         *((volatile uint32_t*)(0x42627C80UL))

#define bFM_INTREQ_IRQ121MON_MFSINT12_TX          *((volatile uint32_t*)(0x42627D00UL))
#define bFM4_INTREQ_IRQ121MON_MFSINT12_TX         *((volatile uint32_t*)(0x42627D00UL))
#define bFM_INTREQ_IRQ121MON_MFSINT12_STATUS      *((volatile uint32_t*)(0x42627D04UL))
#define bFM4_INTREQ_IRQ121MON_MFSINT12_STATUS     *((volatile uint32_t*)(0x42627D04UL))

#define bFM_INTREQ_IRQ122MON_MFSINT13_RX          *((volatile uint32_t*)(0x42627D80UL))
#define bFM4_INTREQ_IRQ122MON_MFSINT13_RX         *((volatile uint32_t*)(0x42627D80UL))

#define bFM_INTREQ_IRQ123MON_MFSINT13_TX          *((volatile uint32_t*)(0x42627E00UL))
#define bFM4_INTREQ_IRQ123MON_MFSINT13_TX         *((volatile uint32_t*)(0x42627E00UL))
#define bFM_INTREQ_IRQ123MON_MFSINT13_STATUS      *((volatile uint32_t*)(0x42627E04UL))
#define bFM4_INTREQ_IRQ123MON_MFSINT13_STATUS     *((volatile uint32_t*)(0x42627E04UL))

#define bFM_INTREQ_IRQ124MON_MFSINT14_RX          *((volatile uint32_t*)(0x42627E80UL))
#define bFM4_INTREQ_IRQ124MON_MFSINT14_RX         *((volatile uint32_t*)(0x42627E80UL))

#define bFM_INTREQ_IRQ125MON_MFSINT14_TX          *((volatile uint32_t*)(0x42627F00UL))
#define bFM4_INTREQ_IRQ125MON_MFSINT14_TX         *((volatile uint32_t*)(0x42627F00UL))
#define bFM_INTREQ_IRQ125MON_MFSINT14_STATUS      *((volatile uint32_t*)(0x42627F04UL))
#define bFM4_INTREQ_IRQ125MON_MFSINT14_STATUS     *((volatile uint32_t*)(0x42627F04UL))

#define bFM_INTREQ_IRQ126MON_MFSINT15_RX          *((volatile uint32_t*)(0x42627F80UL))
#define bFM4_INTREQ_IRQ126MON_MFSINT15_RX         *((volatile uint32_t*)(0x42627F80UL))

#define bFM_INTREQ_IRQ127MON_MFSINT15_TX          *((volatile uint32_t*)(0x42628000UL))
#define bFM4_INTREQ_IRQ127MON_MFSINT15_TX         *((volatile uint32_t*)(0x42628000UL))
#define bFM_INTREQ_IRQ127MON_MFSINT15_STATUS      *((volatile uint32_t*)(0x42628004UL))
#define bFM4_INTREQ_IRQ127MON_MFSINT15_STATUS     *((volatile uint32_t*)(0x42628004UL))

#define bFM_INTREQ_ODDPKS_ODDPKS0                 *((volatile uint32_t*)(0x42620200UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS0                *((volatile uint32_t*)(0x42620200UL))
#define bFM_INTREQ_ODDPKS_ODDPKS1                 *((volatile uint32_t*)(0x42620204UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS1                *((volatile uint32_t*)(0x42620204UL))
#define bFM_INTREQ_ODDPKS_ODDPKS2                 *((volatile uint32_t*)(0x42620208UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS2                *((volatile uint32_t*)(0x42620208UL))
#define bFM_INTREQ_ODDPKS_ODDPKS3                 *((volatile uint32_t*)(0x4262020CUL))
#define bFM4_INTREQ_ODDPKS_ODDPKS3                *((volatile uint32_t*)(0x4262020CUL))
#define bFM_INTREQ_ODDPKS_ODDPKS4                 *((volatile uint32_t*)(0x42620210UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS4                *((volatile uint32_t*)(0x42620210UL))

#define bFM_INTREQ_ODDPKS1_ODDPKS10               *((volatile uint32_t*)(0x42620280UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS10              *((volatile uint32_t*)(0x42620280UL))
#define bFM_INTREQ_ODDPKS1_ODDPKS11               *((volatile uint32_t*)(0x42620284UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS11              *((volatile uint32_t*)(0x42620284UL))
#define bFM_INTREQ_ODDPKS1_ODDPKS12               *((volatile uint32_t*)(0x42620288UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS12              *((volatile uint32_t*)(0x42620288UL))
#define bFM_INTREQ_ODDPKS1_ODDPKS13               *((volatile uint32_t*)(0x4262028CUL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS13              *((volatile uint32_t*)(0x4262028CUL))
#define bFM_INTREQ_ODDPKS1_ODDPKS14               *((volatile uint32_t*)(0x42620290UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS14              *((volatile uint32_t*)(0x42620290UL))


/******************************************************************************
 ** LSCRP Registers LSCRP
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** LVD Registers LVD
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_LVD_LVD_CLR_LVDCL                     *((volatile uint32_t*)(0x426A011CUL))
#define bFM4_LVD_LVD_CLR_LVDCL                    *((volatile uint32_t*)(0x426A011CUL))

#define bFM_LVD_LVD_CTL_LVDIE                     *((volatile uint32_t*)(0x426A001CUL))
#define bFM4_LVD_LVD_CTL_LVDIE                    *((volatile uint32_t*)(0x426A001CUL))

