neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_LVD_LVD_STR_LVDIR                     *((volatile uint32_t*)(0x426A009CUL))
#define bFM4_LVD_LVD_STR_LVDIR                    *((volatile uint32_t*)(0x426A009CUL))

#define bFM_LVD_LVD_STR2_LVDIRDY                  *((volatile uint32_t*)(0x426A021CUL))
#define bFM4_LVD_LVD_STR2_LVDIRDY                 *((volatile uint32_t*)(0x426A021CUL))


/******************************************************************************
 ** MFS Registers MFS0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS0_CSIO_ESCR_CSFE                   *((volatile uint32_t*)(0x42700094UL))
#define bFM4_MFS0_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x42700094UL))
#define bFM_MFS0_CSIO_ESCR_L3                     *((volatile uint32_t*)(0x42700098UL))
#define bFM4_MFS0_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x42700098UL))
#define bFM_MFS0_CSIO_ESCR_SOP                    *((volatile uint32_t*)(0x4270009CUL))
#define bFM4_MFS0_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4270009CUL))

#define bFM_MFS0_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x42700280UL))
#define bFM4_MFS0_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42700280UL))
#define bFM_MFS0_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x42700284UL))
#define bFM4_MFS0_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42700284UL))
#define bFM_MFS0_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x42700288UL))
#define bFM4_MFS0_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42700288UL))
#define bFM_MFS0_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4270028CUL))
#define bFM4_MFS0_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4270028CUL))
#define bFM_MFS0_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x42700290UL))
#define bFM4_MFS0_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42700290UL))
#define bFM_MFS0_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x42700294UL))
#define bFM4_MFS0_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42700294UL))
#define bFM_MFS0_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x42700298UL))
#define bFM4_MFS0_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42700298UL))
#define bFM_MFS0_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x427002A0UL))
#define bFM4_MFS0_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427002A0UL))
#define bFM_MFS0_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x427002A4UL))
#define bFM4_MFS0_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427002A4UL))
#define bFM_MFS0_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x427002A8UL))
#define bFM4_MFS0_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427002A8UL))
#define bFM_MFS0_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x427002ACUL))
#define bFM4_MFS0_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427002ACUL))
#define bFM_MFS0_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x427002B0UL))
#define bFM4_MFS0_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427002B0UL))

#define bFM_MFS0_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x42700480UL))
#define bFM4_MFS0_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42700480UL))
#define bFM_MFS0_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x42700498UL))
#define bFM4_MFS0_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42700498UL))
#define bFM_MFS0_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4270049CUL))
#define bFM4_MFS0_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4270049CUL))
#define bFM_MFS0_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x427004A0UL))
#define bFM4_MFS0_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427004A0UL))
#define bFM_MFS0_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x427004ACUL))
#define bFM4_MFS0_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427004ACUL))
#define bFM_MFS0_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x427004B0UL))
#define bFM4_MFS0_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427004B0UL))
#define bFM_MFS0_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x427004B4UL))
#define bFM4_MFS0_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427004B4UL))

#define bFM_MFS0_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x42700020UL))
#define bFM4_MFS0_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42700020UL))
#define bFM_MFS0_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x42700024UL))
#define bFM4_MFS0_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42700024UL))
#define bFM_MFS0_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x42700028UL))
#define bFM4_MFS0_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42700028UL))
#define bFM_MFS0_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4270002CUL))
#define bFM4_MFS0_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4270002CUL))
#define bFM_MFS0_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x42700030UL))
#define bFM4_MFS0_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42700030UL))
#define bFM_MFS0_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x42700034UL))
#define bFM4_MFS0_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42700034UL))
#define bFM_MFS0_CSIO_SCR_MS                      *((volatile uint32_t*)(0x42700038UL))
#define bFM4_MFS0_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42700038UL))
#define bFM_MFS0_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4270003CUL))
#define bFM4_MFS0_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4270003CUL))

#define bFM_MFS0_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x42700600UL))
#define bFM4_MFS0_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42700600UL))
#define bFM_MFS0_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x42700604UL))
#define bFM4_MFS0_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42700604UL))
#define bFM_MFS0_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x42700608UL))
#define bFM4_MFS0_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42700608UL))
#define bFM_MFS0_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4270060CUL))
#define bFM4_MFS0_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4270060CUL))
#define bFM_MFS0_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x42700610UL))
#define bFM4_MFS0_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42700610UL))
#define bFM_MFS0_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x42700614UL))
#define bFM4_MFS0_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42700614UL))
#define bFM_MFS0_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x42700624UL))
#define bFM4_MFS0_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42700624UL))

