neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS0_CSIO_SCSFR0_CS1SPI               *((volatile uint32_t*)(0x42700694UL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x42700694UL))
#define bFM_MFS0_CSIO_SCSFR0_CS1SCINV             *((volatile uint32_t*)(0x42700698UL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x42700698UL))
#define bFM_MFS0_CSIO_SCSFR0_CS1CSLVL             *((volatile uint32_t*)(0x4270069CUL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4270069CUL))

#define bFM_MFS0_CSIO_SCSFR1_CS2SPI               *((volatile uint32_t*)(0x427006B4UL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x427006B4UL))
#define bFM_MFS0_CSIO_SCSFR1_CS2SCINV             *((volatile uint32_t*)(0x427006B8UL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x427006B8UL))
#define bFM_MFS0_CSIO_SCSFR1_CS2CSLVL             *((volatile uint32_t*)(0x427006BCUL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x427006BCUL))

#define bFM_MFS0_CSIO_SCSFR2_CS3SPI               *((volatile uint32_t*)(0x42700714UL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x42700714UL))
#define bFM_MFS0_CSIO_SCSFR2_CS3SCINV             *((volatile uint32_t*)(0x42700718UL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x42700718UL))
#define bFM_MFS0_CSIO_SCSFR2_CS3CSLVL             *((volatile uint32_t*)(0x4270071CUL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4270071CUL))

#define bFM_MFS0_CSIO_SMR_SOE                     *((volatile uint32_t*)(0x42700000UL))
#define bFM4_MFS0_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x42700000UL))
#define bFM_MFS0_CSIO_SMR_SCKE                    *((volatile uint32_t*)(0x42700004UL))
#define bFM4_MFS0_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x42700004UL))
#define bFM_MFS0_CSIO_SMR_BDS                     *((volatile uint32_t*)(0x42700008UL))
#define bFM4_MFS0_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x42700008UL))
#define bFM_MFS0_CSIO_SMR_SCINV                   *((volatile uint32_t*)(0x4270000CUL))
#define bFM4_MFS0_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4270000CUL))

#define bFM_MFS0_CSIO_SSR_TBI                     *((volatile uint32_t*)(0x427000A0UL))
#define bFM4_MFS0_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x427000A0UL))
#define bFM_MFS0_CSIO_SSR_TDRE                    *((volatile uint32_t*)(0x427000A4UL))
#define bFM4_MFS0_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x427000A4UL))
#define bFM_MFS0_CSIO_SSR_RDRF                    *((volatile uint32_t*)(0x427000A8UL))
#define bFM4_MFS0_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x427000A8UL))
#define bFM_MFS0_CSIO_SSR_ORE                     *((volatile uint32_t*)(0x427000ACUL))
#define bFM4_MFS0_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x427000ACUL))
#define bFM_MFS0_CSIO_SSR_AWC                     *((volatile uint32_t*)(0x427000B0UL))
#define bFM4_MFS0_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x427000B0UL))
#define bFM_MFS0_CSIO_SSR_REC                     *((volatile uint32_t*)(0x427000BCUL))
#define bFM4_MFS0_CSIO_SSR_REC                    *((volatile uint32_t*)(0x427000BCUL))

#define bFM_MFS0_I2C_EIBCR_BEC                    *((volatile uint32_t*)(0x427003A0UL))
#define bFM4_MFS0_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x427003A0UL))
#define bFM_MFS0_I2C_EIBCR_SOCE                   *((volatile uint32_t*)(0x427003A4UL))
#define bFM4_MFS0_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x427003A4UL))
#define bFM_MFS0_I2C_EIBCR_SCLC                   *((volatile uint32_t*)(0x427003A8UL))
#define bFM4_MFS0_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x427003A8UL))
#define bFM_MFS0_I2C_EIBCR_SDAC                   *((volatile uint32_t*)(0x427003ACUL))
#define bFM4_MFS0_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x427003ACUL))
#define bFM_MFS0_I2C_EIBCR_SCLS                   *((volatile uint32_t*)(0x427003B0UL))
#define bFM4_MFS0_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x427003B0UL))
#define bFM_MFS0_I2C_EIBCR_SDAS                   *((volatile uint32_t*)(0x427003B4UL))
#define bFM4_MFS0_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x427003B4UL))

#define bFM_MFS0_I2C_FCR_FE1                      *((volatile uint32_t*)(0x42700280UL))
#define bFM4_MFS0_I2C_FCR_FE1                     *((volatile uint32_t*)(0x42700280UL))
#define bFM_MFS0_I2C_FCR_FE2                      *((volatile uint32_t*)(0x42700284UL))
#define bFM4_MFS0_I2C_FCR_FE2                     *((volatile uint32_t*)(0x42700284UL))
#define bFM_MFS0_I2C_FCR_FCL1                     *((volatile uint32_t*)(0x42700288UL))
#define bFM4_MFS0_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x42700288UL))
#define bFM_MFS0_I2C_FCR_FCL2                     *((volatile uint32_t*)(0x4270028CUL))
#define bFM4_MFS0_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4270028CUL))
#define bFM_MFS0_I2C_FCR_FSET                     *((volatile uint32_t*)(0x42700290UL))
#define bFM4_MFS0_I2C_FCR_FSET                    *((volatile uint32_t*)(0x42700290UL))
#define bFM_MFS0_I2C_FCR_FLD                      *((volatile uint32_t*)(0x42700294UL))
#define bFM4_MFS0_I2C_FCR_FLD                     *((volatile uint32_t*)(0x42700294UL))
#define bFM_MFS0_I2C_FCR_FLST                     *((volatile uint32_t*)(0x42700298UL))
#define bFM4_MFS0_I2C_FCR_FLST                    *((volatile uint32_t*)(0x42700298UL))
#define bFM_MFS0_I2C_FCR_FSEL                     *((volatile uint32_t*)(0x427002A0UL))
#define bFM4_MFS0_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x427002A0UL))
#define bFM_MFS0_I2C_FCR_FTIE                     *((volatile uint32_t*)(0x427002A4UL))
#define bFM4_MFS0_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x427002A4UL))
#define bFM_MFS0_I2C_FCR_FDRQ                     *((volatile uint32_t*)(0x427002A8UL))
#define bFM4_MFS0_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x427002A8UL))
#define bFM_MFS0_I2C_FCR_FRIIE                    *((volatile uint32_t*)(0x427002ACUL))
#define bFM4_MFS0_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x427002ACUL))
#define bFM_MFS0_I2C_FCR_FLSTE                    *((volatile uint32_t*)(0x427002B0UL))
#define bFM4_MFS0_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x427002B0UL))

#define bFM_MFS0_I2C_IBCR_INT                     *((volatile uint32_t*)(0x42700020UL))
#define bFM4_MFS0_I2C_IBCR_INT                    *((volatile uint32_t*)(0x42700020UL))
#define bFM_MFS0_I2C_IBCR_BER                     *((volatile uint32_t*)(0x42700024UL))
#define bFM4_MFS0_I2C_IBCR_BER                    *((volatile uint32_t*)(0x42700024UL))
#define bFM_MFS0_I2C_IBCR_INTE                    *((volatile uint32_t*)(0x42700028UL))
#define bFM4_MFS0_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x42700028UL))
#define bFM_MFS0_I2C_IBCR_CNDE                    *((volatile uint32_t*)(0x4270002CUL))
#define bFM4_MFS0_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4270002CUL))
#define bFM_MFS0_I2C_IBCR_WSEL                    *((volatile uint32_t*)(0x42700030UL))
#define bFM4_MFS0_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x42700030UL))
#define bFM_MFS0_I2C_IBCR_ACKE                    *((volatile uint32_t*)(0x42700034UL))
#define bFM4_MFS0_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x42700034UL))
#define bFM_MFS0_I2C_IBCR_ACT_SCC                 *((volatile uint32_t*)(0x42700038UL))
#define bFM4_MFS0_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x42700038UL))
#define bFM_MFS0_I2C_IBCR_MSS                     *((volatile uint32_t*)(0x4270003CUL))
#define bFM4_MFS0_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4270003CUL))

#define bFM_MFS0_I2C_IBSR_BB                      *((volatile uint32_t*)(0x42700080UL))
#define bFM4_MFS0_I2C_IBSR_BB                     *((volatile uint32_t*)(0x42700080UL))
#define bFM_MFS0_I2C_IBSR_SPC                     *((volatile uint32_t*)(0x42700084UL))
#define bFM4_MFS0_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x42700084UL))
#define bFM_MFS0_I2C_IBSR_RSC                     *((volatile uint32_t*)(0x42700088UL))
#define bFM4_MFS0_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x42700088UL))
#define bFM_MFS0_I2C_IBSR_AL                      *((volatile uint32_t*)(0x4270008CUL))
#define bFM4_MFS0_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4270008CUL))
#define bFM_MFS0_I2C_IBSR_TRX                     *((volatile uint32_t*)(0x42700090UL))
#define bFM4_MFS0_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x42700090UL))
#define bFM_MFS0_I2C_IBSR_RSA                     *((volatile uint32_t*)(0x42700094UL))
#define bFM4_MFS0_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x42700094UL))
#define bFM_MFS0_I2C_IBSR_RACK                    *((volatile uint32_t*)(0x42700098UL))
#define bFM4_MFS0_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x42700098UL))
#define bFM_MFS0_I2C_IBSR_FBT                     *((volatile uint32_t*)(0x4270009CUL))
#define bFM4_MFS0_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4270009CUL))

