neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS0_I2C_ISBA_SAEN                    *((volatile uint32_t*)(0x4270021CUL))
#define bFM4_MFS0_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4270021CUL))

#define bFM_MFS0_I2C_ISMK_EN                      *((volatile uint32_t*)(0x4270023CUL))
#define bFM4_MFS0_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4270023CUL))

#define bFM_MFS0_I2C_SMR_TIE                      *((volatile uint32_t*)(0x42700008UL))
#define bFM4_MFS0_I2C_SMR_TIE                     *((volatile uint32_t*)(0x42700008UL))
#define bFM_MFS0_I2C_SMR_RIE                      *((volatile uint32_t*)(0x4270000CUL))
#define bFM4_MFS0_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4270000CUL))

#define bFM_MFS0_I2C_SSR_TBI                      *((volatile uint32_t*)(0x427000A0UL))
#define bFM4_MFS0_I2C_SSR_TBI                     *((volatile uint32_t*)(0x427000A0UL))
#define bFM_MFS0_I2C_SSR_TDRE                     *((volatile uint32_t*)(0x427000A4UL))
#define bFM4_MFS0_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x427000A4UL))
#define bFM_MFS0_I2C_SSR_RDRF                     *((volatile uint32_t*)(0x427000A8UL))
#define bFM4_MFS0_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x427000A8UL))
#define bFM_MFS0_I2C_SSR_ORE                      *((volatile uint32_t*)(0x427000ACUL))
#define bFM4_MFS0_I2C_SSR_ORE                     *((volatile uint32_t*)(0x427000ACUL))
#define bFM_MFS0_I2C_SSR_TBIE                     *((volatile uint32_t*)(0x427000B0UL))
#define bFM4_MFS0_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x427000B0UL))
#define bFM_MFS0_I2C_SSR_DMA                      *((volatile uint32_t*)(0x427000B4UL))
#define bFM4_MFS0_I2C_SSR_DMA                     *((volatile uint32_t*)(0x427000B4UL))
#define bFM_MFS0_I2C_SSR_TSET                     *((volatile uint32_t*)(0x427000B8UL))
#define bFM4_MFS0_I2C_SSR_TSET                    *((volatile uint32_t*)(0x427000B8UL))
#define bFM_MFS0_I2C_SSR_REC                      *((volatile uint32_t*)(0x427000BCUL))
#define bFM4_MFS0_I2C_SSR_REC                     *((volatile uint32_t*)(0x427000BCUL))

#define bFM_MFS0_LIN_BGR_EXT                      *((volatile uint32_t*)(0x427001BCUL))
#define bFM4_MFS0_LIN_BGR_EXT                     *((volatile uint32_t*)(0x427001BCUL))

#define bFM_MFS0_LIN_ESCR_LBIE                    *((volatile uint32_t*)(0x42700090UL))
#define bFM4_MFS0_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x42700090UL))
#define bFM_MFS0_LIN_ESCR_ESBL                    *((volatile uint32_t*)(0x42700098UL))
#define bFM4_MFS0_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x42700098UL))

#define bFM_MFS0_LIN_FCR_FE1                      *((volatile uint32_t*)(0x42700280UL))
#define bFM4_MFS0_LIN_FCR_FE1                     *((volatile uint32_t*)(0x42700280UL))
#define bFM_MFS0_LIN_FCR_FE2                      *((volatile uint32_t*)(0x42700284UL))
#define bFM4_MFS0_LIN_FCR_FE2                     *((volatile uint32_t*)(0x42700284UL))
#define bFM_MFS0_LIN_FCR_FCL1                     *((volatile uint32_t*)(0x42700288UL))
#define bFM4_MFS0_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x42700288UL))
#define bFM_MFS0_LIN_FCR_FCL2                     *((volatile uint32_t*)(0x4270028CUL))
#define bFM4_MFS0_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4270028CUL))
#define bFM_MFS0_LIN_FCR_FSET                     *((volatile uint32_t*)(0x42700290UL))
#define bFM4_MFS0_LIN_FCR_FSET                    *((volatile uint32_t*)(0x42700290UL))
#define bFM_MFS0_LIN_FCR_FLD                      *((volatile uint32_t*)(0x42700294UL))
#define bFM4_MFS0_LIN_FCR_FLD                     *((volatile uint32_t*)(0x42700294UL))
#define bFM_MFS0_LIN_FCR_FLST                     *((volatile uint32_t*)(0x42700298UL))
#define bFM4_MFS0_LIN_FCR_FLST                    *((volatile uint32_t*)(0x42700298UL))
#define bFM_MFS0_LIN_FCR_FSEL                     *((volatile uint32_t*)(0x427002A0UL))
#define bFM4_MFS0_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x427002A0UL))
#define bFM_MFS0_LIN_FCR_FTIE                     *((volatile uint32_t*)(0x427002A4UL))
#define bFM4_MFS0_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x427002A4UL))
#define bFM_MFS0_LIN_FCR_FDRQ                     *((volatile uint32_t*)(0x427002A8UL))
#define bFM4_MFS0_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x427002A8UL))
#define bFM_MFS0_LIN_FCR_FRIIE                    *((volatile uint32_t*)(0x427002ACUL))
#define bFM4_MFS0_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x427002ACUL))
#define bFM_MFS0_LIN_FCR_FLSTE                    *((volatile uint32_t*)(0x427002B0UL))
#define bFM4_MFS0_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x427002B0UL))

#define bFM_MFS0_LIN_SCR_TXE                      *((volatile uint32_t*)(0x42700020UL))
#define bFM4_MFS0_LIN_SCR_TXE                     *((volatile uint32_t*)(0x42700020UL))
#define bFM_MFS0_LIN_SCR_RXE                      *((volatile uint32_t*)(0x42700024UL))
#define bFM4_MFS0_LIN_SCR_RXE                     *((volatile uint32_t*)(0x42700024UL))
#define bFM_MFS0_LIN_SCR_TBIE                     *((volatile uint32_t*)(0x42700028UL))
#define bFM4_MFS0_LIN_SCR_TBIE                    *((volatile uint32_t*)(0x42700028UL))
#define bFM_MFS0_LIN_SCR_TIE                      *((volatile uint32_t*)(0x4270002CUL))
#define bFM4_MFS0_LIN_SCR_TIE                     *((volatile uint32_t*)(0x4270002CUL))
#define bFM_MFS0_LIN_SCR_RIE                      *((volatile uint32_t*)(0x42700030UL))
#define bFM4_MFS0_LIN_SCR_RIE                     *((volatile uint32_t*)(0x42700030UL))
#define bFM_MFS0_LIN_SCR_LBR                      *((volatile uint32_t*)(0x42700034UL))
#define bFM4_MFS0_LIN_SCR_LBR                     *((volatile uint32_t*)(0x42700034UL))
#define bFM_MFS0_LIN_SCR_MS                       *((volatile uint32_t*)(0x42700038UL))
#define bFM4_MFS0_LIN_SCR_MS                      *((volatile uint32_t*)(0x42700038UL))
#define bFM_MFS0_LIN_SCR_UPCL                     *((volatile uint32_t*)(0x4270003CUL))
#define bFM4_MFS0_LIN_SCR_UPCL                    *((volatile uint32_t*)(0x4270003CUL))

#define bFM_MFS0_LIN_SMR_SOE                      *((volatile uint32_t*)(0x42700000UL))
#define bFM4_MFS0_LIN_SMR_SOE                     *((volatile uint32_t*)(0x42700000UL))
#define bFM_MFS0_LIN_SMR_SBL                      *((volatile uint32_t*)(0x4270000CUL))
#define bFM4_MFS0_LIN_SMR_SBL                     *((volatile uint32_t*)(0x4270000CUL))
#define bFM_MFS0_LIN_SMR_WUCR                     *((volatile uint32_t*)(0x42700010UL))
#define bFM4_MFS0_LIN_SMR_WUCR                    *((volatile uint32_t*)(0x42700010UL))

#define bFM_MFS0_LIN_SSR_TBI                      *((volatile uint32_t*)(0x427000A0UL))
#define bFM4_MFS0_LIN_SSR_TBI                     *((volatile uint32_t*)(0x427000A0UL))
#define bFM_MFS0_LIN_SSR_TDRE                     *((volatile uint32_t*)(0x427000A4UL))
#define bFM4_MFS0_LIN_SSR_TDRE                    *((volatile uint32_t*)(0x427000A4UL))
#define bFM_MFS0_LIN_SSR_RDRF                     *((volatile uint32_t*)(0x427000A8UL))
#define bFM4_MFS0_LIN_SSR_RDRF                    *((volatile uint32_t*)(0x427000A8UL))
#define bFM_MFS0_LIN_SSR_ORE                      *((volatile uint32_t*)(0x427000ACUL))
#define bFM4_MFS0_LIN_SSR_ORE                     *((volatile uint32_t*)(0x427000ACUL))
#define bFM_MFS0_LIN_SSR_FRE                      *((volatile uint32_t*)(0x427000B0UL))
#define bFM4_MFS0_LIN_SSR_FRE                     *((volatile uint32_t*)(0x427000B0UL))
#define bFM_MFS0_LIN_SSR_LBD                      *((volatile uint32_t*)(0x427000B4UL))
#define bFM4_MFS0_LIN_SSR_LBD                     *((volatile uint32_t*)(0x427000B4UL))
#define bFM_MFS0_LIN_SSR_REC                      *((volatile uint32_t*)(0x427000BCUL))
#define bFM4_MFS0_LIN_SSR_REC                     *((volatile uint32_t*)(0x427000BCUL))

