neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS0_UART_BGR_EXT                     *((volatile uint32_t*)(0x427001BCUL))
#define bFM4_MFS0_UART_BGR_EXT                    *((volatile uint32_t*)(0x427001BCUL))

#define bFM_MFS0_UART_ESCR_P                      *((volatile uint32_t*)(0x4270008CUL))
#define bFM4_MFS0_UART_ESCR_P                     *((volatile uint32_t*)(0x4270008CUL))
#define bFM_MFS0_UART_ESCR_PEN                    *((volatile uint32_t*)(0x42700090UL))
#define bFM4_MFS0_UART_ESCR_PEN                   *((volatile uint32_t*)(0x42700090UL))
#define bFM_MFS0_UART_ESCR_INV                    *((volatile uint32_t*)(0x42700094UL))
#define bFM4_MFS0_UART_ESCR_INV                   *((volatile uint32_t*)(0x42700094UL))
#define bFM_MFS0_UART_ESCR_ESBL                   *((volatile uint32_t*)(0x42700098UL))
#define bFM4_MFS0_UART_ESCR_ESBL                  *((volatile uint32_t*)(0x42700098UL))
#define bFM_MFS0_UART_ESCR_FLWEN                  *((volatile uint32_t*)(0x4270009CUL))
#define bFM4_MFS0_UART_ESCR_FLWEN                 *((volatile uint32_t*)(0x4270009CUL))

#define bFM_MFS0_UART_FCR_FE1                     *((volatile uint32_t*)(0x42700280UL))
#define bFM4_MFS0_UART_FCR_FE1                    *((volatile uint32_t*)(0x42700280UL))
#define bFM_MFS0_UART_FCR_FE2                     *((volatile uint32_t*)(0x42700284UL))
#define bFM4_MFS0_UART_FCR_FE2                    *((volatile uint32_t*)(0x42700284UL))
#define bFM_MFS0_UART_FCR_FCL1                    *((volatile uint32_t*)(0x42700288UL))
#define bFM4_MFS0_UART_FCR_FCL1                   *((volatile uint32_t*)(0x42700288UL))
#define bFM_MFS0_UART_FCR_FCL2                    *((volatile uint32_t*)(0x4270028CUL))
#define bFM4_MFS0_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4270028CUL))
#define bFM_MFS0_UART_FCR_FSET                    *((volatile uint32_t*)(0x42700290UL))
#define bFM4_MFS0_UART_FCR_FSET                   *((volatile uint32_t*)(0x42700290UL))
#define bFM_MFS0_UART_FCR_FLD                     *((volatile uint32_t*)(0x42700294UL))
#define bFM4_MFS0_UART_FCR_FLD                    *((volatile uint32_t*)(0x42700294UL))
#define bFM_MFS0_UART_FCR_FLST                    *((volatile uint32_t*)(0x42700298UL))
#define bFM4_MFS0_UART_FCR_FLST                   *((volatile uint32_t*)(0x42700298UL))
#define bFM_MFS0_UART_FCR_FSEL                    *((volatile uint32_t*)(0x427002A0UL))
#define bFM4_MFS0_UART_FCR_FSEL                   *((volatile uint32_t*)(0x427002A0UL))
#define bFM_MFS0_UART_FCR_FTIE                    *((volatile uint32_t*)(0x427002A4UL))
#define bFM4_MFS0_UART_FCR_FTIE                   *((volatile uint32_t*)(0x427002A4UL))
#define bFM_MFS0_UART_FCR_FDRQ                    *((volatile uint32_t*)(0x427002A8UL))
#define bFM4_MFS0_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x427002A8UL))
#define bFM_MFS0_UART_FCR_FRIIE                   *((volatile uint32_t*)(0x427002ACUL))
#define bFM4_MFS0_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x427002ACUL))
#define bFM_MFS0_UART_FCR_FLSTE                   *((volatile uint32_t*)(0x427002B0UL))
#define bFM4_MFS0_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x427002B0UL))

#define bFM_MFS0_UART_SCR_TXE                     *((volatile uint32_t*)(0x42700020UL))
#define bFM4_MFS0_UART_SCR_TXE                    *((volatile uint32_t*)(0x42700020UL))
#define bFM_MFS0_UART_SCR_RXE                     *((volatile uint32_t*)(0x42700024UL))
#define bFM4_MFS0_UART_SCR_RXE                    *((volatile uint32_t*)(0x42700024UL))
#define bFM_MFS0_UART_SCR_TBIE                    *((volatile uint32_t*)(0x42700028UL))
#define bFM4_MFS0_UART_SCR_TBIE                   *((volatile uint32_t*)(0x42700028UL))
#define bFM_MFS0_UART_SCR_TIE                     *((volatile uint32_t*)(0x4270002CUL))
#define bFM4_MFS0_UART_SCR_TIE                    *((volatile uint32_t*)(0x4270002CUL))
#define bFM_MFS0_UART_SCR_RIE                     *((volatile uint32_t*)(0x42700030UL))
#define bFM4_MFS0_UART_SCR_RIE                    *((volatile uint32_t*)(0x42700030UL))
#define bFM_MFS0_UART_SCR_UPCL                    *((volatile uint32_t*)(0x4270003CUL))
#define bFM4_MFS0_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4270003CUL))

#define bFM_MFS0_UART_SMR_SOE                     *((volatile uint32_t*)(0x42700000UL))
#define bFM4_MFS0_UART_SMR_SOE                    *((volatile uint32_t*)(0x42700000UL))
#define bFM_MFS0_UART_SMR_BDS                     *((volatile uint32_t*)(0x42700008UL))
#define bFM4_MFS0_UART_SMR_BDS                    *((volatile uint32_t*)(0x42700008UL))
#define bFM_MFS0_UART_SMR_SBL                     *((volatile uint32_t*)(0x4270000CUL))
#define bFM4_MFS0_UART_SMR_SBL                    *((volatile uint32_t*)(0x4270000CUL))

#define bFM_MFS0_UART_SSR_TBI                     *((volatile uint32_t*)(0x427000A0UL))
#define bFM4_MFS0_UART_SSR_TBI                    *((volatile uint32_t*)(0x427000A0UL))
#define bFM_MFS0_UART_SSR_TDRE                    *((volatile uint32_t*)(0x427000A4UL))
#define bFM4_MFS0_UART_SSR_TDRE                   *((volatile uint32_t*)(0x427000A4UL))
#define bFM_MFS0_UART_SSR_RDRF                    *((volatile uint32_t*)(0x427000A8UL))
#define bFM4_MFS0_UART_SSR_RDRF                   *((volatile uint32_t*)(0x427000A8UL))
#define bFM_MFS0_UART_SSR_ORE                     *((volatile uint32_t*)(0x427000ACUL))
#define bFM4_MFS0_UART_SSR_ORE                    *((volatile uint32_t*)(0x427000ACUL))
#define bFM_MFS0_UART_SSR_FRE                     *((volatile uint32_t*)(0x427000B0UL))
#define bFM4_MFS0_UART_SSR_FRE                    *((volatile uint32_t*)(0x427000B0UL))
#define bFM_MFS0_UART_SSR_PE                      *((volatile uint32_t*)(0x427000B4UL))
#define bFM4_MFS0_UART_SSR_PE                     *((volatile uint32_t*)(0x427000B4UL))
#define bFM_MFS0_UART_SSR_REC                     *((volatile uint32_t*)(0x427000BCUL))
#define bFM4_MFS0_UART_SSR_REC                    *((volatile uint32_t*)(0x427000BCUL))


/******************************************************************************
 ** MFS Registers MFS1
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS1_CSIO_ESCR_CSFE                   *((volatile uint32_t*)(0x42702094UL))
#define bFM4_MFS1_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x42702094UL))
#define bFM_MFS1_CSIO_ESCR_L3                     *((volatile uint32_t*)(0x42702098UL))
#define bFM4_MFS1_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x42702098UL))
#define bFM_MFS1_CSIO_ESCR_SOP                    *((volatile uint32_t*)(0x4270209CUL))
#define bFM4_MFS1_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4270209CUL))

