neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS1_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x42702280UL))
#define bFM4_MFS1_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42702280UL))
#define bFM_MFS1_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x42702284UL))
#define bFM4_MFS1_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42702284UL))
#define bFM_MFS1_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x42702288UL))
#define bFM4_MFS1_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42702288UL))
#define bFM_MFS1_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4270228CUL))
#define bFM4_MFS1_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4270228CUL))
#define bFM_MFS1_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x42702290UL))
#define bFM4_MFS1_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42702290UL))
#define bFM_MFS1_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x42702294UL))
#define bFM4_MFS1_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42702294UL))
#define bFM_MFS1_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x42702298UL))
#define bFM4_MFS1_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42702298UL))
#define bFM_MFS1_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x427022A0UL))
#define bFM4_MFS1_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427022A0UL))
#define bFM_MFS1_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x427022A4UL))
#define bFM4_MFS1_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427022A4UL))
#define bFM_MFS1_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x427022A8UL))
#define bFM4_MFS1_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427022A8UL))
#define bFM_MFS1_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x427022ACUL))
#define bFM4_MFS1_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427022ACUL))
#define bFM_MFS1_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x427022B0UL))
#define bFM4_MFS1_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427022B0UL))

#define bFM_MFS1_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x42702480UL))
#define bFM4_MFS1_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42702480UL))
#define bFM_MFS1_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x42702498UL))
#define bFM4_MFS1_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42702498UL))
#define bFM_MFS1_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4270249CUL))
#define bFM4_MFS1_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4270249CUL))
#define bFM_MFS1_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x427024A0UL))
#define bFM4_MFS1_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427024A0UL))
#define bFM_MFS1_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x427024ACUL))
#define bFM4_MFS1_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427024ACUL))
#define bFM_MFS1_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x427024B0UL))
#define bFM4_MFS1_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427024B0UL))
#define bFM_MFS1_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x427024B4UL))
#define bFM4_MFS1_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427024B4UL))

#define bFM_MFS1_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x42702020UL))
#define bFM4_MFS1_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42702020UL))
#define bFM_MFS1_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x42702024UL))
#define bFM4_MFS1_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42702024UL))
#define bFM_MFS1_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x42702028UL))
#define bFM4_MFS1_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42702028UL))
#define bFM_MFS1_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4270202CUL))
#define bFM4_MFS1_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4270202CUL))
#define bFM_MFS1_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x42702030UL))
#define bFM4_MFS1_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42702030UL))
#define bFM_MFS1_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x42702034UL))
#define bFM4_MFS1_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42702034UL))
#define bFM_MFS1_CSIO_SCR_MS                      *((volatile uint32_t*)(0x42702038UL))
#define bFM4_MFS1_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42702038UL))
#define bFM_MFS1_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4270203CUL))
#define bFM4_MFS1_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4270203CUL))

#define bFM_MFS1_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x42702600UL))
#define bFM4_MFS1_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42702600UL))
#define bFM_MFS1_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x42702604UL))
#define bFM4_MFS1_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42702604UL))
#define bFM_MFS1_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x42702608UL))
#define bFM4_MFS1_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42702608UL))
#define bFM_MFS1_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4270260CUL))
#define bFM4_MFS1_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4270260CUL))
#define bFM_MFS1_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x42702610UL))
#define bFM4_MFS1_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42702610UL))
#define bFM_MFS1_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x42702614UL))
#define bFM4_MFS1_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42702614UL))
#define bFM_MFS1_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x42702624UL))
#define bFM4_MFS1_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42702624UL))

#define bFM_MFS1_CSIO_SCSFR0_CS1SPI               *((volatile uint32_t*)(0x42702694UL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x42702694UL))
#define bFM_MFS1_CSIO_SCSFR0_CS1SCINV             *((volatile uint32_t*)(0x42702698UL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x42702698UL))
#define bFM_MFS1_CSIO_SCSFR0_CS1CSLVL             *((volatile uint32_t*)(0x4270269CUL))
#define bFM4_MFS1_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4270269CUL))

#define bFM_MFS1_CSIO_SCSFR1_CS2SPI               *((volatile uint32_t*)(0x427026B4UL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x427026B4UL))
#define bFM_MFS1_CSIO_SCSFR1_CS2SCINV             *((volatile uint32_t*)(0x427026B8UL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x427026B8UL))
#define bFM_MFS1_CSIO_SCSFR1_CS2CSLVL             *((volatile uint32_t*)(0x427026BCUL))
#define bFM4_MFS1_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x427026BCUL))

#define bFM_MFS1_CSIO_SCSFR2_CS3SPI               *((volatile uint32_t*)(0x42702714UL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x42702714UL))
#define bFM_MFS1_CSIO_SCSFR2_CS3SCINV             *((volatile uint32_t*)(0x42702718UL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x42702718UL))
#define bFM_MFS1_CSIO_SCSFR2_CS3CSLVL             *((volatile uint32_t*)(0x4270271CUL))
#define bFM4_MFS1_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4270271CUL))

