neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS1_CSIO_SMR_SOE                     *((volatile uint32_t*)(0x42702000UL))
#define bFM4_MFS1_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x42702000UL))
#define bFM_MFS1_CSIO_SMR_SCKE                    *((volatile uint32_t*)(0x42702004UL))
#define bFM4_MFS1_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x42702004UL))
#define bFM_MFS1_CSIO_SMR_BDS                     *((volatile uint32_t*)(0x42702008UL))
#define bFM4_MFS1_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x42702008UL))
#define bFM_MFS1_CSIO_SMR_SCINV                   *((volatile uint32_t*)(0x4270200CUL))
#define bFM4_MFS1_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4270200CUL))

#define bFM_MFS1_CSIO_SSR_TBI                     *((volatile uint32_t*)(0x427020A0UL))
#define bFM4_MFS1_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x427020A0UL))
#define bFM_MFS1_CSIO_SSR_TDRE                    *((volatile uint32_t*)(0x427020A4UL))
#define bFM4_MFS1_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x427020A4UL))
#define bFM_MFS1_CSIO_SSR_RDRF                    *((volatile uint32_t*)(0x427020A8UL))
#define bFM4_MFS1_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x427020A8UL))
#define bFM_MFS1_CSIO_SSR_ORE                     *((volatile uint32_t*)(0x427020ACUL))
#define bFM4_MFS1_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x427020ACUL))
#define bFM_MFS1_CSIO_SSR_AWC                     *((volatile uint32_t*)(0x427020B0UL))
#define bFM4_MFS1_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x427020B0UL))
#define bFM_MFS1_CSIO_SSR_REC                     *((volatile uint32_t*)(0x427020BCUL))
#define bFM4_MFS1_CSIO_SSR_REC                    *((volatile uint32_t*)(0x427020BCUL))

#define bFM_MFS1_I2C_EIBCR_BEC                    *((volatile uint32_t*)(0x427023A0UL))
#define bFM4_MFS1_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x427023A0UL))
#define bFM_MFS1_I2C_EIBCR_SOCE                   *((volatile uint32_t*)(0x427023A4UL))
#define bFM4_MFS1_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x427023A4UL))
#define bFM_MFS1_I2C_EIBCR_SCLC                   *((volatile uint32_t*)(0x427023A8UL))
#define bFM4_MFS1_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x427023A8UL))
#define bFM_MFS1_I2C_EIBCR_SDAC                   *((volatile uint32_t*)(0x427023ACUL))
#define bFM4_MFS1_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x427023ACUL))
#define bFM_MFS1_I2C_EIBCR_SCLS                   *((volatile uint32_t*)(0x427023B0UL))
#define bFM4_MFS1_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x427023B0UL))
#define bFM_MFS1_I2C_EIBCR_SDAS                   *((volatile uint32_t*)(0x427023B4UL))
#define bFM4_MFS1_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x427023B4UL))

#define bFM_MFS1_I2C_FCR_FE1                      *((volatile uint32_t*)(0x42702280UL))
#define bFM4_MFS1_I2C_FCR_FE1                     *((volatile uint32_t*)(0x42702280UL))
#define bFM_MFS1_I2C_FCR_FE2                      *((volatile uint32_t*)(0x42702284UL))
#define bFM4_MFS1_I2C_FCR_FE2                     *((volatile uint32_t*)(0x42702284UL))
#define bFM_MFS1_I2C_FCR_FCL1                     *((volatile uint32_t*)(0x42702288UL))
#define bFM4_MFS1_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x42702288UL))
#define bFM_MFS1_I2C_FCR_FCL2                     *((volatile uint32_t*)(0x4270228CUL))
#define bFM4_MFS1_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4270228CUL))
#define bFM_MFS1_I2C_FCR_FSET                     *((volatile uint32_t*)(0x42702290UL))
#define bFM4_MFS1_I2C_FCR_FSET                    *((volatile uint32_t*)(0x42702290UL))
#define bFM_MFS1_I2C_FCR_FLD                      *((volatile uint32_t*)(0x42702294UL))
#define bFM4_MFS1_I2C_FCR_FLD                     *((volatile uint32_t*)(0x42702294UL))
#define bFM_MFS1_I2C_FCR_FLST                     *((volatile uint32_t*)(0x42702298UL))
#define bFM4_MFS1_I2C_FCR_FLST                    *((volatile uint32_t*)(0x42702298UL))
#define bFM_MFS1_I2C_FCR_FSEL                     *((volatile uint32_t*)(0x427022A0UL))
#define bFM4_MFS1_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x427022A0UL))
#define bFM_MFS1_I2C_FCR_FTIE                     *((volatile uint32_t*)(0x427022A4UL))
#define bFM4_MFS1_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x427022A4UL))
#define bFM_MFS1_I2C_FCR_FDRQ                     *((volatile uint32_t*)(0x427022A8UL))
#define bFM4_MFS1_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x427022A8UL))
#define bFM_MFS1_I2C_FCR_FRIIE                    *((volatile uint32_t*)(0x427022ACUL))
#define bFM4_MFS1_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x427022ACUL))
#define bFM_MFS1_I2C_FCR_FLSTE                    *((volatile uint32_t*)(0x427022B0UL))
#define bFM4_MFS1_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x427022B0UL))

#define bFM_MFS1_I2C_IBCR_INT                     *((volatile uint32_t*)(0x42702020UL))
#define bFM4_MFS1_I2C_IBCR_INT                    *((volatile uint32_t*)(0x42702020UL))
#define bFM_MFS1_I2C_IBCR_BER                     *((volatile uint32_t*)(0x42702024UL))
#define bFM4_MFS1_I2C_IBCR_BER                    *((volatile uint32_t*)(0x42702024UL))
#define bFM_MFS1_I2C_IBCR_INTE                    *((volatile uint32_t*)(0x42702028UL))
#define bFM4_MFS1_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x42702028UL))
#define bFM_MFS1_I2C_IBCR_CNDE                    *((volatile uint32_t*)(0x4270202CUL))
#define bFM4_MFS1_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4270202CUL))
#define bFM_MFS1_I2C_IBCR_WSEL                    *((volatile uint32_t*)(0x42702030UL))
#define bFM4_MFS1_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x42702030UL))
#define bFM_MFS1_I2C_IBCR_ACKE                    *((volatile uint32_t*)(0x42702034UL))
#define bFM4_MFS1_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x42702034UL))
#define bFM_MFS1_I2C_IBCR_ACT_SCC                 *((volatile uint32_t*)(0x42702038UL))
#define bFM4_MFS1_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x42702038UL))
#define bFM_MFS1_I2C_IBCR_MSS                     *((volatile uint32_t*)(0x4270203CUL))
#define bFM4_MFS1_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4270203CUL))

#define bFM_MFS1_I2C_IBSR_BB                      *((volatile uint32_t*)(0x42702080UL))
#define bFM4_MFS1_I2C_IBSR_BB                     *((volatile uint32_t*)(0x42702080UL))
#define bFM_MFS1_I2C_IBSR_SPC                     *((volatile uint32_t*)(0x42702084UL))
#define bFM4_MFS1_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x42702084UL))
#define bFM_MFS1_I2C_IBSR_RSC                     *((volatile uint32_t*)(0x42702088UL))
#define bFM4_MFS1_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x42702088UL))
#define bFM_MFS1_I2C_IBSR_AL                      *((volatile uint32_t*)(0x4270208CUL))
#define bFM4_MFS1_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4270208CUL))
#define bFM_MFS1_I2C_IBSR_TRX                     *((volatile uint32_t*)(0x42702090UL))
#define bFM4_MFS1_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x42702090UL))
#define bFM_MFS1_I2C_IBSR_RSA                     *((volatile uint32_t*)(0x42702094UL))
#define bFM4_MFS1_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x42702094UL))
#define bFM_MFS1_I2C_IBSR_RACK                    *((volatile uint32_t*)(0x42702098UL))
#define bFM4_MFS1_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x42702098UL))
#define bFM_MFS1_I2C_IBSR_FBT                     *((volatile uint32_t*)(0x4270209CUL))
#define bFM4_MFS1_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4270209CUL))

#define bFM_MFS1_I2C_ISBA_SAEN                    *((volatile uint32_t*)(0x4270221CUL))
#define bFM4_MFS1_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4270221CUL))

#define bFM_MFS1_I2C_ISMK_EN                      *((volatile uint32_t*)(0x4270223CUL))
#define bFM4_MFS1_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4270223CUL))

#define bFM_MFS1_I2C_SMR_TIE                      *((volatile uint32_t*)(0x42702008UL))
#define bFM4_MFS1_I2C_SMR_TIE                     *((volatile uint32_t*)(0x42702008UL))
#define bFM_MFS1_I2C_SMR_RIE                      *((volatile uint32_t*)(0x4270200CUL))
#define bFM4_MFS1_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4270200CUL))

#define bFM_MFS1_I2C_SSR_TBI                      *((volatile uint32_t*)(0x427020A0UL))
#define bFM4_MFS1_I2C_SSR_TBI                     *((volatile uint32_t*)(0x427020A0UL))
#define bFM_MFS1_I2C_SSR_TDRE                     *((volatile uint32_t*)(0x427020A4UL))
#define bFM4_MFS1_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x427020A4UL))
#define bFM_MFS1_I2C_SSR_RDRF                     *((volatile uint32_t*)(0x427020A8UL))
#define bFM4_MFS1_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x427020A8UL))
#define bFM_MFS1_I2C_SSR_ORE                      *((volatile uint32_t*)(0x427020ACUL))
#define bFM4_MFS1_I2C_SSR_ORE                     *((volatile uint32_t*)(0x427020ACUL))
#define bFM_MFS1_I2C_SSR_TBIE                     *((volatile uint32_t*)(0x427020B0UL))
#define bFM4_MFS1_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x427020B0UL))
#define bFM_MFS1_I2C_SSR_DMA                      *((volatile uint32_t*)(0x427020B4UL))
#define bFM4_MFS1_I2C_SSR_DMA                     *((volatile uint32_t*)(0x427020B4UL))
#define bFM_MFS1_I2C_SSR_TSET                     *((volatile uint32_t*)(0x427020B8UL))
#define bFM4_MFS1_I2C_SSR_TSET                    *((volatile uint32_t*)(0x427020B8UL))
#define bFM_MFS1_I2C_SSR_REC                      *((volatile uint32_t*)(0x427020BCUL))
#define bFM4_MFS1_I2C_SSR_REC                     *((volatile uint32_t*)(0x427020BCUL))

#define bFM_MFS1_LIN_BGR_EXT                      *((volatile uint32_t*)(0x427021BCUL))
#define bFM4_MFS1_LIN_BGR_EXT                     *((volatile uint32_t*)(0x427021BCUL))

