neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS1_UART_FCR_FE1                     *((volatile uint32_t*)(0x42702280UL))
#define bFM4_MFS1_UART_FCR_FE1                    *((volatile uint32_t*)(0x42702280UL))
#define bFM_MFS1_UART_FCR_FE2                     *((volatile uint32_t*)(0x42702284UL))
#define bFM4_MFS1_UART_FCR_FE2                    *((volatile uint32_t*)(0x42702284UL))
#define bFM_MFS1_UART_FCR_FCL1                    *((volatile uint32_t*)(0x42702288UL))
#define bFM4_MFS1_UART_FCR_FCL1                   *((volatile uint32_t*)(0x42702288UL))
#define bFM_MFS1_UART_FCR_FCL2                    *((volatile uint32_t*)(0x4270228CUL))
#define bFM4_MFS1_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4270228CUL))
#define bFM_MFS1_UART_FCR_FSET                    *((volatile uint32_t*)(0x42702290UL))
#define bFM4_MFS1_UART_FCR_FSET                   *((volatile uint32_t*)(0x42702290UL))
#define bFM_MFS1_UART_FCR_FLD                     *((volatile uint32_t*)(0x42702294UL))
#define bFM4_MFS1_UART_FCR_FLD                    *((volatile uint32_t*)(0x42702294UL))
#define bFM_MFS1_UART_FCR_FLST                    *((volatile uint32_t*)(0x42702298UL))
#define bFM4_MFS1_UART_FCR_FLST                   *((volatile uint32_t*)(0x42702298UL))
#define bFM_MFS1_UART_FCR_FSEL                    *((volatile uint32_t*)(0x427022A0UL))
#define bFM4_MFS1_UART_FCR_FSEL                   *((volatile uint32_t*)(0x427022A0UL))
#define bFM_MFS1_UART_FCR_FTIE                    *((volatile uint32_t*)(0x427022A4UL))
#define bFM4_MFS1_UART_FCR_FTIE                   *((volatile uint32_t*)(0x427022A4UL))
#define bFM_MFS1_UART_FCR_FDRQ                    *((volatile uint32_t*)(0x427022A8UL))
#define bFM4_MFS1_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x427022A8UL))
#define bFM_MFS1_UART_FCR_FRIIE                   *((volatile uint32_t*)(0x427022ACUL))
#define bFM4_MFS1_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x427022ACUL))
#define bFM_MFS1_UART_FCR_FLSTE                   *((volatile uint32_t*)(0x427022B0UL))
#define bFM4_MFS1_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x427022B0UL))

#define bFM_MFS1_UART_SCR_TXE                     *((volatile uint32_t*)(0x42702020UL))
#define bFM4_MFS1_UART_SCR_TXE                    *((volatile uint32_t*)(0x42702020UL))
#define bFM_MFS1_UART_SCR_RXE                     *((volatile uint32_t*)(0x42702024UL))
#define bFM4_MFS1_UART_SCR_RXE                    *((volatile uint32_t*)(0x42702024UL))
#define bFM_MFS1_UART_SCR_TBIE                    *((volatile uint32_t*)(0x42702028UL))
#define bFM4_MFS1_UART_SCR_TBIE                   *((volatile uint32_t*)(0x42702028UL))
#define bFM_MFS1_UART_SCR_TIE                     *((volatile uint32_t*)(0x4270202CUL))
#define bFM4_MFS1_UART_SCR_TIE                    *((volatile uint32_t*)(0x4270202CUL))
#define bFM_MFS1_UART_SCR_RIE                     *((volatile uint32_t*)(0x42702030UL))
#define bFM4_MFS1_UART_SCR_RIE                    *((volatile uint32_t*)(0x42702030UL))
#define bFM_MFS1_UART_SCR_UPCL                    *((volatile uint32_t*)(0x4270203CUL))
#define bFM4_MFS1_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4270203CUL))

#define bFM_MFS1_UART_SMR_SOE                     *((volatile uint32_t*)(0x42702000UL))
#define bFM4_MFS1_UART_SMR_SOE                    *((volatile uint32_t*)(0x42702000UL))
#define bFM_MFS1_UART_SMR_BDS                     *((volatile uint32_t*)(0x42702008UL))
#define bFM4_MFS1_UART_SMR_BDS                    *((volatile uint32_t*)(0x42702008UL))
#define bFM_MFS1_UART_SMR_SBL                     *((volatile uint32_t*)(0x4270200CUL))
#define bFM4_MFS1_UART_SMR_SBL                    *((volatile uint32_t*)(0x4270200CUL))

#define bFM_MFS1_UART_SSR_TBI                     *((volatile uint32_t*)(0x427020A0UL))
#define bFM4_MFS1_UART_SSR_TBI                    *((volatile uint32_t*)(0x427020A0UL))
#define bFM_MFS1_UART_SSR_TDRE                    *((volatile uint32_t*)(0x427020A4UL))
#define bFM4_MFS1_UART_SSR_TDRE                   *((volatile uint32_t*)(0x427020A4UL))
#define bFM_MFS1_UART_SSR_RDRF                    *((volatile uint32_t*)(0x427020A8UL))
#define bFM4_MFS1_UART_SSR_RDRF                   *((volatile uint32_t*)(0x427020A8UL))
#define bFM_MFS1_UART_SSR_ORE                     *((volatile uint32_t*)(0x427020ACUL))
#define bFM4_MFS1_UART_SSR_ORE                    *((volatile uint32_t*)(0x427020ACUL))
#define bFM_MFS1_UART_SSR_FRE                     *((volatile uint32_t*)(0x427020B0UL))
#define bFM4_MFS1_UART_SSR_FRE                    *((volatile uint32_t*)(0x427020B0UL))
#define bFM_MFS1_UART_SSR_PE                      *((volatile uint32_t*)(0x427020B4UL))
#define bFM4_MFS1_UART_SSR_PE                     *((volatile uint32_t*)(0x427020B4UL))
#define bFM_MFS1_UART_SSR_REC                     *((volatile uint32_t*)(0x427020BCUL))
#define bFM4_MFS1_UART_SSR_REC                    *((volatile uint32_t*)(0x427020BCUL))


/******************************************************************************
 ** MFS Registers MFS10
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS10_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x42714094UL))
#define bFM4_MFS10_CSIO_ESCR_CSFE                 *((volatile uint32_t*)(0x42714094UL))
#define bFM_MFS10_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x42714098UL))
#define bFM4_MFS10_CSIO_ESCR_L3                   *((volatile uint32_t*)(0x42714098UL))
#define bFM_MFS10_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4271409CUL))
#define bFM4_MFS10_CSIO_ESCR_SOP                  *((volatile uint32_t*)(0x4271409CUL))

#define bFM_MFS10_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42714280UL))
#define bFM4_MFS10_CSIO_FCR_FE1                   *((volatile uint32_t*)(0x42714280UL))
#define bFM_MFS10_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42714284UL))
#define bFM4_MFS10_CSIO_FCR_FE2                   *((volatile uint32_t*)(0x42714284UL))
#define bFM_MFS10_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42714288UL))
#define bFM4_MFS10_CSIO_FCR_FCL1                  *((volatile uint32_t*)(0x42714288UL))
#define bFM_MFS10_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4271428CUL))
#define bFM4_MFS10_CSIO_FCR_FCL2                  *((volatile uint32_t*)(0x4271428CUL))
#define bFM_MFS10_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42714290UL))
#define bFM4_MFS10_CSIO_FCR_FSET                  *((volatile uint32_t*)(0x42714290UL))
#define bFM_MFS10_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42714294UL))
#define bFM4_MFS10_CSIO_FCR_FLD                   *((volatile uint32_t*)(0x42714294UL))
#define bFM_MFS10_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42714298UL))
#define bFM4_MFS10_CSIO_FCR_FLST                  *((volatile uint32_t*)(0x42714298UL))
#define bFM_MFS10_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427142A0UL))
#define bFM4_MFS10_CSIO_FCR_FSEL                  *((volatile uint32_t*)(0x427142A0UL))
#define bFM_MFS10_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427142A4UL))
#define bFM4_MFS10_CSIO_FCR_FTIE                  *((volatile uint32_t*)(0x427142A4UL))
#define bFM_MFS10_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427142A8UL))
#define bFM4_MFS10_CSIO_FCR_FDRQ                  *((volatile uint32_t*)(0x427142A8UL))
#define bFM_MFS10_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427142ACUL))
#define bFM4_MFS10_CSIO_FCR_FRIIE                 *((volatile uint32_t*)(0x427142ACUL))
#define bFM_MFS10_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427142B0UL))
#define bFM4_MFS10_CSIO_FCR_FLSTE                 *((volatile uint32_t*)(0x427142B0UL))

