neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS10_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42714480UL))
#define bFM4_MFS10_CSIO_SACSR_TMRE                *((volatile uint32_t*)(0x42714480UL))
#define bFM_MFS10_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42714498UL))
#define bFM4_MFS10_CSIO_SACSR_TSYNE               *((volatile uint32_t*)(0x42714498UL))
#define bFM_MFS10_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4271449CUL))
#define bFM4_MFS10_CSIO_SACSR_TINTE               *((volatile uint32_t*)(0x4271449CUL))
#define bFM_MFS10_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427144A0UL))
#define bFM4_MFS10_CSIO_SACSR_TINT                *((volatile uint32_t*)(0x427144A0UL))
#define bFM_MFS10_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427144ACUL))
#define bFM4_MFS10_CSIO_SACSR_CSE                 *((volatile uint32_t*)(0x427144ACUL))
#define bFM_MFS10_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427144B0UL))
#define bFM4_MFS10_CSIO_SACSR_CSEIE               *((volatile uint32_t*)(0x427144B0UL))
#define bFM_MFS10_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427144B4UL))
#define bFM4_MFS10_CSIO_SACSR_TBEEN               *((volatile uint32_t*)(0x427144B4UL))

#define bFM_MFS10_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42714020UL))
#define bFM4_MFS10_CSIO_SCR_TXE                   *((volatile uint32_t*)(0x42714020UL))
#define bFM_MFS10_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42714024UL))
#define bFM4_MFS10_CSIO_SCR_RXE                   *((volatile uint32_t*)(0x42714024UL))
#define bFM_MFS10_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42714028UL))
#define bFM4_MFS10_CSIO_SCR_TBIE                  *((volatile uint32_t*)(0x42714028UL))
#define bFM_MFS10_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4271402CUL))
#define bFM4_MFS10_CSIO_SCR_TIE                   *((volatile uint32_t*)(0x4271402CUL))
#define bFM_MFS10_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42714030UL))
#define bFM4_MFS10_CSIO_SCR_RIE                   *((volatile uint32_t*)(0x42714030UL))
#define bFM_MFS10_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42714034UL))
#define bFM4_MFS10_CSIO_SCR_SPI                   *((volatile uint32_t*)(0x42714034UL))
#define bFM_MFS10_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42714038UL))
#define bFM4_MFS10_CSIO_SCR_MS                    *((volatile uint32_t*)(0x42714038UL))
#define bFM_MFS10_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4271403CUL))
#define bFM4_MFS10_CSIO_SCR_UPCL                  *((volatile uint32_t*)(0x4271403CUL))

#define bFM_MFS10_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42714600UL))
#define bFM4_MFS10_CSIO_SCSCR_CSOE                *((volatile uint32_t*)(0x42714600UL))
#define bFM_MFS10_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42714604UL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN0               *((volatile uint32_t*)(0x42714604UL))
#define bFM_MFS10_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42714608UL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN1               *((volatile uint32_t*)(0x42714608UL))
#define bFM_MFS10_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4271460CUL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN2               *((volatile uint32_t*)(0x4271460CUL))
#define bFM_MFS10_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42714610UL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN3               *((volatile uint32_t*)(0x42714610UL))
#define bFM_MFS10_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42714614UL))
#define bFM4_MFS10_CSIO_SCSCR_CSLVL               *((volatile uint32_t*)(0x42714614UL))
#define bFM_MFS10_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42714624UL))
#define bFM4_MFS10_CSIO_SCSCR_SCAM                *((volatile uint32_t*)(0x42714624UL))

#define bFM_MFS10_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x42714694UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1SPI             *((volatile uint32_t*)(0x42714694UL))
#define bFM_MFS10_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x42714698UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1SCINV           *((volatile uint32_t*)(0x42714698UL))
#define bFM_MFS10_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4271469CUL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1CSLVL           *((volatile uint32_t*)(0x4271469CUL))

#define bFM_MFS10_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x427146B4UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2SPI             *((volatile uint32_t*)(0x427146B4UL))
#define bFM_MFS10_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x427146B8UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2SCINV           *((volatile uint32_t*)(0x427146B8UL))
#define bFM_MFS10_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x427146BCUL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2CSLVL           *((volatile uint32_t*)(0x427146BCUL))

#define bFM_MFS10_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x42714714UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3SPI             *((volatile uint32_t*)(0x42714714UL))
#define bFM_MFS10_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x42714718UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3SCINV           *((volatile uint32_t*)(0x42714718UL))
#define bFM_MFS10_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4271471CUL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3CSLVL           *((volatile uint32_t*)(0x4271471CUL))

#define bFM_MFS10_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x42714000UL))
#define bFM4_MFS10_CSIO_SMR_SOE                   *((volatile uint32_t*)(0x42714000UL))
#define bFM_MFS10_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x42714004UL))
#define bFM4_MFS10_CSIO_SMR_SCKE                  *((volatile uint32_t*)(0x42714004UL))
#define bFM_MFS10_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x42714008UL))
#define bFM4_MFS10_CSIO_SMR_BDS                   *((volatile uint32_t*)(0x42714008UL))
#define bFM_MFS10_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4271400CUL))
#define bFM4_MFS10_CSIO_SMR_SCINV                 *((volatile uint32_t*)(0x4271400CUL))

#define bFM_MFS10_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x427140A0UL))
#define bFM4_MFS10_CSIO_SSR_TBI                   *((volatile uint32_t*)(0x427140A0UL))
#define bFM_MFS10_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x427140A4UL))
#define bFM4_MFS10_CSIO_SSR_TDRE                  *((volatile uint32_t*)(0x427140A4UL))
#define bFM_MFS10_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x427140A8UL))
#define bFM4_MFS10_CSIO_SSR_RDRF                  *((volatile uint32_t*)(0x427140A8UL))
#define bFM_MFS10_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x427140ACUL))
#define bFM4_MFS10_CSIO_SSR_ORE                   *((volatile uint32_t*)(0x427140ACUL))
#define bFM_MFS10_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x427140B0UL))
#define bFM4_MFS10_CSIO_SSR_AWC                   *((volatile uint32_t*)(0x427140B0UL))
#define bFM_MFS10_CSIO_SSR_REC                    *((volatile uint32_t*)(0x427140BCUL))
#define bFM4_MFS10_CSIO_SSR_REC                   *((volatile uint32_t*)(0x427140BCUL))

