neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS10_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x42714090UL))
#define bFM4_MFS10_LIN_ESCR_LBIE                  *((volatile uint32_t*)(0x42714090UL))
#define bFM_MFS10_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x42714098UL))
#define bFM4_MFS10_LIN_ESCR_ESBL                  *((volatile uint32_t*)(0x42714098UL))

#define bFM_MFS10_LIN_FCR_FE1                     *((volatile uint32_t*)(0x42714280UL))
#define bFM4_MFS10_LIN_FCR_FE1                    *((volatile uint32_t*)(0x42714280UL))
#define bFM_MFS10_LIN_FCR_FE2                     *((volatile uint32_t*)(0x42714284UL))
#define bFM4_MFS10_LIN_FCR_FE2                    *((volatile uint32_t*)(0x42714284UL))
#define bFM_MFS10_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x42714288UL))
#define bFM4_MFS10_LIN_FCR_FCL1                   *((volatile uint32_t*)(0x42714288UL))
#define bFM_MFS10_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4271428CUL))
#define bFM4_MFS10_LIN_FCR_FCL2                   *((volatile uint32_t*)(0x4271428CUL))
#define bFM_MFS10_LIN_FCR_FSET                    *((volatile uint32_t*)(0x42714290UL))
#define bFM4_MFS10_LIN_FCR_FSET                   *((volatile uint32_t*)(0x42714290UL))
#define bFM_MFS10_LIN_FCR_FLD                     *((volatile uint32_t*)(0x42714294UL))
#define bFM4_MFS10_LIN_FCR_FLD                    *((volatile uint32_t*)(0x42714294UL))
#define bFM_MFS10_LIN_FCR_FLST                    *((volatile uint32_t*)(0x42714298UL))
#define bFM4_MFS10_LIN_FCR_FLST                   *((volatile uint32_t*)(0x42714298UL))
#define bFM_MFS10_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x427142A0UL))
#define bFM4_MFS10_LIN_FCR_FSEL                   *((volatile uint32_t*)(0x427142A0UL))
#define bFM_MFS10_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x427142A4UL))
#define bFM4_MFS10_LIN_FCR_FTIE                   *((volatile uint32_t*)(0x427142A4UL))
#define bFM_MFS10_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x427142A8UL))
#define bFM4_MFS10_LIN_FCR_FDRQ                   *((volatile uint32_t*)(0x427142A8UL))
#define bFM_MFS10_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x427142ACUL))
#define bFM4_MFS10_LIN_FCR_FRIIE                  *((volatile uint32_t*)(0x427142ACUL))
#define bFM_MFS10_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x427142B0UL))
#define bFM4_MFS10_LIN_FCR_FLSTE                  *((volatile uint32_t*)(0x427142B0UL))

#define bFM_MFS10_LIN_SCR_TXE                     *((volatile uint32_t*)(0x42714020UL))
#define bFM4_MFS10_LIN_SCR_TXE                    *((volatile uint32_t*)(0x42714020UL))
#define bFM_MFS10_LIN_SCR_RXE                     *((volatile uint32_t*)(0x42714024UL))
#define bFM4_MFS10_LIN_SCR_RXE                    *((volatile uint32_t*)(0x42714024UL))
#define bFM_MFS10_LIN_SCR_TBIE                    *((volatile uint32_t*)(0x42714028UL))
#define bFM4_MFS10_LIN_SCR_TBIE                   *((volatile uint32_t*)(0x42714028UL))
#define bFM_MFS10_LIN_SCR_TIE                     *((volatile uint32_t*)(0x4271402CUL))
#define bFM4_MFS10_LIN_SCR_TIE                    *((volatile uint32_t*)(0x4271402CUL))
#define bFM_MFS10_LIN_SCR_RIE                     *((volatile uint32_t*)(0x42714030UL))
#define bFM4_MFS10_LIN_SCR_RIE                    *((volatile uint32_t*)(0x42714030UL))
#define bFM_MFS10_LIN_SCR_LBR                     *((volatile uint32_t*)(0x42714034UL))
#define bFM4_MFS10_LIN_SCR_LBR                    *((volatile uint32_t*)(0x42714034UL))
#define bFM_MFS10_LIN_SCR_MS                      *((volatile uint32_t*)(0x42714038UL))
#define bFM4_MFS10_LIN_SCR_MS                     *((volatile uint32_t*)(0x42714038UL))
#define bFM_MFS10_LIN_SCR_UPCL                    *((volatile uint32_t*)(0x4271403CUL))
#define bFM4_MFS10_LIN_SCR_UPCL                   *((volatile uint32_t*)(0x4271403CUL))

#define bFM_MFS10_LIN_SMR_SOE                     *((volatile uint32_t*)(0x42714000UL))
#define bFM4_MFS10_LIN_SMR_SOE                    *((volatile uint32_t*)(0x42714000UL))
#define bFM_MFS10_LIN_SMR_SBL                     *((volatile uint32_t*)(0x4271400CUL))
#define bFM4_MFS10_LIN_SMR_SBL                    *((volatile uint32_t*)(0x4271400CUL))
#define bFM_MFS10_LIN_SMR_WUCR                    *((volatile uint32_t*)(0x42714010UL))
#define bFM4_MFS10_LIN_SMR_WUCR                   *((volatile uint32_t*)(0x42714010UL))

#define bFM_MFS10_LIN_SSR_TBI                     *((volatile uint32_t*)(0x427140A0UL))
#define bFM4_MFS10_LIN_SSR_TBI                    *((volatile uint32_t*)(0x427140A0UL))
#define bFM_MFS10_LIN_SSR_TDRE                    *((volatile uint32_t*)(0x427140A4UL))
#define bFM4_MFS10_LIN_SSR_TDRE                   *((volatile uint32_t*)(0x427140A4UL))
#define bFM_MFS10_LIN_SSR_RDRF                    *((volatile uint32_t*)(0x427140A8UL))
#define bFM4_MFS10_LIN_SSR_RDRF                   *((volatile uint32_t*)(0x427140A8UL))
#define bFM_MFS10_LIN_SSR_ORE                     *((volatile uint32_t*)(0x427140ACUL))
#define bFM4_MFS10_LIN_SSR_ORE                    *((volatile uint32_t*)(0x427140ACUL))
#define bFM_MFS10_LIN_SSR_FRE                     *((volatile uint32_t*)(0x427140B0UL))
#define bFM4_MFS10_LIN_SSR_FRE                    *((volatile uint32_t*)(0x427140B0UL))
#define bFM_MFS10_LIN_SSR_LBD                     *((volatile uint32_t*)(0x427140B4UL))
#define bFM4_MFS10_LIN_SSR_LBD                    *((volatile uint32_t*)(0x427140B4UL))
#define bFM_MFS10_LIN_SSR_REC                     *((volatile uint32_t*)(0x427140BCUL))
#define bFM4_MFS10_LIN_SSR_REC                    *((volatile uint32_t*)(0x427140BCUL))

#define bFM_MFS10_UART_BGR_EXT                    *((volatile uint32_t*)(0x427141BCUL))
#define bFM4_MFS10_UART_BGR_EXT                   *((volatile uint32_t*)(0x427141BCUL))

#define bFM_MFS10_UART_ESCR_P                     *((volatile uint32_t*)(0x4271408CUL))
#define bFM4_MFS10_UART_ESCR_P                    *((volatile uint32_t*)(0x4271408CUL))
#define bFM_MFS10_UART_ESCR_PEN                   *((volatile uint32_t*)(0x42714090UL))
#define bFM4_MFS10_UART_ESCR_PEN                  *((volatile uint32_t*)(0x42714090UL))
#define bFM_MFS10_UART_ESCR_INV                   *((volatile uint32_t*)(0x42714094UL))
#define bFM4_MFS10_UART_ESCR_INV                  *((volatile uint32_t*)(0x42714094UL))
#define bFM_MFS10_UART_ESCR_ESBL                  *((volatile uint32_t*)(0x42714098UL))
#define bFM4_MFS10_UART_ESCR_ESBL                 *((volatile uint32_t*)(0x42714098UL))
#define bFM_MFS10_UART_ESCR_FLWEN                 *((volatile uint32_t*)(0x4271409CUL))
#define bFM4_MFS10_UART_ESCR_FLWEN                *((volatile uint32_t*)(0x4271409CUL))

#define bFM_MFS10_UART_FCR_FE1                    *((volatile uint32_t*)(0x42714280UL))
#define bFM4_MFS10_UART_FCR_FE1                   *((volatile uint32_t*)(0x42714280UL))
#define bFM_MFS10_UART_FCR_FE2                    *((volatile uint32_t*)(0x42714284UL))
#define bFM4_MFS10_UART_FCR_FE2                   *((volatile uint32_t*)(0x42714284UL))
#define bFM_MFS10_UART_FCR_FCL1                   *((volatile uint32_t*)(0x42714288UL))
#define bFM4_MFS10_UART_FCR_FCL1                  *((volatile uint32_t*)(0x42714288UL))
#define bFM_MFS10_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4271428CUL))
#define bFM4_MFS10_UART_FCR_FCL2                  *((volatile uint32_t*)(0x4271428CUL))
#define bFM_MFS10_UART_FCR_FSET                   *((volatile uint32_t*)(0x42714290UL))
#define bFM4_MFS10_UART_FCR_FSET                  *((volatile uint32_t*)(0x42714290UL))
#define bFM_MFS10_UART_FCR_FLD                    *((volatile uint32_t*)(0x42714294UL))
#define bFM4_MFS10_UART_FCR_FLD                   *((volatile uint32_t*)(0x42714294UL))
#define bFM_MFS10_UART_FCR_FLST                   *((volatile uint32_t*)(0x42714298UL))
#define bFM4_MFS10_UART_FCR_FLST                  *((volatile uint32_t*)(0x42714298UL))
#define bFM_MFS10_UART_FCR_FSEL                   *((volatile uint32_t*)(0x427142A0UL))
#define bFM4_MFS10_UART_FCR_FSEL                  *((volatile uint32_t*)(0x427142A0UL))
#define bFM_MFS10_UART_FCR_FTIE                   *((volatile uint32_t*)(0x427142A4UL))
#define bFM4_MFS10_UART_FCR_FTIE                  *((volatile uint32_t*)(0x427142A4UL))
#define bFM_MFS10_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x427142A8UL))
#define bFM4_MFS10_UART_FCR_FDRQ                  *((volatile uint32_t*)(0x427142A8UL))
#define bFM_MFS10_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x427142ACUL))
#define bFM4_MFS10_UART_FCR_FRIIE                 *((volatile uint32_t*)(0x427142ACUL))
#define bFM_MFS10_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x427142B0UL))
#define bFM4_MFS10_UART_FCR_FLSTE                 *((volatile uint32_t*)(0x427142B0UL))

