neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS10_UART_SCR_TXE                    *((volatile uint32_t*)(0x42714020UL))
#define bFM4_MFS10_UART_SCR_TXE                   *((volatile uint32_t*)(0x42714020UL))
#define bFM_MFS10_UART_SCR_RXE                    *((volatile uint32_t*)(0x42714024UL))
#define bFM4_MFS10_UART_SCR_RXE                   *((volatile uint32_t*)(0x42714024UL))
#define bFM_MFS10_UART_SCR_TBIE                   *((volatile uint32_t*)(0x42714028UL))
#define bFM4_MFS10_UART_SCR_TBIE                  *((volatile uint32_t*)(0x42714028UL))
#define bFM_MFS10_UART_SCR_TIE                    *((volatile uint32_t*)(0x4271402CUL))
#define bFM4_MFS10_UART_SCR_TIE                   *((volatile uint32_t*)(0x4271402CUL))
#define bFM_MFS10_UART_SCR_RIE                    *((volatile uint32_t*)(0x42714030UL))
#define bFM4_MFS10_UART_SCR_RIE                   *((volatile uint32_t*)(0x42714030UL))
#define bFM_MFS10_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4271403CUL))
#define bFM4_MFS10_UART_SCR_UPCL                  *((volatile uint32_t*)(0x4271403CUL))

#define bFM_MFS10_UART_SMR_SOE                    *((volatile uint32_t*)(0x42714000UL))
#define bFM4_MFS10_UART_SMR_SOE                   *((volatile uint32_t*)(0x42714000UL))
#define bFM_MFS10_UART_SMR_BDS                    *((volatile uint32_t*)(0x42714008UL))
#define bFM4_MFS10_UART_SMR_BDS                   *((volatile uint32_t*)(0x42714008UL))
#define bFM_MFS10_UART_SMR_SBL                    *((volatile uint32_t*)(0x4271400CUL))
#define bFM4_MFS10_UART_SMR_SBL                   *((volatile uint32_t*)(0x4271400CUL))

#define bFM_MFS10_UART_SSR_TBI                    *((volatile uint32_t*)(0x427140A0UL))
#define bFM4_MFS10_UART_SSR_TBI                   *((volatile uint32_t*)(0x427140A0UL))
#define bFM_MFS10_UART_SSR_TDRE                   *((volatile uint32_t*)(0x427140A4UL))
#define bFM4_MFS10_UART_SSR_TDRE                  *((volatile uint32_t*)(0x427140A4UL))
#define bFM_MFS10_UART_SSR_RDRF                   *((volatile uint32_t*)(0x427140A8UL))
#define bFM4_MFS10_UART_SSR_RDRF                  *((volatile uint32_t*)(0x427140A8UL))
#define bFM_MFS10_UART_SSR_ORE                    *((volatile uint32_t*)(0x427140ACUL))
#define bFM4_MFS10_UART_SSR_ORE                   *((volatile uint32_t*)(0x427140ACUL))
#define bFM_MFS10_UART_SSR_FRE                    *((volatile uint32_t*)(0x427140B0UL))
#define bFM4_MFS10_UART_SSR_FRE                   *((volatile uint32_t*)(0x427140B0UL))
#define bFM_MFS10_UART_SSR_PE                     *((volatile uint32_t*)(0x427140B4UL))
#define bFM4_MFS10_UART_SSR_PE                    *((volatile uint32_t*)(0x427140B4UL))
#define bFM_MFS10_UART_SSR_REC                    *((volatile uint32_t*)(0x427140BCUL))
#define bFM4_MFS10_UART_SSR_REC                   *((volatile uint32_t*)(0x427140BCUL))


/******************************************************************************
 ** MFS Registers MFS11
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS11_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x42716094UL))
#define bFM4_MFS11_CSIO_ESCR_CSFE                 *((volatile uint32_t*)(0x42716094UL))
#define bFM_MFS11_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x42716098UL))
#define bFM4_MFS11_CSIO_ESCR_L3                   *((volatile uint32_t*)(0x42716098UL))
#define bFM_MFS11_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4271609CUL))
#define bFM4_MFS11_CSIO_ESCR_SOP                  *((volatile uint32_t*)(0x4271609CUL))

#define bFM_MFS11_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42716280UL))
#define bFM4_MFS11_CSIO_FCR_FE1                   *((volatile uint32_t*)(0x42716280UL))
#define bFM_MFS11_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42716284UL))
#define bFM4_MFS11_CSIO_FCR_FE2                   *((volatile uint32_t*)(0x42716284UL))
#define bFM_MFS11_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42716288UL))
#define bFM4_MFS11_CSIO_FCR_FCL1                  *((volatile uint32_t*)(0x42716288UL))
#define bFM_MFS11_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4271628CUL))
#define bFM4_MFS11_CSIO_FCR_FCL2                  *((volatile uint32_t*)(0x4271628CUL))
#define bFM_MFS11_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42716290UL))
#define bFM4_MFS11_CSIO_FCR_FSET                  *((volatile uint32_t*)(0x42716290UL))
#define bFM_MFS11_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42716294UL))
#define bFM4_MFS11_CSIO_FCR_FLD                   *((volatile uint32_t*)(0x42716294UL))
#define bFM_MFS11_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42716298UL))
#define bFM4_MFS11_CSIO_FCR_FLST                  *((volatile uint32_t*)(0x42716298UL))
#define bFM_MFS11_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427162A0UL))
#define bFM4_MFS11_CSIO_FCR_FSEL                  *((volatile uint32_t*)(0x427162A0UL))
#define bFM_MFS11_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427162A4UL))
#define bFM4_MFS11_CSIO_FCR_FTIE                  *((volatile uint32_t*)(0x427162A4UL))
#define bFM_MFS11_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427162A8UL))
#define bFM4_MFS11_CSIO_FCR_FDRQ                  *((volatile uint32_t*)(0x427162A8UL))
#define bFM_MFS11_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427162ACUL))
#define bFM4_MFS11_CSIO_FCR_FRIIE                 *((volatile uint32_t*)(0x427162ACUL))
#define bFM_MFS11_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427162B0UL))
#define bFM4_MFS11_CSIO_FCR_FLSTE                 *((volatile uint32_t*)(0x427162B0UL))

#define bFM_MFS11_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42716480UL))
#define bFM4_MFS11_CSIO_SACSR_TMRE                *((volatile uint32_t*)(0x42716480UL))
#define bFM_MFS11_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42716498UL))
#define bFM4_MFS11_CSIO_SACSR_TSYNE               *((volatile uint32_t*)(0x42716498UL))
#define bFM_MFS11_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4271649CUL))
#define bFM4_MFS11_CSIO_SACSR_TINTE               *((volatile uint32_t*)(0x4271649CUL))
#define bFM_MFS11_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427164A0UL))
#define bFM4_MFS11_CSIO_SACSR_TINT                *((volatile uint32_t*)(0x427164A0UL))
#define bFM_MFS11_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427164ACUL))
#define bFM4_MFS11_CSIO_SACSR_CSE                 *((volatile uint32_t*)(0x427164ACUL))
#define bFM_MFS11_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427164B0UL))
#define bFM4_MFS11_CSIO_SACSR_CSEIE               *((volatile uint32_t*)(0x427164B0UL))
#define bFM_MFS11_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427164B4UL))
#define bFM4_MFS11_CSIO_SACSR_TBEEN               *((volatile uint32_t*)(0x427164B4UL))

#define bFM_MFS11_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42716020UL))
#define bFM4_MFS11_CSIO_SCR_TXE                   *((volatile uint32_t*)(0x42716020UL))
#define bFM_MFS11_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42716024UL))
#define bFM4_MFS11_CSIO_SCR_RXE                   *((volatile uint32_t*)(0x42716024UL))
#define bFM_MFS11_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42716028UL))
#define bFM4_MFS11_CSIO_SCR_TBIE                  *((volatile uint32_t*)(0x42716028UL))
#define bFM_MFS11_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4271602CUL))
#define bFM4_MFS11_CSIO_SCR_TIE                   *((volatile uint32_t*)(0x4271602CUL))
#define bFM_MFS11_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42716030UL))
#define bFM4_MFS11_CSIO_SCR_RIE                   *((volatile uint32_t*)(0x42716030UL))
#define bFM_MFS11_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42716034UL))
#define bFM4_MFS11_CSIO_SCR_SPI                   *((volatile uint32_t*)(0x42716034UL))
#define bFM_MFS11_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42716038UL))
#define bFM4_MFS11_CSIO_SCR_MS                    *((volatile uint32_t*)(0x42716038UL))
#define bFM_MFS11_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4271603CUL))
#define bFM4_MFS11_CSIO_SCR_UPCL                  *((volatile uint32_t*)(0x4271603CUL))

#define bFM_MFS11_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42716600UL))
#define bFM4_MFS11_CSIO_SCSCR_CSOE                *((volatile uint32_t*)(0x42716600UL))
#define bFM_MFS11_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42716604UL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN0               *((volatile uint32_t*)(0x42716604UL))
#define bFM_MFS11_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42716608UL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN1               *((volatile uint32_t*)(0x42716608UL))
#define bFM_MFS11_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4271660CUL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN2               *((volatile uint32_t*)(0x4271660CUL))
#define bFM_MFS11_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42716610UL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN3               *((volatile uint32_t*)(0x42716610UL))
#define bFM_MFS11_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42716614UL))
#define bFM4_MFS11_CSIO_SCSCR_CSLVL               *((volatile uint32_t*)(0x42716614UL))
#define bFM_MFS11_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42716624UL))
#define bFM4_MFS11_CSIO_SCSCR_SCAM                *((volatile uint32_t*)(0x42716624UL))

#define bFM_MFS11_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x42716694UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1SPI             *((volatile uint32_t*)(0x42716694UL))
#define bFM_MFS11_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x42716698UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1SCINV           *((volatile uint32_t*)(0x42716698UL))
#define bFM_MFS11_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4271669CUL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1CSLVL           *((volatile uint32_t*)(0x4271669CUL))

#define bFM_MFS11_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x427166B4UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2SPI             *((volatile uint32_t*)(0x427166B4UL))
#define bFM_MFS11_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x427166B8UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2SCINV           *((volatile uint32_t*)(0x427166B8UL))
#define bFM_MFS11_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x427166BCUL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2CSLVL           *((volatile uint32_t*)(0x427166BCUL))

#define bFM_MFS11_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x42716714UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3SPI             *((volatile uint32_t*)(0x42716714UL))
#define bFM_MFS11_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x42716718UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3SCINV           *((volatile uint32_t*)(0x42716718UL))
#define bFM_MFS11_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4271671CUL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3CSLVL           *((volatile uint32_t*)(0x4271671CUL))

#define bFM_MFS11_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x42716000UL))
#define bFM4_MFS11_CSIO_SMR_SOE                   *((volatile uint32_t*)(0x42716000UL))
#define bFM_MFS11_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x42716004UL))
#define bFM4_MFS11_CSIO_SMR_SCKE                  *((volatile uint32_t*)(0x42716004UL))
#define bFM_MFS11_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x42716008UL))
#define bFM4_MFS11_CSIO_SMR_BDS                   *((volatile uint32_t*)(0x42716008UL))
#define bFM_MFS11_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4271600CUL))
#define bFM4_MFS11_CSIO_SMR_SCINV                 *((volatile uint32_t*)(0x4271600CUL))

