neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS11_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x427160A0UL))
#define bFM4_MFS11_CSIO_SSR_TBI                   *((volatile uint32_t*)(0x427160A0UL))
#define bFM_MFS11_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x427160A4UL))
#define bFM4_MFS11_CSIO_SSR_TDRE                  *((volatile uint32_t*)(0x427160A4UL))
#define bFM_MFS11_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x427160A8UL))
#define bFM4_MFS11_CSIO_SSR_RDRF                  *((volatile uint32_t*)(0x427160A8UL))
#define bFM_MFS11_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x427160ACUL))
#define bFM4_MFS11_CSIO_SSR_ORE                   *((volatile uint32_t*)(0x427160ACUL))
#define bFM_MFS11_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x427160B0UL))
#define bFM4_MFS11_CSIO_SSR_AWC                   *((volatile uint32_t*)(0x427160B0UL))
#define bFM_MFS11_CSIO_SSR_REC                    *((volatile uint32_t*)(0x427160BCUL))
#define bFM4_MFS11_CSIO_SSR_REC                   *((volatile uint32_t*)(0x427160BCUL))

#define bFM_MFS11_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x427163A0UL))
#define bFM4_MFS11_I2C_EIBCR_BEC                  *((volatile uint32_t*)(0x427163A0UL))
#define bFM_MFS11_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x427163A4UL))
#define bFM4_MFS11_I2C_EIBCR_SOCE                 *((volatile uint32_t*)(0x427163A4UL))
#define bFM_MFS11_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x427163A8UL))
#define bFM4_MFS11_I2C_EIBCR_SCLC                 *((volatile uint32_t*)(0x427163A8UL))
#define bFM_MFS11_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x427163ACUL))
#define bFM4_MFS11_I2C_EIBCR_SDAC                 *((volatile uint32_t*)(0x427163ACUL))
#define bFM_MFS11_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x427163B0UL))
#define bFM4_MFS11_I2C_EIBCR_SCLS                 *((volatile uint32_t*)(0x427163B0UL))
#define bFM_MFS11_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x427163B4UL))
#define bFM4_MFS11_I2C_EIBCR_SDAS                 *((volatile uint32_t*)(0x427163B4UL))

#define bFM_MFS11_I2C_FCR_FE1                     *((volatile uint32_t*)(0x42716280UL))
#define bFM4_MFS11_I2C_FCR_FE1                    *((volatile uint32_t*)(0x42716280UL))
#define bFM_MFS11_I2C_FCR_FE2                     *((volatile uint32_t*)(0x42716284UL))
#define bFM4_MFS11_I2C_FCR_FE2                    *((volatile uint32_t*)(0x42716284UL))
#define bFM_MFS11_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x42716288UL))
#define bFM4_MFS11_I2C_FCR_FCL1                   *((volatile uint32_t*)(0x42716288UL))
#define bFM_MFS11_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4271628CUL))
#define bFM4_MFS11_I2C_FCR_FCL2                   *((volatile uint32_t*)(0x4271628CUL))
#define bFM_MFS11_I2C_FCR_FSET                    *((volatile uint32_t*)(0x42716290UL))
#define bFM4_MFS11_I2C_FCR_FSET                   *((volatile uint32_t*)(0x42716290UL))
#define bFM_MFS11_I2C_FCR_FLD                     *((volatile uint32_t*)(0x42716294UL))
#define bFM4_MFS11_I2C_FCR_FLD                    *((volatile uint32_t*)(0x42716294UL))
#define bFM_MFS11_I2C_FCR_FLST                    *((volatile uint32_t*)(0x42716298UL))
#define bFM4_MFS11_I2C_FCR_FLST                   *((volatile uint32_t*)(0x42716298UL))
#define bFM_MFS11_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x427162A0UL))
#define bFM4_MFS11_I2C_FCR_FSEL                   *((volatile uint32_t*)(0x427162A0UL))
#define bFM_MFS11_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x427162A4UL))
#define bFM4_MFS11_I2C_FCR_FTIE                   *((volatile uint32_t*)(0x427162A4UL))
#define bFM_MFS11_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x427162A8UL))
#define bFM4_MFS11_I2C_FCR_FDRQ                   *((volatile uint32_t*)(0x427162A8UL))
#define bFM_MFS11_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x427162ACUL))
#define bFM4_MFS11_I2C_FCR_FRIIE                  *((volatile uint32_t*)(0x427162ACUL))
#define bFM_MFS11_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x427162B0UL))
#define bFM4_MFS11_I2C_FCR_FLSTE                  *((volatile uint32_t*)(0x427162B0UL))

#define bFM_MFS11_I2C_IBCR_INT                    *((volatile uint32_t*)(0x42716020UL))
#define bFM4_MFS11_I2C_IBCR_INT                   *((volatile uint32_t*)(0x42716020UL))
#define bFM_MFS11_I2C_IBCR_BER                    *((volatile uint32_t*)(0x42716024UL))
#define bFM4_MFS11_I2C_IBCR_BER                   *((volatile uint32_t*)(0x42716024UL))
#define bFM_MFS11_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x42716028UL))
#define bFM4_MFS11_I2C_IBCR_INTE                  *((volatile uint32_t*)(0x42716028UL))
#define bFM_MFS11_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4271602CUL))
#define bFM4_MFS11_I2C_IBCR_CNDE                  *((volatile uint32_t*)(0x4271602CUL))
#define bFM_MFS11_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x42716030UL))
#define bFM4_MFS11_I2C_IBCR_WSEL                  *((volatile uint32_t*)(0x42716030UL))
#define bFM_MFS11_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x42716034UL))
#define bFM4_MFS11_I2C_IBCR_ACKE                  *((volatile uint32_t*)(0x42716034UL))
#define bFM_MFS11_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x42716038UL))
#define bFM4_MFS11_I2C_IBCR_ACT_SCC               *((volatile uint32_t*)(0x42716038UL))
#define bFM_MFS11_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4271603CUL))
#define bFM4_MFS11_I2C_IBCR_MSS                   *((volatile uint32_t*)(0x4271603CUL))

#define bFM_MFS11_I2C_IBSR_BB                     *((volatile uint32_t*)(0x42716080UL))
#define bFM4_MFS11_I2C_IBSR_BB                    *((volatile uint32_t*)(0x42716080UL))
#define bFM_MFS11_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x42716084UL))
#define bFM4_MFS11_I2C_IBSR_SPC                   *((volatile uint32_t*)(0x42716084UL))
#define bFM_MFS11_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x42716088UL))
#define bFM4_MFS11_I2C_IBSR_RSC                   *((volatile uint32_t*)(0x42716088UL))
#define bFM_MFS11_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4271608CUL))
#define bFM4_MFS11_I2C_IBSR_AL                    *((volatile uint32_t*)(0x4271608CUL))
#define bFM_MFS11_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x42716090UL))
#define bFM4_MFS11_I2C_IBSR_TRX                   *((volatile uint32_t*)(0x42716090UL))
#define bFM_MFS11_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x42716094UL))
#define bFM4_MFS11_I2C_IBSR_RSA                   *((volatile uint32_t*)(0x42716094UL))
#define bFM_MFS11_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x42716098UL))
#define bFM4_MFS11_I2C_IBSR_RACK                  *((volatile uint32_t*)(0x42716098UL))
#define bFM_MFS11_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4271609CUL))
#define bFM4_MFS11_I2C_IBSR_FBT                   *((volatile uint32_t*)(0x4271609CUL))

#define bFM_MFS11_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4271621CUL))
#define bFM4_MFS11_I2C_ISBA_SAEN                  *((volatile uint32_t*)(0x4271621CUL))

#define bFM_MFS11_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4271623CUL))
#define bFM4_MFS11_I2C_ISMK_EN                    *((volatile uint32_t*)(0x4271623CUL))

#define bFM_MFS11_I2C_SMR_TIE                     *((volatile uint32_t*)(0x42716008UL))
#define bFM4_MFS11_I2C_SMR_TIE                    *((volatile uint32_t*)(0x42716008UL))
#define bFM_MFS11_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4271600CUL))
#define bFM4_MFS11_I2C_SMR_RIE                    *((volatile uint32_t*)(0x4271600CUL))

#define bFM_MFS11_I2C_SSR_TBI                     *((volatile uint32_t*)(0x427160A0UL))
#define bFM4_MFS11_I2C_SSR_TBI                    *((volatile uint32_t*)(0x427160A0UL))
#define bFM_MFS11_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x427160A4UL))
#define bFM4_MFS11_I2C_SSR_TDRE                   *((volatile uint32_t*)(0x427160A4UL))
#define bFM_MFS11_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x427160A8UL))
#define bFM4_MFS11_I2C_SSR_RDRF                   *((volatile uint32_t*)(0x427160A8UL))
#define bFM_MFS11_I2C_SSR_ORE                     *((volatile uint32_t*)(0x427160ACUL))
#define bFM4_MFS11_I2C_SSR_ORE                    *((volatile uint32_t*)(0x427160ACUL))
#define bFM_MFS11_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x427160B0UL))
#define bFM4_MFS11_I2C_SSR_TBIE                   *((volatile uint32_t*)(0x427160B0UL))
#define bFM_MFS11_I2C_SSR_DMA                     *((volatile uint32_t*)(0x427160B4UL))
#define bFM4_MFS11_I2C_SSR_DMA                    *((volatile uint32_t*)(0x427160B4UL))
#define bFM_MFS11_I2C_SSR_TSET                    *((volatile uint32_t*)(0x427160B8UL))
#define bFM4_MFS11_I2C_SSR_TSET                   *((volatile uint32_t*)(0x427160B8UL))
#define bFM_MFS11_I2C_SSR_REC                     *((volatile uint32_t*)(0x427160BCUL))
#define bFM4_MFS11_I2C_SSR_REC                    *((volatile uint32_t*)(0x427160BCUL))

