neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS11_LIN_BGR_EXT                     *((volatile uint32_t*)(0x427161BCUL))
#define bFM4_MFS11_LIN_BGR_EXT                    *((volatile uint32_t*)(0x427161BCUL))

#define bFM_MFS11_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x42716090UL))
#define bFM4_MFS11_LIN_ESCR_LBIE                  *((volatile uint32_t*)(0x42716090UL))
#define bFM_MFS11_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x42716098UL))
#define bFM4_MFS11_LIN_ESCR_ESBL                  *((volatile uint32_t*)(0x42716098UL))

#define bFM_MFS11_LIN_FCR_FE1                     *((volatile uint32_t*)(0x42716280UL))
#define bFM4_MFS11_LIN_FCR_FE1                    *((volatile uint32_t*)(0x42716280UL))
#define bFM_MFS11_LIN_FCR_FE2                     *((volatile uint32_t*)(0x42716284UL))
#define bFM4_MFS11_LIN_FCR_FE2                    *((volatile uint32_t*)(0x42716284UL))
#define bFM_MFS11_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x42716288UL))
#define bFM4_MFS11_LIN_FCR_FCL1                   *((volatile uint32_t*)(0x42716288UL))
#define bFM_MFS11_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4271628CUL))
#define bFM4_MFS11_LIN_FCR_FCL2                   *((volatile uint32_t*)(0x4271628CUL))
#define bFM_MFS11_LIN_FCR_FSET                    *((volatile uint32_t*)(0x42716290UL))
#define bFM4_MFS11_LIN_FCR_FSET                   *((volatile uint32_t*)(0x42716290UL))
#define bFM_MFS11_LIN_FCR_FLD                     *((volatile uint32_t*)(0x42716294UL))
#define bFM4_MFS11_LIN_FCR_FLD                    *((volatile uint32_t*)(0x42716294UL))
#define bFM_MFS11_LIN_FCR_FLST                    *((volatile uint32_t*)(0x42716298UL))
#define bFM4_MFS11_LIN_FCR_FLST                   *((volatile uint32_t*)(0x42716298UL))
#define bFM_MFS11_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x427162A0UL))
#define bFM4_MFS11_LIN_FCR_FSEL                   *((volatile uint32_t*)(0x427162A0UL))
#define bFM_MFS11_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x427162A4UL))
#define bFM4_MFS11_LIN_FCR_FTIE                   *((volatile uint32_t*)(0x427162A4UL))
#define bFM_MFS11_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x427162A8UL))
#define bFM4_MFS11_LIN_FCR_FDRQ                   *((volatile uint32_t*)(0x427162A8UL))
#define bFM_MFS11_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x427162ACUL))
#define bFM4_MFS11_LIN_FCR_FRIIE                  *((volatile uint32_t*)(0x427162ACUL))
#define bFM_MFS11_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x427162B0UL))
#define bFM4_MFS11_LIN_FCR_FLSTE                  *((volatile uint32_t*)(0x427162B0UL))

#define bFM_MFS11_LIN_SCR_TXE                     *((volatile uint32_t*)(0x42716020UL))
#define bFM4_MFS11_LIN_SCR_TXE                    *((volatile uint32_t*)(0x42716020UL))
#define bFM_MFS11_LIN_SCR_RXE                     *((volatile uint32_t*)(0x42716024UL))
#define bFM4_MFS11_LIN_SCR_RXE                    *((volatile uint32_t*)(0x42716024UL))
#define bFM_MFS11_LIN_SCR_TBIE                    *((volatile uint32_t*)(0x42716028UL))
#define bFM4_MFS11_LIN_SCR_TBIE                   *((volatile uint32_t*)(0x42716028UL))
#define bFM_MFS11_LIN_SCR_TIE                     *((volatile uint32_t*)(0x4271602CUL))
#define bFM4_MFS11_LIN_SCR_TIE                    *((volatile uint32_t*)(0x4271602CUL))
#define bFM_MFS11_LIN_SCR_RIE                     *((volatile uint32_t*)(0x42716030UL))
#define bFM4_MFS11_LIN_SCR_RIE                    *((volatile uint32_t*)(0x42716030UL))
#define bFM_MFS11_LIN_SCR_LBR                     *((volatile uint32_t*)(0x42716034UL))
#define bFM4_MFS11_LIN_SCR_LBR                    *((volatile uint32_t*)(0x42716034UL))
#define bFM_MFS11_LIN_SCR_MS                      *((volatile uint32_t*)(0x42716038UL))
#define bFM4_MFS11_LIN_SCR_MS                     *((volatile uint32_t*)(0x42716038UL))
#define bFM_MFS11_LIN_SCR_UPCL                    *((volatile uint32_t*)(0x4271603CUL))
#define bFM4_MFS11_LIN_SCR_UPCL                   *((volatile uint32_t*)(0x4271603CUL))

#define bFM_MFS11_LIN_SMR_SOE                     *((volatile uint32_t*)(0x42716000UL))
#define bFM4_MFS11_LIN_SMR_SOE                    *((volatile uint32_t*)(0x42716000UL))
#define bFM_MFS11_LIN_SMR_SBL                     *((volatile uint32_t*)(0x4271600CUL))
#define bFM4_MFS11_LIN_SMR_SBL                    *((volatile uint32_t*)(0x4271600CUL))
#define bFM_MFS11_LIN_SMR_WUCR                    *((volatile uint32_t*)(0x42716010UL))
#define bFM4_MFS11_LIN_SMR_WUCR                   *((volatile uint32_t*)(0x42716010UL))

#define bFM_MFS11_LIN_SSR_TBI                     *((volatile uint32_t*)(0x427160A0UL))
#define bFM4_MFS11_LIN_SSR_TBI                    *((volatile uint32_t*)(0x427160A0UL))
#define bFM_MFS11_LIN_SSR_TDRE                    *((volatile uint32_t*)(0x427160A4UL))
#define bFM4_MFS11_LIN_SSR_TDRE                   *((volatile uint32_t*)(0x427160A4UL))
#define bFM_MFS11_LIN_SSR_RDRF                    *((volatile uint32_t*)(0x427160A8UL))
#define bFM4_MFS11_LIN_SSR_RDRF                   *((volatile uint32_t*)(0x427160A8UL))
#define bFM_MFS11_LIN_SSR_ORE                     *((volatile uint32_t*)(0x427160ACUL))
#define bFM4_MFS11_LIN_SSR_ORE                    *((volatile uint32_t*)(0x427160ACUL))
#define bFM_MFS11_LIN_SSR_FRE                     *((volatile uint32_t*)(0x427160B0UL))
#define bFM4_MFS11_LIN_SSR_FRE                    *((volatile uint32_t*)(0x427160B0UL))
#define bFM_MFS11_LIN_SSR_LBD                     *((volatile uint32_t*)(0x427160B4UL))
#define bFM4_MFS11_LIN_SSR_LBD                    *((volatile uint32_t*)(0x427160B4UL))
#define bFM_MFS11_LIN_SSR_REC                     *((volatile uint32_t*)(0x427160BCUL))
#define bFM4_MFS11_LIN_SSR_REC                    *((volatile uint32_t*)(0x427160BCUL))

#define bFM_MFS11_UART_BGR_EXT                    *((volatile uint32_t*)(0x427161BCUL))
#define bFM4_MFS11_UART_BGR_EXT                   *((volatile uint32_t*)(0x427161BCUL))

#define bFM_MFS11_UART_ESCR_P                     *((volatile uint32_t*)(0x4271608CUL))
#define bFM4_MFS11_UART_ESCR_P                    *((volatile uint32_t*)(0x4271608CUL))
#define bFM_MFS11_UART_ESCR_PEN                   *((volatile uint32_t*)(0x42716090UL))
#define bFM4_MFS11_UART_ESCR_PEN                  *((volatile uint32_t*)(0x42716090UL))
#define bFM_MFS11_UART_ESCR_INV                   *((volatile uint32_t*)(0x42716094UL))
#define bFM4_MFS11_UART_ESCR_INV                  *((volatile uint32_t*)(0x42716094UL))
#define bFM_MFS11_UART_ESCR_ESBL                  *((volatile uint32_t*)(0x42716098UL))
#define bFM4_MFS11_UART_ESCR_ESBL                 *((volatile uint32_t*)(0x42716098UL))
#define bFM_MFS11_UART_ESCR_FLWEN                 *((volatile uint32_t*)(0x4271609CUL))
#define bFM4_MFS11_UART_ESCR_FLWEN                *((volatile uint32_t*)(0x4271609CUL))

