neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS11_UART_FCR_FE1                    *((volatile uint32_t*)(0x42716280UL))
#define bFM4_MFS11_UART_FCR_FE1                   *((volatile uint32_t*)(0x42716280UL))
#define bFM_MFS11_UART_FCR_FE2                    *((volatile uint32_t*)(0x42716284UL))
#define bFM4_MFS11_UART_FCR_FE2                   *((volatile uint32_t*)(0x42716284UL))
#define bFM_MFS11_UART_FCR_FCL1                   *((volatile uint32_t*)(0x42716288UL))
#define bFM4_MFS11_UART_FCR_FCL1                  *((volatile uint32_t*)(0x42716288UL))
#define bFM_MFS11_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4271628CUL))
#define bFM4_MFS11_UART_FCR_FCL2                  *((volatile uint32_t*)(0x4271628CUL))
#define bFM_MFS11_UART_FCR_FSET                   *((volatile uint32_t*)(0x42716290UL))
#define bFM4_MFS11_UART_FCR_FSET                  *((volatile uint32_t*)(0x42716290UL))
#define bFM_MFS11_UART_FCR_FLD                    *((volatile uint32_t*)(0x42716294UL))
#define bFM4_MFS11_UART_FCR_FLD                   *((volatile uint32_t*)(0x42716294UL))
#define bFM_MFS11_UART_FCR_FLST                   *((volatile uint32_t*)(0x42716298UL))
#define bFM4_MFS11_UART_FCR_FLST                  *((volatile uint32_t*)(0x42716298UL))
#define bFM_MFS11_UART_FCR_FSEL                   *((volatile uint32_t*)(0x427162A0UL))
#define bFM4_MFS11_UART_FCR_FSEL                  *((volatile uint32_t*)(0x427162A0UL))
#define bFM_MFS11_UART_FCR_FTIE                   *((volatile uint32_t*)(0x427162A4UL))
#define bFM4_MFS11_UART_FCR_FTIE                  *((volatile uint32_t*)(0x427162A4UL))
#define bFM_MFS11_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x427162A8UL))
#define bFM4_MFS11_UART_FCR_FDRQ                  *((volatile uint32_t*)(0x427162A8UL))
#define bFM_MFS11_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x427162ACUL))
#define bFM4_MFS11_UART_FCR_FRIIE                 *((volatile uint32_t*)(0x427162ACUL))
#define bFM_MFS11_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x427162B0UL))
#define bFM4_MFS11_UART_FCR_FLSTE                 *((volatile uint32_t*)(0x427162B0UL))

#define bFM_MFS11_UART_SCR_TXE                    *((volatile uint32_t*)(0x42716020UL))
#define bFM4_MFS11_UART_SCR_TXE                   *((volatile uint32_t*)(0x42716020UL))
#define bFM_MFS11_UART_SCR_RXE                    *((volatile uint32_t*)(0x42716024UL))
#define bFM4_MFS11_UART_SCR_RXE                   *((volatile uint32_t*)(0x42716024UL))
#define bFM_MFS11_UART_SCR_TBIE                   *((volatile uint32_t*)(0x42716028UL))
#define bFM4_MFS11_UART_SCR_TBIE                  *((volatile uint32_t*)(0x42716028UL))
#define bFM_MFS11_UART_SCR_TIE                    *((volatile uint32_t*)(0x4271602CUL))
#define bFM4_MFS11_UART_SCR_TIE                   *((volatile uint32_t*)(0x4271602CUL))
#define bFM_MFS11_UART_SCR_RIE                    *((volatile uint32_t*)(0x42716030UL))
#define bFM4_MFS11_UART_SCR_RIE                   *((volatile uint32_t*)(0x42716030UL))
#define bFM_MFS11_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4271603CUL))
#define bFM4_MFS11_UART_SCR_UPCL                  *((volatile uint32_t*)(0x4271603CUL))

#define bFM_MFS11_UART_SMR_SOE                    *((volatile uint32_t*)(0x42716000UL))
#define bFM4_MFS11_UART_SMR_SOE                   *((volatile uint32_t*)(0x42716000UL))
#define bFM_MFS11_UART_SMR_BDS                    *((volatile uint32_t*)(0x42716008UL))
#define bFM4_MFS11_UART_SMR_BDS                   *((volatile uint32_t*)(0x42716008UL))
#define bFM_MFS11_UART_SMR_SBL                    *((volatile uint32_t*)(0x4271600CUL))
#define bFM4_MFS11_UART_SMR_SBL                   *((volatile uint32_t*)(0x4271600CUL))

#define bFM_MFS11_UART_SSR_TBI                    *((volatile uint32_t*)(0x427160A0UL))
#define bFM4_MFS11_UART_SSR_TBI                   *((volatile uint32_t*)(0x427160A0UL))
#define bFM_MFS11_UART_SSR_TDRE                   *((volatile uint32_t*)(0x427160A4UL))
#define bFM4_MFS11_UART_SSR_TDRE                  *((volatile uint32_t*)(0x427160A4UL))
#define bFM_MFS11_UART_SSR_RDRF                   *((volatile uint32_t*)(0x427160A8UL))
#define bFM4_MFS11_UART_SSR_RDRF                  *((volatile uint32_t*)(0x427160A8UL))
#define bFM_MFS11_UART_SSR_ORE                    *((volatile uint32_t*)(0x427160ACUL))
#define bFM4_MFS11_UART_SSR_ORE                   *((volatile uint32_t*)(0x427160ACUL))
#define bFM_MFS11_UART_SSR_FRE                    *((volatile uint32_t*)(0x427160B0UL))
#define bFM4_MFS11_UART_SSR_FRE                   *((volatile uint32_t*)(0x427160B0UL))
#define bFM_MFS11_UART_SSR_PE                     *((volatile uint32_t*)(0x427160B4UL))
#define bFM4_MFS11_UART_SSR_PE                    *((volatile uint32_t*)(0x427160B4UL))
#define bFM_MFS11_UART_SSR_REC                    *((volatile uint32_t*)(0x427160BCUL))
#define bFM4_MFS11_UART_SSR_REC                   *((volatile uint32_t*)(0x427160BCUL))


/******************************************************************************
 ** MFS Registers MFS12
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS12_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x42718094UL))
#define bFM4_MFS12_CSIO_ESCR_CSFE                 *((volatile uint32_t*)(0x42718094UL))
#define bFM_MFS12_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x42718098UL))
#define bFM4_MFS12_CSIO_ESCR_L3                   *((volatile uint32_t*)(0x42718098UL))
#define bFM_MFS12_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4271809CUL))
#define bFM4_MFS12_CSIO_ESCR_SOP                  *((volatile uint32_t*)(0x4271809CUL))

#define bFM_MFS12_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42718280UL))
#define bFM4_MFS12_CSIO_FCR_FE1                   *((volatile uint32_t*)(0x42718280UL))
#define bFM_MFS12_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42718284UL))
#define bFM4_MFS12_CSIO_FCR_FE2                   *((volatile uint32_t*)(0x42718284UL))
#define bFM_MFS12_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42718288UL))
#define bFM4_MFS12_CSIO_FCR_FCL1                  *((volatile uint32_t*)(0x42718288UL))
#define bFM_MFS12_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4271828CUL))
#define bFM4_MFS12_CSIO_FCR_FCL2                  *((volatile uint32_t*)(0x4271828CUL))
#define bFM_MFS12_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42718290UL))
#define bFM4_MFS12_CSIO_FCR_FSET                  *((volatile uint32_t*)(0x42718290UL))
#define bFM_MFS12_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42718294UL))
#define bFM4_MFS12_CSIO_FCR_FLD                   *((volatile uint32_t*)(0x42718294UL))
#define bFM_MFS12_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42718298UL))
#define bFM4_MFS12_CSIO_FCR_FLST                  *((volatile uint32_t*)(0x42718298UL))
#define bFM_MFS12_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427182A0UL))
#define bFM4_MFS12_CSIO_FCR_FSEL                  *((volatile uint32_t*)(0x427182A0UL))
#define bFM_MFS12_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427182A4UL))
#define bFM4_MFS12_CSIO_FCR_FTIE                  *((volatile uint32_t*)(0x427182A4UL))
#define bFM_MFS12_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427182A8UL))
#define bFM4_MFS12_CSIO_FCR_FDRQ                  *((volatile uint32_t*)(0x427182A8UL))
#define bFM_MFS12_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427182ACUL))
#define bFM4_MFS12_CSIO_FCR_FRIIE                 *((volatile uint32_t*)(0x427182ACUL))
#define bFM_MFS12_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427182B0UL))
#define bFM4_MFS12_CSIO_FCR_FLSTE                 *((volatile uint32_t*)(0x427182B0UL))

#define bFM_MFS12_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42718480UL))
#define bFM4_MFS12_CSIO_SACSR_TMRE                *((volatile uint32_t*)(0x42718480UL))
#define bFM_MFS12_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42718498UL))
#define bFM4_MFS12_CSIO_SACSR_TSYNE               *((volatile uint32_t*)(0x42718498UL))
#define bFM_MFS12_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4271849CUL))
#define bFM4_MFS12_CSIO_SACSR_TINTE               *((volatile uint32_t*)(0x4271849CUL))
#define bFM_MFS12_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427184A0UL))
#define bFM4_MFS12_CSIO_SACSR_TINT                *((volatile uint32_t*)(0x427184A0UL))
#define bFM_MFS12_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427184ACUL))
#define bFM4_MFS12_CSIO_SACSR_CSE                 *((volatile uint32_t*)(0x427184ACUL))
#define bFM_MFS12_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427184B0UL))
#define bFM4_MFS12_CSIO_SACSR_CSEIE               *((volatile uint32_t*)(0x427184B0UL))
#define bFM_MFS12_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427184B4UL))
#define bFM4_MFS12_CSIO_SACSR_TBEEN               *((volatile uint32_t*)(0x427184B4UL))

