neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS12_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42718020UL))
#define bFM4_MFS12_CSIO_SCR_TXE                   *((volatile uint32_t*)(0x42718020UL))
#define bFM_MFS12_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42718024UL))
#define bFM4_MFS12_CSIO_SCR_RXE                   *((volatile uint32_t*)(0x42718024UL))
#define bFM_MFS12_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42718028UL))
#define bFM4_MFS12_CSIO_SCR_TBIE                  *((volatile uint32_t*)(0x42718028UL))
#define bFM_MFS12_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4271802CUL))
#define bFM4_MFS12_CSIO_SCR_TIE                   *((volatile uint32_t*)(0x4271802CUL))
#define bFM_MFS12_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42718030UL))
#define bFM4_MFS12_CSIO_SCR_RIE                   *((volatile uint32_t*)(0x42718030UL))
#define bFM_MFS12_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42718034UL))
#define bFM4_MFS12_CSIO_SCR_SPI                   *((volatile uint32_t*)(0x42718034UL))
#define bFM_MFS12_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42718038UL))
#define bFM4_MFS12_CSIO_SCR_MS                    *((volatile uint32_t*)(0x42718038UL))
#define bFM_MFS12_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4271803CUL))
#define bFM4_MFS12_CSIO_SCR_UPCL                  *((volatile uint32_t*)(0x4271803CUL))

#define bFM_MFS12_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42718600UL))
#define bFM4_MFS12_CSIO_SCSCR_CSOE                *((volatile uint32_t*)(0x42718600UL))
#define bFM_MFS12_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42718604UL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN0               *((volatile uint32_t*)(0x42718604UL))
#define bFM_MFS12_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42718608UL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN1               *((volatile uint32_t*)(0x42718608UL))
#define bFM_MFS12_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4271860CUL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN2               *((volatile uint32_t*)(0x4271860CUL))
#define bFM_MFS12_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42718610UL))
#define bFM4_MFS12_CSIO_SCSCR_CSEN3               *((volatile uint32_t*)(0x42718610UL))
#define bFM_MFS12_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42718614UL))
#define bFM4_MFS12_CSIO_SCSCR_CSLVL               *((volatile uint32_t*)(0x42718614UL))
#define bFM_MFS12_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42718624UL))
#define bFM4_MFS12_CSIO_SCSCR_SCAM                *((volatile uint32_t*)(0x42718624UL))

#define bFM_MFS12_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x42718694UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1SPI             *((volatile uint32_t*)(0x42718694UL))
#define bFM_MFS12_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x42718698UL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1SCINV           *((volatile uint32_t*)(0x42718698UL))
#define bFM_MFS12_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4271869CUL))
#define bFM4_MFS12_CSIO_SCSFR0_CS1CSLVL           *((volatile uint32_t*)(0x4271869CUL))

#define bFM_MFS12_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x427186B4UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2SPI             *((volatile uint32_t*)(0x427186B4UL))
#define bFM_MFS12_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x427186B8UL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2SCINV           *((volatile uint32_t*)(0x427186B8UL))
#define bFM_MFS12_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x427186BCUL))
#define bFM4_MFS12_CSIO_SCSFR1_CS2CSLVL           *((volatile uint32_t*)(0x427186BCUL))

#define bFM_MFS12_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x42718714UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3SPI             *((volatile uint32_t*)(0x42718714UL))
#define bFM_MFS12_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x42718718UL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3SCINV           *((volatile uint32_t*)(0x42718718UL))
#define bFM_MFS12_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4271871CUL))
#define bFM4_MFS12_CSIO_SCSFR2_CS3CSLVL           *((volatile uint32_t*)(0x4271871CUL))

#define bFM_MFS12_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x42718000UL))
#define bFM4_MFS12_CSIO_SMR_SOE                   *((volatile uint32_t*)(0x42718000UL))
#define bFM_MFS12_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x42718004UL))
#define bFM4_MFS12_CSIO_SMR_SCKE                  *((volatile uint32_t*)(0x42718004UL))
#define bFM_MFS12_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x42718008UL))
#define bFM4_MFS12_CSIO_SMR_BDS                   *((volatile uint32_t*)(0x42718008UL))
#define bFM_MFS12_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4271800CUL))
#define bFM4_MFS12_CSIO_SMR_SCINV                 *((volatile uint32_t*)(0x4271800CUL))

#define bFM_MFS12_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x427180A0UL))
#define bFM4_MFS12_CSIO_SSR_TBI                   *((volatile uint32_t*)(0x427180A0UL))
#define bFM_MFS12_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x427180A4UL))
#define bFM4_MFS12_CSIO_SSR_TDRE                  *((volatile uint32_t*)(0x427180A4UL))
#define bFM_MFS12_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x427180A8UL))
#define bFM4_MFS12_CSIO_SSR_RDRF                  *((volatile uint32_t*)(0x427180A8UL))
#define bFM_MFS12_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x427180ACUL))
#define bFM4_MFS12_CSIO_SSR_ORE                   *((volatile uint32_t*)(0x427180ACUL))
#define bFM_MFS12_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x427180B0UL))
#define bFM4_MFS12_CSIO_SSR_AWC                   *((volatile uint32_t*)(0x427180B0UL))
#define bFM_MFS12_CSIO_SSR_REC                    *((volatile uint32_t*)(0x427180BCUL))
#define bFM4_MFS12_CSIO_SSR_REC                   *((volatile uint32_t*)(0x427180BCUL))

#define bFM_MFS12_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x427183A0UL))
#define bFM4_MFS12_I2C_EIBCR_BEC                  *((volatile uint32_t*)(0x427183A0UL))
#define bFM_MFS12_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x427183A4UL))
#define bFM4_MFS12_I2C_EIBCR_SOCE                 *((volatile uint32_t*)(0x427183A4UL))
#define bFM_MFS12_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x427183A8UL))
#define bFM4_MFS12_I2C_EIBCR_SCLC                 *((volatile uint32_t*)(0x427183A8UL))
#define bFM_MFS12_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x427183ACUL))
#define bFM4_MFS12_I2C_EIBCR_SDAC                 *((volatile uint32_t*)(0x427183ACUL))
#define bFM_MFS12_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x427183B0UL))
#define bFM4_MFS12_I2C_EIBCR_SCLS                 *((volatile uint32_t*)(0x427183B0UL))
#define bFM_MFS12_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x427183B4UL))
#define bFM4_MFS12_I2C_EIBCR_SDAS                 *((volatile uint32_t*)(0x427183B4UL))

#define bFM_MFS12_I2C_FCR_FE1                     *((volatile uint32_t*)(0x42718280UL))
#define bFM4_MFS12_I2C_FCR_FE1                    *((volatile uint32_t*)(0x42718280UL))
#define bFM_MFS12_I2C_FCR_FE2                     *((volatile uint32_t*)(0x42718284UL))
#define bFM4_MFS12_I2C_FCR_FE2                    *((volatile uint32_t*)(0x42718284UL))
#define bFM_MFS12_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x42718288UL))
#define bFM4_MFS12_I2C_FCR_FCL1                   *((volatile uint32_t*)(0x42718288UL))
#define bFM_MFS12_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4271828CUL))
#define bFM4_MFS12_I2C_FCR_FCL2                   *((volatile uint32_t*)(0x4271828CUL))
#define bFM_MFS12_I2C_FCR_FSET                    *((volatile uint32_t*)(0x42718290UL))
#define bFM4_MFS12_I2C_FCR_FSET                   *((volatile uint32_t*)(0x42718290UL))
#define bFM_MFS12_I2C_FCR_FLD                     *((volatile uint32_t*)(0x42718294UL))
#define bFM4_MFS12_I2C_FCR_FLD                    *((volatile uint32_t*)(0x42718294UL))
#define bFM_MFS12_I2C_FCR_FLST                    *((volatile uint32_t*)(0x42718298UL))
#define bFM4_MFS12_I2C_FCR_FLST                   *((volatile uint32_t*)(0x42718298UL))
#define bFM_MFS12_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x427182A0UL))
#define bFM4_MFS12_I2C_FCR_FSEL                   *((volatile uint32_t*)(0x427182A0UL))
#define bFM_MFS12_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x427182A4UL))
#define bFM4_MFS12_I2C_FCR_FTIE                   *((volatile uint32_t*)(0x427182A4UL))
#define bFM_MFS12_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x427182A8UL))
#define bFM4_MFS12_I2C_FCR_FDRQ                   *((volatile uint32_t*)(0x427182A8UL))
#define bFM_MFS12_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x427182ACUL))
#define bFM4_MFS12_I2C_FCR_FRIIE                  *((volatile uint32_t*)(0x427182ACUL))
#define bFM_MFS12_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x427182B0UL))
#define bFM4_MFS12_I2C_FCR_FLSTE                  *((volatile uint32_t*)(0x427182B0UL))

#define bFM_MFS12_I2C_IBCR_INT                    *((volatile uint32_t*)(0x42718020UL))
#define bFM4_MFS12_I2C_IBCR_INT                   *((volatile uint32_t*)(0x42718020UL))
#define bFM_MFS12_I2C_IBCR_BER                    *((volatile uint32_t*)(0x42718024UL))
#define bFM4_MFS12_I2C_IBCR_BER                   *((volatile uint32_t*)(0x42718024UL))
#define bFM_MFS12_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x42718028UL))
#define bFM4_MFS12_I2C_IBCR_INTE                  *((volatile uint32_t*)(0x42718028UL))
#define bFM_MFS12_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4271802CUL))
#define bFM4_MFS12_I2C_IBCR_CNDE                  *((volatile uint32_t*)(0x4271802CUL))
#define bFM_MFS12_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x42718030UL))
#define bFM4_MFS12_I2C_IBCR_WSEL                  *((volatile uint32_t*)(0x42718030UL))
#define bFM_MFS12_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x42718034UL))
#define bFM4_MFS12_I2C_IBCR_ACKE                  *((volatile uint32_t*)(0x42718034UL))
#define bFM_MFS12_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x42718038UL))
#define bFM4_MFS12_I2C_IBCR_ACT_SCC               *((volatile uint32_t*)(0x42718038UL))
#define bFM_MFS12_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4271803CUL))
#define bFM4_MFS12_I2C_IBCR_MSS                   *((volatile uint32_t*)(0x4271803CUL))

