neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS12_I2C_IBSR_BB                     *((volatile uint32_t*)(0x42718080UL))
#define bFM4_MFS12_I2C_IBSR_BB                    *((volatile uint32_t*)(0x42718080UL))
#define bFM_MFS12_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x42718084UL))
#define bFM4_MFS12_I2C_IBSR_SPC                   *((volatile uint32_t*)(0x42718084UL))
#define bFM_MFS12_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x42718088UL))
#define bFM4_MFS12_I2C_IBSR_RSC                   *((volatile uint32_t*)(0x42718088UL))
#define bFM_MFS12_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4271808CUL))
#define bFM4_MFS12_I2C_IBSR_AL                    *((volatile uint32_t*)(0x4271808CUL))
#define bFM_MFS12_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x42718090UL))
#define bFM4_MFS12_I2C_IBSR_TRX                   *((volatile uint32_t*)(0x42718090UL))
#define bFM_MFS12_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x42718094UL))
#define bFM4_MFS12_I2C_IBSR_RSA                   *((volatile uint32_t*)(0x42718094UL))
#define bFM_MFS12_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x42718098UL))
#define bFM4_MFS12_I2C_IBSR_RACK                  *((volatile uint32_t*)(0x42718098UL))
#define bFM_MFS12_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4271809CUL))
#define bFM4_MFS12_I2C_IBSR_FBT                   *((volatile uint32_t*)(0x4271809CUL))

#define bFM_MFS12_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4271821CUL))
#define bFM4_MFS12_I2C_ISBA_SAEN                  *((volatile uint32_t*)(0x4271821CUL))

#define bFM_MFS12_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4271823CUL))
#define bFM4_MFS12_I2C_ISMK_EN                    *((volatile uint32_t*)(0x4271823CUL))

#define bFM_MFS12_I2C_SMR_TIE                     *((volatile uint32_t*)(0x42718008UL))
#define bFM4_MFS12_I2C_SMR_TIE                    *((volatile uint32_t*)(0x42718008UL))
#define bFM_MFS12_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4271800CUL))
#define bFM4_MFS12_I2C_SMR_RIE                    *((volatile uint32_t*)(0x4271800CUL))

#define bFM_MFS12_I2C_SSR_TBI                     *((volatile uint32_t*)(0x427180A0UL))
#define bFM4_MFS12_I2C_SSR_TBI                    *((volatile uint32_t*)(0x427180A0UL))
#define bFM_MFS12_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x427180A4UL))
#define bFM4_MFS12_I2C_SSR_TDRE                   *((volatile uint32_t*)(0x427180A4UL))
#define bFM_MFS12_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x427180A8UL))
#define bFM4_MFS12_I2C_SSR_RDRF                   *((volatile uint32_t*)(0x427180A8UL))
#define bFM_MFS12_I2C_SSR_ORE                     *((volatile uint32_t*)(0x427180ACUL))
#define bFM4_MFS12_I2C_SSR_ORE                    *((volatile uint32_t*)(0x427180ACUL))
#define bFM_MFS12_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x427180B0UL))
#define bFM4_MFS12_I2C_SSR_TBIE                   *((volatile uint32_t*)(0x427180B0UL))
#define bFM_MFS12_I2C_SSR_DMA                     *((volatile uint32_t*)(0x427180B4UL))
#define bFM4_MFS12_I2C_SSR_DMA                    *((volatile uint32_t*)(0x427180B4UL))
#define bFM_MFS12_I2C_SSR_TSET                    *((volatile uint32_t*)(0x427180B8UL))
#define bFM4_MFS12_I2C_SSR_TSET                   *((volatile uint32_t*)(0x427180B8UL))
#define bFM_MFS12_I2C_SSR_REC                     *((volatile uint32_t*)(0x427180BCUL))
#define bFM4_MFS12_I2C_SSR_REC                    *((volatile uint32_t*)(0x427180BCUL))

#define bFM_MFS12_LIN_BGR_EXT                     *((volatile uint32_t*)(0x427181BCUL))
#define bFM4_MFS12_LIN_BGR_EXT                    *((volatile uint32_t*)(0x427181BCUL))

#define bFM_MFS12_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x42718090UL))
#define bFM4_MFS12_LIN_ESCR_LBIE                  *((volatile uint32_t*)(0x42718090UL))
#define bFM_MFS12_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x42718098UL))
#define bFM4_MFS12_LIN_ESCR_ESBL                  *((volatile uint32_t*)(0x42718098UL))

#define bFM_MFS12_LIN_FCR_FE1                     *((volatile uint32_t*)(0x42718280UL))
#define bFM4_MFS12_LIN_FCR_FE1                    *((volatile uint32_t*)(0x42718280UL))
#define bFM_MFS12_LIN_FCR_FE2                     *((volatile uint32_t*)(0x42718284UL))
#define bFM4_MFS12_LIN_FCR_FE2                    *((volatile uint32_t*)(0x42718284UL))
#define bFM_MFS12_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x42718288UL))
#define bFM4_MFS12_LIN_FCR_FCL1                   *((volatile uint32_t*)(0x42718288UL))
#define bFM_MFS12_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4271828CUL))
#define bFM4_MFS12_LIN_FCR_FCL2                   *((volatile uint32_t*)(0x4271828CUL))
#define bFM_MFS12_LIN_FCR_FSET                    *((volatile uint32_t*)(0x42718290UL))
#define bFM4_MFS12_LIN_FCR_FSET                   *((volatile uint32_t*)(0x42718290UL))
#define bFM_MFS12_LIN_FCR_FLD                     *((volatile uint32_t*)(0x42718294UL))
#define bFM4_MFS12_LIN_FCR_FLD                    *((volatile uint32_t*)(0x42718294UL))
#define bFM_MFS12_LIN_FCR_FLST                    *((volatile uint32_t*)(0x42718298UL))
#define bFM4_MFS12_LIN_FCR_FLST                   *((volatile uint32_t*)(0x42718298UL))
#define bFM_MFS12_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x427182A0UL))
#define bFM4_MFS12_LIN_FCR_FSEL                   *((volatile uint32_t*)(0x427182A0UL))
#define bFM_MFS12_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x427182A4UL))
#define bFM4_MFS12_LIN_FCR_FTIE                   *((volatile uint32_t*)(0x427182A4UL))
#define bFM_MFS12_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x427182A8UL))
#define bFM4_MFS12_LIN_FCR_FDRQ                   *((volatile uint32_t*)(0x427182A8UL))
#define bFM_MFS12_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x427182ACUL))
#define bFM4_MFS12_LIN_FCR_FRIIE                  *((volatile uint32_t*)(0x427182ACUL))
#define bFM_MFS12_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x427182B0UL))
#define bFM4_MFS12_LIN_FCR_FLSTE                  *((volatile uint32_t*)(0x427182B0UL))

#define bFM_MFS12_LIN_SCR_TXE                     *((volatile uint32_t*)(0x42718020UL))
#define bFM4_MFS12_LIN_SCR_TXE                    *((volatile uint32_t*)(0x42718020UL))
#define bFM_MFS12_LIN_SCR_RXE                     *((volatile uint32_t*)(0x42718024UL))
#define bFM4_MFS12_LIN_SCR_RXE                    *((volatile uint32_t*)(0x42718024UL))
#define bFM_MFS12_LIN_SCR_TBIE                    *((volatile uint32_t*)(0x42718028UL))
#define bFM4_MFS12_LIN_SCR_TBIE                   *((volatile uint32_t*)(0x42718028UL))
#define bFM_MFS12_LIN_SCR_TIE                     *((volatile uint32_t*)(0x4271802CUL))
#define bFM4_MFS12_LIN_SCR_TIE                    *((volatile uint32_t*)(0x4271802CUL))
#define bFM_MFS12_LIN_SCR_RIE                     *((volatile uint32_t*)(0x42718030UL))
#define bFM4_MFS12_LIN_SCR_RIE                    *((volatile uint32_t*)(0x42718030UL))
#define bFM_MFS12_LIN_SCR_LBR                     *((volatile uint32_t*)(0x42718034UL))
#define bFM4_MFS12_LIN_SCR_LBR                    *((volatile uint32_t*)(0x42718034UL))
#define bFM_MFS12_LIN_SCR_MS                      *((volatile uint32_t*)(0x42718038UL))
#define bFM4_MFS12_LIN_SCR_MS                     *((volatile uint32_t*)(0x42718038UL))
#define bFM_MFS12_LIN_SCR_UPCL                    *((volatile uint32_t*)(0x4271803CUL))
#define bFM4_MFS12_LIN_SCR_UPCL                   *((volatile uint32_t*)(0x4271803CUL))

#define bFM_MFS12_LIN_SMR_SOE                     *((volatile uint32_t*)(0x42718000UL))
#define bFM4_MFS12_LIN_SMR_SOE                    *((volatile uint32_t*)(0x42718000UL))
#define bFM_MFS12_LIN_SMR_SBL                     *((volatile uint32_t*)(0x4271800CUL))
#define bFM4_MFS12_LIN_SMR_SBL                    *((volatile uint32_t*)(0x4271800CUL))
#define bFM_MFS12_LIN_SMR_WUCR                    *((volatile uint32_t*)(0x42718010UL))
#define bFM4_MFS12_LIN_SMR_WUCR                   *((volatile uint32_t*)(0x42718010UL))

#define bFM_MFS12_LIN_SSR_TBI                     *((volatile uint32_t*)(0x427180A0UL))
#define bFM4_MFS12_LIN_SSR_TBI                    *((volatile uint32_t*)(0x427180A0UL))
#define bFM_MFS12_LIN_SSR_TDRE                    *((volatile uint32_t*)(0x427180A4UL))
#define bFM4_MFS12_LIN_SSR_TDRE                   *((volatile uint32_t*)(0x427180A4UL))
#define bFM_MFS12_LIN_SSR_RDRF                    *((volatile uint32_t*)(0x427180A8UL))
#define bFM4_MFS12_LIN_SSR_RDRF                   *((volatile uint32_t*)(0x427180A8UL))
#define bFM_MFS12_LIN_SSR_ORE                     *((volatile uint32_t*)(0x427180ACUL))
#define bFM4_MFS12_LIN_SSR_ORE                    *((volatile uint32_t*)(0x427180ACUL))
#define bFM_MFS12_LIN_SSR_FRE                     *((volatile uint32_t*)(0x427180B0UL))
#define bFM4_MFS12_LIN_SSR_FRE                    *((volatile uint32_t*)(0x427180B0UL))
#define bFM_MFS12_LIN_SSR_LBD                     *((volatile uint32_t*)(0x427180B4UL))
#define bFM4_MFS12_LIN_SSR_LBD                    *((volatile uint32_t*)(0x427180B4UL))
#define bFM_MFS12_LIN_SSR_REC                     *((volatile uint32_t*)(0x427180BCUL))
#define bFM4_MFS12_LIN_SSR_REC                    *((volatile uint32_t*)(0x427180BCUL))

