neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS12_UART_BGR_EXT                    *((volatile uint32_t*)(0x427181BCUL))
#define bFM4_MFS12_UART_BGR_EXT                   *((volatile uint32_t*)(0x427181BCUL))

#define bFM_MFS12_UART_ESCR_P                     *((volatile uint32_t*)(0x4271808CUL))
#define bFM4_MFS12_UART_ESCR_P                    *((volatile uint32_t*)(0x4271808CUL))
#define bFM_MFS12_UART_ESCR_PEN                   *((volatile uint32_t*)(0x42718090UL))
#define bFM4_MFS12_UART_ESCR_PEN                  *((volatile uint32_t*)(0x42718090UL))
#define bFM_MFS12_UART_ESCR_INV                   *((volatile uint32_t*)(0x42718094UL))
#define bFM4_MFS12_UART_ESCR_INV                  *((volatile uint32_t*)(0x42718094UL))
#define bFM_MFS12_UART_ESCR_ESBL                  *((volatile uint32_t*)(0x42718098UL))
#define bFM4_MFS12_UART_ESCR_ESBL                 *((volatile uint32_t*)(0x42718098UL))
#define bFM_MFS12_UART_ESCR_FLWEN                 *((volatile uint32_t*)(0x4271809CUL))
#define bFM4_MFS12_UART_ESCR_FLWEN                *((volatile uint32_t*)(0x4271809CUL))

#define bFM_MFS12_UART_FCR_FE1                    *((volatile uint32_t*)(0x42718280UL))
#define bFM4_MFS12_UART_FCR_FE1                   *((volatile uint32_t*)(0x42718280UL))
#define bFM_MFS12_UART_FCR_FE2                    *((volatile uint32_t*)(0x42718284UL))
#define bFM4_MFS12_UART_FCR_FE2                   *((volatile uint32_t*)(0x42718284UL))
#define bFM_MFS12_UART_FCR_FCL1                   *((volatile uint32_t*)(0x42718288UL))
#define bFM4_MFS12_UART_FCR_FCL1                  *((volatile uint32_t*)(0x42718288UL))
#define bFM_MFS12_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4271828CUL))
#define bFM4_MFS12_UART_FCR_FCL2                  *((volatile uint32_t*)(0x4271828CUL))
#define bFM_MFS12_UART_FCR_FSET                   *((volatile uint32_t*)(0x42718290UL))
#define bFM4_MFS12_UART_FCR_FSET                  *((volatile uint32_t*)(0x42718290UL))
#define bFM_MFS12_UART_FCR_FLD                    *((volatile uint32_t*)(0x42718294UL))
#define bFM4_MFS12_UART_FCR_FLD                   *((volatile uint32_t*)(0x42718294UL))
#define bFM_MFS12_UART_FCR_FLST                   *((volatile uint32_t*)(0x42718298UL))
#define bFM4_MFS12_UART_FCR_FLST                  *((volatile uint32_t*)(0x42718298UL))
#define bFM_MFS12_UART_FCR_FSEL                   *((volatile uint32_t*)(0x427182A0UL))
#define bFM4_MFS12_UART_FCR_FSEL                  *((volatile uint32_t*)(0x427182A0UL))
#define bFM_MFS12_UART_FCR_FTIE                   *((volatile uint32_t*)(0x427182A4UL))
#define bFM4_MFS12_UART_FCR_FTIE                  *((volatile uint32_t*)(0x427182A4UL))
#define bFM_MFS12_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x427182A8UL))
#define bFM4_MFS12_UART_FCR_FDRQ                  *((volatile uint32_t*)(0x427182A8UL))
#define bFM_MFS12_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x427182ACUL))
#define bFM4_MFS12_UART_FCR_FRIIE                 *((volatile uint32_t*)(0x427182ACUL))
#define bFM_MFS12_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x427182B0UL))
#define bFM4_MFS12_UART_FCR_FLSTE                 *((volatile uint32_t*)(0x427182B0UL))

#define bFM_MFS12_UART_SCR_TXE                    *((volatile uint32_t*)(0x42718020UL))
#define bFM4_MFS12_UART_SCR_TXE                   *((volatile uint32_t*)(0x42718020UL))
#define bFM_MFS12_UART_SCR_RXE                    *((volatile uint32_t*)(0x42718024UL))
#define bFM4_MFS12_UART_SCR_RXE                   *((volatile uint32_t*)(0x42718024UL))
#define bFM_MFS12_UART_SCR_TBIE                   *((volatile uint32_t*)(0x42718028UL))
#define bFM4_MFS12_UART_SCR_TBIE                  *((volatile uint32_t*)(0x42718028UL))
#define bFM_MFS12_UART_SCR_TIE                    *((volatile uint32_t*)(0x4271802CUL))
#define bFM4_MFS12_UART_SCR_TIE                   *((volatile uint32_t*)(0x4271802CUL))
#define bFM_MFS12_UART_SCR_RIE                    *((volatile uint32_t*)(0x42718030UL))
#define bFM4_MFS12_UART_SCR_RIE                   *((volatile uint32_t*)(0x42718030UL))
#define bFM_MFS12_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4271803CUL))
#define bFM4_MFS12_UART_SCR_UPCL                  *((volatile uint32_t*)(0x4271803CUL))

#define bFM_MFS12_UART_SMR_SOE                    *((volatile uint32_t*)(0x42718000UL))
#define bFM4_MFS12_UART_SMR_SOE                   *((volatile uint32_t*)(0x42718000UL))
#define bFM_MFS12_UART_SMR_BDS                    *((volatile uint32_t*)(0x42718008UL))
#define bFM4_MFS12_UART_SMR_BDS                   *((volatile uint32_t*)(0x42718008UL))
#define bFM_MFS12_UART_SMR_SBL                    *((volatile uint32_t*)(0x4271800CUL))
#define bFM4_MFS12_UART_SMR_SBL                   *((volatile uint32_t*)(0x4271800CUL))

#define bFM_MFS12_UART_SSR_TBI                    *((volatile uint32_t*)(0x427180A0UL))
#define bFM4_MFS12_UART_SSR_TBI                   *((volatile uint32_t*)(0x427180A0UL))
#define bFM_MFS12_UART_SSR_TDRE                   *((volatile uint32_t*)(0x427180A4UL))
#define bFM4_MFS12_UART_SSR_TDRE                  *((volatile uint32_t*)(0x427180A4UL))
#define bFM_MFS12_UART_SSR_RDRF                   *((volatile uint32_t*)(0x427180A8UL))
#define bFM4_MFS12_UART_SSR_RDRF                  *((volatile uint32_t*)(0x427180A8UL))
#define bFM_MFS12_UART_SSR_ORE                    *((volatile uint32_t*)(0x427180ACUL))
#define bFM4_MFS12_UART_SSR_ORE                   *((volatile uint32_t*)(0x427180ACUL))
#define bFM_MFS12_UART_SSR_FRE                    *((volatile uint32_t*)(0x427180B0UL))
#define bFM4_MFS12_UART_SSR_FRE                   *((volatile uint32_t*)(0x427180B0UL))
#define bFM_MFS12_UART_SSR_PE                     *((volatile uint32_t*)(0x427180B4UL))
#define bFM4_MFS12_UART_SSR_PE                    *((volatile uint32_t*)(0x427180B4UL))
#define bFM_MFS12_UART_SSR_REC                    *((volatile uint32_t*)(0x427180BCUL))
#define bFM4_MFS12_UART_SSR_REC                   *((volatile uint32_t*)(0x427180BCUL))


/******************************************************************************
 ** MFS Registers MFS13
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS13_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x4271A094UL))
#define bFM4_MFS13_CSIO_ESCR_CSFE                 *((volatile uint32_t*)(0x4271A094UL))
#define bFM_MFS13_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x4271A098UL))
#define bFM4_MFS13_CSIO_ESCR_L3                   *((volatile uint32_t*)(0x4271A098UL))
#define bFM_MFS13_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4271A09CUL))
#define bFM4_MFS13_CSIO_ESCR_SOP                  *((volatile uint32_t*)(0x4271A09CUL))

#define bFM_MFS13_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x4271A280UL))
#define bFM4_MFS13_CSIO_FCR_FE1                   *((volatile uint32_t*)(0x4271A280UL))
#define bFM_MFS13_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x4271A284UL))
#define bFM4_MFS13_CSIO_FCR_FE2                   *((volatile uint32_t*)(0x4271A284UL))
#define bFM_MFS13_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x4271A288UL))
#define bFM4_MFS13_CSIO_FCR_FCL1                  *((volatile uint32_t*)(0x4271A288UL))
#define bFM_MFS13_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4271A28CUL))
#define bFM4_MFS13_CSIO_FCR_FCL2                  *((volatile uint32_t*)(0x4271A28CUL))
#define bFM_MFS13_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x4271A290UL))
#define bFM4_MFS13_CSIO_FCR_FSET                  *((volatile uint32_t*)(0x4271A290UL))
#define bFM_MFS13_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x4271A294UL))
#define bFM4_MFS13_CSIO_FCR_FLD                   *((volatile uint32_t*)(0x4271A294UL))
#define bFM_MFS13_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x4271A298UL))
#define bFM4_MFS13_CSIO_FCR_FLST                  *((volatile uint32_t*)(0x4271A298UL))
#define bFM_MFS13_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x4271A2A0UL))
#define bFM4_MFS13_CSIO_FCR_FSEL                  *((volatile uint32_t*)(0x4271A2A0UL))
#define bFM_MFS13_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x4271A2A4UL))
#define bFM4_MFS13_CSIO_FCR_FTIE                  *((volatile uint32_t*)(0x4271A2A4UL))
#define bFM_MFS13_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x4271A2A8UL))
#define bFM4_MFS13_CSIO_FCR_FDRQ                  *((volatile uint32_t*)(0x4271A2A8UL))
#define bFM_MFS13_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x4271A2ACUL))
#define bFM4_MFS13_CSIO_FCR_FRIIE                 *((volatile uint32_t*)(0x4271A2ACUL))
#define bFM_MFS13_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x4271A2B0UL))
#define bFM4_MFS13_CSIO_FCR_FLSTE                 *((volatile uint32_t*)(0x4271A2B0UL))

#define bFM_MFS13_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x4271A480UL))
#define bFM4_MFS13_CSIO_SACSR_TMRE                *((volatile uint32_t*)(0x4271A480UL))
#define bFM_MFS13_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x4271A498UL))
#define bFM4_MFS13_CSIO_SACSR_TSYNE               *((volatile uint32_t*)(0x4271A498UL))
#define bFM_MFS13_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4271A49CUL))
#define bFM4_MFS13_CSIO_SACSR_TINTE               *((volatile uint32_t*)(0x4271A49CUL))
#define bFM_MFS13_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x4271A4A0UL))
#define bFM4_MFS13_CSIO_SACSR_TINT                *((volatile uint32_t*)(0x4271A4A0UL))
#define bFM_MFS13_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x4271A4ACUL))
#define bFM4_MFS13_CSIO_SACSR_CSE                 *((volatile uint32_t*)(0x4271A4ACUL))
#define bFM_MFS13_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x4271A4B0UL))
#define bFM4_MFS13_CSIO_SACSR_CSEIE               *((volatile uint32_t*)(0x4271A4B0UL))
#define bFM_MFS13_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x4271A4B4UL))
#define bFM4_MFS13_CSIO_SACSR_TBEEN               *((volatile uint32_t*)(0x4271A4B4UL))

#define bFM_MFS13_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x4271A020UL))
#define bFM4_MFS13_CSIO_SCR_TXE                   *((volatile uint32_t*)(0x4271A020UL))
#define bFM_MFS13_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x4271A024UL))
#define bFM4_MFS13_CSIO_SCR_RXE                   *((volatile uint32_t*)(0x4271A024UL))
#define bFM_MFS13_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x4271A028UL))
#define bFM4_MFS13_CSIO_SCR_TBIE                  *((volatile uint32_t*)(0x4271A028UL))
#define bFM_MFS13_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4271A02CUL))
#define bFM4_MFS13_CSIO_SCR_TIE                   *((volatile uint32_t*)(0x4271A02CUL))
#define bFM_MFS13_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x4271A030UL))
#define bFM4_MFS13_CSIO_SCR_RIE                   *((volatile uint32_t*)(0x4271A030UL))
#define bFM_MFS13_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x4271A034UL))
#define bFM4_MFS13_CSIO_SCR_SPI                   *((volatile uint32_t*)(0x4271A034UL))
#define bFM_MFS13_CSIO_SCR_MS                     *((volatile uint32_t*)(0x4271A038UL))
#define bFM4_MFS13_CSIO_SCR_MS                    *((volatile uint32_t*)(0x4271A038UL))
#define bFM_MFS13_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4271A03CUL))
#define bFM4_MFS13_CSIO_SCR_UPCL                  *((volatile uint32_t*)(0x4271A03CUL))

#define bFM_MFS13_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x4271A600UL))
#define bFM4_MFS13_CSIO_SCSCR_CSOE                *((volatile uint32_t*)(0x4271A600UL))
#define bFM_MFS13_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x4271A604UL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN0               *((volatile uint32_t*)(0x4271A604UL))
#define bFM_MFS13_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x4271A608UL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN1               *((volatile uint32_t*)(0x4271A608UL))
#define bFM_MFS13_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4271A60CUL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN2               *((volatile uint32_t*)(0x4271A60CUL))
#define bFM_MFS13_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x4271A610UL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN3               *((volatile uint32_t*)(0x4271A610UL))
#define bFM_MFS13_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x4271A614UL))
#define bFM4_MFS13_CSIO_SCSCR_CSLVL               *((volatile uint32_t*)(0x4271A614UL))
#define bFM_MFS13_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x4271A624UL))
#define bFM4_MFS13_CSIO_SCSCR_SCAM                *((volatile uint32_t*)(0x4271A624UL))

#define bFM_MFS13_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x4271A694UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1SPI             *((volatile uint32_t*)(0x4271A694UL))
#define bFM_MFS13_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x4271A698UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1SCINV           *((volatile uint32_t*)(0x4271A698UL))
#define bFM_MFS13_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4271A69CUL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1CSLVL           *((volatile uint32_t*)(0x4271A69CUL))

#define bFM_MFS13_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x4271A6B4UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2SPI             *((volatile uint32_t*)(0x4271A6B4UL))
#define bFM_MFS13_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x4271A6B8UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2SCINV           *((volatile uint32_t*)(0x4271A6B8UL))
#define bFM_MFS13_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x4271A6BCUL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2CSLVL           *((volatile uint32_t*)(0x4271A6BCUL))

#define bFM_MFS13_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x4271A714UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3SPI             *((volatile uint32_t*)(0x4271A714UL))
#define bFM_MFS13_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x4271A718UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3SCINV           *((volatile uint32_t*)(0x4271A718UL))
#define bFM_MFS13_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4271A71CUL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3CSLVL           *((volatile uint32_t*)(0x4271A71CUL))

#define bFM_MFS13_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x4271A000UL))
#define bFM4_MFS13_CSIO_SMR_SOE                   *((volatile uint32_t*)(0x4271A000UL))
#define bFM_MFS13_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x4271A004UL))
#define bFM4_MFS13_CSIO_SMR_SCKE                  *((volatile uint32_t*)(0x4271A004UL))
#define bFM_MFS13_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x4271A008UL))
#define bFM4_MFS13_CSIO_SMR_BDS                   *((volatile uint32_t*)(0x4271A008UL))
#define bFM_MFS13_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4271A00CUL))
#define bFM4_MFS13_CSIO_SMR_SCINV                 *((volatile uint32_t*)(0x4271A00CUL))

