neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS13_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x4271A0A0UL))
#define bFM4_MFS13_CSIO_SSR_TBI                   *((volatile uint32_t*)(0x4271A0A0UL))
#define bFM_MFS13_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x4271A0A4UL))
#define bFM4_MFS13_CSIO_SSR_TDRE                  *((volatile uint32_t*)(0x4271A0A4UL))
#define bFM_MFS13_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x4271A0A8UL))
#define bFM4_MFS13_CSIO_SSR_RDRF                  *((volatile uint32_t*)(0x4271A0A8UL))
#define bFM_MFS13_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x4271A0ACUL))
#define bFM4_MFS13_CSIO_SSR_ORE                   *((volatile uint32_t*)(0x4271A0ACUL))
#define bFM_MFS13_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x4271A0B0UL))
#define bFM4_MFS13_CSIO_SSR_AWC                   *((volatile uint32_t*)(0x4271A0B0UL))
#define bFM_MFS13_CSIO_SSR_REC                    *((volatile uint32_t*)(0x4271A0BCUL))
#define bFM4_MFS13_CSIO_SSR_REC                   *((volatile uint32_t*)(0x4271A0BCUL))

#define bFM_MFS13_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x4271A3A0UL))
#define bFM4_MFS13_I2C_EIBCR_BEC                  *((volatile uint32_t*)(0x4271A3A0UL))
#define bFM_MFS13_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x4271A3A4UL))
#define bFM4_MFS13_I2C_EIBCR_SOCE                 *((volatile uint32_t*)(0x4271A3A4UL))
#define bFM_MFS13_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x4271A3A8UL))
#define bFM4_MFS13_I2C_EIBCR_SCLC                 *((volatile uint32_t*)(0x4271A3A8UL))
#define bFM_MFS13_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x4271A3ACUL))
#define bFM4_MFS13_I2C_EIBCR_SDAC                 *((volatile uint32_t*)(0x4271A3ACUL))
#define bFM_MFS13_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x4271A3B0UL))
#define bFM4_MFS13_I2C_EIBCR_SCLS                 *((volatile uint32_t*)(0x4271A3B0UL))
#define bFM_MFS13_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x4271A3B4UL))
#define bFM4_MFS13_I2C_EIBCR_SDAS                 *((volatile uint32_t*)(0x4271A3B4UL))

#define bFM_MFS13_I2C_FCR_FE1                     *((volatile uint32_t*)(0x4271A280UL))
#define bFM4_MFS13_I2C_FCR_FE1                    *((volatile uint32_t*)(0x4271A280UL))
#define bFM_MFS13_I2C_FCR_FE2                     *((volatile uint32_t*)(0x4271A284UL))
#define bFM4_MFS13_I2C_FCR_FE2                    *((volatile uint32_t*)(0x4271A284UL))
#define bFM_MFS13_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x4271A288UL))
#define bFM4_MFS13_I2C_FCR_FCL1                   *((volatile uint32_t*)(0x4271A288UL))
#define bFM_MFS13_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4271A28CUL))
#define bFM4_MFS13_I2C_FCR_FCL2                   *((volatile uint32_t*)(0x4271A28CUL))
#define bFM_MFS13_I2C_FCR_FSET                    *((volatile uint32_t*)(0x4271A290UL))
#define bFM4_MFS13_I2C_FCR_FSET                   *((volatile uint32_t*)(0x4271A290UL))
#define bFM_MFS13_I2C_FCR_FLD                     *((volatile uint32_t*)(0x4271A294UL))
#define bFM4_MFS13_I2C_FCR_FLD                    *((volatile uint32_t*)(0x4271A294UL))
#define bFM_MFS13_I2C_FCR_FLST                    *((volatile uint32_t*)(0x4271A298UL))
#define bFM4_MFS13_I2C_FCR_FLST                   *((volatile uint32_t*)(0x4271A298UL))
#define bFM_MFS13_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x4271A2A0UL))
#define bFM4_MFS13_I2C_FCR_FSEL                   *((volatile uint32_t*)(0x4271A2A0UL))
#define bFM_MFS13_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x4271A2A4UL))
#define bFM4_MFS13_I2C_FCR_FTIE                   *((volatile uint32_t*)(0x4271A2A4UL))
#define bFM_MFS13_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x4271A2A8UL))
#define bFM4_MFS13_I2C_FCR_FDRQ                   *((volatile uint32_t*)(0x4271A2A8UL))
#define bFM_MFS13_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x4271A2ACUL))
#define bFM4_MFS13_I2C_FCR_FRIIE                  *((volatile uint32_t*)(0x4271A2ACUL))
#define bFM_MFS13_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x4271A2B0UL))
#define bFM4_MFS13_I2C_FCR_FLSTE                  *((volatile uint32_t*)(0x4271A2B0UL))

#define bFM_MFS13_I2C_IBCR_INT                    *((volatile uint32_t*)(0x4271A020UL))
#define bFM4_MFS13_I2C_IBCR_INT                   *((volatile uint32_t*)(0x4271A020UL))
#define bFM_MFS13_I2C_IBCR_BER                    *((volatile uint32_t*)(0x4271A024UL))
#define bFM4_MFS13_I2C_IBCR_BER                   *((volatile uint32_t*)(0x4271A024UL))
#define bFM_MFS13_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x4271A028UL))
#define bFM4_MFS13_I2C_IBCR_INTE                  *((volatile uint32_t*)(0x4271A028UL))
#define bFM_MFS13_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4271A02CUL))
#define bFM4_MFS13_I2C_IBCR_CNDE                  *((volatile uint32_t*)(0x4271A02CUL))
#define bFM_MFS13_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x4271A030UL))
#define bFM4_MFS13_I2C_IBCR_WSEL                  *((volatile uint32_t*)(0x4271A030UL))
#define bFM_MFS13_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x4271A034UL))
#define bFM4_MFS13_I2C_IBCR_ACKE                  *((volatile uint32_t*)(0x4271A034UL))
#define bFM_MFS13_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x4271A038UL))
#define bFM4_MFS13_I2C_IBCR_ACT_SCC               *((volatile uint32_t*)(0x4271A038UL))
#define bFM_MFS13_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4271A03CUL))
#define bFM4_MFS13_I2C_IBCR_MSS                   *((volatile uint32_t*)(0x4271A03CUL))

#define bFM_MFS13_I2C_IBSR_BB                     *((volatile uint32_t*)(0x4271A080UL))
#define bFM4_MFS13_I2C_IBSR_BB                    *((volatile uint32_t*)(0x4271A080UL))
#define bFM_MFS13_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x4271A084UL))
#define bFM4_MFS13_I2C_IBSR_SPC                   *((volatile uint32_t*)(0x4271A084UL))
#define bFM_MFS13_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x4271A088UL))
#define bFM4_MFS13_I2C_IBSR_RSC                   *((volatile uint32_t*)(0x4271A088UL))
#define bFM_MFS13_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4271A08CUL))
#define bFM4_MFS13_I2C_IBSR_AL                    *((volatile uint32_t*)(0x4271A08CUL))
#define bFM_MFS13_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x4271A090UL))
#define bFM4_MFS13_I2C_IBSR_TRX                   *((volatile uint32_t*)(0x4271A090UL))
#define bFM_MFS13_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x4271A094UL))
#define bFM4_MFS13_I2C_IBSR_RSA                   *((volatile uint32_t*)(0x4271A094UL))
#define bFM_MFS13_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x4271A098UL))
#define bFM4_MFS13_I2C_IBSR_RACK                  *((volatile uint32_t*)(0x4271A098UL))
#define bFM_MFS13_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4271A09CUL))
#define bFM4_MFS13_I2C_IBSR_FBT                   *((volatile uint32_t*)(0x4271A09CUL))

#define bFM_MFS13_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4271A21CUL))
#define bFM4_MFS13_I2C_ISBA_SAEN                  *((volatile uint32_t*)(0x4271A21CUL))

#define bFM_MFS13_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4271A23CUL))
#define bFM4_MFS13_I2C_ISMK_EN                    *((volatile uint32_t*)(0x4271A23CUL))

#define bFM_MFS13_I2C_SMR_TIE                     *((volatile uint32_t*)(0x4271A008UL))
#define bFM4_MFS13_I2C_SMR_TIE                    *((volatile uint32_t*)(0x4271A008UL))
#define bFM_MFS13_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4271A00CUL))
#define bFM4_MFS13_I2C_SMR_RIE                    *((volatile uint32_t*)(0x4271A00CUL))

#define bFM_MFS13_I2C_SSR_TBI                     *((volatile uint32_t*)(0x4271A0A0UL))
#define bFM4_MFS13_I2C_SSR_TBI                    *((volatile uint32_t*)(0x4271A0A0UL))
#define bFM_MFS13_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x4271A0A4UL))
#define bFM4_MFS13_I2C_SSR_TDRE                   *((volatile uint32_t*)(0x4271A0A4UL))
#define bFM_MFS13_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x4271A0A8UL))
#define bFM4_MFS13_I2C_SSR_RDRF                   *((volatile uint32_t*)(0x4271A0A8UL))
#define bFM_MFS13_I2C_SSR_ORE                     *((volatile uint32_t*)(0x4271A0ACUL))
#define bFM4_MFS13_I2C_SSR_ORE                    *((volatile uint32_t*)(0x4271A0ACUL))
#define bFM_MFS13_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x4271A0B0UL))
#define bFM4_MFS13_I2C_SSR_TBIE                   *((volatile uint32_t*)(0x4271A0B0UL))
#define bFM_MFS13_I2C_SSR_DMA                     *((volatile uint32_t*)(0x4271A0B4UL))
#define bFM4_MFS13_I2C_SSR_DMA                    *((volatile uint32_t*)(0x4271A0B4UL))
#define bFM_MFS13_I2C_SSR_TSET                    *((volatile uint32_t*)(0x4271A0B8UL))
#define bFM4_MFS13_I2C_SSR_TSET                   *((volatile uint32_t*)(0x4271A0B8UL))
#define bFM_MFS13_I2C_SSR_REC                     *((volatile uint32_t*)(0x4271A0BCUL))
#define bFM4_MFS13_I2C_SSR_REC                    *((volatile uint32_t*)(0x4271A0BCUL))

