neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS13_LIN_BGR_EXT                     *((volatile uint32_t*)(0x4271A1BCUL))
#define bFM4_MFS13_LIN_BGR_EXT                    *((volatile uint32_t*)(0x4271A1BCUL))

#define bFM_MFS13_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x4271A090UL))
#define bFM4_MFS13_LIN_ESCR_LBIE                  *((volatile uint32_t*)(0x4271A090UL))
#define bFM_MFS13_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x4271A098UL))
#define bFM4_MFS13_LIN_ESCR_ESBL                  *((volatile uint32_t*)(0x4271A098UL))

#define bFM_MFS13_LIN_FCR_FE1                     *((volatile uint32_t*)(0x4271A280UL))
#define bFM4_MFS13_LIN_FCR_FE1                    *((volatile uint32_t*)(0x4271A280UL))
#define bFM_MFS13_LIN_FCR_FE2                     *((volatile uint32_t*)(0x4271A284UL))
#define bFM4_MFS13_LIN_FCR_FE2                    *((volatile uint32_t*)(0x4271A284UL))
#define bFM_MFS13_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x4271A288UL))
#define bFM4_MFS13_LIN_FCR_FCL1                   *((volatile uint32_t*)(0x4271A288UL))
#define bFM_MFS13_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4271A28CUL))
#define bFM4_MFS13_LIN_FCR_FCL2                   *((volatile uint32_t*)(0x4271A28CUL))
#define bFM_MFS13_LIN_FCR_FSET                    *((volatile uint32_t*)(0x4271A290UL))
#define bFM4_MFS13_LIN_FCR_FSET                   *((volatile uint32_t*)(0x4271A290UL))
#define bFM_MFS13_LIN_FCR_FLD                     *((volatile uint32_t*)(0x4271A294UL))
#define bFM4_MFS13_LIN_FCR_FLD                    *((volatile uint32_t*)(0x4271A294UL))
#define bFM_MFS13_LIN_FCR_FLST                    *((volatile uint32_t*)(0x4271A298UL))
#define bFM4_MFS13_LIN_FCR_FLST                   *((volatile uint32_t*)(0x4271A298UL))
#define bFM_MFS13_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x4271A2A0UL))
#define bFM4_MFS13_LIN_FCR_FSEL                   *((volatile uint32_t*)(0x4271A2A0UL))
#define bFM_MFS13_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x4271A2A4UL))
#define bFM4_MFS13_LIN_FCR_FTIE                   *((volatile uint32_t*)(0x4271A2A4UL))
#define bFM_MFS13_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x4271A2A8UL))
#define bFM4_MFS13_LIN_FCR_FDRQ                   *((volatile uint32_t*)(0x4271A2A8UL))
#define bFM_MFS13_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x4271A2ACUL))
#define bFM4_MFS13_LIN_FCR_FRIIE                  *((volatile uint32_t*)(0x4271A2ACUL))
#define bFM_MFS13_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x4271A2B0UL))
#define bFM4_MFS13_LIN_FCR_FLSTE                  *((volatile uint32_t*)(0x4271A2B0UL))

#define bFM_MFS13_LIN_SCR_TXE                     *((volatile uint32_t*)(0x4271A020UL))
#define bFM4_MFS13_LIN_SCR_TXE                    *((volatile uint32_t*)(0x4271A020UL))
#define bFM_MFS13_LIN_SCR_RXE                     *((volatile uint32_t*)(0x4271A024UL))
#define bFM4_MFS13_LIN_SCR_RXE                    *((volatile uint32_t*)(0x4271A024UL))
#define bFM_MFS13_LIN_SCR_TBIE                    *((volatile uint32_t*)(0x4271A028UL))
#define bFM4_MFS13_LIN_SCR_TBIE                   *((volatile uint32_t*)(0x4271A028UL))
#define bFM_MFS13_LIN_SCR_TIE                     *((volatile uint32_t*)(0x4271A02CUL))
#define bFM4_MFS13_LIN_SCR_TIE                    *((volatile uint32_t*)(0x4271A02CUL))
#define bFM_MFS13_LIN_SCR_RIE                     *((volatile uint32_t*)(0x4271A030UL))
#define bFM4_MFS13_LIN_SCR_RIE                    *((volatile uint32_t*)(0x4271A030UL))
#define bFM_MFS13_LIN_SCR_LBR                     *((volatile uint32_t*)(0x4271A034UL))
#define bFM4_MFS13_LIN_SCR_LBR                    *((volatile uint32_t*)(0x4271A034UL))
#define bFM_MFS13_LIN_SCR_MS                      *((volatile uint32_t*)(0x4271A038UL))
#define bFM4_MFS13_LIN_SCR_MS                     *((volatile uint32_t*)(0x4271A038UL))
#define bFM_MFS13_LIN_SCR_UPCL                    *((volatile uint32_t*)(0x4271A03CUL))
#define bFM4_MFS13_LIN_SCR_UPCL                   *((volatile uint32_t*)(0x4271A03CUL))

#define bFM_MFS13_LIN_SMR_SOE                     *((volatile uint32_t*)(0x4271A000UL))
#define bFM4_MFS13_LIN_SMR_SOE                    *((volatile uint32_t*)(0x4271A000UL))
#define bFM_MFS13_LIN_SMR_SBL                     *((volatile uint32_t*)(0x4271A00CUL))
#define bFM4_MFS13_LIN_SMR_SBL                    *((volatile uint32_t*)(0x4271A00CUL))
#define bFM_MFS13_LIN_SMR_WUCR                    *((volatile uint32_t*)(0x4271A010UL))
#define bFM4_MFS13_LIN_SMR_WUCR                   *((volatile uint32_t*)(0x4271A010UL))

#define bFM_MFS13_LIN_SSR_TBI                     *((volatile uint32_t*)(0x4271A0A0UL))
#define bFM4_MFS13_LIN_SSR_TBI                    *((volatile uint32_t*)(0x4271A0A0UL))
#define bFM_MFS13_LIN_SSR_TDRE                    *((volatile uint32_t*)(0x4271A0A4UL))
#define bFM4_MFS13_LIN_SSR_TDRE                   *((volatile uint32_t*)(0x4271A0A4UL))
#define bFM_MFS13_LIN_SSR_RDRF                    *((volatile uint32_t*)(0x4271A0A8UL))
#define bFM4_MFS13_LIN_SSR_RDRF                   *((volatile uint32_t*)(0x4271A0A8UL))
#define bFM_MFS13_LIN_SSR_ORE                     *((volatile uint32_t*)(0x4271A0ACUL))
#define bFM4_MFS13_LIN_SSR_ORE                    *((volatile uint32_t*)(0x4271A0ACUL))
#define bFM_MFS13_LIN_SSR_FRE                     *((volatile uint32_t*)(0x4271A0B0UL))
#define bFM4_MFS13_LIN_SSR_FRE                    *((volatile uint32_t*)(0x4271A0B0UL))
#define bFM_MFS13_LIN_SSR_LBD                     *((volatile uint32_t*)(0x4271A0B4UL))
#define bFM4_MFS13_LIN_SSR_LBD                    *((volatile uint32_t*)(0x4271A0B4UL))
#define bFM_MFS13_LIN_SSR_REC                     *((volatile uint32_t*)(0x4271A0BCUL))
#define bFM4_MFS13_LIN_SSR_REC                    *((volatile uint32_t*)(0x4271A0BCUL))

#define bFM_MFS13_UART_BGR_EXT                    *((volatile uint32_t*)(0x4271A1BCUL))
#define bFM4_MFS13_UART_BGR_EXT                   *((volatile uint32_t*)(0x4271A1BCUL))

#define bFM_MFS13_UART_ESCR_P                     *((volatile uint32_t*)(0x4271A08CUL))
#define bFM4_MFS13_UART_ESCR_P                    *((volatile uint32_t*)(0x4271A08CUL))
#define bFM_MFS13_UART_ESCR_PEN                   *((volatile uint32_t*)(0x4271A090UL))
#define bFM4_MFS13_UART_ESCR_PEN                  *((volatile uint32_t*)(0x4271A090UL))
#define bFM_MFS13_UART_ESCR_INV                   *((volatile uint32_t*)(0x4271A094UL))
#define bFM4_MFS13_UART_ESCR_INV                  *((volatile uint32_t*)(0x4271A094UL))
#define bFM_MFS13_UART_ESCR_ESBL                  *((volatile uint32_t*)(0x4271A098UL))
#define bFM4_MFS13_UART_ESCR_ESBL                 *((volatile uint32_t*)(0x4271A098UL))
#define bFM_MFS13_UART_ESCR_FLWEN                 *((volatile uint32_t*)(0x4271A09CUL))
#define bFM4_MFS13_UART_ESCR_FLWEN                *((volatile uint32_t*)(0x4271A09CUL))

