neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS13_UART_FCR_FE1                    *((volatile uint32_t*)(0x4271A280UL))
#define bFM4_MFS13_UART_FCR_FE1                   *((volatile uint32_t*)(0x4271A280UL))
#define bFM_MFS13_UART_FCR_FE2                    *((volatile uint32_t*)(0x4271A284UL))
#define bFM4_MFS13_UART_FCR_FE2                   *((volatile uint32_t*)(0x4271A284UL))
#define bFM_MFS13_UART_FCR_FCL1                   *((volatile uint32_t*)(0x4271A288UL))
#define bFM4_MFS13_UART_FCR_FCL1                  *((volatile uint32_t*)(0x4271A288UL))
#define bFM_MFS13_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4271A28CUL))
#define bFM4_MFS13_UART_FCR_FCL2                  *((volatile uint32_t*)(0x4271A28CUL))
#define bFM_MFS13_UART_FCR_FSET                   *((volatile uint32_t*)(0x4271A290UL))
#define bFM4_MFS13_UART_FCR_FSET                  *((volatile uint32_t*)(0x4271A290UL))
#define bFM_MFS13_UART_FCR_FLD                    *((volatile uint32_t*)(0x4271A294UL))
#define bFM4_MFS13_UART_FCR_FLD                   *((volatile uint32_t*)(0x4271A294UL))
#define bFM_MFS13_UART_FCR_FLST                   *((volatile uint32_t*)(0x4271A298UL))
#define bFM4_MFS13_UART_FCR_FLST                  *((volatile uint32_t*)(0x4271A298UL))
#define bFM_MFS13_UART_FCR_FSEL                   *((volatile uint32_t*)(0x4271A2A0UL))
#define bFM4_MFS13_UART_FCR_FSEL                  *((volatile uint32_t*)(0x4271A2A0UL))
#define bFM_MFS13_UART_FCR_FTIE                   *((volatile uint32_t*)(0x4271A2A4UL))
#define bFM4_MFS13_UART_FCR_FTIE                  *((volatile uint32_t*)(0x4271A2A4UL))
#define bFM_MFS13_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x4271A2A8UL))
#define bFM4_MFS13_UART_FCR_FDRQ                  *((volatile uint32_t*)(0x4271A2A8UL))
#define bFM_MFS13_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x4271A2ACUL))
#define bFM4_MFS13_UART_FCR_FRIIE                 *((volatile uint32_t*)(0x4271A2ACUL))
#define bFM_MFS13_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x4271A2B0UL))
#define bFM4_MFS13_UART_FCR_FLSTE                 *((volatile uint32_t*)(0x4271A2B0UL))

#define bFM_MFS13_UART_SCR_TXE                    *((volatile uint32_t*)(0x4271A020UL))
#define bFM4_MFS13_UART_SCR_TXE                   *((volatile uint32_t*)(0x4271A020UL))
#define bFM_MFS13_UART_SCR_RXE                    *((volatile uint32_t*)(0x4271A024UL))
#define bFM4_MFS13_UART_SCR_RXE                   *((volatile uint32_t*)(0x4271A024UL))
#define bFM_MFS13_UART_SCR_TBIE                   *((volatile uint32_t*)(0x4271A028UL))
#define bFM4_MFS13_UART_SCR_TBIE                  *((volatile uint32_t*)(0x4271A028UL))
#define bFM_MFS13_UART_SCR_TIE                    *((volatile uint32_t*)(0x4271A02CUL))
#define bFM4_MFS13_UART_SCR_TIE                   *((volatile uint32_t*)(0x4271A02CUL))
#define bFM_MFS13_UART_SCR_RIE                    *((volatile uint32_t*)(0x4271A030UL))
#define bFM4_MFS13_UART_SCR_RIE                   *((volatile uint32_t*)(0x4271A030UL))
#define bFM_MFS13_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4271A03CUL))
#define bFM4_MFS13_UART_SCR_UPCL                  *((volatile uint32_t*)(0x4271A03CUL))

#define bFM_MFS13_UART_SMR_SOE                    *((volatile uint32_t*)(0x4271A000UL))
#define bFM4_MFS13_UART_SMR_SOE                   *((volatile uint32_t*)(0x4271A000UL))
#define bFM_MFS13_UART_SMR_BDS                    *((volatile uint32_t*)(0x4271A008UL))
#define bFM4_MFS13_UART_SMR_BDS                   *((volatile uint32_t*)(0x4271A008UL))
#define bFM_MFS13_UART_SMR_SBL                    *((volatile uint32_t*)(0x4271A00CUL))
#define bFM4_MFS13_UART_SMR_SBL                   *((volatile uint32_t*)(0x4271A00CUL))

#define bFM_MFS13_UART_SSR_TBI                    *((volatile uint32_t*)(0x4271A0A0UL))
#define bFM4_MFS13_UART_SSR_TBI                   *((volatile uint32_t*)(0x4271A0A0UL))
#define bFM_MFS13_UART_SSR_TDRE                   *((volatile uint32_t*)(0x4271A0A4UL))
#define bFM4_MFS13_UART_SSR_TDRE                  *((volatile uint32_t*)(0x4271A0A4UL))
#define bFM_MFS13_UART_SSR_RDRF                   *((volatile uint32_t*)(0x4271A0A8UL))
#define bFM4_MFS13_UART_SSR_RDRF                  *((volatile uint32_t*)(0x4271A0A8UL))
#define bFM_MFS13_UART_SSR_ORE                    *((volatile uint32_t*)(0x4271A0ACUL))
#define bFM4_MFS13_UART_SSR_ORE                   *((volatile uint32_t*)(0x4271A0ACUL))
#define bFM_MFS13_UART_SSR_FRE                    *((volatile uint32_t*)(0x4271A0B0UL))
#define bFM4_MFS13_UART_SSR_FRE                   *((volatile uint32_t*)(0x4271A0B0UL))
#define bFM_MFS13_UART_SSR_PE                     *((volatile uint32_t*)(0x4271A0B4UL))
#define bFM4_MFS13_UART_SSR_PE                    *((volatile uint32_t*)(0x4271A0B4UL))
#define bFM_MFS13_UART_SSR_REC                    *((volatile uint32_t*)(0x4271A0BCUL))
#define bFM4_MFS13_UART_SSR_REC                   *((volatile uint32_t*)(0x4271A0BCUL))


/******************************************************************************
 ** MFS Registers MFS14
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS14_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x4271C094UL))
#define bFM4_MFS14_CSIO_ESCR_CSFE                 *((volatile uint32_t*)(0x4271C094UL))
#define bFM_MFS14_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x4271C098UL))
#define bFM4_MFS14_CSIO_ESCR_L3                   *((volatile uint32_t*)(0x4271C098UL))
#define bFM_MFS14_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4271C09CUL))
#define bFM4_MFS14_CSIO_ESCR_SOP                  *((volatile uint32_t*)(0x4271C09CUL))

#define bFM_MFS14_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x4271C280UL))
#define bFM4_MFS14_CSIO_FCR_FE1                   *((volatile uint32_t*)(0x4271C280UL))
#define bFM_MFS14_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x4271C284UL))
#define bFM4_MFS14_CSIO_FCR_FE2                   *((volatile uint32_t*)(0x4271C284UL))
#define bFM_MFS14_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x4271C288UL))
#define bFM4_MFS14_CSIO_FCR_FCL1                  *((volatile uint32_t*)(0x4271C288UL))
#define bFM_MFS14_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4271C28CUL))
#define bFM4_MFS14_CSIO_FCR_FCL2                  *((volatile uint32_t*)(0x4271C28CUL))
#define bFM_MFS14_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x4271C290UL))
#define bFM4_MFS14_CSIO_FCR_FSET                  *((volatile uint32_t*)(0x4271C290UL))
#define bFM_MFS14_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x4271C294UL))
#define bFM4_MFS14_CSIO_FCR_FLD                   *((volatile uint32_t*)(0x4271C294UL))
#define bFM_MFS14_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x4271C298UL))
#define bFM4_MFS14_CSIO_FCR_FLST                  *((volatile uint32_t*)(0x4271C298UL))
#define bFM_MFS14_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x4271C2A0UL))
#define bFM4_MFS14_CSIO_FCR_FSEL                  *((volatile uint32_t*)(0x4271C2A0UL))
#define bFM_MFS14_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x4271C2A4UL))
#define bFM4_MFS14_CSIO_FCR_FTIE                  *((volatile uint32_t*)(0x4271C2A4UL))
#define bFM_MFS14_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x4271C2A8UL))
#define bFM4_MFS14_CSIO_FCR_FDRQ                  *((volatile uint32_t*)(0x4271C2A8UL))
#define bFM_MFS14_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x4271C2ACUL))
#define bFM4_MFS14_CSIO_FCR_FRIIE                 *((volatile uint32_t*)(0x4271C2ACUL))
#define bFM_MFS14_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x4271C2B0UL))
#define bFM4_MFS14_CSIO_FCR_FLSTE                 *((volatile uint32_t*)(0x4271C2B0UL))

#define bFM_MFS14_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x4271C480UL))
#define bFM4_MFS14_CSIO_SACSR_TMRE                *((volatile uint32_t*)(0x4271C480UL))
#define bFM_MFS14_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x4271C498UL))
#define bFM4_MFS14_CSIO_SACSR_TSYNE               *((volatile uint32_t*)(0x4271C498UL))
#define bFM_MFS14_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4271C49CUL))
#define bFM4_MFS14_CSIO_SACSR_TINTE               *((volatile uint32_t*)(0x4271C49CUL))
#define bFM_MFS14_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x4271C4A0UL))
#define bFM4_MFS14_CSIO_SACSR_TINT                *((volatile uint32_t*)(0x4271C4A0UL))
#define bFM_MFS14_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x4271C4ACUL))
#define bFM4_MFS14_CSIO_SACSR_CSE                 *((volatile uint32_t*)(0x4271C4ACUL))
#define bFM_MFS14_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x4271C4B0UL))
#define bFM4_MFS14_CSIO_SACSR_CSEIE               *((volatile uint32_t*)(0x4271C4B0UL))
#define bFM_MFS14_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x4271C4B4UL))
#define bFM4_MFS14_CSIO_SACSR_TBEEN               *((volatile uint32_t*)(0x4271C4B4UL))

#define bFM_MFS14_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x4271C020UL))
#define bFM4_MFS14_CSIO_SCR_TXE                   *((volatile uint32_t*)(0x4271C020UL))
#define bFM_MFS14_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x4271C024UL))
#define bFM4_MFS14_CSIO_SCR_RXE                   *((volatile uint32_t*)(0x4271C024UL))
#define bFM_MFS14_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x4271C028UL))
#define bFM4_MFS14_CSIO_SCR_TBIE                  *((volatile uint32_t*)(0x4271C028UL))
#define bFM_MFS14_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4271C02CUL))
#define bFM4_MFS14_CSIO_SCR_TIE                   *((volatile uint32_t*)(0x4271C02CUL))
#define bFM_MFS14_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x4271C030UL))
#define bFM4_MFS14_CSIO_SCR_RIE                   *((volatile uint32_t*)(0x4271C030UL))
#define bFM_MFS14_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x4271C034UL))
#define bFM4_MFS14_CSIO_SCR_SPI                   *((volatile uint32_t*)(0x4271C034UL))
#define bFM_MFS14_CSIO_SCR_MS                     *((volatile uint32_t*)(0x4271C038UL))
#define bFM4_MFS14_CSIO_SCR_MS                    *((volatile uint32_t*)(0x4271C038UL))
#define bFM_MFS14_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4271C03CUL))
#define bFM4_MFS14_CSIO_SCR_UPCL                  *((volatile uint32_t*)(0x4271C03CUL))

#define bFM_MFS14_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x4271C600UL))
#define bFM4_MFS14_CSIO_SCSCR_CSOE                *((volatile uint32_t*)(0x4271C600UL))
#define bFM_MFS14_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x4271C604UL))
#define bFM4_MFS14_CSIO_SCSCR_CSEN0               *((volatile uint32_t*)(0x4271C604UL))
#define bFM_MFS14_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x4271C608UL))
#define bFM4_MFS14_CSIO_SCSCR_CSEN1               *((volatile uint32_t*)(0x4271C608UL))
#define bFM_MFS14_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4271C60CUL))
#define bFM4_MFS14_CSIO_SCSCR_CSEN2               *((volatile uint32_t*)(0x4271C60CUL))
#define bFM_MFS14_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x4271C610UL))
#define bFM4_MFS14_CSIO_SCSCR_CSEN3               *((volatile uint32_t*)(0x4271C610UL))
#define bFM_MFS14_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x4271C614UL))
#define bFM4_MFS14_CSIO_SCSCR_CSLVL               *((volatile uint32_t*)(0x4271C614UL))
#define bFM_MFS14_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x4271C624UL))
#define bFM4_MFS14_CSIO_SCSCR_SCAM                *((volatile uint32_t*)(0x4271C624UL))

