neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS14_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x4271C694UL))
#define bFM4_MFS14_CSIO_SCSFR0_CS1SPI             *((volatile uint32_t*)(0x4271C694UL))
#define bFM_MFS14_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x4271C698UL))
#define bFM4_MFS14_CSIO_SCSFR0_CS1SCINV           *((volatile uint32_t*)(0x4271C698UL))
#define bFM_MFS14_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4271C69CUL))
#define bFM4_MFS14_CSIO_SCSFR0_CS1CSLVL           *((volatile uint32_t*)(0x4271C69CUL))

#define bFM_MFS14_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x4271C6B4UL))
#define bFM4_MFS14_CSIO_SCSFR1_CS2SPI             *((volatile uint32_t*)(0x4271C6B4UL))
#define bFM_MFS14_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x4271C6B8UL))
#define bFM4_MFS14_CSIO_SCSFR1_CS2SCINV           *((volatile uint32_t*)(0x4271C6B8UL))
#define bFM_MFS14_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x4271C6BCUL))
#define bFM4_MFS14_CSIO_SCSFR1_CS2CSLVL           *((volatile uint32_t*)(0x4271C6BCUL))

#define bFM_MFS14_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x4271C714UL))
#define bFM4_MFS14_CSIO_SCSFR2_CS3SPI             *((volatile uint32_t*)(0x4271C714UL))
#define bFM_MFS14_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x4271C718UL))
#define bFM4_MFS14_CSIO_SCSFR2_CS3SCINV           *((volatile uint32_t*)(0x4271C718UL))
#define bFM_MFS14_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4271C71CUL))
#define bFM4_MFS14_CSIO_SCSFR2_CS3CSLVL           *((volatile uint32_t*)(0x4271C71CUL))

#define bFM_MFS14_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x4271C000UL))
#define bFM4_MFS14_CSIO_SMR_SOE                   *((volatile uint32_t*)(0x4271C000UL))
#define bFM_MFS14_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x4271C004UL))
#define bFM4_MFS14_CSIO_SMR_SCKE                  *((volatile uint32_t*)(0x4271C004UL))
#define bFM_MFS14_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x4271C008UL))
#define bFM4_MFS14_CSIO_SMR_BDS                   *((volatile uint32_t*)(0x4271C008UL))
#define bFM_MFS14_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4271C00CUL))
#define bFM4_MFS14_CSIO_SMR_SCINV                 *((volatile uint32_t*)(0x4271C00CUL))

#define bFM_MFS14_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x4271C0A0UL))
#define bFM4_MFS14_CSIO_SSR_TBI                   *((volatile uint32_t*)(0x4271C0A0UL))
#define bFM_MFS14_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x4271C0A4UL))
#define bFM4_MFS14_CSIO_SSR_TDRE                  *((volatile uint32_t*)(0x4271C0A4UL))
#define bFM_MFS14_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x4271C0A8UL))
#define bFM4_MFS14_CSIO_SSR_RDRF                  *((volatile uint32_t*)(0x4271C0A8UL))
#define bFM_MFS14_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x4271C0ACUL))
#define bFM4_MFS14_CSIO_SSR_ORE                   *((volatile uint32_t*)(0x4271C0ACUL))
#define bFM_MFS14_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x4271C0B0UL))
#define bFM4_MFS14_CSIO_SSR_AWC                   *((volatile uint32_t*)(0x4271C0B0UL))
#define bFM_MFS14_CSIO_SSR_REC                    *((volatile uint32_t*)(0x4271C0BCUL))
#define bFM4_MFS14_CSIO_SSR_REC                   *((volatile uint32_t*)(0x4271C0BCUL))

#define bFM_MFS14_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x4271C3A0UL))
#define bFM4_MFS14_I2C_EIBCR_BEC                  *((volatile uint32_t*)(0x4271C3A0UL))
#define bFM_MFS14_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x4271C3A4UL))
#define bFM4_MFS14_I2C_EIBCR_SOCE                 *((volatile uint32_t*)(0x4271C3A4UL))
#define bFM_MFS14_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x4271C3A8UL))
#define bFM4_MFS14_I2C_EIBCR_SCLC                 *((volatile uint32_t*)(0x4271C3A8UL))
#define bFM_MFS14_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x4271C3ACUL))
#define bFM4_MFS14_I2C_EIBCR_SDAC                 *((volatile uint32_t*)(0x4271C3ACUL))
#define bFM_MFS14_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x4271C3B0UL))
#define bFM4_MFS14_I2C_EIBCR_SCLS                 *((volatile uint32_t*)(0x4271C3B0UL))
#define bFM_MFS14_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x4271C3B4UL))
#define bFM4_MFS14_I2C_EIBCR_SDAS                 *((volatile uint32_t*)(0x4271C3B4UL))

#define bFM_MFS14_I2C_FCR_FE1                     *((volatile uint32_t*)(0x4271C280UL))
#define bFM4_MFS14_I2C_FCR_FE1                    *((volatile uint32_t*)(0x4271C280UL))
#define bFM_MFS14_I2C_FCR_FE2                     *((volatile uint32_t*)(0x4271C284UL))
#define bFM4_MFS14_I2C_FCR_FE2                    *((volatile uint32_t*)(0x4271C284UL))
#define bFM_MFS14_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x4271C288UL))
#define bFM4_MFS14_I2C_FCR_FCL1                   *((volatile uint32_t*)(0x4271C288UL))
#define bFM_MFS14_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4271C28CUL))
#define bFM4_MFS14_I2C_FCR_FCL2                   *((volatile uint32_t*)(0x4271C28CUL))
#define bFM_MFS14_I2C_FCR_FSET                    *((volatile uint32_t*)(0x4271C290UL))
#define bFM4_MFS14_I2C_FCR_FSET                   *((volatile uint32_t*)(0x4271C290UL))
#define bFM_MFS14_I2C_FCR_FLD                     *((volatile uint32_t*)(0x4271C294UL))
#define bFM4_MFS14_I2C_FCR_FLD                    *((volatile uint32_t*)(0x4271C294UL))
#define bFM_MFS14_I2C_FCR_FLST                    *((volatile uint32_t*)(0x4271C298UL))
#define bFM4_MFS14_I2C_FCR_FLST                   *((volatile uint32_t*)(0x4271C298UL))
#define bFM_MFS14_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x4271C2A0UL))
#define bFM4_MFS14_I2C_FCR_FSEL                   *((volatile uint32_t*)(0x4271C2A0UL))
#define bFM_MFS14_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x4271C2A4UL))
#define bFM4_MFS14_I2C_FCR_FTIE                   *((volatile uint32_t*)(0x4271C2A4UL))
#define bFM_MFS14_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x4271C2A8UL))
#define bFM4_MFS14_I2C_FCR_FDRQ                   *((volatile uint32_t*)(0x4271C2A8UL))
#define bFM_MFS14_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x4271C2ACUL))
#define bFM4_MFS14_I2C_FCR_FRIIE                  *((volatile uint32_t*)(0x4271C2ACUL))
#define bFM_MFS14_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x4271C2B0UL))
#define bFM4_MFS14_I2C_FCR_FLSTE                  *((volatile uint32_t*)(0x4271C2B0UL))

