neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS14_I2C_IBCR_INT                    *((volatile uint32_t*)(0x4271C020UL))
#define bFM4_MFS14_I2C_IBCR_INT                   *((volatile uint32_t*)(0x4271C020UL))
#define bFM_MFS14_I2C_IBCR_BER                    *((volatile uint32_t*)(0x4271C024UL))
#define bFM4_MFS14_I2C_IBCR_BER                   *((volatile uint32_t*)(0x4271C024UL))
#define bFM_MFS14_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x4271C028UL))
#define bFM4_MFS14_I2C_IBCR_INTE                  *((volatile uint32_t*)(0x4271C028UL))
#define bFM_MFS14_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4271C02CUL))
#define bFM4_MFS14_I2C_IBCR_CNDE                  *((volatile uint32_t*)(0x4271C02CUL))
#define bFM_MFS14_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x4271C030UL))
#define bFM4_MFS14_I2C_IBCR_WSEL                  *((volatile uint32_t*)(0x4271C030UL))
#define bFM_MFS14_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x4271C034UL))
#define bFM4_MFS14_I2C_IBCR_ACKE                  *((volatile uint32_t*)(0x4271C034UL))
#define bFM_MFS14_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x4271C038UL))
#define bFM4_MFS14_I2C_IBCR_ACT_SCC               *((volatile uint32_t*)(0x4271C038UL))
#define bFM_MFS14_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4271C03CUL))
#define bFM4_MFS14_I2C_IBCR_MSS                   *((volatile uint32_t*)(0x4271C03CUL))

#define bFM_MFS14_I2C_IBSR_BB                     *((volatile uint32_t*)(0x4271C080UL))
#define bFM4_MFS14_I2C_IBSR_BB                    *((volatile uint32_t*)(0x4271C080UL))
#define bFM_MFS14_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x4271C084UL))
#define bFM4_MFS14_I2C_IBSR_SPC                   *((volatile uint32_t*)(0x4271C084UL))
#define bFM_MFS14_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x4271C088UL))
#define bFM4_MFS14_I2C_IBSR_RSC                   *((volatile uint32_t*)(0x4271C088UL))
#define bFM_MFS14_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4271C08CUL))
#define bFM4_MFS14_I2C_IBSR_AL                    *((volatile uint32_t*)(0x4271C08CUL))
#define bFM_MFS14_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x4271C090UL))
#define bFM4_MFS14_I2C_IBSR_TRX                   *((volatile uint32_t*)(0x4271C090UL))
#define bFM_MFS14_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x4271C094UL))
#define bFM4_MFS14_I2C_IBSR_RSA                   *((volatile uint32_t*)(0x4271C094UL))
#define bFM_MFS14_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x4271C098UL))
#define bFM4_MFS14_I2C_IBSR_RACK                  *((volatile uint32_t*)(0x4271C098UL))
#define bFM_MFS14_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4271C09CUL))
#define bFM4_MFS14_I2C_IBSR_FBT                   *((volatile uint32_t*)(0x4271C09CUL))

#define bFM_MFS14_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4271C21CUL))
#define bFM4_MFS14_I2C_ISBA_SAEN                  *((volatile uint32_t*)(0x4271C21CUL))

#define bFM_MFS14_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4271C23CUL))
#define bFM4_MFS14_I2C_ISMK_EN                    *((volatile uint32_t*)(0x4271C23CUL))

#define bFM_MFS14_I2C_SMR_TIE                     *((volatile uint32_t*)(0x4271C008UL))
#define bFM4_MFS14_I2C_SMR_TIE                    *((volatile uint32_t*)(0x4271C008UL))
#define bFM_MFS14_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4271C00CUL))
#define bFM4_MFS14_I2C_SMR_RIE                    *((volatile uint32_t*)(0x4271C00CUL))

#define bFM_MFS14_I2C_SSR_TBI                     *((volatile uint32_t*)(0x4271C0A0UL))
#define bFM4_MFS14_I2C_SSR_TBI                    *((volatile uint32_t*)(0x4271C0A0UL))
#define bFM_MFS14_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x4271C0A4UL))
#define bFM4_MFS14_I2C_SSR_TDRE                   *((volatile uint32_t*)(0x4271C0A4UL))
#define bFM_MFS14_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x4271C0A8UL))
#define bFM4_MFS14_I2C_SSR_RDRF                   *((volatile uint32_t*)(0x4271C0A8UL))
#define bFM_MFS14_I2C_SSR_ORE                     *((volatile uint32_t*)(0x4271C0ACUL))
#define bFM4_MFS14_I2C_SSR_ORE                    *((volatile uint32_t*)(0x4271C0ACUL))
#define bFM_MFS14_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x4271C0B0UL))
#define bFM4_MFS14_I2C_SSR_TBIE                   *((volatile uint32_t*)(0x4271C0B0UL))
#define bFM_MFS14_I2C_SSR_DMA                     *((volatile uint32_t*)(0x4271C0B4UL))
#define bFM4_MFS14_I2C_SSR_DMA                    *((volatile uint32_t*)(0x4271C0B4UL))
#define bFM_MFS14_I2C_SSR_TSET                    *((volatile uint32_t*)(0x4271C0B8UL))
#define bFM4_MFS14_I2C_SSR_TSET                   *((volatile uint32_t*)(0x4271C0B8UL))
#define bFM_MFS14_I2C_SSR_REC                     *((volatile uint32_t*)(0x4271C0BCUL))
#define bFM4_MFS14_I2C_SSR_REC                    *((volatile uint32_t*)(0x4271C0BCUL))

#define bFM_MFS14_LIN_BGR_EXT                     *((volatile uint32_t*)(0x4271C1BCUL))
#define bFM4_MFS14_LIN_BGR_EXT                    *((volatile uint32_t*)(0x4271C1BCUL))

#define bFM_MFS14_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x4271C090UL))
#define bFM4_MFS14_LIN_ESCR_LBIE                  *((volatile uint32_t*)(0x4271C090UL))
#define bFM_MFS14_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x4271C098UL))
#define bFM4_MFS14_LIN_ESCR_ESBL                  *((volatile uint32_t*)(0x4271C098UL))

#define bFM_MFS14_LIN_FCR_FE1                     *((volatile uint32_t*)(0x4271C280UL))
#define bFM4_MFS14_LIN_FCR_FE1                    *((volatile uint32_t*)(0x4271C280UL))
#define bFM_MFS14_LIN_FCR_FE2                     *((volatile uint32_t*)(0x4271C284UL))
#define bFM4_MFS14_LIN_FCR_FE2                    *((volatile uint32_t*)(0x4271C284UL))
#define bFM_MFS14_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x4271C288UL))
#define bFM4_MFS14_LIN_FCR_FCL1                   *((volatile uint32_t*)(0x4271C288UL))
#define bFM_MFS14_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4271C28CUL))
#define bFM4_MFS14_LIN_FCR_FCL2                   *((volatile uint32_t*)(0x4271C28CUL))
#define bFM_MFS14_LIN_FCR_FSET                    *((volatile uint32_t*)(0x4271C290UL))
#define bFM4_MFS14_LIN_FCR_FSET                   *((volatile uint32_t*)(0x4271C290UL))
#define bFM_MFS14_LIN_FCR_FLD                     *((volatile uint32_t*)(0x4271C294UL))
#define bFM4_MFS14_LIN_FCR_FLD                    *((volatile uint32_t*)(0x4271C294UL))
#define bFM_MFS14_LIN_FCR_FLST                    *((volatile uint32_t*)(0x4271C298UL))
#define bFM4_MFS14_LIN_FCR_FLST                   *((volatile uint32_t*)(0x4271C298UL))
#define bFM_MFS14_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x4271C2A0UL))
#define bFM4_MFS14_LIN_FCR_FSEL                   *((volatile uint32_t*)(0x4271C2A0UL))
#define bFM_MFS14_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x4271C2A4UL))
#define bFM4_MFS14_LIN_FCR_FTIE                   *((volatile uint32_t*)(0x4271C2A4UL))
#define bFM_MFS14_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x4271C2A8UL))
#define bFM4_MFS14_LIN_FCR_FDRQ                   *((volatile uint32_t*)(0x4271C2A8UL))
#define bFM_MFS14_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x4271C2ACUL))
#define bFM4_MFS14_LIN_FCR_FRIIE                  *((volatile uint32_t*)(0x4271C2ACUL))
#define bFM_MFS14_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x4271C2B0UL))
#define bFM4_MFS14_LIN_FCR_FLSTE                  *((volatile uint32_t*)(0x4271C2B0UL))

#define bFM_MFS14_LIN_SCR_TXE                     *((volatile uint32_t*)(0x4271C020UL))
#define bFM4_MFS14_LIN_SCR_TXE                    *((volatile uint32_t*)(0x4271C020UL))
#define bFM_MFS14_LIN_SCR_RXE                     *((volatile uint32_t*)(0x4271C024UL))
#define bFM4_MFS14_LIN_SCR_RXE                    *((volatile uint32_t*)(0x4271C024UL))
#define bFM_MFS14_LIN_SCR_TBIE                    *((volatile uint32_t*)(0x4271C028UL))
#define bFM4_MFS14_LIN_SCR_TBIE                   *((volatile uint32_t*)(0x4271C028UL))
#define bFM_MFS14_LIN_SCR_TIE                     *((volatile uint32_t*)(0x4271C02CUL))
#define bFM4_MFS14_LIN_SCR_TIE                    *((volatile uint32_t*)(0x4271C02CUL))
#define bFM_MFS14_LIN_SCR_RIE                     *((volatile uint32_t*)(0x4271C030UL))
#define bFM4_MFS14_LIN_SCR_RIE                    *((volatile uint32_t*)(0x4271C030UL))
#define bFM_MFS14_LIN_SCR_LBR                     *((volatile uint32_t*)(0x4271C034UL))
#define bFM4_MFS14_LIN_SCR_LBR                    *((volatile uint32_t*)(0x4271C034UL))
#define bFM_MFS14_LIN_SCR_MS                      *((volatile uint32_t*)(0x4271C038UL))
#define bFM4_MFS14_LIN_SCR_MS                     *((volatile uint32_t*)(0x4271C038UL))
#define bFM_MFS14_LIN_SCR_UPCL                    *((volatile uint32_t*)(0x4271C03CUL))
#define bFM4_MFS14_LIN_SCR_UPCL                   *((volatile uint32_t*)(0x4271C03CUL))

#define bFM_MFS14_LIN_SMR_SOE                     *((volatile uint32_t*)(0x4271C000UL))
#define bFM4_MFS14_LIN_SMR_SOE                    *((volatile uint32_t*)(0x4271C000UL))
#define bFM_MFS14_LIN_SMR_SBL                     *((volatile uint32_t*)(0x4271C00CUL))
#define bFM4_MFS14_LIN_SMR_SBL                    *((volatile uint32_t*)(0x4271C00CUL))
#define bFM_MFS14_LIN_SMR_WUCR                    *((volatile uint32_t*)(0x4271C010UL))
#define bFM4_MFS14_LIN_SMR_WUCR                   *((volatile uint32_t*)(0x4271C010UL))

#define bFM_MFS14_LIN_SSR_TBI                     *((volatile uint32_t*)(0x4271C0A0UL))
#define bFM4_MFS14_LIN_SSR_TBI                    *((volatile uint32_t*)(0x4271C0A0UL))
#define bFM_MFS14_LIN_SSR_TDRE                    *((volatile uint32_t*)(0x4271C0A4UL))
#define bFM4_MFS14_LIN_SSR_TDRE                   *((volatile uint32_t*)(0x4271C0A4UL))
#define bFM_MFS14_LIN_SSR_RDRF                    *((volatile uint32_t*)(0x4271C0A8UL))
#define bFM4_MFS14_LIN_SSR_RDRF                   *((volatile uint32_t*)(0x4271C0A8UL))
#define bFM_MFS14_LIN_SSR_ORE                     *((volatile uint32_t*)(0x4271C0ACUL))
#define bFM4_MFS14_LIN_SSR_ORE                    *((volatile uint32_t*)(0x4271C0ACUL))
#define bFM_MFS14_LIN_SSR_FRE                     *((volatile uint32_t*)(0x4271C0B0UL))
#define bFM4_MFS14_LIN_SSR_FRE                    *((volatile uint32_t*)(0x4271C0B0UL))
#define bFM_MFS14_LIN_SSR_LBD                     *((volatile uint32_t*)(0x4271C0B4UL))
#define bFM4_MFS14_LIN_SSR_LBD                    *((volatile uint32_t*)(0x4271C0B4UL))
#define bFM_MFS14_LIN_SSR_REC                     *((volatile uint32_t*)(0x4271C0BCUL))
#define bFM4_MFS14_LIN_SSR_REC                    *((volatile uint32_t*)(0x4271C0BCUL))

#define bFM_MFS14_UART_BGR_EXT                    *((volatile uint32_t*)(0x4271C1BCUL))
#define bFM4_MFS14_UART_BGR_EXT                   *((volatile uint32_t*)(0x4271C1BCUL))

#define bFM_MFS14_UART_ESCR_P                     *((volatile uint32_t*)(0x4271C08CUL))
#define bFM4_MFS14_UART_ESCR_P                    *((volatile uint32_t*)(0x4271C08CUL))
#define bFM_MFS14_UART_ESCR_PEN                   *((volatile uint32_t*)(0x4271C090UL))
#define bFM4_MFS14_UART_ESCR_PEN                  *((volatile uint32_t*)(0x4271C090UL))
#define bFM_MFS14_UART_ESCR_INV                   *((volatile uint32_t*)(0x4271C094UL))
#define bFM4_MFS14_UART_ESCR_INV                  *((volatile uint32_t*)(0x4271C094UL))
#define bFM_MFS14_UART_ESCR_ESBL                  *((volatile uint32_t*)(0x4271C098UL))
#define bFM4_MFS14_UART_ESCR_ESBL                 *((volatile uint32_t*)(0x4271C098UL))
#define bFM_MFS14_UART_ESCR_FLWEN                 *((volatile uint32_t*)(0x4271C09CUL))
#define bFM4_MFS14_UART_ESCR_FLWEN                *((volatile uint32_t*)(0x4271C09CUL))

#define bFM_MFS14_UART_FCR_FE1                    *((volatile uint32_t*)(0x4271C280UL))
#define bFM4_MFS14_UART_FCR_FE1                   *((volatile uint32_t*)(0x4271C280UL))
#define bFM_MFS14_UART_FCR_FE2                    *((volatile uint32_t*)(0x4271C284UL))
#define bFM4_MFS14_UART_FCR_FE2                   *((volatile uint32_t*)(0x4271C284UL))
#define bFM_MFS14_UART_FCR_FCL1                   *((volatile uint32_t*)(0x4271C288UL))
#define bFM4_MFS14_UART_FCR_FCL1                  *((volatile uint32_t*)(0x4271C288UL))
#define bFM_MFS14_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4271C28CUL))
#define bFM4_MFS14_UART_FCR_FCL2                  *((volatile uint32_t*)(0x4271C28CUL))
#define bFM_MFS14_UART_FCR_FSET                   *((volatile uint32_t*)(0x4271C290UL))
#define bFM4_MFS14_UART_FCR_FSET                  *((volatile uint32_t*)(0x4271C290UL))
#define bFM_MFS14_UART_FCR_FLD                    *((volatile uint32_t*)(0x4271C294UL))
#define bFM4_MFS14_UART_FCR_FLD                   *((volatile uint32_t*)(0x4271C294UL))
#define bFM_MFS14_UART_FCR_FLST                   *((volatile uint32_t*)(0x4271C298UL))
#define bFM4_MFS14_UART_FCR_FLST                  *((volatile uint32_t*)(0x4271C298UL))
#define bFM_MFS14_UART_FCR_FSEL                   *((volatile uint32_t*)(0x4271C2A0UL))
#define bFM4_MFS14_UART_FCR_FSEL                  *((volatile uint32_t*)(0x4271C2A0UL))
#define bFM_MFS14_UART_FCR_FTIE                   *((volatile uint32_t*)(0x4271C2A4UL))
#define bFM4_MFS14_UART_FCR_FTIE                  *((volatile uint32_t*)(0x4271C2A4UL))
#define bFM_MFS14_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x4271C2A8UL))
#define bFM4_MFS14_UART_FCR_FDRQ                  *((volatile uint32_t*)(0x4271C2A8UL))
#define bFM_MFS14_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x4271C2ACUL))
#define bFM4_MFS14_UART_FCR_FRIIE                 *((volatile uint32_t*)(0x4271C2ACUL))
#define bFM_MFS14_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x4271C2B0UL))
#define bFM4_MFS14_UART_FCR_FLSTE                 *((volatile uint32_t*)(0x4271C2B0UL))

#define bFM_MFS14_UART_SCR_TXE                    *((volatile uint32_t*)(0x4271C020UL))
#define bFM4_MFS14_UART_SCR_TXE                   *((volatile uint32_t*)(0x4271C020UL))
#define bFM_MFS14_UART_SCR_RXE                    *((volatile uint32_t*)(0x4271C024UL))
#define bFM4_MFS14_UART_SCR_RXE                   *((volatile uint32_t*)(0x4271C024UL))
#define bFM_MFS14_UART_SCR_TBIE                   *((volatile uint32_t*)(0x4271C028UL))
#define bFM4_MFS14_UART_SCR_TBIE                  *((volatile uint32_t*)(0x4271C028UL))
#define bFM_MFS14_UART_SCR_TIE                    *((volatile uint32_t*)(0x4271C02CUL))
#define bFM4_MFS14_UART_SCR_TIE                   *((volatile uint32_t*)(0x4271C02CUL))
#define bFM_MFS14_UART_SCR_RIE                    *((volatile uint32_t*)(0x4271C030UL))
#define bFM4_MFS14_UART_SCR_RIE                   *((volatile uint32_t*)(0x4271C030UL))
#define bFM_MFS14_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4271C03CUL))
#define bFM4_MFS14_UART_SCR_UPCL                  *((volatile uint32_t*)(0x4271C03CUL))

#define bFM_MFS14_UART_SMR_SOE                    *((volatile uint32_t*)(0x4271C000UL))
#define bFM4_MFS14_UART_SMR_SOE                   *((volatile uint32_t*)(0x4271C000UL))
#define bFM_MFS14_UART_SMR_BDS                    *((volatile uint32_t*)(0x4271C008UL))
#define bFM4_MFS14_UART_SMR_BDS                   *((volatile uint32_t*)(0x4271C008UL))
#define bFM_MFS14_UART_SMR_SBL                    *((volatile uint32_t*)(0x4271C00CUL))
#define bFM4_MFS14_UART_SMR_SBL                   *((volatile uint32_t*)(0x4271C00CUL))

