neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS14_UART_SSR_TBI                    *((volatile uint32_t*)(0x4271C0A0UL))
#define bFM4_MFS14_UART_SSR_TBI                   *((volatile uint32_t*)(0x4271C0A0UL))
#define bFM_MFS14_UART_SSR_TDRE                   *((volatile uint32_t*)(0x4271C0A4UL))
#define bFM4_MFS14_UART_SSR_TDRE                  *((volatile uint32_t*)(0x4271C0A4UL))
#define bFM_MFS14_UART_SSR_RDRF                   *((volatile uint32_t*)(0x4271C0A8UL))
#define bFM4_MFS14_UART_SSR_RDRF                  *((volatile uint32_t*)(0x4271C0A8UL))
#define bFM_MFS14_UART_SSR_ORE                    *((volatile uint32_t*)(0x4271C0ACUL))
#define bFM4_MFS14_UART_SSR_ORE                   *((volatile uint32_t*)(0x4271C0ACUL))
#define bFM_MFS14_UART_SSR_FRE                    *((volatile uint32_t*)(0x4271C0B0UL))
#define bFM4_MFS14_UART_SSR_FRE                   *((volatile uint32_t*)(0x4271C0B0UL))
#define bFM_MFS14_UART_SSR_PE                     *((volatile uint32_t*)(0x4271C0B4UL))
#define bFM4_MFS14_UART_SSR_PE                    *((volatile uint32_t*)(0x4271C0B4UL))
#define bFM_MFS14_UART_SSR_REC                    *((volatile uint32_t*)(0x4271C0BCUL))
#define bFM4_MFS14_UART_SSR_REC                   *((volatile uint32_t*)(0x4271C0BCUL))


/******************************************************************************
 ** MFS Registers MFS15
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS15_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x4271E094UL))
#define bFM4_MFS15_CSIO_ESCR_CSFE                 *((volatile uint32_t*)(0x4271E094UL))
#define bFM_MFS15_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x4271E098UL))
#define bFM4_MFS15_CSIO_ESCR_L3                   *((volatile uint32_t*)(0x4271E098UL))
#define bFM_MFS15_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4271E09CUL))
#define bFM4_MFS15_CSIO_ESCR_SOP                  *((volatile uint32_t*)(0x4271E09CUL))

#define bFM_MFS15_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x4271E280UL))
#define bFM4_MFS15_CSIO_FCR_FE1                   *((volatile uint32_t*)(0x4271E280UL))
#define bFM_MFS15_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x4271E284UL))
#define bFM4_MFS15_CSIO_FCR_FE2                   *((volatile uint32_t*)(0x4271E284UL))
#define bFM_MFS15_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x4271E288UL))
#define bFM4_MFS15_CSIO_FCR_FCL1                  *((volatile uint32_t*)(0x4271E288UL))
#define bFM_MFS15_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4271E28CUL))
#define bFM4_MFS15_CSIO_FCR_FCL2                  *((volatile uint32_t*)(0x4271E28CUL))
#define bFM_MFS15_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x4271E290UL))
#define bFM4_MFS15_CSIO_FCR_FSET                  *((volatile uint32_t*)(0x4271E290UL))
#define bFM_MFS15_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x4271E294UL))
#define bFM4_MFS15_CSIO_FCR_FLD                   *((volatile uint32_t*)(0x4271E294UL))
#define bFM_MFS15_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x4271E298UL))
#define bFM4_MFS15_CSIO_FCR_FLST                  *((volatile uint32_t*)(0x4271E298UL))
#define bFM_MFS15_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x4271E2A0UL))
#define bFM4_MFS15_CSIO_FCR_FSEL                  *((volatile uint32_t*)(0x4271E2A0UL))
#define bFM_MFS15_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x4271E2A4UL))
#define bFM4_MFS15_CSIO_FCR_FTIE                  *((volatile uint32_t*)(0x4271E2A4UL))
#define bFM_MFS15_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x4271E2A8UL))
#define bFM4_MFS15_CSIO_FCR_FDRQ                  *((volatile uint32_t*)(0x4271E2A8UL))
#define bFM_MFS15_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x4271E2ACUL))
#define bFM4_MFS15_CSIO_FCR_FRIIE                 *((volatile uint32_t*)(0x4271E2ACUL))
#define bFM_MFS15_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x4271E2B0UL))
#define bFM4_MFS15_CSIO_FCR_FLSTE                 *((volatile uint32_t*)(0x4271E2B0UL))

#define bFM_MFS15_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x4271E480UL))
#define bFM4_MFS15_CSIO_SACSR_TMRE                *((volatile uint32_t*)(0x4271E480UL))
#define bFM_MFS15_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x4271E498UL))
#define bFM4_MFS15_CSIO_SACSR_TSYNE               *((volatile uint32_t*)(0x4271E498UL))
#define bFM_MFS15_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4271E49CUL))
#define bFM4_MFS15_CSIO_SACSR_TINTE               *((volatile uint32_t*)(0x4271E49CUL))
#define bFM_MFS15_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x4271E4A0UL))
#define bFM4_MFS15_CSIO_SACSR_TINT                *((volatile uint32_t*)(0x4271E4A0UL))
#define bFM_MFS15_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x4271E4ACUL))
#define bFM4_MFS15_CSIO_SACSR_CSE                 *((volatile uint32_t*)(0x4271E4ACUL))
#define bFM_MFS15_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x4271E4B0UL))
#define bFM4_MFS15_CSIO_SACSR_CSEIE               *((volatile uint32_t*)(0x4271E4B0UL))
#define bFM_MFS15_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x4271E4B4UL))
#define bFM4_MFS15_CSIO_SACSR_TBEEN               *((volatile uint32_t*)(0x4271E4B4UL))

#define bFM_MFS15_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x4271E020UL))
#define bFM4_MFS15_CSIO_SCR_TXE                   *((volatile uint32_t*)(0x4271E020UL))
#define bFM_MFS15_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x4271E024UL))
#define bFM4_MFS15_CSIO_SCR_RXE                   *((volatile uint32_t*)(0x4271E024UL))
#define bFM_MFS15_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x4271E028UL))
#define bFM4_MFS15_CSIO_SCR_TBIE                  *((volatile uint32_t*)(0x4271E028UL))
#define bFM_MFS15_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4271E02CUL))
#define bFM4_MFS15_CSIO_SCR_TIE                   *((volatile uint32_t*)(0x4271E02CUL))
#define bFM_MFS15_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x4271E030UL))
#define bFM4_MFS15_CSIO_SCR_RIE                   *((volatile uint32_t*)(0x4271E030UL))
#define bFM_MFS15_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x4271E034UL))
#define bFM4_MFS15_CSIO_SCR_SPI                   *((volatile uint32_t*)(0x4271E034UL))
#define bFM_MFS15_CSIO_SCR_MS                     *((volatile uint32_t*)(0x4271E038UL))
#define bFM4_MFS15_CSIO_SCR_MS                    *((volatile uint32_t*)(0x4271E038UL))
#define bFM_MFS15_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4271E03CUL))
#define bFM4_MFS15_CSIO_SCR_UPCL                  *((volatile uint32_t*)(0x4271E03CUL))

#define bFM_MFS15_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x4271E600UL))
#define bFM4_MFS15_CSIO_SCSCR_CSOE                *((volatile uint32_t*)(0x4271E600UL))
#define bFM_MFS15_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x4271E604UL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN0               *((volatile uint32_t*)(0x4271E604UL))
#define bFM_MFS15_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x4271E608UL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN1               *((volatile uint32_t*)(0x4271E608UL))
#define bFM_MFS15_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4271E60CUL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN2               *((volatile uint32_t*)(0x4271E60CUL))
#define bFM_MFS15_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x4271E610UL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN3               *((volatile uint32_t*)(0x4271E610UL))
#define bFM_MFS15_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x4271E614UL))
#define bFM4_MFS15_CSIO_SCSCR_CSLVL               *((volatile uint32_t*)(0x4271E614UL))
#define bFM_MFS15_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x4271E624UL))
#define bFM4_MFS15_CSIO_SCSCR_SCAM                *((volatile uint32_t*)(0x4271E624UL))

#define bFM_MFS15_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x4271E694UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1SPI             *((volatile uint32_t*)(0x4271E694UL))
#define bFM_MFS15_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x4271E698UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1SCINV           *((volatile uint32_t*)(0x4271E698UL))
#define bFM_MFS15_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4271E69CUL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1CSLVL           *((volatile uint32_t*)(0x4271E69CUL))

