neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS15_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x4271E6B4UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2SPI             *((volatile uint32_t*)(0x4271E6B4UL))
#define bFM_MFS15_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x4271E6B8UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2SCINV           *((volatile uint32_t*)(0x4271E6B8UL))
#define bFM_MFS15_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x4271E6BCUL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2CSLVL           *((volatile uint32_t*)(0x4271E6BCUL))

#define bFM_MFS15_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x4271E714UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3SPI             *((volatile uint32_t*)(0x4271E714UL))
#define bFM_MFS15_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x4271E718UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3SCINV           *((volatile uint32_t*)(0x4271E718UL))
#define bFM_MFS15_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4271E71CUL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3CSLVL           *((volatile uint32_t*)(0x4271E71CUL))

#define bFM_MFS15_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x4271E000UL))
#define bFM4_MFS15_CSIO_SMR_SOE                   *((volatile uint32_t*)(0x4271E000UL))
#define bFM_MFS15_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x4271E004UL))
#define bFM4_MFS15_CSIO_SMR_SCKE                  *((volatile uint32_t*)(0x4271E004UL))
#define bFM_MFS15_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x4271E008UL))
#define bFM4_MFS15_CSIO_SMR_BDS                   *((volatile uint32_t*)(0x4271E008UL))
#define bFM_MFS15_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4271E00CUL))
#define bFM4_MFS15_CSIO_SMR_SCINV                 *((volatile uint32_t*)(0x4271E00CUL))

#define bFM_MFS15_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x4271E0A0UL))
#define bFM4_MFS15_CSIO_SSR_TBI                   *((volatile uint32_t*)(0x4271E0A0UL))
#define bFM_MFS15_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x4271E0A4UL))
#define bFM4_MFS15_CSIO_SSR_TDRE                  *((volatile uint32_t*)(0x4271E0A4UL))
#define bFM_MFS15_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x4271E0A8UL))
#define bFM4_MFS15_CSIO_SSR_RDRF                  *((volatile uint32_t*)(0x4271E0A8UL))
#define bFM_MFS15_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x4271E0ACUL))
#define bFM4_MFS15_CSIO_SSR_ORE                   *((volatile uint32_t*)(0x4271E0ACUL))
#define bFM_MFS15_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x4271E0B0UL))
#define bFM4_MFS15_CSIO_SSR_AWC                   *((volatile uint32_t*)(0x4271E0B0UL))
#define bFM_MFS15_CSIO_SSR_REC                    *((volatile uint32_t*)(0x4271E0BCUL))
#define bFM4_MFS15_CSIO_SSR_REC                   *((volatile uint32_t*)(0x4271E0BCUL))

#define bFM_MFS15_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x4271E3A0UL))
#define bFM4_MFS15_I2C_EIBCR_BEC                  *((volatile uint32_t*)(0x4271E3A0UL))
#define bFM_MFS15_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x4271E3A4UL))
#define bFM4_MFS15_I2C_EIBCR_SOCE                 *((volatile uint32_t*)(0x4271E3A4UL))
#define bFM_MFS15_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x4271E3A8UL))
#define bFM4_MFS15_I2C_EIBCR_SCLC                 *((volatile uint32_t*)(0x4271E3A8UL))
#define bFM_MFS15_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x4271E3ACUL))
#define bFM4_MFS15_I2C_EIBCR_SDAC                 *((volatile uint32_t*)(0x4271E3ACUL))
#define bFM_MFS15_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x4271E3B0UL))
#define bFM4_MFS15_I2C_EIBCR_SCLS                 *((volatile uint32_t*)(0x4271E3B0UL))
#define bFM_MFS15_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x4271E3B4UL))
#define bFM4_MFS15_I2C_EIBCR_SDAS                 *((volatile uint32_t*)(0x4271E3B4UL))

#define bFM_MFS15_I2C_FCR_FE1                     *((volatile uint32_t*)(0x4271E280UL))
#define bFM4_MFS15_I2C_FCR_FE1                    *((volatile uint32_t*)(0x4271E280UL))
#define bFM_MFS15_I2C_FCR_FE2                     *((volatile uint32_t*)(0x4271E284UL))
#define bFM4_MFS15_I2C_FCR_FE2                    *((volatile uint32_t*)(0x4271E284UL))
#define bFM_MFS15_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x4271E288UL))
#define bFM4_MFS15_I2C_FCR_FCL1                   *((volatile uint32_t*)(0x4271E288UL))
#define bFM_MFS15_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4271E28CUL))
#define bFM4_MFS15_I2C_FCR_FCL2                   *((volatile uint32_t*)(0x4271E28CUL))
#define bFM_MFS15_I2C_FCR_FSET                    *((volatile uint32_t*)(0x4271E290UL))
#define bFM4_MFS15_I2C_FCR_FSET                   *((volatile uint32_t*)(0x4271E290UL))
#define bFM_MFS15_I2C_FCR_FLD                     *((volatile uint32_t*)(0x4271E294UL))
#define bFM4_MFS15_I2C_FCR_FLD                    *((volatile uint32_t*)(0x4271E294UL))
#define bFM_MFS15_I2C_FCR_FLST                    *((volatile uint32_t*)(0x4271E298UL))
#define bFM4_MFS15_I2C_FCR_FLST                   *((volatile uint32_t*)(0x4271E298UL))
#define bFM_MFS15_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x4271E2A0UL))
#define bFM4_MFS15_I2C_FCR_FSEL                   *((volatile uint32_t*)(0x4271E2A0UL))
#define bFM_MFS15_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x4271E2A4UL))
#define bFM4_MFS15_I2C_FCR_FTIE                   *((volatile uint32_t*)(0x4271E2A4UL))
#define bFM_MFS15_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x4271E2A8UL))
#define bFM4_MFS15_I2C_FCR_FDRQ                   *((volatile uint32_t*)(0x4271E2A8UL))
#define bFM_MFS15_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x4271E2ACUL))
#define bFM4_MFS15_I2C_FCR_FRIIE                  *((volatile uint32_t*)(0x4271E2ACUL))
#define bFM_MFS15_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x4271E2B0UL))
#define bFM4_MFS15_I2C_FCR_FLSTE                  *((volatile uint32_t*)(0x4271E2B0UL))

#define bFM_MFS15_I2C_IBCR_INT                    *((volatile uint32_t*)(0x4271E020UL))
#define bFM4_MFS15_I2C_IBCR_INT                   *((volatile uint32_t*)(0x4271E020UL))
#define bFM_MFS15_I2C_IBCR_BER                    *((volatile uint32_t*)(0x4271E024UL))
#define bFM4_MFS15_I2C_IBCR_BER                   *((volatile uint32_t*)(0x4271E024UL))
#define bFM_MFS15_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x4271E028UL))
#define bFM4_MFS15_I2C_IBCR_INTE                  *((volatile uint32_t*)(0x4271E028UL))
#define bFM_MFS15_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4271E02CUL))
#define bFM4_MFS15_I2C_IBCR_CNDE                  *((volatile uint32_t*)(0x4271E02CUL))
#define bFM_MFS15_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x4271E030UL))
#define bFM4_MFS15_I2C_IBCR_WSEL                  *((volatile uint32_t*)(0x4271E030UL))
#define bFM_MFS15_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x4271E034UL))
#define bFM4_MFS15_I2C_IBCR_ACKE                  *((volatile uint32_t*)(0x4271E034UL))
#define bFM_MFS15_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x4271E038UL))
#define bFM4_MFS15_I2C_IBCR_ACT_SCC               *((volatile uint32_t*)(0x4271E038UL))
#define bFM_MFS15_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4271E03CUL))
#define bFM4_MFS15_I2C_IBCR_MSS                   *((volatile uint32_t*)(0x4271E03CUL))

#define bFM_MFS15_I2C_IBSR_BB                     *((volatile uint32_t*)(0x4271E080UL))
#define bFM4_MFS15_I2C_IBSR_BB                    *((volatile uint32_t*)(0x4271E080UL))
#define bFM_MFS15_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x4271E084UL))
#define bFM4_MFS15_I2C_IBSR_SPC                   *((volatile uint32_t*)(0x4271E084UL))
#define bFM_MFS15_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x4271E088UL))
#define bFM4_MFS15_I2C_IBSR_RSC                   *((volatile uint32_t*)(0x4271E088UL))
#define bFM_MFS15_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4271E08CUL))
#define bFM4_MFS15_I2C_IBSR_AL                    *((volatile uint32_t*)(0x4271E08CUL))
#define bFM_MFS15_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x4271E090UL))
#define bFM4_MFS15_I2C_IBSR_TRX                   *((volatile uint32_t*)(0x4271E090UL))
#define bFM_MFS15_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x4271E094UL))
#define bFM4_MFS15_I2C_IBSR_RSA                   *((volatile uint32_t*)(0x4271E094UL))
#define bFM_MFS15_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x4271E098UL))
#define bFM4_MFS15_I2C_IBSR_RACK                  *((volatile uint32_t*)(0x4271E098UL))
#define bFM_MFS15_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4271E09CUL))
#define bFM4_MFS15_I2C_IBSR_FBT                   *((volatile uint32_t*)(0x4271E09CUL))

#define bFM_MFS15_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4271E21CUL))
#define bFM4_MFS15_I2C_ISBA_SAEN                  *((volatile uint32_t*)(0x4271E21CUL))

#define bFM_MFS15_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4271E23CUL))
#define bFM4_MFS15_I2C_ISMK_EN                    *((volatile uint32_t*)(0x4271E23CUL))

#define bFM_MFS15_I2C_SMR_TIE                     *((volatile uint32_t*)(0x4271E008UL))
#define bFM4_MFS15_I2C_SMR_TIE                    *((volatile uint32_t*)(0x4271E008UL))
#define bFM_MFS15_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4271E00CUL))
#define bFM4_MFS15_I2C_SMR_RIE                    *((volatile uint32_t*)(0x4271E00CUL))

#define bFM_MFS15_I2C_SSR_TBI                     *((volatile uint32_t*)(0x4271E0A0UL))
#define bFM4_MFS15_I2C_SSR_TBI                    *((volatile uint32_t*)(0x4271E0A0UL))
#define bFM_MFS15_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x4271E0A4UL))
#define bFM4_MFS15_I2C_SSR_TDRE                   *((volatile uint32_t*)(0x4271E0A4UL))
#define bFM_MFS15_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x4271E0A8UL))
#define bFM4_MFS15_I2C_SSR_RDRF                   *((volatile uint32_t*)(0x4271E0A8UL))
#define bFM_MFS15_I2C_SSR_ORE                     *((volatile uint32_t*)(0x4271E0ACUL))
#define bFM4_MFS15_I2C_SSR_ORE                    *((volatile uint32_t*)(0x4271E0ACUL))
#define bFM_MFS15_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x4271E0B0UL))
#define bFM4_MFS15_I2C_SSR_TBIE                   *((volatile uint32_t*)(0x4271E0B0UL))
#define bFM_MFS15_I2C_SSR_DMA                     *((volatile uint32_t*)(0x4271E0B4UL))
#define bFM4_MFS15_I2C_SSR_DMA                    *((volatile uint32_t*)(0x4271E0B4UL))
#define bFM_MFS15_I2C_SSR_TSET                    *((volatile uint32_t*)(0x4271E0B8UL))
#define bFM4_MFS15_I2C_SSR_TSET                   *((volatile uint32_t*)(0x4271E0B8UL))
#define bFM_MFS15_I2C_SSR_REC                     *((volatile uint32_t*)(0x4271E0BCUL))
#define bFM4_MFS15_I2C_SSR_REC                    *((volatile uint32_t*)(0x4271E0BCUL))

#define bFM_MFS15_LIN_BGR_EXT                     *((volatile uint32_t*)(0x4271E1BCUL))
#define bFM4_MFS15_LIN_BGR_EXT                    *((volatile uint32_t*)(0x4271E1BCUL))

