neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS15_UART_SCR_TXE                    *((volatile uint32_t*)(0x4271E020UL))
#define bFM4_MFS15_UART_SCR_TXE                   *((volatile uint32_t*)(0x4271E020UL))
#define bFM_MFS15_UART_SCR_RXE                    *((volatile uint32_t*)(0x4271E024UL))
#define bFM4_MFS15_UART_SCR_RXE                   *((volatile uint32_t*)(0x4271E024UL))
#define bFM_MFS15_UART_SCR_TBIE                   *((volatile uint32_t*)(0x4271E028UL))
#define bFM4_MFS15_UART_SCR_TBIE                  *((volatile uint32_t*)(0x4271E028UL))
#define bFM_MFS15_UART_SCR_TIE                    *((volatile uint32_t*)(0x4271E02CUL))
#define bFM4_MFS15_UART_SCR_TIE                   *((volatile uint32_t*)(0x4271E02CUL))
#define bFM_MFS15_UART_SCR_RIE                    *((volatile uint32_t*)(0x4271E030UL))
#define bFM4_MFS15_UART_SCR_RIE                   *((volatile uint32_t*)(0x4271E030UL))
#define bFM_MFS15_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4271E03CUL))
#define bFM4_MFS15_UART_SCR_UPCL                  *((volatile uint32_t*)(0x4271E03CUL))

#define bFM_MFS15_UART_SMR_SOE                    *((volatile uint32_t*)(0x4271E000UL))
#define bFM4_MFS15_UART_SMR_SOE                   *((volatile uint32_t*)(0x4271E000UL))
#define bFM_MFS15_UART_SMR_BDS                    *((volatile uint32_t*)(0x4271E008UL))
#define bFM4_MFS15_UART_SMR_BDS                   *((volatile uint32_t*)(0x4271E008UL))
#define bFM_MFS15_UART_SMR_SBL                    *((volatile uint32_t*)(0x4271E00CUL))
#define bFM4_MFS15_UART_SMR_SBL                   *((volatile uint32_t*)(0x4271E00CUL))

#define bFM_MFS15_UART_SSR_TBI                    *((volatile uint32_t*)(0x4271E0A0UL))
#define bFM4_MFS15_UART_SSR_TBI                   *((volatile uint32_t*)(0x4271E0A0UL))
#define bFM_MFS15_UART_SSR_TDRE                   *((volatile uint32_t*)(0x4271E0A4UL))
#define bFM4_MFS15_UART_SSR_TDRE                  *((volatile uint32_t*)(0x4271E0A4UL))
#define bFM_MFS15_UART_SSR_RDRF                   *((volatile uint32_t*)(0x4271E0A8UL))
#define bFM4_MFS15_UART_SSR_RDRF                  *((volatile uint32_t*)(0x4271E0A8UL))
#define bFM_MFS15_UART_SSR_ORE                    *((volatile uint32_t*)(0x4271E0ACUL))
#define bFM4_MFS15_UART_SSR_ORE                   *((volatile uint32_t*)(0x4271E0ACUL))
#define bFM_MFS15_UART_SSR_FRE                    *((volatile uint32_t*)(0x4271E0B0UL))
#define bFM4_MFS15_UART_SSR_FRE                   *((volatile uint32_t*)(0x4271E0B0UL))
#define bFM_MFS15_UART_SSR_PE                     *((volatile uint32_t*)(0x4271E0B4UL))
#define bFM4_MFS15_UART_SSR_PE                    *((volatile uint32_t*)(0x4271E0B4UL))
#define bFM_MFS15_UART_SSR_REC                    *((volatile uint32_t*)(0x4271E0BCUL))
#define bFM4_MFS15_UART_SSR_REC                   *((volatile uint32_t*)(0x4271E0BCUL))


/******************************************************************************
 ** MFS Registers MFS2
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS2_CSIO_ESCR_CSFE                   *((volatile uint32_t*)(0x42704094UL))
#define bFM4_MFS2_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x42704094UL))
#define bFM_MFS2_CSIO_ESCR_L3                     *((volatile uint32_t*)(0x42704098UL))
#define bFM4_MFS2_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x42704098UL))
#define bFM_MFS2_CSIO_ESCR_SOP                    *((volatile uint32_t*)(0x4270409CUL))
#define bFM4_MFS2_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4270409CUL))

#define bFM_MFS2_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x42704280UL))
#define bFM4_MFS2_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42704280UL))
#define bFM_MFS2_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x42704284UL))
#define bFM4_MFS2_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42704284UL))
#define bFM_MFS2_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x42704288UL))
#define bFM4_MFS2_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42704288UL))
#define bFM_MFS2_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4270428CUL))
#define bFM4_MFS2_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4270428CUL))
#define bFM_MFS2_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x42704290UL))
#define bFM4_MFS2_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42704290UL))
#define bFM_MFS2_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x42704294UL))
#define bFM4_MFS2_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42704294UL))
#define bFM_MFS2_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x42704298UL))
#define bFM4_MFS2_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42704298UL))
#define bFM_MFS2_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x427042A0UL))
#define bFM4_MFS2_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427042A0UL))
#define bFM_MFS2_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x427042A4UL))
#define bFM4_MFS2_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427042A4UL))
#define bFM_MFS2_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x427042A8UL))
#define bFM4_MFS2_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427042A8UL))
#define bFM_MFS2_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x427042ACUL))
#define bFM4_MFS2_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427042ACUL))
#define bFM_MFS2_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x427042B0UL))
#define bFM4_MFS2_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427042B0UL))

#define bFM_MFS2_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x42704480UL))
#define bFM4_MFS2_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42704480UL))
#define bFM_MFS2_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x42704498UL))
#define bFM4_MFS2_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42704498UL))
#define bFM_MFS2_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4270449CUL))
#define bFM4_MFS2_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4270449CUL))
#define bFM_MFS2_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x427044A0UL))
#define bFM4_MFS2_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427044A0UL))
#define bFM_MFS2_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x427044ACUL))
#define bFM4_MFS2_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427044ACUL))
#define bFM_MFS2_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x427044B0UL))
#define bFM4_MFS2_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427044B0UL))
#define bFM_MFS2_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x427044B4UL))
#define bFM4_MFS2_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427044B4UL))

#define bFM_MFS2_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x42704020UL))
#define bFM4_MFS2_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42704020UL))
#define bFM_MFS2_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x42704024UL))
#define bFM4_MFS2_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42704024UL))
#define bFM_MFS2_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x42704028UL))
#define bFM4_MFS2_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42704028UL))
#define bFM_MFS2_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4270402CUL))
#define bFM4_MFS2_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4270402CUL))
#define bFM_MFS2_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x42704030UL))
#define bFM4_MFS2_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42704030UL))
#define bFM_MFS2_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x42704034UL))
#define bFM4_MFS2_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42704034UL))
#define bFM_MFS2_CSIO_SCR_MS                      *((volatile uint32_t*)(0x42704038UL))
#define bFM4_MFS2_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42704038UL))
#define bFM_MFS2_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4270403CUL))
#define bFM4_MFS2_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4270403CUL))

#define bFM_MFS2_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x42704600UL))
#define bFM4_MFS2_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42704600UL))
#define bFM_MFS2_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x42704604UL))
#define bFM4_MFS2_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42704604UL))
#define bFM_MFS2_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x42704608UL))
#define bFM4_MFS2_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42704608UL))
#define bFM_MFS2_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4270460CUL))
#define bFM4_MFS2_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4270460CUL))
#define bFM_MFS2_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x42704610UL))
#define bFM4_MFS2_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42704610UL))
#define bFM_MFS2_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x42704614UL))
#define bFM4_MFS2_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42704614UL))
#define bFM_MFS2_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x42704624UL))
#define bFM4_MFS2_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42704624UL))

#define bFM_MFS2_CSIO_SCSFR0_CS1SPI               *((volatile uint32_t*)(0x42704694UL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x42704694UL))
#define bFM_MFS2_CSIO_SCSFR0_CS1SCINV             *((volatile uint32_t*)(0x42704698UL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x42704698UL))
#define bFM_MFS2_CSIO_SCSFR0_CS1CSLVL             *((volatile uint32_t*)(0x4270469CUL))
#define bFM4_MFS2_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4270469CUL))

#define bFM_MFS2_CSIO_SCSFR1_CS2SPI               *((volatile uint32_t*)(0x427046B4UL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x427046B4UL))
#define bFM_MFS2_CSIO_SCSFR1_CS2SCINV             *((volatile uint32_t*)(0x427046B8UL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x427046B8UL))
#define bFM_MFS2_CSIO_SCSFR1_CS2CSLVL             *((volatile uint32_t*)(0x427046BCUL))
#define bFM4_MFS2_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x427046BCUL))

#define bFM_MFS2_CSIO_SCSFR2_CS3SPI               *((volatile uint32_t*)(0x42704714UL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x42704714UL))
#define bFM_MFS2_CSIO_SCSFR2_CS3SCINV             *((volatile uint32_t*)(0x42704718UL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x42704718UL))
#define bFM_MFS2_CSIO_SCSFR2_CS3CSLVL             *((volatile uint32_t*)(0x4270471CUL))
#define bFM4_MFS2_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4270471CUL))

#define bFM_MFS2_CSIO_SMR_SOE                     *((volatile uint32_t*)(0x42704000UL))
#define bFM4_MFS2_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x42704000UL))
#define bFM_MFS2_CSIO_SMR_SCKE                    *((volatile uint32_t*)(0x42704004UL))
#define bFM4_MFS2_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x42704004UL))
#define bFM_MFS2_CSIO_SMR_BDS                     *((volatile uint32_t*)(0x42704008UL))
#define bFM4_MFS2_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x42704008UL))
#define bFM_MFS2_CSIO_SMR_SCINV                   *((volatile uint32_t*)(0x4270400CUL))
#define bFM4_MFS2_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4270400CUL))

#define bFM_MFS2_CSIO_SSR_TBI                     *((volatile uint32_t*)(0x427040A0UL))
#define bFM4_MFS2_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x427040A0UL))
#define bFM_MFS2_CSIO_SSR_TDRE                    *((volatile uint32_t*)(0x427040A4UL))
#define bFM4_MFS2_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x427040A4UL))
#define bFM_MFS2_CSIO_SSR_RDRF                    *((volatile uint32_t*)(0x427040A8UL))
#define bFM4_MFS2_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x427040A8UL))
#define bFM_MFS2_CSIO_SSR_ORE                     *((volatile uint32_t*)(0x427040ACUL))
#define bFM4_MFS2_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x427040ACUL))
#define bFM_MFS2_CSIO_SSR_AWC                     *((volatile uint32_t*)(0x427040B0UL))
#define bFM4_MFS2_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x427040B0UL))
#define bFM_MFS2_CSIO_SSR_REC                     *((volatile uint32_t*)(0x427040BCUL))
#define bFM4_MFS2_CSIO_SSR_REC                    *((volatile uint32_t*)(0x427040BCUL))

#define bFM_MFS2_I2C_EIBCR_BEC                    *((volatile uint32_t*)(0x427043A0UL))
#define bFM4_MFS2_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x427043A0UL))
#define bFM_MFS2_I2C_EIBCR_SOCE                   *((volatile uint32_t*)(0x427043A4UL))
#define bFM4_MFS2_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x427043A4UL))
#define bFM_MFS2_I2C_EIBCR_SCLC                   *((volatile uint32_t*)(0x427043A8UL))
#define bFM4_MFS2_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x427043A8UL))
#define bFM_MFS2_I2C_EIBCR_SDAC                   *((volatile uint32_t*)(0x427043ACUL))
#define bFM4_MFS2_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x427043ACUL))
#define bFM_MFS2_I2C_EIBCR_SCLS                   *((volatile uint32_t*)(0x427043B0UL))
#define bFM4_MFS2_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x427043B0UL))
#define bFM_MFS2_I2C_EIBCR_SDAS                   *((volatile uint32_t*)(0x427043B4UL))
#define bFM4_MFS2_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x427043B4UL))

#define bFM_MFS2_I2C_FCR_FE1                      *((volatile uint32_t*)(0x42704280UL))
#define bFM4_MFS2_I2C_FCR_FE1                     *((volatile uint32_t*)(0x42704280UL))
#define bFM_MFS2_I2C_FCR_FE2                      *((volatile uint32_t*)(0x42704284UL))
#define bFM4_MFS2_I2C_FCR_FE2                     *((volatile uint32_t*)(0x42704284UL))
#define bFM_MFS2_I2C_FCR_FCL1                     *((volatile uint32_t*)(0x42704288UL))
#define bFM4_MFS2_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x42704288UL))
#define bFM_MFS2_I2C_FCR_FCL2                     *((volatile uint32_t*)(0x4270428CUL))
#define bFM4_MFS2_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4270428CUL))
#define bFM_MFS2_I2C_FCR_FSET                     *((volatile uint32_t*)(0x42704290UL))
#define bFM4_MFS2_I2C_FCR_FSET                    *((volatile uint32_t*)(0x42704290UL))
#define bFM_MFS2_I2C_FCR_FLD                      *((volatile uint32_t*)(0x42704294UL))
#define bFM4_MFS2_I2C_FCR_FLD                     *((volatile uint32_t*)(0x42704294UL))
#define bFM_MFS2_I2C_FCR_FLST                     *((volatile uint32_t*)(0x42704298UL))
#define bFM4_MFS2_I2C_FCR_FLST                    *((volatile uint32_t*)(0x42704298UL))
#define bFM_MFS2_I2C_FCR_FSEL                     *((volatile uint32_t*)(0x427042A0UL))
#define bFM4_MFS2_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x427042A0UL))
#define bFM_MFS2_I2C_FCR_FTIE                     *((volatile uint32_t*)(0x427042A4UL))
#define bFM4_MFS2_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x427042A4UL))
#define bFM_MFS2_I2C_FCR_FDRQ                     *((volatile uint32_t*)(0x427042A8UL))
#define bFM4_MFS2_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x427042A8UL))
#define bFM_MFS2_I2C_FCR_FRIIE                    *((volatile uint32_t*)(0x427042ACUL))
#define bFM4_MFS2_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x427042ACUL))
#define bFM_MFS2_I2C_FCR_FLSTE                    *((volatile uint32_t*)(0x427042B0UL))
#define bFM4_MFS2_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x427042B0UL))

