neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS2_I2C_IBCR_INT                     *((volatile uint32_t*)(0x42704020UL))
#define bFM4_MFS2_I2C_IBCR_INT                    *((volatile uint32_t*)(0x42704020UL))
#define bFM_MFS2_I2C_IBCR_BER                     *((volatile uint32_t*)(0x42704024UL))
#define bFM4_MFS2_I2C_IBCR_BER                    *((volatile uint32_t*)(0x42704024UL))
#define bFM_MFS2_I2C_IBCR_INTE                    *((volatile uint32_t*)(0x42704028UL))
#define bFM4_MFS2_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x42704028UL))
#define bFM_MFS2_I2C_IBCR_CNDE                    *((volatile uint32_t*)(0x4270402CUL))
#define bFM4_MFS2_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4270402CUL))
#define bFM_MFS2_I2C_IBCR_WSEL                    *((volatile uint32_t*)(0x42704030UL))
#define bFM4_MFS2_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x42704030UL))
#define bFM_MFS2_I2C_IBCR_ACKE                    *((volatile uint32_t*)(0x42704034UL))
#define bFM4_MFS2_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x42704034UL))
#define bFM_MFS2_I2C_IBCR_ACT_SCC                 *((volatile uint32_t*)(0x42704038UL))
#define bFM4_MFS2_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x42704038UL))
#define bFM_MFS2_I2C_IBCR_MSS                     *((volatile uint32_t*)(0x4270403CUL))
#define bFM4_MFS2_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4270403CUL))

#define bFM_MFS2_I2C_IBSR_BB                      *((volatile uint32_t*)(0x42704080UL))
#define bFM4_MFS2_I2C_IBSR_BB                     *((volatile uint32_t*)(0x42704080UL))
#define bFM_MFS2_I2C_IBSR_SPC                     *((volatile uint32_t*)(0x42704084UL))
#define bFM4_MFS2_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x42704084UL))
#define bFM_MFS2_I2C_IBSR_RSC                     *((volatile uint32_t*)(0x42704088UL))
#define bFM4_MFS2_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x42704088UL))
#define bFM_MFS2_I2C_IBSR_AL                      *((volatile uint32_t*)(0x4270408CUL))
#define bFM4_MFS2_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4270408CUL))
#define bFM_MFS2_I2C_IBSR_TRX                     *((volatile uint32_t*)(0x42704090UL))
#define bFM4_MFS2_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x42704090UL))
#define bFM_MFS2_I2C_IBSR_RSA                     *((volatile uint32_t*)(0x42704094UL))
#define bFM4_MFS2_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x42704094UL))
#define bFM_MFS2_I2C_IBSR_RACK                    *((volatile uint32_t*)(0x42704098UL))
#define bFM4_MFS2_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x42704098UL))
#define bFM_MFS2_I2C_IBSR_FBT                     *((volatile uint32_t*)(0x4270409CUL))
#define bFM4_MFS2_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4270409CUL))

#define bFM_MFS2_I2C_ISBA_SAEN                    *((volatile uint32_t*)(0x4270421CUL))
#define bFM4_MFS2_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4270421CUL))

#define bFM_MFS2_I2C_ISMK_EN                      *((volatile uint32_t*)(0x4270423CUL))
#define bFM4_MFS2_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4270423CUL))

#define bFM_MFS2_I2C_SMR_TIE                      *((volatile uint32_t*)(0x42704008UL))
#define bFM4_MFS2_I2C_SMR_TIE                     *((volatile uint32_t*)(0x42704008UL))
#define bFM_MFS2_I2C_SMR_RIE                      *((volatile uint32_t*)(0x4270400CUL))
#define bFM4_MFS2_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4270400CUL))

#define bFM_MFS2_I2C_SSR_TBI                      *((volatile uint32_t*)(0x427040A0UL))
#define bFM4_MFS2_I2C_SSR_TBI                     *((volatile uint32_t*)(0x427040A0UL))
#define bFM_MFS2_I2C_SSR_TDRE                     *((volatile uint32_t*)(0x427040A4UL))
#define bFM4_MFS2_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x427040A4UL))
#define bFM_MFS2_I2C_SSR_RDRF                     *((volatile uint32_t*)(0x427040A8UL))
#define bFM4_MFS2_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x427040A8UL))
#define bFM_MFS2_I2C_SSR_ORE                      *((volatile uint32_t*)(0x427040ACUL))
#define bFM4_MFS2_I2C_SSR_ORE                     *((volatile uint32_t*)(0x427040ACUL))
#define bFM_MFS2_I2C_SSR_TBIE                     *((volatile uint32_t*)(0x427040B0UL))
#define bFM4_MFS2_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x427040B0UL))
#define bFM_MFS2_I2C_SSR_DMA                      *((volatile uint32_t*)(0x427040B4UL))
#define bFM4_MFS2_I2C_SSR_DMA                     *((volatile uint32_t*)(0x427040B4UL))
#define bFM_MFS2_I2C_SSR_TSET                     *((volatile uint32_t*)(0x427040B8UL))
#define bFM4_MFS2_I2C_SSR_TSET                    *((volatile uint32_t*)(0x427040B8UL))
#define bFM_MFS2_I2C_SSR_REC                      *((volatile uint32_t*)(0x427040BCUL))
#define bFM4_MFS2_I2C_SSR_REC                     *((volatile uint32_t*)(0x427040BCUL))

#define bFM_MFS2_LIN_BGR_EXT                      *((volatile uint32_t*)(0x427041BCUL))
#define bFM4_MFS2_LIN_BGR_EXT                     *((volatile uint32_t*)(0x427041BCUL))

#define bFM_MFS2_LIN_ESCR_LBIE                    *((volatile uint32_t*)(0x42704090UL))
#define bFM4_MFS2_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x42704090UL))
#define bFM_MFS2_LIN_ESCR_ESBL                    *((volatile uint32_t*)(0x42704098UL))
#define bFM4_MFS2_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x42704098UL))

#define bFM_MFS2_LIN_FCR_FE1                      *((volatile uint32_t*)(0x42704280UL))
#define bFM4_MFS2_LIN_FCR_FE1                     *((volatile uint32_t*)(0x42704280UL))
#define bFM_MFS2_LIN_FCR_FE2                      *((volatile uint32_t*)(0x42704284UL))
#define bFM4_MFS2_LIN_FCR_FE2                     *((volatile uint32_t*)(0x42704284UL))
#define bFM_MFS2_LIN_FCR_FCL1                     *((volatile uint32_t*)(0x42704288UL))
#define bFM4_MFS2_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x42704288UL))
#define bFM_MFS2_LIN_FCR_FCL2                     *((volatile uint32_t*)(0x4270428CUL))
#define bFM4_MFS2_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4270428CUL))
#define bFM_MFS2_LIN_FCR_FSET                     *((volatile uint32_t*)(0x42704290UL))
#define bFM4_MFS2_LIN_FCR_FSET                    *((volatile uint32_t*)(0x42704290UL))
#define bFM_MFS2_LIN_FCR_FLD                      *((volatile uint32_t*)(0x42704294UL))
#define bFM4_MFS2_LIN_FCR_FLD                     *((volatile uint32_t*)(0x42704294UL))
#define bFM_MFS2_LIN_FCR_FLST                     *((volatile uint32_t*)(0x42704298UL))
#define bFM4_MFS2_LIN_FCR_FLST                    *((volatile uint32_t*)(0x42704298UL))
#define bFM_MFS2_LIN_FCR_FSEL                     *((volatile uint32_t*)(0x427042A0UL))
#define bFM4_MFS2_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x427042A0UL))
#define bFM_MFS2_LIN_FCR_FTIE                     *((volatile uint32_t*)(0x427042A4UL))
#define bFM4_MFS2_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x427042A4UL))
#define bFM_MFS2_LIN_FCR_FDRQ                     *((volatile uint32_t*)(0x427042A8UL))
#define bFM4_MFS2_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x427042A8UL))
#define bFM_MFS2_LIN_FCR_FRIIE                    *((volatile uint32_t*)(0x427042ACUL))
#define bFM4_MFS2_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x427042ACUL))
#define bFM_MFS2_LIN_FCR_FLSTE                    *((volatile uint32_t*)(0x427042B0UL))
#define bFM4_MFS2_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x427042B0UL))

