neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** MFS Registers MFS3
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS3_CSIO_ESCR_CSFE                   *((volatile uint32_t*)(0x42706094UL))
#define bFM4_MFS3_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x42706094UL))
#define bFM_MFS3_CSIO_ESCR_L3                     *((volatile uint32_t*)(0x42706098UL))
#define bFM4_MFS3_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x42706098UL))
#define bFM_MFS3_CSIO_ESCR_SOP                    *((volatile uint32_t*)(0x4270609CUL))
#define bFM4_MFS3_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4270609CUL))

#define bFM_MFS3_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x42706280UL))
#define bFM4_MFS3_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42706280UL))
#define bFM_MFS3_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x42706284UL))
#define bFM4_MFS3_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42706284UL))
#define bFM_MFS3_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x42706288UL))
#define bFM4_MFS3_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42706288UL))
#define bFM_MFS3_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4270628CUL))
#define bFM4_MFS3_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4270628CUL))
#define bFM_MFS3_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x42706290UL))
#define bFM4_MFS3_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42706290UL))
#define bFM_MFS3_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x42706294UL))
#define bFM4_MFS3_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42706294UL))
#define bFM_MFS3_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x42706298UL))
#define bFM4_MFS3_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42706298UL))
#define bFM_MFS3_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x427062A0UL))
#define bFM4_MFS3_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427062A0UL))
#define bFM_MFS3_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x427062A4UL))
#define bFM4_MFS3_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427062A4UL))
#define bFM_MFS3_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x427062A8UL))
#define bFM4_MFS3_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427062A8UL))
#define bFM_MFS3_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x427062ACUL))
#define bFM4_MFS3_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427062ACUL))
#define bFM_MFS3_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x427062B0UL))
#define bFM4_MFS3_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427062B0UL))

#define bFM_MFS3_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x42706480UL))
#define bFM4_MFS3_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42706480UL))
#define bFM_MFS3_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x42706498UL))
#define bFM4_MFS3_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42706498UL))
#define bFM_MFS3_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4270649CUL))
#define bFM4_MFS3_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4270649CUL))
#define bFM_MFS3_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x427064A0UL))
#define bFM4_MFS3_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427064A0UL))
#define bFM_MFS3_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x427064ACUL))
#define bFM4_MFS3_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427064ACUL))
#define bFM_MFS3_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x427064B0UL))
#define bFM4_MFS3_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427064B0UL))
#define bFM_MFS3_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x427064B4UL))
#define bFM4_MFS3_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427064B4UL))

#define bFM_MFS3_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x42706020UL))
#define bFM4_MFS3_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42706020UL))
#define bFM_MFS3_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x42706024UL))
#define bFM4_MFS3_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42706024UL))
#define bFM_MFS3_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x42706028UL))
#define bFM4_MFS3_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42706028UL))
#define bFM_MFS3_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4270602CUL))
#define bFM4_MFS3_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4270602CUL))
#define bFM_MFS3_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x42706030UL))
#define bFM4_MFS3_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42706030UL))
#define bFM_MFS3_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x42706034UL))
#define bFM4_MFS3_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42706034UL))
#define bFM_MFS3_CSIO_SCR_MS                      *((volatile uint32_t*)(0x42706038UL))
#define bFM4_MFS3_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42706038UL))
#define bFM_MFS3_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4270603CUL))
#define bFM4_MFS3_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4270603CUL))

#define bFM_MFS3_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x42706600UL))
#define bFM4_MFS3_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42706600UL))
#define bFM_MFS3_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x42706604UL))
#define bFM4_MFS3_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42706604UL))
#define bFM_MFS3_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x42706608UL))
#define bFM4_MFS3_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42706608UL))
#define bFM_MFS3_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4270660CUL))
#define bFM4_MFS3_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4270660CUL))
#define bFM_MFS3_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x42706610UL))
#define bFM4_MFS3_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42706610UL))
#define bFM_MFS3_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x42706614UL))
#define bFM4_MFS3_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42706614UL))
#define bFM_MFS3_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x42706624UL))
#define bFM4_MFS3_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42706624UL))

#define bFM_MFS3_CSIO_SCSFR0_CS1SPI               *((volatile uint32_t*)(0x42706694UL))
#define bFM4_MFS3_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x42706694UL))
#define bFM_MFS3_CSIO_SCSFR0_CS1SCINV             *((volatile uint32_t*)(0x42706698UL))
#define bFM4_MFS3_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x42706698UL))
#define bFM_MFS3_CSIO_SCSFR0_CS1CSLVL             *((volatile uint32_t*)(0x4270669CUL))
#define bFM4_MFS3_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4270669CUL))

#define bFM_MFS3_CSIO_SCSFR1_CS2SPI               *((volatile uint32_t*)(0x427066B4UL))
#define bFM4_MFS3_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x427066B4UL))
#define bFM_MFS3_CSIO_SCSFR1_CS2SCINV             *((volatile uint32_t*)(0x427066B8UL))
#define bFM4_MFS3_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x427066B8UL))
#define bFM_MFS3_CSIO_SCSFR1_CS2CSLVL             *((volatile uint32_t*)(0x427066BCUL))
#define bFM4_MFS3_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x427066BCUL))

#define bFM_MFS3_CSIO_SCSFR2_CS3SPI               *((volatile uint32_t*)(0x42706714UL))
#define bFM4_MFS3_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x42706714UL))
#define bFM_MFS3_CSIO_SCSFR2_CS3SCINV             *((volatile uint32_t*)(0x42706718UL))
#define bFM4_MFS3_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x42706718UL))
#define bFM_MFS3_CSIO_SCSFR2_CS3CSLVL             *((volatile uint32_t*)(0x4270671CUL))
#define bFM4_MFS3_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4270671CUL))

#define bFM_MFS3_CSIO_SMR_SOE                     *((volatile uint32_t*)(0x42706000UL))
#define bFM4_MFS3_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x42706000UL))
#define bFM_MFS3_CSIO_SMR_SCKE                    *((volatile uint32_t*)(0x42706004UL))
#define bFM4_MFS3_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x42706004UL))
#define bFM_MFS3_CSIO_SMR_BDS                     *((volatile uint32_t*)(0x42706008UL))
#define bFM4_MFS3_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x42706008UL))
#define bFM_MFS3_CSIO_SMR_SCINV                   *((volatile uint32_t*)(0x4270600CUL))
#define bFM4_MFS3_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4270600CUL))

#define bFM_MFS3_CSIO_SSR_TBI                     *((volatile uint32_t*)(0x427060A0UL))
#define bFM4_MFS3_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x427060A0UL))
#define bFM_MFS3_CSIO_SSR_TDRE                    *((volatile uint32_t*)(0x427060A4UL))
#define bFM4_MFS3_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x427060A4UL))
#define bFM_MFS3_CSIO_SSR_RDRF                    *((volatile uint32_t*)(0x427060A8UL))
#define bFM4_MFS3_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x427060A8UL))
#define bFM_MFS3_CSIO_SSR_ORE                     *((volatile uint32_t*)(0x427060ACUL))
#define bFM4_MFS3_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x427060ACUL))
#define bFM_MFS3_CSIO_SSR_AWC                     *((volatile uint32_t*)(0x427060B0UL))
#define bFM4_MFS3_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x427060B0UL))
#define bFM_MFS3_CSIO_SSR_REC                     *((volatile uint32_t*)(0x427060BCUL))
#define bFM4_MFS3_CSIO_SSR_REC                    *((volatile uint32_t*)(0x427060BCUL))

#define bFM_MFS3_I2C_EIBCR_BEC                    *((volatile uint32_t*)(0x427063A0UL))
#define bFM4_MFS3_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x427063A0UL))
#define bFM_MFS3_I2C_EIBCR_SOCE                   *((volatile uint32_t*)(0x427063A4UL))
#define bFM4_MFS3_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x427063A4UL))
#define bFM_MFS3_I2C_EIBCR_SCLC                   *((volatile uint32_t*)(0x427063A8UL))
#define bFM4_MFS3_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x427063A8UL))
#define bFM_MFS3_I2C_EIBCR_SDAC                   *((volatile uint32_t*)(0x427063ACUL))
#define bFM4_MFS3_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x427063ACUL))
#define bFM_MFS3_I2C_EIBCR_SCLS                   *((volatile uint32_t*)(0x427063B0UL))
#define bFM4_MFS3_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x427063B0UL))
#define bFM_MFS3_I2C_EIBCR_SDAS                   *((volatile uint32_t*)(0x427063B4UL))
#define bFM4_MFS3_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x427063B4UL))

#define bFM_MFS3_I2C_FCR_FE1                      *((volatile uint32_t*)(0x42706280UL))
#define bFM4_MFS3_I2C_FCR_FE1                     *((volatile uint32_t*)(0x42706280UL))
#define bFM_MFS3_I2C_FCR_FE2                      *((volatile uint32_t*)(0x42706284UL))
#define bFM4_MFS3_I2C_FCR_FE2                     *((volatile uint32_t*)(0x42706284UL))
#define bFM_MFS3_I2C_FCR_FCL1                     *((volatile uint32_t*)(0x42706288UL))
#define bFM4_MFS3_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x42706288UL))
#define bFM_MFS3_I2C_FCR_FCL2                     *((volatile uint32_t*)(0x4270628CUL))
#define bFM4_MFS3_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4270628CUL))
#define bFM_MFS3_I2C_FCR_FSET                     *((volatile uint32_t*)(0x42706290UL))
#define bFM4_MFS3_I2C_FCR_FSET                    *((volatile uint32_t*)(0x42706290UL))
#define bFM_MFS3_I2C_FCR_FLD                      *((volatile uint32_t*)(0x42706294UL))
#define bFM4_MFS3_I2C_FCR_FLD                     *((volatile uint32_t*)(0x42706294UL))
#define bFM_MFS3_I2C_FCR_FLST                     *((volatile uint32_t*)(0x42706298UL))
#define bFM4_MFS3_I2C_FCR_FLST                    *((volatile uint32_t*)(0x42706298UL))
#define bFM_MFS3_I2C_FCR_FSEL                     *((volatile uint32_t*)(0x427062A0UL))
#define bFM4_MFS3_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x427062A0UL))
#define bFM_MFS3_I2C_FCR_FTIE                     *((volatile uint32_t*)(0x427062A4UL))
#define bFM4_MFS3_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x427062A4UL))
#define bFM_MFS3_I2C_FCR_FDRQ                     *((volatile uint32_t*)(0x427062A8UL))
#define bFM4_MFS3_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x427062A8UL))
#define bFM_MFS3_I2C_FCR_FRIIE                    *((volatile uint32_t*)(0x427062ACUL))
#define bFM4_MFS3_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x427062ACUL))
#define bFM_MFS3_I2C_FCR_FLSTE                    *((volatile uint32_t*)(0x427062B0UL))
#define bFM4_MFS3_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x427062B0UL))

#define bFM_MFS3_I2C_IBCR_INT                     *((volatile uint32_t*)(0x42706020UL))
#define bFM4_MFS3_I2C_IBCR_INT                    *((volatile uint32_t*)(0x42706020UL))
#define bFM_MFS3_I2C_IBCR_BER                     *((volatile uint32_t*)(0x42706024UL))
#define bFM4_MFS3_I2C_IBCR_BER                    *((volatile uint32_t*)(0x42706024UL))
#define bFM_MFS3_I2C_IBCR_INTE                    *((volatile uint32_t*)(0x42706028UL))
#define bFM4_MFS3_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x42706028UL))
#define bFM_MFS3_I2C_IBCR_CNDE                    *((volatile uint32_t*)(0x4270602CUL))
#define bFM4_MFS3_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4270602CUL))
#define bFM_MFS3_I2C_IBCR_WSEL                    *((volatile uint32_t*)(0x42706030UL))
#define bFM4_MFS3_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x42706030UL))
#define bFM_MFS3_I2C_IBCR_ACKE                    *((volatile uint32_t*)(0x42706034UL))
#define bFM4_MFS3_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x42706034UL))
#define bFM_MFS3_I2C_IBCR_ACT_SCC                 *((volatile uint32_t*)(0x42706038UL))
#define bFM4_MFS3_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x42706038UL))
#define bFM_MFS3_I2C_IBCR_MSS                     *((volatile uint32_t*)(0x4270603CUL))
#define bFM4_MFS3_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4270603CUL))

