neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS3_I2C_IBSR_BB                      *((volatile uint32_t*)(0x42706080UL))
#define bFM4_MFS3_I2C_IBSR_BB                     *((volatile uint32_t*)(0x42706080UL))
#define bFM_MFS3_I2C_IBSR_SPC                     *((volatile uint32_t*)(0x42706084UL))
#define bFM4_MFS3_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x42706084UL))
#define bFM_MFS3_I2C_IBSR_RSC                     *((volatile uint32_t*)(0x42706088UL))
#define bFM4_MFS3_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x42706088UL))
#define bFM_MFS3_I2C_IBSR_AL                      *((volatile uint32_t*)(0x4270608CUL))
#define bFM4_MFS3_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4270608CUL))
#define bFM_MFS3_I2C_IBSR_TRX                     *((volatile uint32_t*)(0x42706090UL))
#define bFM4_MFS3_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x42706090UL))
#define bFM_MFS3_I2C_IBSR_RSA                     *((volatile uint32_t*)(0x42706094UL))
#define bFM4_MFS3_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x42706094UL))
#define bFM_MFS3_I2C_IBSR_RACK                    *((volatile uint32_t*)(0x42706098UL))
#define bFM4_MFS3_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x42706098UL))
#define bFM_MFS3_I2C_IBSR_FBT                     *((volatile uint32_t*)(0x4270609CUL))
#define bFM4_MFS3_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4270609CUL))

#define bFM_MFS3_I2C_ISBA_SAEN                    *((volatile uint32_t*)(0x4270621CUL))
#define bFM4_MFS3_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4270621CUL))

#define bFM_MFS3_I2C_ISMK_EN                      *((volatile uint32_t*)(0x4270623CUL))
#define bFM4_MFS3_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4270623CUL))

#define bFM_MFS3_I2C_SMR_TIE                      *((volatile uint32_t*)(0x42706008UL))
#define bFM4_MFS3_I2C_SMR_TIE                     *((volatile uint32_t*)(0x42706008UL))
#define bFM_MFS3_I2C_SMR_RIE                      *((volatile uint32_t*)(0x4270600CUL))
#define bFM4_MFS3_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4270600CUL))

#define bFM_MFS3_I2C_SSR_TBI                      *((volatile uint32_t*)(0x427060A0UL))
#define bFM4_MFS3_I2C_SSR_TBI                     *((volatile uint32_t*)(0x427060A0UL))
#define bFM_MFS3_I2C_SSR_TDRE                     *((volatile uint32_t*)(0x427060A4UL))
#define bFM4_MFS3_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x427060A4UL))
#define bFM_MFS3_I2C_SSR_RDRF                     *((volatile uint32_t*)(0x427060A8UL))
#define bFM4_MFS3_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x427060A8UL))
#define bFM_MFS3_I2C_SSR_ORE                      *((volatile uint32_t*)(0x427060ACUL))
#define bFM4_MFS3_I2C_SSR_ORE                     *((volatile uint32_t*)(0x427060ACUL))
#define bFM_MFS3_I2C_SSR_TBIE                     *((volatile uint32_t*)(0x427060B0UL))
#define bFM4_MFS3_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x427060B0UL))
#define bFM_MFS3_I2C_SSR_DMA                      *((volatile uint32_t*)(0x427060B4UL))
#define bFM4_MFS3_I2C_SSR_DMA                     *((volatile uint32_t*)(0x427060B4UL))
#define bFM_MFS3_I2C_SSR_TSET                     *((volatile uint32_t*)(0x427060B8UL))
#define bFM4_MFS3_I2C_SSR_TSET                    *((volatile uint32_t*)(0x427060B8UL))
#define bFM_MFS3_I2C_SSR_REC                      *((volatile uint32_t*)(0x427060BCUL))
#define bFM4_MFS3_I2C_SSR_REC                     *((volatile uint32_t*)(0x427060BCUL))

#define bFM_MFS3_LIN_BGR_EXT                      *((volatile uint32_t*)(0x427061BCUL))
#define bFM4_MFS3_LIN_BGR_EXT                     *((volatile uint32_t*)(0x427061BCUL))

#define bFM_MFS3_LIN_ESCR_LBIE                    *((volatile uint32_t*)(0x42706090UL))
#define bFM4_MFS3_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x42706090UL))
#define bFM_MFS3_LIN_ESCR_ESBL                    *((volatile uint32_t*)(0x42706098UL))
#define bFM4_MFS3_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x42706098UL))

#define bFM_MFS3_LIN_FCR_FE1                      *((volatile uint32_t*)(0x42706280UL))
#define bFM4_MFS3_LIN_FCR_FE1                     *((volatile uint32_t*)(0x42706280UL))
#define bFM_MFS3_LIN_FCR_FE2                      *((volatile uint32_t*)(0x42706284UL))
#define bFM4_MFS3_LIN_FCR_FE2                     *((volatile uint32_t*)(0x42706284UL))
#define bFM_MFS3_LIN_FCR_FCL1                     *((volatile uint32_t*)(0x42706288UL))
#define bFM4_MFS3_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x42706288UL))
#define bFM_MFS3_LIN_FCR_FCL2                     *((volatile uint32_t*)(0x4270628CUL))
#define bFM4_MFS3_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4270628CUL))
#define bFM_MFS3_LIN_FCR_FSET                     *((volatile uint32_t*)(0x42706290UL))
#define bFM4_MFS3_LIN_FCR_FSET                    *((volatile uint32_t*)(0x42706290UL))
#define bFM_MFS3_LIN_FCR_FLD                      *((volatile uint32_t*)(0x42706294UL))
#define bFM4_MFS3_LIN_FCR_FLD                     *((volatile uint32_t*)(0x42706294UL))
#define bFM_MFS3_LIN_FCR_FLST                     *((volatile uint32_t*)(0x42706298UL))
#define bFM4_MFS3_LIN_FCR_FLST                    *((volatile uint32_t*)(0x42706298UL))
#define bFM_MFS3_LIN_FCR_FSEL                     *((volatile uint32_t*)(0x427062A0UL))
#define bFM4_MFS3_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x427062A0UL))
#define bFM_MFS3_LIN_FCR_FTIE                     *((volatile uint32_t*)(0x427062A4UL))
#define bFM4_MFS3_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x427062A4UL))
#define bFM_MFS3_LIN_FCR_FDRQ                     *((volatile uint32_t*)(0x427062A8UL))
#define bFM4_MFS3_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x427062A8UL))
#define bFM_MFS3_LIN_FCR_FRIIE                    *((volatile uint32_t*)(0x427062ACUL))
#define bFM4_MFS3_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x427062ACUL))
#define bFM_MFS3_LIN_FCR_FLSTE                    *((volatile uint32_t*)(0x427062B0UL))
#define bFM4_MFS3_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x427062B0UL))

#define bFM_MFS3_LIN_SCR_TXE                      *((volatile uint32_t*)(0x42706020UL))
#define bFM4_MFS3_LIN_SCR_TXE                     *((volatile uint32_t*)(0x42706020UL))
#define bFM_MFS3_LIN_SCR_RXE                      *((volatile uint32_t*)(0x42706024UL))
#define bFM4_MFS3_LIN_SCR_RXE                     *((volatile uint32_t*)(0x42706024UL))
#define bFM_MFS3_LIN_SCR_TBIE                     *((volatile uint32_t*)(0x42706028UL))
#define bFM4_MFS3_LIN_SCR_TBIE                    *((volatile uint32_t*)(0x42706028UL))
#define bFM_MFS3_LIN_SCR_TIE                      *((volatile uint32_t*)(0x4270602CUL))
#define bFM4_MFS3_LIN_SCR_TIE                     *((volatile uint32_t*)(0x4270602CUL))
#define bFM_MFS3_LIN_SCR_RIE                      *((volatile uint32_t*)(0x42706030UL))
#define bFM4_MFS3_LIN_SCR_RIE                     *((volatile uint32_t*)(0x42706030UL))
#define bFM_MFS3_LIN_SCR_LBR                      *((volatile uint32_t*)(0x42706034UL))
#define bFM4_MFS3_LIN_SCR_LBR                     *((volatile uint32_t*)(0x42706034UL))
#define bFM_MFS3_LIN_SCR_MS                       *((volatile uint32_t*)(0x42706038UL))
#define bFM4_MFS3_LIN_SCR_MS                      *((volatile uint32_t*)(0x42706038UL))
#define bFM_MFS3_LIN_SCR_UPCL                     *((volatile uint32_t*)(0x4270603CUL))
#define bFM4_MFS3_LIN_SCR_UPCL                    *((volatile uint32_t*)(0x4270603CUL))

