neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS3_LIN_SMR_SOE                      *((volatile uint32_t*)(0x42706000UL))
#define bFM4_MFS3_LIN_SMR_SOE                     *((volatile uint32_t*)(0x42706000UL))
#define bFM_MFS3_LIN_SMR_SBL                      *((volatile uint32_t*)(0x4270600CUL))
#define bFM4_MFS3_LIN_SMR_SBL                     *((volatile uint32_t*)(0x4270600CUL))
#define bFM_MFS3_LIN_SMR_WUCR                     *((volatile uint32_t*)(0x42706010UL))
#define bFM4_MFS3_LIN_SMR_WUCR                    *((volatile uint32_t*)(0x42706010UL))

#define bFM_MFS3_LIN_SSR_TBI                      *((volatile uint32_t*)(0x427060A0UL))
#define bFM4_MFS3_LIN_SSR_TBI                     *((volatile uint32_t*)(0x427060A0UL))
#define bFM_MFS3_LIN_SSR_TDRE                     *((volatile uint32_t*)(0x427060A4UL))
#define bFM4_MFS3_LIN_SSR_TDRE                    *((volatile uint32_t*)(0x427060A4UL))
#define bFM_MFS3_LIN_SSR_RDRF                     *((volatile uint32_t*)(0x427060A8UL))
#define bFM4_MFS3_LIN_SSR_RDRF                    *((volatile uint32_t*)(0x427060A8UL))
#define bFM_MFS3_LIN_SSR_ORE                      *((volatile uint32_t*)(0x427060ACUL))
#define bFM4_MFS3_LIN_SSR_ORE                     *((volatile uint32_t*)(0x427060ACUL))
#define bFM_MFS3_LIN_SSR_FRE                      *((volatile uint32_t*)(0x427060B0UL))
#define bFM4_MFS3_LIN_SSR_FRE                     *((volatile uint32_t*)(0x427060B0UL))
#define bFM_MFS3_LIN_SSR_LBD                      *((volatile uint32_t*)(0x427060B4UL))
#define bFM4_MFS3_LIN_SSR_LBD                     *((volatile uint32_t*)(0x427060B4UL))
#define bFM_MFS3_LIN_SSR_REC                      *((volatile uint32_t*)(0x427060BCUL))
#define bFM4_MFS3_LIN_SSR_REC                     *((volatile uint32_t*)(0x427060BCUL))

#define bFM_MFS3_UART_BGR_EXT                     *((volatile uint32_t*)(0x427061BCUL))
#define bFM4_MFS3_UART_BGR_EXT                    *((volatile uint32_t*)(0x427061BCUL))

#define bFM_MFS3_UART_ESCR_P                      *((volatile uint32_t*)(0x4270608CUL))
#define bFM4_MFS3_UART_ESCR_P                     *((volatile uint32_t*)(0x4270608CUL))
#define bFM_MFS3_UART_ESCR_PEN                    *((volatile uint32_t*)(0x42706090UL))
#define bFM4_MFS3_UART_ESCR_PEN                   *((volatile uint32_t*)(0x42706090UL))
#define bFM_MFS3_UART_ESCR_INV                    *((volatile uint32_t*)(0x42706094UL))
#define bFM4_MFS3_UART_ESCR_INV                   *((volatile uint32_t*)(0x42706094UL))
#define bFM_MFS3_UART_ESCR_ESBL                   *((volatile uint32_t*)(0x42706098UL))
#define bFM4_MFS3_UART_ESCR_ESBL                  *((volatile uint32_t*)(0x42706098UL))
#define bFM_MFS3_UART_ESCR_FLWEN                  *((volatile uint32_t*)(0x4270609CUL))
#define bFM4_MFS3_UART_ESCR_FLWEN                 *((volatile uint32_t*)(0x4270609CUL))

#define bFM_MFS3_UART_FCR_FE1                     *((volatile uint32_t*)(0x42706280UL))
#define bFM4_MFS3_UART_FCR_FE1                    *((volatile uint32_t*)(0x42706280UL))
#define bFM_MFS3_UART_FCR_FE2                     *((volatile uint32_t*)(0x42706284UL))
#define bFM4_MFS3_UART_FCR_FE2                    *((volatile uint32_t*)(0x42706284UL))
#define bFM_MFS3_UART_FCR_FCL1                    *((volatile uint32_t*)(0x42706288UL))
#define bFM4_MFS3_UART_FCR_FCL1                   *((volatile uint32_t*)(0x42706288UL))
#define bFM_MFS3_UART_FCR_FCL2                    *((volatile uint32_t*)(0x4270628CUL))
#define bFM4_MFS3_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4270628CUL))
#define bFM_MFS3_UART_FCR_FSET                    *((volatile uint32_t*)(0x42706290UL))
#define bFM4_MFS3_UART_FCR_FSET                   *((volatile uint32_t*)(0x42706290UL))
#define bFM_MFS3_UART_FCR_FLD                     *((volatile uint32_t*)(0x42706294UL))
#define bFM4_MFS3_UART_FCR_FLD                    *((volatile uint32_t*)(0x42706294UL))
#define bFM_MFS3_UART_FCR_FLST                    *((volatile uint32_t*)(0x42706298UL))
#define bFM4_MFS3_UART_FCR_FLST                   *((volatile uint32_t*)(0x42706298UL))
#define bFM_MFS3_UART_FCR_FSEL                    *((volatile uint32_t*)(0x427062A0UL))
#define bFM4_MFS3_UART_FCR_FSEL                   *((volatile uint32_t*)(0x427062A0UL))
#define bFM_MFS3_UART_FCR_FTIE                    *((volatile uint32_t*)(0x427062A4UL))
#define bFM4_MFS3_UART_FCR_FTIE                   *((volatile uint32_t*)(0x427062A4UL))
#define bFM_MFS3_UART_FCR_FDRQ                    *((volatile uint32_t*)(0x427062A8UL))
#define bFM4_MFS3_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x427062A8UL))
#define bFM_MFS3_UART_FCR_FRIIE                   *((volatile uint32_t*)(0x427062ACUL))
#define bFM4_MFS3_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x427062ACUL))
#define bFM_MFS3_UART_FCR_FLSTE                   *((volatile uint32_t*)(0x427062B0UL))
#define bFM4_MFS3_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x427062B0UL))

#define bFM_MFS3_UART_SCR_TXE                     *((volatile uint32_t*)(0x42706020UL))
#define bFM4_MFS3_UART_SCR_TXE                    *((volatile uint32_t*)(0x42706020UL))
#define bFM_MFS3_UART_SCR_RXE                     *((volatile uint32_t*)(0x42706024UL))
#define bFM4_MFS3_UART_SCR_RXE                    *((volatile uint32_t*)(0x42706024UL))
#define bFM_MFS3_UART_SCR_TBIE                    *((volatile uint32_t*)(0x42706028UL))
#define bFM4_MFS3_UART_SCR_TBIE                   *((volatile uint32_t*)(0x42706028UL))
#define bFM_MFS3_UART_SCR_TIE                     *((volatile uint32_t*)(0x4270602CUL))
#define bFM4_MFS3_UART_SCR_TIE                    *((volatile uint32_t*)(0x4270602CUL))
#define bFM_MFS3_UART_SCR_RIE                     *((volatile uint32_t*)(0x42706030UL))
#define bFM4_MFS3_UART_SCR_RIE                    *((volatile uint32_t*)(0x42706030UL))
#define bFM_MFS3_UART_SCR_UPCL                    *((volatile uint32_t*)(0x4270603CUL))
#define bFM4_MFS3_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4270603CUL))

#define bFM_MFS3_UART_SMR_SOE                     *((volatile uint32_t*)(0x42706000UL))
#define bFM4_MFS3_UART_SMR_SOE                    *((volatile uint32_t*)(0x42706000UL))
#define bFM_MFS3_UART_SMR_BDS                     *((volatile uint32_t*)(0x42706008UL))
#define bFM4_MFS3_UART_SMR_BDS                    *((volatile uint32_t*)(0x42706008UL))
#define bFM_MFS3_UART_SMR_SBL                     *((volatile uint32_t*)(0x4270600CUL))
#define bFM4_MFS3_UART_SMR_SBL                    *((volatile uint32_t*)(0x4270600CUL))

#define bFM_MFS3_UART_SSR_TBI                     *((volatile uint32_t*)(0x427060A0UL))
#define bFM4_MFS3_UART_SSR_TBI                    *((volatile uint32_t*)(0x427060A0UL))
#define bFM_MFS3_UART_SSR_TDRE                    *((volatile uint32_t*)(0x427060A4UL))
#define bFM4_MFS3_UART_SSR_TDRE                   *((volatile uint32_t*)(0x427060A4UL))
#define bFM_MFS3_UART_SSR_RDRF                    *((volatile uint32_t*)(0x427060A8UL))
#define bFM4_MFS3_UART_SSR_RDRF                   *((volatile uint32_t*)(0x427060A8UL))
#define bFM_MFS3_UART_SSR_ORE                     *((volatile uint32_t*)(0x427060ACUL))
#define bFM4_MFS3_UART_SSR_ORE                    *((volatile uint32_t*)(0x427060ACUL))
#define bFM_MFS3_UART_SSR_FRE                     *((volatile uint32_t*)(0x427060B0UL))
#define bFM4_MFS3_UART_SSR_FRE                    *((volatile uint32_t*)(0x427060B0UL))
#define bFM_MFS3_UART_SSR_PE                      *((volatile uint32_t*)(0x427060B4UL))
#define bFM4_MFS3_UART_SSR_PE                     *((volatile uint32_t*)(0x427060B4UL))
#define bFM_MFS3_UART_SSR_REC                     *((volatile uint32_t*)(0x427060BCUL))
#define bFM4_MFS3_UART_SSR_REC                    *((volatile uint32_t*)(0x427060BCUL))


