neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** MFS Registers MFS4
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS4_CSIO_ESCR_CSFE                   *((volatile uint32_t*)(0x42708094UL))
#define bFM4_MFS4_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x42708094UL))
#define bFM_MFS4_CSIO_ESCR_L3                     *((volatile uint32_t*)(0x42708098UL))
#define bFM4_MFS4_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x42708098UL))
#define bFM_MFS4_CSIO_ESCR_SOP                    *((volatile uint32_t*)(0x4270809CUL))
#define bFM4_MFS4_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4270809CUL))

#define bFM_MFS4_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x42708280UL))
#define bFM4_MFS4_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42708280UL))
#define bFM_MFS4_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x42708284UL))
#define bFM4_MFS4_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42708284UL))
#define bFM_MFS4_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x42708288UL))
#define bFM4_MFS4_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42708288UL))
#define bFM_MFS4_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4270828CUL))
#define bFM4_MFS4_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4270828CUL))
#define bFM_MFS4_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x42708290UL))
#define bFM4_MFS4_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42708290UL))
#define bFM_MFS4_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x42708294UL))
#define bFM4_MFS4_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42708294UL))
#define bFM_MFS4_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x42708298UL))
#define bFM4_MFS4_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42708298UL))
#define bFM_MFS4_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x427082A0UL))
#define bFM4_MFS4_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427082A0UL))
#define bFM_MFS4_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x427082A4UL))
#define bFM4_MFS4_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427082A4UL))
#define bFM_MFS4_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x427082A8UL))
#define bFM4_MFS4_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427082A8UL))
#define bFM_MFS4_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x427082ACUL))
#define bFM4_MFS4_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427082ACUL))
#define bFM_MFS4_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x427082B0UL))
#define bFM4_MFS4_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427082B0UL))

#define bFM_MFS4_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x42708480UL))
#define bFM4_MFS4_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42708480UL))
#define bFM_MFS4_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x42708498UL))
#define bFM4_MFS4_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42708498UL))
#define bFM_MFS4_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4270849CUL))
#define bFM4_MFS4_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4270849CUL))
#define bFM_MFS4_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x427084A0UL))
#define bFM4_MFS4_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427084A0UL))
#define bFM_MFS4_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x427084ACUL))
#define bFM4_MFS4_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427084ACUL))
#define bFM_MFS4_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x427084B0UL))
#define bFM4_MFS4_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427084B0UL))
#define bFM_MFS4_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x427084B4UL))
#define bFM4_MFS4_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427084B4UL))

#define bFM_MFS4_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x42708020UL))
#define bFM4_MFS4_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42708020UL))
#define bFM_MFS4_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x42708024UL))
#define bFM4_MFS4_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42708024UL))
#define bFM_MFS4_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x42708028UL))
#define bFM4_MFS4_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42708028UL))
#define bFM_MFS4_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4270802CUL))
#define bFM4_MFS4_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4270802CUL))
#define bFM_MFS4_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x42708030UL))
#define bFM4_MFS4_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42708030UL))
#define bFM_MFS4_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x42708034UL))
#define bFM4_MFS4_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42708034UL))
#define bFM_MFS4_CSIO_SCR_MS                      *((volatile uint32_t*)(0x42708038UL))
#define bFM4_MFS4_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42708038UL))
#define bFM_MFS4_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4270803CUL))
#define bFM4_MFS4_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4270803CUL))

#define bFM_MFS4_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x42708600UL))
#define bFM4_MFS4_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42708600UL))
#define bFM_MFS4_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x42708604UL))
#define bFM4_MFS4_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42708604UL))
#define bFM_MFS4_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x42708608UL))
#define bFM4_MFS4_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42708608UL))
#define bFM_MFS4_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4270860CUL))
#define bFM4_MFS4_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4270860CUL))
#define bFM_MFS4_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x42708610UL))
#define bFM4_MFS4_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42708610UL))
#define bFM_MFS4_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x42708614UL))
#define bFM4_MFS4_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42708614UL))
#define bFM_MFS4_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x42708624UL))
#define bFM4_MFS4_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42708624UL))

#define bFM_MFS4_CSIO_SCSFR0_CS1SPI               *((volatile uint32_t*)(0x42708694UL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x42708694UL))
#define bFM_MFS4_CSIO_SCSFR0_CS1SCINV             *((volatile uint32_t*)(0x42708698UL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x42708698UL))
#define bFM_MFS4_CSIO_SCSFR0_CS1CSLVL             *((volatile uint32_t*)(0x4270869CUL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4270869CUL))

#define bFM_MFS4_CSIO_SCSFR1_CS2SPI               *((volatile uint32_t*)(0x427086B4UL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x427086B4UL))
#define bFM_MFS4_CSIO_SCSFR1_CS2SCINV             *((volatile uint32_t*)(0x427086B8UL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x427086B8UL))
#define bFM_MFS4_CSIO_SCSFR1_CS2CSLVL             *((volatile uint32_t*)(0x427086BCUL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x427086BCUL))

#define bFM_MFS4_CSIO_SCSFR2_CS3SPI               *((volatile uint32_t*)(0x42708714UL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x42708714UL))
#define bFM_MFS4_CSIO_SCSFR2_CS3SCINV             *((volatile uint32_t*)(0x42708718UL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x42708718UL))
#define bFM_MFS4_CSIO_SCSFR2_CS3CSLVL             *((volatile uint32_t*)(0x4270871CUL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4270871CUL))

#define bFM_MFS4_CSIO_SMR_SOE                     *((volatile uint32_t*)(0x42708000UL))
#define bFM4_MFS4_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x42708000UL))
#define bFM_MFS4_CSIO_SMR_SCKE                    *((volatile uint32_t*)(0x42708004UL))
#define bFM4_MFS4_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x42708004UL))
#define bFM_MFS4_CSIO_SMR_BDS                     *((volatile uint32_t*)(0x42708008UL))
#define bFM4_MFS4_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x42708008UL))
#define bFM_MFS4_CSIO_SMR_SCINV                   *((volatile uint32_t*)(0x4270800CUL))
#define bFM4_MFS4_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4270800CUL))

#define bFM_MFS4_CSIO_SSR_TBI                     *((volatile uint32_t*)(0x427080A0UL))
#define bFM4_MFS4_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x427080A0UL))
#define bFM_MFS4_CSIO_SSR_TDRE                    *((volatile uint32_t*)(0x427080A4UL))
#define bFM4_MFS4_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x427080A4UL))
#define bFM_MFS4_CSIO_SSR_RDRF                    *((volatile uint32_t*)(0x427080A8UL))
#define bFM4_MFS4_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x427080A8UL))
#define bFM_MFS4_CSIO_SSR_ORE                     *((volatile uint32_t*)(0x427080ACUL))
#define bFM4_MFS4_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x427080ACUL))
#define bFM_MFS4_CSIO_SSR_AWC                     *((volatile uint32_t*)(0x427080B0UL))
#define bFM4_MFS4_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x427080B0UL))
#define bFM_MFS4_CSIO_SSR_REC                     *((volatile uint32_t*)(0x427080BCUL))
#define bFM4_MFS4_CSIO_SSR_REC                    *((volatile uint32_t*)(0x427080BCUL))

#define bFM_MFS4_I2C_EIBCR_BEC                    *((volatile uint32_t*)(0x427083A0UL))
#define bFM4_MFS4_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x427083A0UL))
#define bFM_MFS4_I2C_EIBCR_SOCE                   *((volatile uint32_t*)(0x427083A4UL))
#define bFM4_MFS4_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x427083A4UL))
#define bFM_MFS4_I2C_EIBCR_SCLC                   *((volatile uint32_t*)(0x427083A8UL))
#define bFM4_MFS4_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x427083A8UL))
#define bFM_MFS4_I2C_EIBCR_SDAC                   *((volatile uint32_t*)(0x427083ACUL))
#define bFM4_MFS4_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x427083ACUL))
#define bFM_MFS4_I2C_EIBCR_SCLS                   *((volatile uint32_t*)(0x427083B0UL))
#define bFM4_MFS4_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x427083B0UL))
#define bFM_MFS4_I2C_EIBCR_SDAS                   *((volatile uint32_t*)(0x427083B4UL))
#define bFM4_MFS4_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x427083B4UL))

#define bFM_MFS4_I2C_FCR_FE1                      *((volatile uint32_t*)(0x42708280UL))
#define bFM4_MFS4_I2C_FCR_FE1                     *((volatile uint32_t*)(0x42708280UL))
#define bFM_MFS4_I2C_FCR_FE2                      *((volatile uint32_t*)(0x42708284UL))
#define bFM4_MFS4_I2C_FCR_FE2                     *((volatile uint32_t*)(0x42708284UL))
#define bFM_MFS4_I2C_FCR_FCL1                     *((volatile uint32_t*)(0x42708288UL))
#define bFM4_MFS4_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x42708288UL))
#define bFM_MFS4_I2C_FCR_FCL2                     *((volatile uint32_t*)(0x4270828CUL))
#define bFM4_MFS4_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4270828CUL))
#define bFM_MFS4_I2C_FCR_FSET                     *((volatile uint32_t*)(0x42708290UL))
#define bFM4_MFS4_I2C_FCR_FSET                    *((volatile uint32_t*)(0x42708290UL))
#define bFM_MFS4_I2C_FCR_FLD                      *((volatile uint32_t*)(0x42708294UL))
#define bFM4_MFS4_I2C_FCR_FLD                     *((volatile uint32_t*)(0x42708294UL))
#define bFM_MFS4_I2C_FCR_FLST                     *((volatile uint32_t*)(0x42708298UL))
#define bFM4_MFS4_I2C_FCR_FLST                    *((volatile uint32_t*)(0x42708298UL))
#define bFM_MFS4_I2C_FCR_FSEL                     *((volatile uint32_t*)(0x427082A0UL))
#define bFM4_MFS4_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x427082A0UL))
#define bFM_MFS4_I2C_FCR_FTIE                     *((volatile uint32_t*)(0x427082A4UL))
#define bFM4_MFS4_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x427082A4UL))
#define bFM_MFS4_I2C_FCR_FDRQ                     *((volatile uint32_t*)(0x427082A8UL))
#define bFM4_MFS4_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x427082A8UL))
#define bFM_MFS4_I2C_FCR_FRIIE                    *((volatile uint32_t*)(0x427082ACUL))
#define bFM4_MFS4_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x427082ACUL))
#define bFM_MFS4_I2C_FCR_FLSTE                    *((volatile uint32_t*)(0x427082B0UL))
#define bFM4_MFS4_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x427082B0UL))

#define bFM_MFS4_I2C_IBCR_INT                     *((volatile uint32_t*)(0x42708020UL))
#define bFM4_MFS4_I2C_IBCR_INT                    *((volatile uint32_t*)(0x42708020UL))
#define bFM_MFS4_I2C_IBCR_BER                     *((volatile uint32_t*)(0x42708024UL))
#define bFM4_MFS4_I2C_IBCR_BER                    *((volatile uint32_t*)(0x42708024UL))
#define bFM_MFS4_I2C_IBCR_INTE                    *((volatile uint32_t*)(0x42708028UL))
#define bFM4_MFS4_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x42708028UL))
#define bFM_MFS4_I2C_IBCR_CNDE                    *((volatile uint32_t*)(0x4270802CUL))
#define bFM4_MFS4_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4270802CUL))
#define bFM_MFS4_I2C_IBCR_WSEL                    *((volatile uint32_t*)(0x42708030UL))
#define bFM4_MFS4_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x42708030UL))
#define bFM_MFS4_I2C_IBCR_ACKE                    *((volatile uint32_t*)(0x42708034UL))
#define bFM4_MFS4_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x42708034UL))
#define bFM_MFS4_I2C_IBCR_ACT_SCC                 *((volatile uint32_t*)(0x42708038UL))
#define bFM4_MFS4_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x42708038UL))
#define bFM_MFS4_I2C_IBCR_MSS                     *((volatile uint32_t*)(0x4270803CUL))
#define bFM4_MFS4_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4270803CUL))

