neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** MFS Registers MFS5
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS5_CSIO_ESCR_CSFE                   *((volatile uint32_t*)(0x4270A094UL))
#define bFM4_MFS5_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x4270A094UL))
#define bFM_MFS5_CSIO_ESCR_L3                     *((volatile uint32_t*)(0x4270A098UL))
#define bFM4_MFS5_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x4270A098UL))
#define bFM_MFS5_CSIO_ESCR_SOP                    *((volatile uint32_t*)(0x4270A09CUL))
#define bFM4_MFS5_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4270A09CUL))

#define bFM_MFS5_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x4270A280UL))
#define bFM4_MFS5_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x4270A280UL))
#define bFM_MFS5_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x4270A284UL))
#define bFM4_MFS5_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x4270A284UL))
#define bFM_MFS5_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x4270A288UL))
#define bFM4_MFS5_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x4270A288UL))
#define bFM_MFS5_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4270A28CUL))
#define bFM4_MFS5_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4270A28CUL))
#define bFM_MFS5_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x4270A290UL))
#define bFM4_MFS5_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x4270A290UL))
#define bFM_MFS5_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x4270A294UL))
#define bFM4_MFS5_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x4270A294UL))
#define bFM_MFS5_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x4270A298UL))
#define bFM4_MFS5_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x4270A298UL))
#define bFM_MFS5_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x4270A2A0UL))
#define bFM4_MFS5_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x4270A2A0UL))
#define bFM_MFS5_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x4270A2A4UL))
#define bFM4_MFS5_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x4270A2A4UL))
#define bFM_MFS5_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x4270A2A8UL))
#define bFM4_MFS5_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x4270A2A8UL))
#define bFM_MFS5_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x4270A2ACUL))
#define bFM4_MFS5_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x4270A2ACUL))
#define bFM_MFS5_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x4270A2B0UL))
#define bFM4_MFS5_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x4270A2B0UL))

#define bFM_MFS5_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x4270A480UL))
#define bFM4_MFS5_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x4270A480UL))
#define bFM_MFS5_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x4270A498UL))
#define bFM4_MFS5_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x4270A498UL))
#define bFM_MFS5_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4270A49CUL))
#define bFM4_MFS5_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4270A49CUL))
#define bFM_MFS5_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x4270A4A0UL))
#define bFM4_MFS5_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x4270A4A0UL))
#define bFM_MFS5_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x4270A4ACUL))
#define bFM4_MFS5_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x4270A4ACUL))
#define bFM_MFS5_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x4270A4B0UL))
#define bFM4_MFS5_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x4270A4B0UL))
#define bFM_MFS5_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x4270A4B4UL))
#define bFM4_MFS5_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x4270A4B4UL))

#define bFM_MFS5_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x4270A020UL))
#define bFM4_MFS5_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x4270A020UL))
#define bFM_MFS5_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x4270A024UL))
#define bFM4_MFS5_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x4270A024UL))
#define bFM_MFS5_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x4270A028UL))
#define bFM4_MFS5_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x4270A028UL))
#define bFM_MFS5_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4270A02CUL))
#define bFM4_MFS5_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4270A02CUL))
#define bFM_MFS5_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x4270A030UL))
#define bFM4_MFS5_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x4270A030UL))
#define bFM_MFS5_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x4270A034UL))
#define bFM4_MFS5_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x4270A034UL))
#define bFM_MFS5_CSIO_SCR_MS                      *((volatile uint32_t*)(0x4270A038UL))
#define bFM4_MFS5_CSIO_SCR_MS                     *((volatile uint32_t*)(0x4270A038UL))
#define bFM_MFS5_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4270A03CUL))
#define bFM4_MFS5_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4270A03CUL))

#define bFM_MFS5_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x4270A600UL))
#define bFM4_MFS5_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x4270A600UL))
#define bFM_MFS5_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x4270A604UL))
#define bFM4_MFS5_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x4270A604UL))
#define bFM_MFS5_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x4270A608UL))
#define bFM4_MFS5_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x4270A608UL))
#define bFM_MFS5_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4270A60CUL))
#define bFM4_MFS5_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4270A60CUL))
#define bFM_MFS5_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x4270A610UL))
#define bFM4_MFS5_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x4270A610UL))
#define bFM_MFS5_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x4270A614UL))
#define bFM4_MFS5_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x4270A614UL))
#define bFM_MFS5_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x4270A624UL))
#define bFM4_MFS5_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x4270A624UL))

#define bFM_MFS5_CSIO_SCSFR0_CS1SPI               *((volatile uint32_t*)(0x4270A694UL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x4270A694UL))
#define bFM_MFS5_CSIO_SCSFR0_CS1SCINV             *((volatile uint32_t*)(0x4270A698UL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x4270A698UL))
#define bFM_MFS5_CSIO_SCSFR0_CS1CSLVL             *((volatile uint32_t*)(0x4270A69CUL))
#define bFM4_MFS5_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4270A69CUL))

#define bFM_MFS5_CSIO_SCSFR1_CS2SPI               *((volatile uint32_t*)(0x4270A6B4UL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x4270A6B4UL))
#define bFM_MFS5_CSIO_SCSFR1_CS2SCINV             *((volatile uint32_t*)(0x4270A6B8UL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x4270A6B8UL))
#define bFM_MFS5_CSIO_SCSFR1_CS2CSLVL             *((volatile uint32_t*)(0x4270A6BCUL))
#define bFM4_MFS5_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x4270A6BCUL))

#define bFM_MFS5_CSIO_SCSFR2_CS3SPI               *((volatile uint32_t*)(0x4270A714UL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x4270A714UL))
#define bFM_MFS5_CSIO_SCSFR2_CS3SCINV             *((volatile uint32_t*)(0x4270A718UL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x4270A718UL))
#define bFM_MFS5_CSIO_SCSFR2_CS3CSLVL             *((volatile uint32_t*)(0x4270A71CUL))
#define bFM4_MFS5_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4270A71CUL))

