neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS5_UART_FCR_FE1                     *((volatile uint32_t*)(0x4270A280UL))
#define bFM4_MFS5_UART_FCR_FE1                    *((volatile uint32_t*)(0x4270A280UL))
#define bFM_MFS5_UART_FCR_FE2                     *((volatile uint32_t*)(0x4270A284UL))
#define bFM4_MFS5_UART_FCR_FE2                    *((volatile uint32_t*)(0x4270A284UL))
#define bFM_MFS5_UART_FCR_FCL1                    *((volatile uint32_t*)(0x4270A288UL))
#define bFM4_MFS5_UART_FCR_FCL1                   *((volatile uint32_t*)(0x4270A288UL))
#define bFM_MFS5_UART_FCR_FCL2                    *((volatile uint32_t*)(0x4270A28CUL))
#define bFM4_MFS5_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4270A28CUL))
#define bFM_MFS5_UART_FCR_FSET                    *((volatile uint32_t*)(0x4270A290UL))
#define bFM4_MFS5_UART_FCR_FSET                   *((volatile uint32_t*)(0x4270A290UL))
#define bFM_MFS5_UART_FCR_FLD                     *((volatile uint32_t*)(0x4270A294UL))
#define bFM4_MFS5_UART_FCR_FLD                    *((volatile uint32_t*)(0x4270A294UL))
#define bFM_MFS5_UART_FCR_FLST                    *((volatile uint32_t*)(0x4270A298UL))
#define bFM4_MFS5_UART_FCR_FLST                   *((volatile uint32_t*)(0x4270A298UL))
#define bFM_MFS5_UART_FCR_FSEL                    *((volatile uint32_t*)(0x4270A2A0UL))
#define bFM4_MFS5_UART_FCR_FSEL                   *((volatile uint32_t*)(0x4270A2A0UL))
#define bFM_MFS5_UART_FCR_FTIE                    *((volatile uint32_t*)(0x4270A2A4UL))
#define bFM4_MFS5_UART_FCR_FTIE                   *((volatile uint32_t*)(0x4270A2A4UL))
#define bFM_MFS5_UART_FCR_FDRQ                    *((volatile uint32_t*)(0x4270A2A8UL))
#define bFM4_MFS5_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x4270A2A8UL))
#define bFM_MFS5_UART_FCR_FRIIE                   *((volatile uint32_t*)(0x4270A2ACUL))
#define bFM4_MFS5_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x4270A2ACUL))
#define bFM_MFS5_UART_FCR_FLSTE                   *((volatile uint32_t*)(0x4270A2B0UL))
#define bFM4_MFS5_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x4270A2B0UL))

#define bFM_MFS5_UART_SCR_TXE                     *((volatile uint32_t*)(0x4270A020UL))
#define bFM4_MFS5_UART_SCR_TXE                    *((volatile uint32_t*)(0x4270A020UL))
#define bFM_MFS5_UART_SCR_RXE                     *((volatile uint32_t*)(0x4270A024UL))
#define bFM4_MFS5_UART_SCR_RXE                    *((volatile uint32_t*)(0x4270A024UL))
#define bFM_MFS5_UART_SCR_TBIE                    *((volatile uint32_t*)(0x4270A028UL))
#define bFM4_MFS5_UART_SCR_TBIE                   *((volatile uint32_t*)(0x4270A028UL))
#define bFM_MFS5_UART_SCR_TIE                     *((volatile uint32_t*)(0x4270A02CUL))
#define bFM4_MFS5_UART_SCR_TIE                    *((volatile uint32_t*)(0x4270A02CUL))
#define bFM_MFS5_UART_SCR_RIE                     *((volatile uint32_t*)(0x4270A030UL))
#define bFM4_MFS5_UART_SCR_RIE                    *((volatile uint32_t*)(0x4270A030UL))
#define bFM_MFS5_UART_SCR_UPCL                    *((volatile uint32_t*)(0x4270A03CUL))
#define bFM4_MFS5_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4270A03CUL))

#define bFM_MFS5_UART_SMR_SOE                     *((volatile uint32_t*)(0x4270A000UL))
#define bFM4_MFS5_UART_SMR_SOE                    *((volatile uint32_t*)(0x4270A000UL))
#define bFM_MFS5_UART_SMR_BDS                     *((volatile uint32_t*)(0x4270A008UL))
#define bFM4_MFS5_UART_SMR_BDS                    *((volatile uint32_t*)(0x4270A008UL))
#define bFM_MFS5_UART_SMR_SBL                     *((volatile uint32_t*)(0x4270A00CUL))
#define bFM4_MFS5_UART_SMR_SBL                    *((volatile uint32_t*)(0x4270A00CUL))

#define bFM_MFS5_UART_SSR_TBI                     *((volatile uint32_t*)(0x4270A0A0UL))
#define bFM4_MFS5_UART_SSR_TBI                    *((volatile uint32_t*)(0x4270A0A0UL))
#define bFM_MFS5_UART_SSR_TDRE                    *((volatile uint32_t*)(0x4270A0A4UL))
#define bFM4_MFS5_UART_SSR_TDRE                   *((volatile uint32_t*)(0x4270A0A4UL))
#define bFM_MFS5_UART_SSR_RDRF                    *((volatile uint32_t*)(0x4270A0A8UL))
#define bFM4_MFS5_UART_SSR_RDRF                   *((volatile uint32_t*)(0x4270A0A8UL))
#define bFM_MFS5_UART_SSR_ORE                     *((volatile uint32_t*)(0x4270A0ACUL))
#define bFM4_MFS5_UART_SSR_ORE                    *((volatile uint32_t*)(0x4270A0ACUL))
#define bFM_MFS5_UART_SSR_FRE                     *((volatile uint32_t*)(0x4270A0B0UL))
#define bFM4_MFS5_UART_SSR_FRE                    *((volatile uint32_t*)(0x4270A0B0UL))
#define bFM_MFS5_UART_SSR_PE                      *((volatile uint32_t*)(0x4270A0B4UL))
#define bFM4_MFS5_UART_SSR_PE                     *((volatile uint32_t*)(0x4270A0B4UL))
#define bFM_MFS5_UART_SSR_REC                     *((volatile uint32_t*)(0x4270A0BCUL))
#define bFM4_MFS5_UART_SSR_REC                    *((volatile uint32_t*)(0x4270A0BCUL))


/******************************************************************************
 ** MFS Registers MFS6
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS6_CSIO_ESCR_CSFE                   *((volatile uint32_t*)(0x4270C094UL))
#define bFM4_MFS6_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x4270C094UL))
#define bFM_MFS6_CSIO_ESCR_L3                     *((volatile uint32_t*)(0x4270C098UL))
#define bFM4_MFS6_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x4270C098UL))
#define bFM_MFS6_CSIO_ESCR_SOP                    *((volatile uint32_t*)(0x4270C09CUL))
#define bFM4_MFS6_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4270C09CUL))

#define bFM_MFS6_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x4270C280UL))
#define bFM4_MFS6_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x4270C280UL))
#define bFM_MFS6_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x4270C284UL))
#define bFM4_MFS6_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x4270C284UL))
#define bFM_MFS6_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x4270C288UL))
#define bFM4_MFS6_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x4270C288UL))
#define bFM_MFS6_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4270C28CUL))
#define bFM4_MFS6_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4270C28CUL))
#define bFM_MFS6_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x4270C290UL))
#define bFM4_MFS6_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x4270C290UL))
#define bFM_MFS6_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x4270C294UL))
#define bFM4_MFS6_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x4270C294UL))
#define bFM_MFS6_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x4270C298UL))
#define bFM4_MFS6_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x4270C298UL))
#define bFM_MFS6_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x4270C2A0UL))
#define bFM4_MFS6_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x4270C2A0UL))
#define bFM_MFS6_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x4270C2A4UL))
#define bFM4_MFS6_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x4270C2A4UL))
#define bFM_MFS6_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x4270C2A8UL))
#define bFM4_MFS6_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x4270C2A8UL))
#define bFM_MFS6_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x4270C2ACUL))
#define bFM4_MFS6_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x4270C2ACUL))
#define bFM_MFS6_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x4270C2B0UL))
#define bFM4_MFS6_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x4270C2B0UL))

#define bFM_MFS6_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x4270C480UL))
#define bFM4_MFS6_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x4270C480UL))
#define bFM_MFS6_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x4270C498UL))
#define bFM4_MFS6_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x4270C498UL))
#define bFM_MFS6_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4270C49CUL))
#define bFM4_MFS6_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4270C49CUL))
#define bFM_MFS6_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x4270C4A0UL))
#define bFM4_MFS6_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x4270C4A0UL))
#define bFM_MFS6_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x4270C4ACUL))
#define bFM4_MFS6_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x4270C4ACUL))
#define bFM_MFS6_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x4270C4B0UL))
#define bFM4_MFS6_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x4270C4B0UL))
#define bFM_MFS6_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x4270C4B4UL))
#define bFM4_MFS6_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x4270C4B4UL))

