neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS6_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x4270C020UL))
#define bFM4_MFS6_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x4270C020UL))
#define bFM_MFS6_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x4270C024UL))
#define bFM4_MFS6_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x4270C024UL))
#define bFM_MFS6_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x4270C028UL))
#define bFM4_MFS6_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x4270C028UL))
#define bFM_MFS6_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4270C02CUL))
#define bFM4_MFS6_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4270C02CUL))
#define bFM_MFS6_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x4270C030UL))
#define bFM4_MFS6_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x4270C030UL))
#define bFM_MFS6_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x4270C034UL))
#define bFM4_MFS6_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x4270C034UL))
#define bFM_MFS6_CSIO_SCR_MS                      *((volatile uint32_t*)(0x4270C038UL))
#define bFM4_MFS6_CSIO_SCR_MS                     *((volatile uint32_t*)(0x4270C038UL))
#define bFM_MFS6_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4270C03CUL))
#define bFM4_MFS6_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4270C03CUL))

#define bFM_MFS6_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x4270C600UL))
#define bFM4_MFS6_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x4270C600UL))
#define bFM_MFS6_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x4270C604UL))
#define bFM4_MFS6_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x4270C604UL))
#define bFM_MFS6_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x4270C608UL))
#define bFM4_MFS6_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x4270C608UL))
#define bFM_MFS6_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4270C60CUL))
#define bFM4_MFS6_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4270C60CUL))
#define bFM_MFS6_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x4270C610UL))
#define bFM4_MFS6_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x4270C610UL))
#define bFM_MFS6_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x4270C614UL))
#define bFM4_MFS6_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x4270C614UL))
#define bFM_MFS6_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x4270C624UL))
#define bFM4_MFS6_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x4270C624UL))

#define bFM_MFS6_CSIO_SCSFR0_CS1SPI               *((volatile uint32_t*)(0x4270C694UL))
#define bFM4_MFS6_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x4270C694UL))
#define bFM_MFS6_CSIO_SCSFR0_CS1SCINV             *((volatile uint32_t*)(0x4270C698UL))
#define bFM4_MFS6_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x4270C698UL))
#define bFM_MFS6_CSIO_SCSFR0_CS1CSLVL             *((volatile uint32_t*)(0x4270C69CUL))
#define bFM4_MFS6_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4270C69CUL))

#define bFM_MFS6_CSIO_SCSFR1_CS2SPI               *((volatile uint32_t*)(0x4270C6B4UL))
#define bFM4_MFS6_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x4270C6B4UL))
#define bFM_MFS6_CSIO_SCSFR1_CS2SCINV             *((volatile uint32_t*)(0x4270C6B8UL))
#define bFM4_MFS6_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x4270C6B8UL))
#define bFM_MFS6_CSIO_SCSFR1_CS2CSLVL             *((volatile uint32_t*)(0x4270C6BCUL))
#define bFM4_MFS6_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x4270C6BCUL))

#define bFM_MFS6_CSIO_SCSFR2_CS3SPI               *((volatile uint32_t*)(0x4270C714UL))
#define bFM4_MFS6_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x4270C714UL))
#define bFM_MFS6_CSIO_SCSFR2_CS3SCINV             *((volatile uint32_t*)(0x4270C718UL))
#define bFM4_MFS6_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x4270C718UL))
#define bFM_MFS6_CSIO_SCSFR2_CS3CSLVL             *((volatile uint32_t*)(0x4270C71CUL))
#define bFM4_MFS6_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4270C71CUL))

#define bFM_MFS6_CSIO_SMR_SOE                     *((volatile uint32_t*)(0x4270C000UL))
#define bFM4_MFS6_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x4270C000UL))
#define bFM_MFS6_CSIO_SMR_SCKE                    *((volatile uint32_t*)(0x4270C004UL))
#define bFM4_MFS6_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x4270C004UL))
#define bFM_MFS6_CSIO_SMR_BDS                     *((volatile uint32_t*)(0x4270C008UL))
#define bFM4_MFS6_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x4270C008UL))
#define bFM_MFS6_CSIO_SMR_SCINV                   *((volatile uint32_t*)(0x4270C00CUL))
#define bFM4_MFS6_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4270C00CUL))

#define bFM_MFS6_CSIO_SSR_TBI                     *((volatile uint32_t*)(0x4270C0A0UL))
#define bFM4_MFS6_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x4270C0A0UL))
#define bFM_MFS6_CSIO_SSR_TDRE                    *((volatile uint32_t*)(0x4270C0A4UL))
#define bFM4_MFS6_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x4270C0A4UL))
#define bFM_MFS6_CSIO_SSR_RDRF                    *((volatile uint32_t*)(0x4270C0A8UL))
#define bFM4_MFS6_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x4270C0A8UL))
#define bFM_MFS6_CSIO_SSR_ORE                     *((volatile uint32_t*)(0x4270C0ACUL))
#define bFM4_MFS6_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x4270C0ACUL))
#define bFM_MFS6_CSIO_SSR_AWC                     *((volatile uint32_t*)(0x4270C0B0UL))
#define bFM4_MFS6_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x4270C0B0UL))
#define bFM_MFS6_CSIO_SSR_REC                     *((volatile uint32_t*)(0x4270C0BCUL))
#define bFM4_MFS6_CSIO_SSR_REC                    *((volatile uint32_t*)(0x4270C0BCUL))

#define bFM_MFS6_I2C_EIBCR_BEC                    *((volatile uint32_t*)(0x4270C3A0UL))
#define bFM4_MFS6_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x4270C3A0UL))
#define bFM_MFS6_I2C_EIBCR_SOCE                   *((volatile uint32_t*)(0x4270C3A4UL))
#define bFM4_MFS6_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x4270C3A4UL))
#define bFM_MFS6_I2C_EIBCR_SCLC                   *((volatile uint32_t*)(0x4270C3A8UL))
#define bFM4_MFS6_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x4270C3A8UL))
#define bFM_MFS6_I2C_EIBCR_SDAC                   *((volatile uint32_t*)(0x4270C3ACUL))
#define bFM4_MFS6_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x4270C3ACUL))
#define bFM_MFS6_I2C_EIBCR_SCLS                   *((volatile uint32_t*)(0x4270C3B0UL))
#define bFM4_MFS6_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x4270C3B0UL))
#define bFM_MFS6_I2C_EIBCR_SDAS                   *((volatile uint32_t*)(0x4270C3B4UL))
#define bFM4_MFS6_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x4270C3B4UL))

#define bFM_MFS6_I2C_FCR_FE1                      *((volatile uint32_t*)(0x4270C280UL))
#define bFM4_MFS6_I2C_FCR_FE1                     *((volatile uint32_t*)(0x4270C280UL))
#define bFM_MFS6_I2C_FCR_FE2                      *((volatile uint32_t*)(0x4270C284UL))
#define bFM4_MFS6_I2C_FCR_FE2                     *((volatile uint32_t*)(0x4270C284UL))
#define bFM_MFS6_I2C_FCR_FCL1                     *((volatile uint32_t*)(0x4270C288UL))
#define bFM4_MFS6_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x4270C288UL))
#define bFM_MFS6_I2C_FCR_FCL2                     *((volatile uint32_t*)(0x4270C28CUL))
#define bFM4_MFS6_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4270C28CUL))
#define bFM_MFS6_I2C_FCR_FSET                     *((volatile uint32_t*)(0x4270C290UL))
#define bFM4_MFS6_I2C_FCR_FSET                    *((volatile uint32_t*)(0x4270C290UL))
#define bFM_MFS6_I2C_FCR_FLD                      *((volatile uint32_t*)(0x4270C294UL))
#define bFM4_MFS6_I2C_FCR_FLD                     *((volatile uint32_t*)(0x4270C294UL))
#define bFM_MFS6_I2C_FCR_FLST                     *((volatile uint32_t*)(0x4270C298UL))
#define bFM4_MFS6_I2C_FCR_FLST                    *((volatile uint32_t*)(0x4270C298UL))
#define bFM_MFS6_I2C_FCR_FSEL                     *((volatile uint32_t*)(0x4270C2A0UL))
#define bFM4_MFS6_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x4270C2A0UL))
#define bFM_MFS6_I2C_FCR_FTIE                     *((volatile uint32_t*)(0x4270C2A4UL))
#define bFM4_MFS6_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x4270C2A4UL))
#define bFM_MFS6_I2C_FCR_FDRQ                     *((volatile uint32_t*)(0x4270C2A8UL))
#define bFM4_MFS6_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x4270C2A8UL))
#define bFM_MFS6_I2C_FCR_FRIIE                    *((volatile uint32_t*)(0x4270C2ACUL))
#define bFM4_MFS6_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x4270C2ACUL))
#define bFM_MFS6_I2C_FCR_FLSTE                    *((volatile uint32_t*)(0x4270C2B0UL))
#define bFM4_MFS6_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x4270C2B0UL))

#define bFM_MFS6_I2C_IBCR_INT                     *((volatile uint32_t*)(0x4270C020UL))
#define bFM4_MFS6_I2C_IBCR_INT                    *((volatile uint32_t*)(0x4270C020UL))
#define bFM_MFS6_I2C_IBCR_BER                     *((volatile uint32_t*)(0x4270C024UL))
#define bFM4_MFS6_I2C_IBCR_BER                    *((volatile uint32_t*)(0x4270C024UL))
#define bFM_MFS6_I2C_IBCR_INTE                    *((volatile uint32_t*)(0x4270C028UL))
#define bFM4_MFS6_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x4270C028UL))
#define bFM_MFS6_I2C_IBCR_CNDE                    *((volatile uint32_t*)(0x4270C02CUL))
#define bFM4_MFS6_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4270C02CUL))
#define bFM_MFS6_I2C_IBCR_WSEL                    *((volatile uint32_t*)(0x4270C030UL))
#define bFM4_MFS6_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x4270C030UL))
#define bFM_MFS6_I2C_IBCR_ACKE                    *((volatile uint32_t*)(0x4270C034UL))
#define bFM4_MFS6_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x4270C034UL))
#define bFM_MFS6_I2C_IBCR_ACT_SCC                 *((volatile uint32_t*)(0x4270C038UL))
#define bFM4_MFS6_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x4270C038UL))
#define bFM_MFS6_I2C_IBCR_MSS                     *((volatile uint32_t*)(0x4270C03CUL))
#define bFM4_MFS6_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4270C03CUL))

#define bFM_MFS6_I2C_IBSR_BB                      *((volatile uint32_t*)(0x4270C080UL))
#define bFM4_MFS6_I2C_IBSR_BB                     *((volatile uint32_t*)(0x4270C080UL))
#define bFM_MFS6_I2C_IBSR_SPC                     *((volatile uint32_t*)(0x4270C084UL))
#define bFM4_MFS6_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x4270C084UL))
#define bFM_MFS6_I2C_IBSR_RSC                     *((volatile uint32_t*)(0x4270C088UL))
#define bFM4_MFS6_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x4270C088UL))
#define bFM_MFS6_I2C_IBSR_AL                      *((volatile uint32_t*)(0x4270C08CUL))
#define bFM4_MFS6_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4270C08CUL))
#define bFM_MFS6_I2C_IBSR_TRX                     *((volatile uint32_t*)(0x4270C090UL))
#define bFM4_MFS6_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x4270C090UL))
#define bFM_MFS6_I2C_IBSR_RSA                     *((volatile uint32_t*)(0x4270C094UL))
#define bFM4_MFS6_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x4270C094UL))
#define bFM_MFS6_I2C_IBSR_RACK                    *((volatile uint32_t*)(0x4270C098UL))
#define bFM4_MFS6_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x4270C098UL))
#define bFM_MFS6_I2C_IBSR_FBT                     *((volatile uint32_t*)(0x4270C09CUL))
#define bFM4_MFS6_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4270C09CUL))

#define bFM_MFS6_I2C_ISBA_SAEN                    *((volatile uint32_t*)(0x4270C21CUL))
#define bFM4_MFS6_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4270C21CUL))

#define bFM_MFS6_I2C_ISMK_EN                      *((volatile uint32_t*)(0x4270C23CUL))
#define bFM4_MFS6_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4270C23CUL))

#define bFM_MFS6_I2C_SMR_TIE                      *((volatile uint32_t*)(0x4270C008UL))
#define bFM4_MFS6_I2C_SMR_TIE                     *((volatile uint32_t*)(0x4270C008UL))
#define bFM_MFS6_I2C_SMR_RIE                      *((volatile uint32_t*)(0x4270C00CUL))
#define bFM4_MFS6_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4270C00CUL))

#define bFM_MFS6_I2C_SSR_TBI                      *((volatile uint32_t*)(0x4270C0A0UL))
#define bFM4_MFS6_I2C_SSR_TBI                     *((volatile uint32_t*)(0x4270C0A0UL))
#define bFM_MFS6_I2C_SSR_TDRE                     *((volatile uint32_t*)(0x4270C0A4UL))
#define bFM4_MFS6_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x4270C0A4UL))
#define bFM_MFS6_I2C_SSR_RDRF                     *((volatile uint32_t*)(0x4270C0A8UL))
#define bFM4_MFS6_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x4270C0A8UL))
#define bFM_MFS6_I2C_SSR_ORE                      *((volatile uint32_t*)(0x4270C0ACUL))
#define bFM4_MFS6_I2C_SSR_ORE                     *((volatile uint32_t*)(0x4270C0ACUL))
#define bFM_MFS6_I2C_SSR_TBIE                     *((volatile uint32_t*)(0x4270C0B0UL))
#define bFM4_MFS6_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x4270C0B0UL))
#define bFM_MFS6_I2C_SSR_DMA                      *((volatile uint32_t*)(0x4270C0B4UL))
#define bFM4_MFS6_I2C_SSR_DMA                     *((volatile uint32_t*)(0x4270C0B4UL))
#define bFM_MFS6_I2C_SSR_TSET                     *((volatile uint32_t*)(0x4270C0B8UL))
#define bFM4_MFS6_I2C_SSR_TSET                    *((volatile uint32_t*)(0x4270C0B8UL))
#define bFM_MFS6_I2C_SSR_REC                      *((volatile uint32_t*)(0x4270C0BCUL))
#define bFM4_MFS6_I2C_SSR_REC                     *((volatile uint32_t*)(0x4270C0BCUL))

#define bFM_MFS6_LIN_BGR_EXT                      *((volatile uint32_t*)(0x4270C1BCUL))
#define bFM4_MFS6_LIN_BGR_EXT                     *((volatile uint32_t*)(0x4270C1BCUL))

