neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS6_UART_FCR_FE1                     *((volatile uint32_t*)(0x4270C280UL))
#define bFM4_MFS6_UART_FCR_FE1                    *((volatile uint32_t*)(0x4270C280UL))
#define bFM_MFS6_UART_FCR_FE2                     *((volatile uint32_t*)(0x4270C284UL))
#define bFM4_MFS6_UART_FCR_FE2                    *((volatile uint32_t*)(0x4270C284UL))
#define bFM_MFS6_UART_FCR_FCL1                    *((volatile uint32_t*)(0x4270C288UL))
#define bFM4_MFS6_UART_FCR_FCL1                   *((volatile uint32_t*)(0x4270C288UL))
#define bFM_MFS6_UART_FCR_FCL2                    *((volatile uint32_t*)(0x4270C28CUL))
#define bFM4_MFS6_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4270C28CUL))
#define bFM_MFS6_UART_FCR_FSET                    *((volatile uint32_t*)(0x4270C290UL))
#define bFM4_MFS6_UART_FCR_FSET                   *((volatile uint32_t*)(0x4270C290UL))
#define bFM_MFS6_UART_FCR_FLD                     *((volatile uint32_t*)(0x4270C294UL))
#define bFM4_MFS6_UART_FCR_FLD                    *((volatile uint32_t*)(0x4270C294UL))
#define bFM_MFS6_UART_FCR_FLST                    *((volatile uint32_t*)(0x4270C298UL))
#define bFM4_MFS6_UART_FCR_FLST                   *((volatile uint32_t*)(0x4270C298UL))
#define bFM_MFS6_UART_FCR_FSEL                    *((volatile uint32_t*)(0x4270C2A0UL))
#define bFM4_MFS6_UART_FCR_FSEL                   *((volatile uint32_t*)(0x4270C2A0UL))
#define bFM_MFS6_UART_FCR_FTIE                    *((volatile uint32_t*)(0x4270C2A4UL))
#define bFM4_MFS6_UART_FCR_FTIE                   *((volatile uint32_t*)(0x4270C2A4UL))
#define bFM_MFS6_UART_FCR_FDRQ                    *((volatile uint32_t*)(0x4270C2A8UL))
#define bFM4_MFS6_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x4270C2A8UL))
#define bFM_MFS6_UART_FCR_FRIIE                   *((volatile uint32_t*)(0x4270C2ACUL))
#define bFM4_MFS6_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x4270C2ACUL))
#define bFM_MFS6_UART_FCR_FLSTE                   *((volatile uint32_t*)(0x4270C2B0UL))
#define bFM4_MFS6_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x4270C2B0UL))

#define bFM_MFS6_UART_SCR_TXE                     *((volatile uint32_t*)(0x4270C020UL))
#define bFM4_MFS6_UART_SCR_TXE                    *((volatile uint32_t*)(0x4270C020UL))
#define bFM_MFS6_UART_SCR_RXE                     *((volatile uint32_t*)(0x4270C024UL))
#define bFM4_MFS6_UART_SCR_RXE                    *((volatile uint32_t*)(0x4270C024UL))
#define bFM_MFS6_UART_SCR_TBIE                    *((volatile uint32_t*)(0x4270C028UL))
#define bFM4_MFS6_UART_SCR_TBIE                   *((volatile uint32_t*)(0x4270C028UL))
#define bFM_MFS6_UART_SCR_TIE                     *((volatile uint32_t*)(0x4270C02CUL))
#define bFM4_MFS6_UART_SCR_TIE                    *((volatile uint32_t*)(0x4270C02CUL))
#define bFM_MFS6_UART_SCR_RIE                     *((volatile uint32_t*)(0x4270C030UL))
#define bFM4_MFS6_UART_SCR_RIE                    *((volatile uint32_t*)(0x4270C030UL))
#define bFM_MFS6_UART_SCR_UPCL                    *((volatile uint32_t*)(0x4270C03CUL))
#define bFM4_MFS6_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4270C03CUL))

#define bFM_MFS6_UART_SMR_SOE                     *((volatile uint32_t*)(0x4270C000UL))
#define bFM4_MFS6_UART_SMR_SOE                    *((volatile uint32_t*)(0x4270C000UL))
#define bFM_MFS6_UART_SMR_BDS                     *((volatile uint32_t*)(0x4270C008UL))
#define bFM4_MFS6_UART_SMR_BDS                    *((volatile uint32_t*)(0x4270C008UL))
#define bFM_MFS6_UART_SMR_SBL                     *((volatile uint32_t*)(0x4270C00CUL))
#define bFM4_MFS6_UART_SMR_SBL                    *((volatile uint32_t*)(0x4270C00CUL))

#define bFM_MFS6_UART_SSR_TBI                     *((volatile uint32_t*)(0x4270C0A0UL))
#define bFM4_MFS6_UART_SSR_TBI                    *((volatile uint32_t*)(0x4270C0A0UL))
#define bFM_MFS6_UART_SSR_TDRE                    *((volatile uint32_t*)(0x4270C0A4UL))
#define bFM4_MFS6_UART_SSR_TDRE                   *((volatile uint32_t*)(0x4270C0A4UL))
#define bFM_MFS6_UART_SSR_RDRF                    *((volatile uint32_t*)(0x4270C0A8UL))
#define bFM4_MFS6_UART_SSR_RDRF                   *((volatile uint32_t*)(0x4270C0A8UL))
#define bFM_MFS6_UART_SSR_ORE                     *((volatile uint32_t*)(0x4270C0ACUL))
#define bFM4_MFS6_UART_SSR_ORE                    *((volatile uint32_t*)(0x4270C0ACUL))
#define bFM_MFS6_UART_SSR_FRE                     *((volatile uint32_t*)(0x4270C0B0UL))
#define bFM4_MFS6_UART_SSR_FRE                    *((volatile uint32_t*)(0x4270C0B0UL))
#define bFM_MFS6_UART_SSR_PE                      *((volatile uint32_t*)(0x4270C0B4UL))
#define bFM4_MFS6_UART_SSR_PE                     *((volatile uint32_t*)(0x4270C0B4UL))
#define bFM_MFS6_UART_SSR_REC                     *((volatile uint32_t*)(0x4270C0BCUL))
#define bFM4_MFS6_UART_SSR_REC                    *((volatile uint32_t*)(0x4270C0BCUL))


/******************************************************************************
 ** MFS Registers MFS7
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS7_CSIO_ESCR_CSFE                   *((volatile uint32_t*)(0x4270E094UL))
#define bFM4_MFS7_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x4270E094UL))
#define bFM_MFS7_CSIO_ESCR_L3                     *((volatile uint32_t*)(0x4270E098UL))
#define bFM4_MFS7_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x4270E098UL))
#define bFM_MFS7_CSIO_ESCR_SOP                    *((volatile uint32_t*)(0x4270E09CUL))
#define bFM4_MFS7_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4270E09CUL))

#define bFM_MFS7_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x4270E280UL))
#define bFM4_MFS7_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x4270E280UL))
#define bFM_MFS7_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x4270E284UL))
#define bFM4_MFS7_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x4270E284UL))
#define bFM_MFS7_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x4270E288UL))
#define bFM4_MFS7_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x4270E288UL))
#define bFM_MFS7_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4270E28CUL))
#define bFM4_MFS7_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4270E28CUL))
#define bFM_MFS7_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x4270E290UL))
#define bFM4_MFS7_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x4270E290UL))
#define bFM_MFS7_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x4270E294UL))
#define bFM4_MFS7_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x4270E294UL))
#define bFM_MFS7_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x4270E298UL))
#define bFM4_MFS7_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x4270E298UL))
#define bFM_MFS7_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x4270E2A0UL))
#define bFM4_MFS7_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x4270E2A0UL))
#define bFM_MFS7_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x4270E2A4UL))
#define bFM4_MFS7_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x4270E2A4UL))
#define bFM_MFS7_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x4270E2A8UL))
#define bFM4_MFS7_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x4270E2A8UL))
#define bFM_MFS7_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x4270E2ACUL))
#define bFM4_MFS7_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x4270E2ACUL))
#define bFM_MFS7_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x4270E2B0UL))
#define bFM4_MFS7_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x4270E2B0UL))

