neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS7_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x4270E480UL))
#define bFM4_MFS7_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x4270E480UL))
#define bFM_MFS7_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x4270E498UL))
#define bFM4_MFS7_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x4270E498UL))
#define bFM_MFS7_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4270E49CUL))
#define bFM4_MFS7_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4270E49CUL))
#define bFM_MFS7_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x4270E4A0UL))
#define bFM4_MFS7_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x4270E4A0UL))
#define bFM_MFS7_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x4270E4ACUL))
#define bFM4_MFS7_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x4270E4ACUL))
#define bFM_MFS7_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x4270E4B0UL))
#define bFM4_MFS7_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x4270E4B0UL))
#define bFM_MFS7_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x4270E4B4UL))
#define bFM4_MFS7_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x4270E4B4UL))

#define bFM_MFS7_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x4270E020UL))
#define bFM4_MFS7_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x4270E020UL))
#define bFM_MFS7_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x4270E024UL))
#define bFM4_MFS7_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x4270E024UL))
#define bFM_MFS7_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x4270E028UL))
#define bFM4_MFS7_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x4270E028UL))
#define bFM_MFS7_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4270E02CUL))
#define bFM4_MFS7_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4270E02CUL))
#define bFM_MFS7_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x4270E030UL))
#define bFM4_MFS7_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x4270E030UL))
#define bFM_MFS7_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x4270E034UL))
#define bFM4_MFS7_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x4270E034UL))
#define bFM_MFS7_CSIO_SCR_MS                      *((volatile uint32_t*)(0x4270E038UL))
#define bFM4_MFS7_CSIO_SCR_MS                     *((volatile uint32_t*)(0x4270E038UL))
#define bFM_MFS7_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4270E03CUL))
#define bFM4_MFS7_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4270E03CUL))

#define bFM_MFS7_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x4270E600UL))
#define bFM4_MFS7_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x4270E600UL))
#define bFM_MFS7_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x4270E604UL))
#define bFM4_MFS7_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x4270E604UL))
#define bFM_MFS7_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x4270E608UL))
#define bFM4_MFS7_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x4270E608UL))
#define bFM_MFS7_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4270E60CUL))
#define bFM4_MFS7_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4270E60CUL))
#define bFM_MFS7_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x4270E610UL))
#define bFM4_MFS7_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x4270E610UL))
#define bFM_MFS7_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x4270E614UL))
#define bFM4_MFS7_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x4270E614UL))
#define bFM_MFS7_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x4270E624UL))
#define bFM4_MFS7_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x4270E624UL))

#define bFM_MFS7_CSIO_SCSFR0_CS1SPI               *((volatile uint32_t*)(0x4270E694UL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x4270E694UL))
#define bFM_MFS7_CSIO_SCSFR0_CS1SCINV             *((volatile uint32_t*)(0x4270E698UL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x4270E698UL))
#define bFM_MFS7_CSIO_SCSFR0_CS1CSLVL             *((volatile uint32_t*)(0x4270E69CUL))
#define bFM4_MFS7_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4270E69CUL))

#define bFM_MFS7_CSIO_SCSFR1_CS2SPI               *((volatile uint32_t*)(0x4270E6B4UL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x4270E6B4UL))
#define bFM_MFS7_CSIO_SCSFR1_CS2SCINV             *((volatile uint32_t*)(0x4270E6B8UL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x4270E6B8UL))
#define bFM_MFS7_CSIO_SCSFR1_CS2CSLVL             *((volatile uint32_t*)(0x4270E6BCUL))
#define bFM4_MFS7_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x4270E6BCUL))

#define bFM_MFS7_CSIO_SCSFR2_CS3SPI               *((volatile uint32_t*)(0x4270E714UL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x4270E714UL))
#define bFM_MFS7_CSIO_SCSFR2_CS3SCINV             *((volatile uint32_t*)(0x4270E718UL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x4270E718UL))
#define bFM_MFS7_CSIO_SCSFR2_CS3CSLVL             *((volatile uint32_t*)(0x4270E71CUL))
#define bFM4_MFS7_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4270E71CUL))

#define bFM_MFS7_CSIO_SMR_SOE                     *((volatile uint32_t*)(0x4270E000UL))
#define bFM4_MFS7_CSIO_SMR_SOE                    *((volatile uint32_t*)(0x4270E000UL))
#define bFM_MFS7_CSIO_SMR_SCKE                    *((volatile uint32_t*)(0x4270E004UL))
#define bFM4_MFS7_CSIO_SMR_SCKE                   *((volatile uint32_t*)(0x4270E004UL))
#define bFM_MFS7_CSIO_SMR_BDS                     *((volatile uint32_t*)(0x4270E008UL))
#define bFM4_MFS7_CSIO_SMR_BDS                    *((volatile uint32_t*)(0x4270E008UL))
#define bFM_MFS7_CSIO_SMR_SCINV                   *((volatile uint32_t*)(0x4270E00CUL))
#define bFM4_MFS7_CSIO_SMR_SCINV                  *((volatile uint32_t*)(0x4270E00CUL))

#define bFM_MFS7_CSIO_SSR_TBI                     *((volatile uint32_t*)(0x4270E0A0UL))
#define bFM4_MFS7_CSIO_SSR_TBI                    *((volatile uint32_t*)(0x4270E0A0UL))
#define bFM_MFS7_CSIO_SSR_TDRE                    *((volatile uint32_t*)(0x4270E0A4UL))
#define bFM4_MFS7_CSIO_SSR_TDRE                   *((volatile uint32_t*)(0x4270E0A4UL))
#define bFM_MFS7_CSIO_SSR_RDRF                    *((volatile uint32_t*)(0x4270E0A8UL))
#define bFM4_MFS7_CSIO_SSR_RDRF                   *((volatile uint32_t*)(0x4270E0A8UL))
#define bFM_MFS7_CSIO_SSR_ORE                     *((volatile uint32_t*)(0x4270E0ACUL))
#define bFM4_MFS7_CSIO_SSR_ORE                    *((volatile uint32_t*)(0x4270E0ACUL))
#define bFM_MFS7_CSIO_SSR_AWC                     *((volatile uint32_t*)(0x4270E0B0UL))
#define bFM4_MFS7_CSIO_SSR_AWC                    *((volatile uint32_t*)(0x4270E0B0UL))
#define bFM_MFS7_CSIO_SSR_REC                     *((volatile uint32_t*)(0x4270E0BCUL))
#define bFM4_MFS7_CSIO_SSR_REC                    *((volatile uint32_t*)(0x4270E0BCUL))

#define bFM_MFS7_I2C_EIBCR_BEC                    *((volatile uint32_t*)(0x4270E3A0UL))
#define bFM4_MFS7_I2C_EIBCR_BEC                   *((volatile uint32_t*)(0x4270E3A0UL))
#define bFM_MFS7_I2C_EIBCR_SOCE                   *((volatile uint32_t*)(0x4270E3A4UL))
#define bFM4_MFS7_I2C_EIBCR_SOCE                  *((volatile uint32_t*)(0x4270E3A4UL))
#define bFM_MFS7_I2C_EIBCR_SCLC                   *((volatile uint32_t*)(0x4270E3A8UL))
#define bFM4_MFS7_I2C_EIBCR_SCLC                  *((volatile uint32_t*)(0x4270E3A8UL))
#define bFM_MFS7_I2C_EIBCR_SDAC                   *((volatile uint32_t*)(0x4270E3ACUL))
#define bFM4_MFS7_I2C_EIBCR_SDAC                  *((volatile uint32_t*)(0x4270E3ACUL))
#define bFM_MFS7_I2C_EIBCR_SCLS                   *((volatile uint32_t*)(0x4270E3B0UL))
#define bFM4_MFS7_I2C_EIBCR_SCLS                  *((volatile uint32_t*)(0x4270E3B0UL))
#define bFM_MFS7_I2C_EIBCR_SDAS                   *((volatile uint32_t*)(0x4270E3B4UL))
#define bFM4_MFS7_I2C_EIBCR_SDAS                  *((volatile uint32_t*)(0x4270E3B4UL))

#define bFM_MFS7_I2C_FCR_FE1                      *((volatile uint32_t*)(0x4270E280UL))
#define bFM4_MFS7_I2C_FCR_FE1                     *((volatile uint32_t*)(0x4270E280UL))
#define bFM_MFS7_I2C_FCR_FE2                      *((volatile uint32_t*)(0x4270E284UL))
#define bFM4_MFS7_I2C_FCR_FE2                     *((volatile uint32_t*)(0x4270E284UL))
#define bFM_MFS7_I2C_FCR_FCL1                     *((volatile uint32_t*)(0x4270E288UL))
#define bFM4_MFS7_I2C_FCR_FCL1                    *((volatile uint32_t*)(0x4270E288UL))
#define bFM_MFS7_I2C_FCR_FCL2                     *((volatile uint32_t*)(0x4270E28CUL))
#define bFM4_MFS7_I2C_FCR_FCL2                    *((volatile uint32_t*)(0x4270E28CUL))
#define bFM_MFS7_I2C_FCR_FSET                     *((volatile uint32_t*)(0x4270E290UL))
#define bFM4_MFS7_I2C_FCR_FSET                    *((volatile uint32_t*)(0x4270E290UL))
#define bFM_MFS7_I2C_FCR_FLD                      *((volatile uint32_t*)(0x4270E294UL))
#define bFM4_MFS7_I2C_FCR_FLD                     *((volatile uint32_t*)(0x4270E294UL))
#define bFM_MFS7_I2C_FCR_FLST                     *((volatile uint32_t*)(0x4270E298UL))
#define bFM4_MFS7_I2C_FCR_FLST                    *((volatile uint32_t*)(0x4270E298UL))
#define bFM_MFS7_I2C_FCR_FSEL                     *((volatile uint32_t*)(0x4270E2A0UL))
#define bFM4_MFS7_I2C_FCR_FSEL                    *((volatile uint32_t*)(0x4270E2A0UL))
#define bFM_MFS7_I2C_FCR_FTIE                     *((volatile uint32_t*)(0x4270E2A4UL))
#define bFM4_MFS7_I2C_FCR_FTIE                    *((volatile uint32_t*)(0x4270E2A4UL))
#define bFM_MFS7_I2C_FCR_FDRQ                     *((volatile uint32_t*)(0x4270E2A8UL))
#define bFM4_MFS7_I2C_FCR_FDRQ                    *((volatile uint32_t*)(0x4270E2A8UL))
#define bFM_MFS7_I2C_FCR_FRIIE                    *((volatile uint32_t*)(0x4270E2ACUL))
#define bFM4_MFS7_I2C_FCR_FRIIE                   *((volatile uint32_t*)(0x4270E2ACUL))
#define bFM_MFS7_I2C_FCR_FLSTE                    *((volatile uint32_t*)(0x4270E2B0UL))
#define bFM4_MFS7_I2C_FCR_FLSTE                   *((volatile uint32_t*)(0x4270E2B0UL))

#define bFM_MFS7_I2C_IBCR_INT                     *((volatile uint32_t*)(0x4270E020UL))
#define bFM4_MFS7_I2C_IBCR_INT                    *((volatile uint32_t*)(0x4270E020UL))
#define bFM_MFS7_I2C_IBCR_BER                     *((volatile uint32_t*)(0x4270E024UL))
#define bFM4_MFS7_I2C_IBCR_BER                    *((volatile uint32_t*)(0x4270E024UL))
#define bFM_MFS7_I2C_IBCR_INTE                    *((volatile uint32_t*)(0x4270E028UL))
#define bFM4_MFS7_I2C_IBCR_INTE                   *((volatile uint32_t*)(0x4270E028UL))
#define bFM_MFS7_I2C_IBCR_CNDE                    *((volatile uint32_t*)(0x4270E02CUL))
#define bFM4_MFS7_I2C_IBCR_CNDE                   *((volatile uint32_t*)(0x4270E02CUL))
#define bFM_MFS7_I2C_IBCR_WSEL                    *((volatile uint32_t*)(0x4270E030UL))
#define bFM4_MFS7_I2C_IBCR_WSEL                   *((volatile uint32_t*)(0x4270E030UL))
#define bFM_MFS7_I2C_IBCR_ACKE                    *((volatile uint32_t*)(0x4270E034UL))
#define bFM4_MFS7_I2C_IBCR_ACKE                   *((volatile uint32_t*)(0x4270E034UL))
#define bFM_MFS7_I2C_IBCR_ACT_SCC                 *((volatile uint32_t*)(0x4270E038UL))
#define bFM4_MFS7_I2C_IBCR_ACT_SCC                *((volatile uint32_t*)(0x4270E038UL))
#define bFM_MFS7_I2C_IBCR_MSS                     *((volatile uint32_t*)(0x4270E03CUL))
#define bFM4_MFS7_I2C_IBCR_MSS                    *((volatile uint32_t*)(0x4270E03CUL))

