neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS7_I2C_IBSR_BB                      *((volatile uint32_t*)(0x4270E080UL))
#define bFM4_MFS7_I2C_IBSR_BB                     *((volatile uint32_t*)(0x4270E080UL))
#define bFM_MFS7_I2C_IBSR_SPC                     *((volatile uint32_t*)(0x4270E084UL))
#define bFM4_MFS7_I2C_IBSR_SPC                    *((volatile uint32_t*)(0x4270E084UL))
#define bFM_MFS7_I2C_IBSR_RSC                     *((volatile uint32_t*)(0x4270E088UL))
#define bFM4_MFS7_I2C_IBSR_RSC                    *((volatile uint32_t*)(0x4270E088UL))
#define bFM_MFS7_I2C_IBSR_AL                      *((volatile uint32_t*)(0x4270E08CUL))
#define bFM4_MFS7_I2C_IBSR_AL                     *((volatile uint32_t*)(0x4270E08CUL))
#define bFM_MFS7_I2C_IBSR_TRX                     *((volatile uint32_t*)(0x4270E090UL))
#define bFM4_MFS7_I2C_IBSR_TRX                    *((volatile uint32_t*)(0x4270E090UL))
#define bFM_MFS7_I2C_IBSR_RSA                     *((volatile uint32_t*)(0x4270E094UL))
#define bFM4_MFS7_I2C_IBSR_RSA                    *((volatile uint32_t*)(0x4270E094UL))
#define bFM_MFS7_I2C_IBSR_RACK                    *((volatile uint32_t*)(0x4270E098UL))
#define bFM4_MFS7_I2C_IBSR_RACK                   *((volatile uint32_t*)(0x4270E098UL))
#define bFM_MFS7_I2C_IBSR_FBT                     *((volatile uint32_t*)(0x4270E09CUL))
#define bFM4_MFS7_I2C_IBSR_FBT                    *((volatile uint32_t*)(0x4270E09CUL))

#define bFM_MFS7_I2C_ISBA_SAEN                    *((volatile uint32_t*)(0x4270E21CUL))
#define bFM4_MFS7_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4270E21CUL))

#define bFM_MFS7_I2C_ISMK_EN                      *((volatile uint32_t*)(0x4270E23CUL))
#define bFM4_MFS7_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4270E23CUL))

#define bFM_MFS7_I2C_SMR_TIE                      *((volatile uint32_t*)(0x4270E008UL))
#define bFM4_MFS7_I2C_SMR_TIE                     *((volatile uint32_t*)(0x4270E008UL))
#define bFM_MFS7_I2C_SMR_RIE                      *((volatile uint32_t*)(0x4270E00CUL))
#define bFM4_MFS7_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4270E00CUL))

#define bFM_MFS7_I2C_SSR_TBI                      *((volatile uint32_t*)(0x4270E0A0UL))
#define bFM4_MFS7_I2C_SSR_TBI                     *((volatile uint32_t*)(0x4270E0A0UL))
#define bFM_MFS7_I2C_SSR_TDRE                     *((volatile uint32_t*)(0x4270E0A4UL))
#define bFM4_MFS7_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x4270E0A4UL))
#define bFM_MFS7_I2C_SSR_RDRF                     *((volatile uint32_t*)(0x4270E0A8UL))
#define bFM4_MFS7_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x4270E0A8UL))
#define bFM_MFS7_I2C_SSR_ORE                      *((volatile uint32_t*)(0x4270E0ACUL))
#define bFM4_MFS7_I2C_SSR_ORE                     *((volatile uint32_t*)(0x4270E0ACUL))
#define bFM_MFS7_I2C_SSR_TBIE                     *((volatile uint32_t*)(0x4270E0B0UL))
#define bFM4_MFS7_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x4270E0B0UL))
#define bFM_MFS7_I2C_SSR_DMA                      *((volatile uint32_t*)(0x4270E0B4UL))
#define bFM4_MFS7_I2C_SSR_DMA                     *((volatile uint32_t*)(0x4270E0B4UL))
#define bFM_MFS7_I2C_SSR_TSET                     *((volatile uint32_t*)(0x4270E0B8UL))
#define bFM4_MFS7_I2C_SSR_TSET                    *((volatile uint32_t*)(0x4270E0B8UL))
#define bFM_MFS7_I2C_SSR_REC                      *((volatile uint32_t*)(0x4270E0BCUL))
#define bFM4_MFS7_I2C_SSR_REC                     *((volatile uint32_t*)(0x4270E0BCUL))

#define bFM_MFS7_LIN_BGR_EXT                      *((volatile uint32_t*)(0x4270E1BCUL))
#define bFM4_MFS7_LIN_BGR_EXT                     *((volatile uint32_t*)(0x4270E1BCUL))

#define bFM_MFS7_LIN_ESCR_LBIE                    *((volatile uint32_t*)(0x4270E090UL))
#define bFM4_MFS7_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x4270E090UL))
#define bFM_MFS7_LIN_ESCR_ESBL                    *((volatile uint32_t*)(0x4270E098UL))
#define bFM4_MFS7_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x4270E098UL))

#define bFM_MFS7_LIN_FCR_FE1                      *((volatile uint32_t*)(0x4270E280UL))
#define bFM4_MFS7_LIN_FCR_FE1                     *((volatile uint32_t*)(0x4270E280UL))
#define bFM_MFS7_LIN_FCR_FE2                      *((volatile uint32_t*)(0x4270E284UL))
#define bFM4_MFS7_LIN_FCR_FE2                     *((volatile uint32_t*)(0x4270E284UL))
#define bFM_MFS7_LIN_FCR_FCL1                     *((volatile uint32_t*)(0x4270E288UL))
#define bFM4_MFS7_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x4270E288UL))
#define bFM_MFS7_LIN_FCR_FCL2                     *((volatile uint32_t*)(0x4270E28CUL))
#define bFM4_MFS7_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4270E28CUL))
#define bFM_MFS7_LIN_FCR_FSET                     *((volatile uint32_t*)(0x4270E290UL))
#define bFM4_MFS7_LIN_FCR_FSET                    *((volatile uint32_t*)(0x4270E290UL))
#define bFM_MFS7_LIN_FCR_FLD                      *((volatile uint32_t*)(0x4270E294UL))
#define bFM4_MFS7_LIN_FCR_FLD                     *((volatile uint32_t*)(0x4270E294UL))
#define bFM_MFS7_LIN_FCR_FLST                     *((volatile uint32_t*)(0x4270E298UL))
#define bFM4_MFS7_LIN_FCR_FLST                    *((volatile uint32_t*)(0x4270E298UL))
#define bFM_MFS7_LIN_FCR_FSEL                     *((volatile uint32_t*)(0x4270E2A0UL))
#define bFM4_MFS7_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x4270E2A0UL))
#define bFM_MFS7_LIN_FCR_FTIE                     *((volatile uint32_t*)(0x4270E2A4UL))
#define bFM4_MFS7_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x4270E2A4UL))
#define bFM_MFS7_LIN_FCR_FDRQ                     *((volatile uint32_t*)(0x4270E2A8UL))
#define bFM4_MFS7_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x4270E2A8UL))
#define bFM_MFS7_LIN_FCR_FRIIE                    *((volatile uint32_t*)(0x4270E2ACUL))
#define bFM4_MFS7_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x4270E2ACUL))
#define bFM_MFS7_LIN_FCR_FLSTE                    *((volatile uint32_t*)(0x4270E2B0UL))
#define bFM4_MFS7_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x4270E2B0UL))

#define bFM_MFS7_LIN_SCR_TXE                      *((volatile uint32_t*)(0x4270E020UL))
#define bFM4_MFS7_LIN_SCR_TXE                     *((volatile uint32_t*)(0x4270E020UL))
#define bFM_MFS7_LIN_SCR_RXE                      *((volatile uint32_t*)(0x4270E024UL))
#define bFM4_MFS7_LIN_SCR_RXE                     *((volatile uint32_t*)(0x4270E024UL))
#define bFM_MFS7_LIN_SCR_TBIE                     *((volatile uint32_t*)(0x4270E028UL))
#define bFM4_MFS7_LIN_SCR_TBIE                    *((volatile uint32_t*)(0x4270E028UL))
#define bFM_MFS7_LIN_SCR_TIE                      *((volatile uint32_t*)(0x4270E02CUL))
#define bFM4_MFS7_LIN_SCR_TIE                     *((volatile uint32_t*)(0x4270E02CUL))
#define bFM_MFS7_LIN_SCR_RIE                      *((volatile uint32_t*)(0x4270E030UL))
#define bFM4_MFS7_LIN_SCR_RIE                     *((volatile uint32_t*)(0x4270E030UL))
#define bFM_MFS7_LIN_SCR_LBR                      *((volatile uint32_t*)(0x4270E034UL))
#define bFM4_MFS7_LIN_SCR_LBR                     *((volatile uint32_t*)(0x4270E034UL))
#define bFM_MFS7_LIN_SCR_MS                       *((volatile uint32_t*)(0x4270E038UL))
#define bFM4_MFS7_LIN_SCR_MS                      *((volatile uint32_t*)(0x4270E038UL))
#define bFM_MFS7_LIN_SCR_UPCL                     *((volatile uint32_t*)(0x4270E03CUL))
#define bFM4_MFS7_LIN_SCR_UPCL                    *((volatile uint32_t*)(0x4270E03CUL))

