neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS7_LIN_SMR_SOE                      *((volatile uint32_t*)(0x4270E000UL))
#define bFM4_MFS7_LIN_SMR_SOE                     *((volatile uint32_t*)(0x4270E000UL))
#define bFM_MFS7_LIN_SMR_SBL                      *((volatile uint32_t*)(0x4270E00CUL))
#define bFM4_MFS7_LIN_SMR_SBL                     *((volatile uint32_t*)(0x4270E00CUL))
#define bFM_MFS7_LIN_SMR_WUCR                     *((volatile uint32_t*)(0x4270E010UL))
#define bFM4_MFS7_LIN_SMR_WUCR                    *((volatile uint32_t*)(0x4270E010UL))

#define bFM_MFS7_LIN_SSR_TBI                      *((volatile uint32_t*)(0x4270E0A0UL))
#define bFM4_MFS7_LIN_SSR_TBI                     *((volatile uint32_t*)(0x4270E0A0UL))
#define bFM_MFS7_LIN_SSR_TDRE                     *((volatile uint32_t*)(0x4270E0A4UL))
#define bFM4_MFS7_LIN_SSR_TDRE                    *((volatile uint32_t*)(0x4270E0A4UL))
#define bFM_MFS7_LIN_SSR_RDRF                     *((volatile uint32_t*)(0x4270E0A8UL))
#define bFM4_MFS7_LIN_SSR_RDRF                    *((volatile uint32_t*)(0x4270E0A8UL))
#define bFM_MFS7_LIN_SSR_ORE                      *((volatile uint32_t*)(0x4270E0ACUL))
#define bFM4_MFS7_LIN_SSR_ORE                     *((volatile uint32_t*)(0x4270E0ACUL))
#define bFM_MFS7_LIN_SSR_FRE                      *((volatile uint32_t*)(0x4270E0B0UL))
#define bFM4_MFS7_LIN_SSR_FRE                     *((volatile uint32_t*)(0x4270E0B0UL))
#define bFM_MFS7_LIN_SSR_LBD                      *((volatile uint32_t*)(0x4270E0B4UL))
#define bFM4_MFS7_LIN_SSR_LBD                     *((volatile uint32_t*)(0x4270E0B4UL))
#define bFM_MFS7_LIN_SSR_REC                      *((volatile uint32_t*)(0x4270E0BCUL))
#define bFM4_MFS7_LIN_SSR_REC                     *((volatile uint32_t*)(0x4270E0BCUL))

#define bFM_MFS7_UART_BGR_EXT                     *((volatile uint32_t*)(0x4270E1BCUL))
#define bFM4_MFS7_UART_BGR_EXT                    *((volatile uint32_t*)(0x4270E1BCUL))

#define bFM_MFS7_UART_ESCR_P                      *((volatile uint32_t*)(0x4270E08CUL))
#define bFM4_MFS7_UART_ESCR_P                     *((volatile uint32_t*)(0x4270E08CUL))
#define bFM_MFS7_UART_ESCR_PEN                    *((volatile uint32_t*)(0x4270E090UL))
#define bFM4_MFS7_UART_ESCR_PEN                   *((volatile uint32_t*)(0x4270E090UL))
#define bFM_MFS7_UART_ESCR_INV                    *((volatile uint32_t*)(0x4270E094UL))
#define bFM4_MFS7_UART_ESCR_INV                   *((volatile uint32_t*)(0x4270E094UL))
#define bFM_MFS7_UART_ESCR_ESBL                   *((volatile uint32_t*)(0x4270E098UL))
#define bFM4_MFS7_UART_ESCR_ESBL                  *((volatile uint32_t*)(0x4270E098UL))
#define bFM_MFS7_UART_ESCR_FLWEN                  *((volatile uint32_t*)(0x4270E09CUL))
#define bFM4_MFS7_UART_ESCR_FLWEN                 *((volatile uint32_t*)(0x4270E09CUL))

#define bFM_MFS7_UART_FCR_FE1                     *((volatile uint32_t*)(0x4270E280UL))
#define bFM4_MFS7_UART_FCR_FE1                    *((volatile uint32_t*)(0x4270E280UL))
#define bFM_MFS7_UART_FCR_FE2                     *((volatile uint32_t*)(0x4270E284UL))
#define bFM4_MFS7_UART_FCR_FE2                    *((volatile uint32_t*)(0x4270E284UL))
#define bFM_MFS7_UART_FCR_FCL1                    *((volatile uint32_t*)(0x4270E288UL))
#define bFM4_MFS7_UART_FCR_FCL1                   *((volatile uint32_t*)(0x4270E288UL))
#define bFM_MFS7_UART_FCR_FCL2                    *((volatile uint32_t*)(0x4270E28CUL))
#define bFM4_MFS7_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4270E28CUL))
#define bFM_MFS7_UART_FCR_FSET                    *((volatile uint32_t*)(0x4270E290UL))
#define bFM4_MFS7_UART_FCR_FSET                   *((volatile uint32_t*)(0x4270E290UL))
#define bFM_MFS7_UART_FCR_FLD                     *((volatile uint32_t*)(0x4270E294UL))
#define bFM4_MFS7_UART_FCR_FLD                    *((volatile uint32_t*)(0x4270E294UL))
#define bFM_MFS7_UART_FCR_FLST                    *((volatile uint32_t*)(0x4270E298UL))
#define bFM4_MFS7_UART_FCR_FLST                   *((volatile uint32_t*)(0x4270E298UL))
#define bFM_MFS7_UART_FCR_FSEL                    *((volatile uint32_t*)(0x4270E2A0UL))
#define bFM4_MFS7_UART_FCR_FSEL                   *((volatile uint32_t*)(0x4270E2A0UL))
#define bFM_MFS7_UART_FCR_FTIE                    *((volatile uint32_t*)(0x4270E2A4UL))
#define bFM4_MFS7_UART_FCR_FTIE                   *((volatile uint32_t*)(0x4270E2A4UL))
#define bFM_MFS7_UART_FCR_FDRQ                    *((volatile uint32_t*)(0x4270E2A8UL))
#define bFM4_MFS7_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x4270E2A8UL))
#define bFM_MFS7_UART_FCR_FRIIE                   *((volatile uint32_t*)(0x4270E2ACUL))
#define bFM4_MFS7_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x4270E2ACUL))
#define bFM_MFS7_UART_FCR_FLSTE                   *((volatile uint32_t*)(0x4270E2B0UL))
#define bFM4_MFS7_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x4270E2B0UL))

#define bFM_MFS7_UART_SCR_TXE                     *((volatile uint32_t*)(0x4270E020UL))
#define bFM4_MFS7_UART_SCR_TXE                    *((volatile uint32_t*)(0x4270E020UL))
#define bFM_MFS7_UART_SCR_RXE                     *((volatile uint32_t*)(0x4270E024UL))
#define bFM4_MFS7_UART_SCR_RXE                    *((volatile uint32_t*)(0x4270E024UL))
#define bFM_MFS7_UART_SCR_TBIE                    *((volatile uint32_t*)(0x4270E028UL))
#define bFM4_MFS7_UART_SCR_TBIE                   *((volatile uint32_t*)(0x4270E028UL))
#define bFM_MFS7_UART_SCR_TIE                     *((volatile uint32_t*)(0x4270E02CUL))
#define bFM4_MFS7_UART_SCR_TIE                    *((volatile uint32_t*)(0x4270E02CUL))
#define bFM_MFS7_UART_SCR_RIE                     *((volatile uint32_t*)(0x4270E030UL))
#define bFM4_MFS7_UART_SCR_RIE                    *((volatile uint32_t*)(0x4270E030UL))
#define bFM_MFS7_UART_SCR_UPCL                    *((volatile uint32_t*)(0x4270E03CUL))
#define bFM4_MFS7_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4270E03CUL))

#define bFM_MFS7_UART_SMR_SOE                     *((volatile uint32_t*)(0x4270E000UL))
#define bFM4_MFS7_UART_SMR_SOE                    *((volatile uint32_t*)(0x4270E000UL))
#define bFM_MFS7_UART_SMR_BDS                     *((volatile uint32_t*)(0x4270E008UL))
#define bFM4_MFS7_UART_SMR_BDS                    *((volatile uint32_t*)(0x4270E008UL))
#define bFM_MFS7_UART_SMR_SBL                     *((volatile uint32_t*)(0x4270E00CUL))
#define bFM4_MFS7_UART_SMR_SBL                    *((volatile uint32_t*)(0x4270E00CUL))

#define bFM_MFS7_UART_SSR_TBI                     *((volatile uint32_t*)(0x4270E0A0UL))
#define bFM4_MFS7_UART_SSR_TBI                    *((volatile uint32_t*)(0x4270E0A0UL))
#define bFM_MFS7_UART_SSR_TDRE                    *((volatile uint32_t*)(0x4270E0A4UL))
#define bFM4_MFS7_UART_SSR_TDRE                   *((volatile uint32_t*)(0x4270E0A4UL))
#define bFM_MFS7_UART_SSR_RDRF                    *((volatile uint32_t*)(0x4270E0A8UL))
#define bFM4_MFS7_UART_SSR_RDRF                   *((volatile uint32_t*)(0x4270E0A8UL))
#define bFM_MFS7_UART_SSR_ORE                     *((volatile uint32_t*)(0x4270E0ACUL))
#define bFM4_MFS7_UART_SSR_ORE                    *((volatile uint32_t*)(0x4270E0ACUL))
#define bFM_MFS7_UART_SSR_FRE                     *((volatile uint32_t*)(0x4270E0B0UL))
#define bFM4_MFS7_UART_SSR_FRE                    *((volatile uint32_t*)(0x4270E0B0UL))
#define bFM_MFS7_UART_SSR_PE                      *((volatile uint32_t*)(0x4270E0B4UL))
#define bFM4_MFS7_UART_SSR_PE                     *((volatile uint32_t*)(0x4270E0B4UL))
#define bFM_MFS7_UART_SSR_REC                     *((volatile uint32_t*)(0x4270E0BCUL))
#define bFM4_MFS7_UART_SSR_REC                    *((volatile uint32_t*)(0x4270E0BCUL))


