neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** MFS Registers MFS8
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFS8_CSIO_ESCR_CSFE                   *((volatile uint32_t*)(0x42710094UL))
#define bFM4_MFS8_CSIO_ESCR_CSFE                  *((volatile uint32_t*)(0x42710094UL))
#define bFM_MFS8_CSIO_ESCR_L3                     *((volatile uint32_t*)(0x42710098UL))
#define bFM4_MFS8_CSIO_ESCR_L3                    *((volatile uint32_t*)(0x42710098UL))
#define bFM_MFS8_CSIO_ESCR_SOP                    *((volatile uint32_t*)(0x4271009CUL))
#define bFM4_MFS8_CSIO_ESCR_SOP                   *((volatile uint32_t*)(0x4271009CUL))

#define bFM_MFS8_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x42710280UL))
#define bFM4_MFS8_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42710280UL))
#define bFM_MFS8_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x42710284UL))
#define bFM4_MFS8_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42710284UL))
#define bFM_MFS8_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x42710288UL))
#define bFM4_MFS8_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42710288UL))
#define bFM_MFS8_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4271028CUL))
#define bFM4_MFS8_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4271028CUL))
#define bFM_MFS8_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x42710290UL))
#define bFM4_MFS8_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42710290UL))
#define bFM_MFS8_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x42710294UL))
#define bFM4_MFS8_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42710294UL))
#define bFM_MFS8_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x42710298UL))
#define bFM4_MFS8_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42710298UL))
#define bFM_MFS8_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x427102A0UL))
#define bFM4_MFS8_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427102A0UL))
#define bFM_MFS8_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x427102A4UL))
#define bFM4_MFS8_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427102A4UL))
#define bFM_MFS8_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x427102A8UL))
#define bFM4_MFS8_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427102A8UL))
#define bFM_MFS8_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x427102ACUL))
#define bFM4_MFS8_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427102ACUL))
#define bFM_MFS8_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x427102B0UL))
#define bFM4_MFS8_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427102B0UL))

#define bFM_MFS8_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x42710480UL))
#define bFM4_MFS8_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42710480UL))
#define bFM_MFS8_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x42710498UL))
#define bFM4_MFS8_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42710498UL))
#define bFM_MFS8_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4271049CUL))
#define bFM4_MFS8_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4271049CUL))
#define bFM_MFS8_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x427104A0UL))
#define bFM4_MFS8_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427104A0UL))
#define bFM_MFS8_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x427104ACUL))
#define bFM4_MFS8_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427104ACUL))
#define bFM_MFS8_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x427104B0UL))
#define bFM4_MFS8_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427104B0UL))
#define bFM_MFS8_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x427104B4UL))
#define bFM4_MFS8_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427104B4UL))

#define bFM_MFS8_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x42710020UL))
#define bFM4_MFS8_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42710020UL))
#define bFM_MFS8_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x42710024UL))
#define bFM4_MFS8_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42710024UL))
#define bFM_MFS8_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x42710028UL))
#define bFM4_MFS8_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42710028UL))
#define bFM_MFS8_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4271002CUL))
#define bFM4_MFS8_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4271002CUL))
#define bFM_MFS8_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x42710030UL))
#define bFM4_MFS8_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42710030UL))
#define bFM_MFS8_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x42710034UL))
#define bFM4_MFS8_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42710034UL))
#define bFM_MFS8_CSIO_SCR_MS                      *((volatile uint32_t*)(0x42710038UL))
#define bFM4_MFS8_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42710038UL))
#define bFM_MFS8_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4271003CUL))
#define bFM4_MFS8_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4271003CUL))

#define bFM_MFS8_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x42710600UL))
#define bFM4_MFS8_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42710600UL))
#define bFM_MFS8_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x42710604UL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42710604UL))
#define bFM_MFS8_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x42710608UL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42710608UL))
#define bFM_MFS8_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4271060CUL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4271060CUL))
#define bFM_MFS8_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x42710610UL))
#define bFM4_MFS8_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42710610UL))
#define bFM_MFS8_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x42710614UL))
#define bFM4_MFS8_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42710614UL))
#define bFM_MFS8_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x42710624UL))
#define bFM4_MFS8_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42710624UL))

