neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS8_I2C_ISBA_SAEN                    *((volatile uint32_t*)(0x4271021CUL))
#define bFM4_MFS8_I2C_ISBA_SAEN                   *((volatile uint32_t*)(0x4271021CUL))

#define bFM_MFS8_I2C_ISMK_EN                      *((volatile uint32_t*)(0x4271023CUL))
#define bFM4_MFS8_I2C_ISMK_EN                     *((volatile uint32_t*)(0x4271023CUL))

#define bFM_MFS8_I2C_SMR_TIE                      *((volatile uint32_t*)(0x42710008UL))
#define bFM4_MFS8_I2C_SMR_TIE                     *((volatile uint32_t*)(0x42710008UL))
#define bFM_MFS8_I2C_SMR_RIE                      *((volatile uint32_t*)(0x4271000CUL))
#define bFM4_MFS8_I2C_SMR_RIE                     *((volatile uint32_t*)(0x4271000CUL))

#define bFM_MFS8_I2C_SSR_TBI                      *((volatile uint32_t*)(0x427100A0UL))
#define bFM4_MFS8_I2C_SSR_TBI                     *((volatile uint32_t*)(0x427100A0UL))
#define bFM_MFS8_I2C_SSR_TDRE                     *((volatile uint32_t*)(0x427100A4UL))
#define bFM4_MFS8_I2C_SSR_TDRE                    *((volatile uint32_t*)(0x427100A4UL))
#define bFM_MFS8_I2C_SSR_RDRF                     *((volatile uint32_t*)(0x427100A8UL))
#define bFM4_MFS8_I2C_SSR_RDRF                    *((volatile uint32_t*)(0x427100A8UL))
#define bFM_MFS8_I2C_SSR_ORE                      *((volatile uint32_t*)(0x427100ACUL))
#define bFM4_MFS8_I2C_SSR_ORE                     *((volatile uint32_t*)(0x427100ACUL))
#define bFM_MFS8_I2C_SSR_TBIE                     *((volatile uint32_t*)(0x427100B0UL))
#define bFM4_MFS8_I2C_SSR_TBIE                    *((volatile uint32_t*)(0x427100B0UL))
#define bFM_MFS8_I2C_SSR_DMA                      *((volatile uint32_t*)(0x427100B4UL))
#define bFM4_MFS8_I2C_SSR_DMA                     *((volatile uint32_t*)(0x427100B4UL))
#define bFM_MFS8_I2C_SSR_TSET                     *((volatile uint32_t*)(0x427100B8UL))
#define bFM4_MFS8_I2C_SSR_TSET                    *((volatile uint32_t*)(0x427100B8UL))
#define bFM_MFS8_I2C_SSR_REC                      *((volatile uint32_t*)(0x427100BCUL))
#define bFM4_MFS8_I2C_SSR_REC                     *((volatile uint32_t*)(0x427100BCUL))

#define bFM_MFS8_LIN_BGR_EXT                      *((volatile uint32_t*)(0x427101BCUL))
#define bFM4_MFS8_LIN_BGR_EXT                     *((volatile uint32_t*)(0x427101BCUL))

#define bFM_MFS8_LIN_ESCR_LBIE                    *((volatile uint32_t*)(0x42710090UL))
#define bFM4_MFS8_LIN_ESCR_LBIE                   *((volatile uint32_t*)(0x42710090UL))
#define bFM_MFS8_LIN_ESCR_ESBL                    *((volatile uint32_t*)(0x42710098UL))
#define bFM4_MFS8_LIN_ESCR_ESBL                   *((volatile uint32_t*)(0x42710098UL))

#define bFM_MFS8_LIN_FCR_FE1                      *((volatile uint32_t*)(0x42710280UL))
#define bFM4_MFS8_LIN_FCR_FE1                     *((volatile uint32_t*)(0x42710280UL))
#define bFM_MFS8_LIN_FCR_FE2                      *((volatile uint32_t*)(0x42710284UL))
#define bFM4_MFS8_LIN_FCR_FE2                     *((volatile uint32_t*)(0x42710284UL))
#define bFM_MFS8_LIN_FCR_FCL1                     *((volatile uint32_t*)(0x42710288UL))
#define bFM4_MFS8_LIN_FCR_FCL1                    *((volatile uint32_t*)(0x42710288UL))
#define bFM_MFS8_LIN_FCR_FCL2                     *((volatile uint32_t*)(0x4271028CUL))
#define bFM4_MFS8_LIN_FCR_FCL2                    *((volatile uint32_t*)(0x4271028CUL))
#define bFM_MFS8_LIN_FCR_FSET                     *((volatile uint32_t*)(0x42710290UL))
#define bFM4_MFS8_LIN_FCR_FSET                    *((volatile uint32_t*)(0x42710290UL))
#define bFM_MFS8_LIN_FCR_FLD                      *((volatile uint32_t*)(0x42710294UL))
#define bFM4_MFS8_LIN_FCR_FLD                     *((volatile uint32_t*)(0x42710294UL))
#define bFM_MFS8_LIN_FCR_FLST                     *((volatile uint32_t*)(0x42710298UL))
#define bFM4_MFS8_LIN_FCR_FLST                    *((volatile uint32_t*)(0x42710298UL))
#define bFM_MFS8_LIN_FCR_FSEL                     *((volatile uint32_t*)(0x427102A0UL))
#define bFM4_MFS8_LIN_FCR_FSEL                    *((volatile uint32_t*)(0x427102A0UL))
#define bFM_MFS8_LIN_FCR_FTIE                     *((volatile uint32_t*)(0x427102A4UL))
#define bFM4_MFS8_LIN_FCR_FTIE                    *((volatile uint32_t*)(0x427102A4UL))
#define bFM_MFS8_LIN_FCR_FDRQ                     *((volatile uint32_t*)(0x427102A8UL))
#define bFM4_MFS8_LIN_FCR_FDRQ                    *((volatile uint32_t*)(0x427102A8UL))
#define bFM_MFS8_LIN_FCR_FRIIE                    *((volatile uint32_t*)(0x427102ACUL))
#define bFM4_MFS8_LIN_FCR_FRIIE                   *((volatile uint32_t*)(0x427102ACUL))
#define bFM_MFS8_LIN_FCR_FLSTE                    *((volatile uint32_t*)(0x427102B0UL))
#define bFM4_MFS8_LIN_FCR_FLSTE                   *((volatile uint32_t*)(0x427102B0UL))

#define bFM_MFS8_LIN_SCR_TXE                      *((volatile uint32_t*)(0x42710020UL))
#define bFM4_MFS8_LIN_SCR_TXE                     *((volatile uint32_t*)(0x42710020UL))
#define bFM_MFS8_LIN_SCR_RXE                      *((volatile uint32_t*)(0x42710024UL))
#define bFM4_MFS8_LIN_SCR_RXE                     *((volatile uint32_t*)(0x42710024UL))
#define bFM_MFS8_LIN_SCR_TBIE                     *((volatile uint32_t*)(0x42710028UL))
#define bFM4_MFS8_LIN_SCR_TBIE                    *((volatile uint32_t*)(0x42710028UL))
#define bFM_MFS8_LIN_SCR_TIE                      *((volatile uint32_t*)(0x4271002CUL))
#define bFM4_MFS8_LIN_SCR_TIE                     *((volatile uint32_t*)(0x4271002CUL))
#define bFM_MFS8_LIN_SCR_RIE                      *((volatile uint32_t*)(0x42710030UL))
#define bFM4_MFS8_LIN_SCR_RIE                     *((volatile uint32_t*)(0x42710030UL))
#define bFM_MFS8_LIN_SCR_LBR                      *((volatile uint32_t*)(0x42710034UL))
#define bFM4_MFS8_LIN_SCR_LBR                     *((volatile uint32_t*)(0x42710034UL))
#define bFM_MFS8_LIN_SCR_MS                       *((volatile uint32_t*)(0x42710038UL))
#define bFM4_MFS8_LIN_SCR_MS                      *((volatile uint32_t*)(0x42710038UL))
#define bFM_MFS8_LIN_SCR_UPCL                     *((volatile uint32_t*)(0x4271003CUL))
#define bFM4_MFS8_LIN_SCR_UPCL                    *((volatile uint32_t*)(0x4271003CUL))

#define bFM_MFS8_LIN_SMR_SOE                      *((volatile uint32_t*)(0x42710000UL))
#define bFM4_MFS8_LIN_SMR_SOE                     *((volatile uint32_t*)(0x42710000UL))
#define bFM_MFS8_LIN_SMR_SBL                      *((volatile uint32_t*)(0x4271000CUL))
#define bFM4_MFS8_LIN_SMR_SBL                     *((volatile uint32_t*)(0x4271000CUL))
#define bFM_MFS8_LIN_SMR_WUCR                     *((volatile uint32_t*)(0x42710010UL))
#define bFM4_MFS8_LIN_SMR_WUCR                    *((volatile uint32_t*)(0x42710010UL))

#define bFM_MFS8_LIN_SSR_TBI                      *((volatile uint32_t*)(0x427100A0UL))
#define bFM4_MFS8_LIN_SSR_TBI                     *((volatile uint32_t*)(0x427100A0UL))
#define bFM_MFS8_LIN_SSR_TDRE                     *((volatile uint32_t*)(0x427100A4UL))
#define bFM4_MFS8_LIN_SSR_TDRE                    *((volatile uint32_t*)(0x427100A4UL))
#define bFM_MFS8_LIN_SSR_RDRF                     *((volatile uint32_t*)(0x427100A8UL))
#define bFM4_MFS8_LIN_SSR_RDRF                    *((volatile uint32_t*)(0x427100A8UL))
#define bFM_MFS8_LIN_SSR_ORE                      *((volatile uint32_t*)(0x427100ACUL))
#define bFM4_MFS8_LIN_SSR_ORE                     *((volatile uint32_t*)(0x427100ACUL))
#define bFM_MFS8_LIN_SSR_FRE                      *((volatile uint32_t*)(0x427100B0UL))
#define bFM4_MFS8_LIN_SSR_FRE                     *((volatile uint32_t*)(0x427100B0UL))
#define bFM_MFS8_LIN_SSR_LBD                      *((volatile uint32_t*)(0x427100B4UL))
#define bFM4_MFS8_LIN_SSR_LBD                     *((volatile uint32_t*)(0x427100B4UL))
#define bFM_MFS8_LIN_SSR_REC                      *((volatile uint32_t*)(0x427100BCUL))
#define bFM4_MFS8_LIN_SSR_REC                     *((volatile uint32_t*)(0x427100BCUL))

