neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS9_CSIO_FCR_FE1                     *((volatile uint32_t*)(0x42712280UL))
#define bFM4_MFS9_CSIO_FCR_FE1                    *((volatile uint32_t*)(0x42712280UL))
#define bFM_MFS9_CSIO_FCR_FE2                     *((volatile uint32_t*)(0x42712284UL))
#define bFM4_MFS9_CSIO_FCR_FE2                    *((volatile uint32_t*)(0x42712284UL))
#define bFM_MFS9_CSIO_FCR_FCL1                    *((volatile uint32_t*)(0x42712288UL))
#define bFM4_MFS9_CSIO_FCR_FCL1                   *((volatile uint32_t*)(0x42712288UL))
#define bFM_MFS9_CSIO_FCR_FCL2                    *((volatile uint32_t*)(0x4271228CUL))
#define bFM4_MFS9_CSIO_FCR_FCL2                   *((volatile uint32_t*)(0x4271228CUL))
#define bFM_MFS9_CSIO_FCR_FSET                    *((volatile uint32_t*)(0x42712290UL))
#define bFM4_MFS9_CSIO_FCR_FSET                   *((volatile uint32_t*)(0x42712290UL))
#define bFM_MFS9_CSIO_FCR_FLD                     *((volatile uint32_t*)(0x42712294UL))
#define bFM4_MFS9_CSIO_FCR_FLD                    *((volatile uint32_t*)(0x42712294UL))
#define bFM_MFS9_CSIO_FCR_FLST                    *((volatile uint32_t*)(0x42712298UL))
#define bFM4_MFS9_CSIO_FCR_FLST                   *((volatile uint32_t*)(0x42712298UL))
#define bFM_MFS9_CSIO_FCR_FSEL                    *((volatile uint32_t*)(0x427122A0UL))
#define bFM4_MFS9_CSIO_FCR_FSEL                   *((volatile uint32_t*)(0x427122A0UL))
#define bFM_MFS9_CSIO_FCR_FTIE                    *((volatile uint32_t*)(0x427122A4UL))
#define bFM4_MFS9_CSIO_FCR_FTIE                   *((volatile uint32_t*)(0x427122A4UL))
#define bFM_MFS9_CSIO_FCR_FDRQ                    *((volatile uint32_t*)(0x427122A8UL))
#define bFM4_MFS9_CSIO_FCR_FDRQ                   *((volatile uint32_t*)(0x427122A8UL))
#define bFM_MFS9_CSIO_FCR_FRIIE                   *((volatile uint32_t*)(0x427122ACUL))
#define bFM4_MFS9_CSIO_FCR_FRIIE                  *((volatile uint32_t*)(0x427122ACUL))
#define bFM_MFS9_CSIO_FCR_FLSTE                   *((volatile uint32_t*)(0x427122B0UL))
#define bFM4_MFS9_CSIO_FCR_FLSTE                  *((volatile uint32_t*)(0x427122B0UL))

#define bFM_MFS9_CSIO_SACSR_TMRE                  *((volatile uint32_t*)(0x42712480UL))
#define bFM4_MFS9_CSIO_SACSR_TMRE                 *((volatile uint32_t*)(0x42712480UL))
#define bFM_MFS9_CSIO_SACSR_TSYNE                 *((volatile uint32_t*)(0x42712498UL))
#define bFM4_MFS9_CSIO_SACSR_TSYNE                *((volatile uint32_t*)(0x42712498UL))
#define bFM_MFS9_CSIO_SACSR_TINTE                 *((volatile uint32_t*)(0x4271249CUL))
#define bFM4_MFS9_CSIO_SACSR_TINTE                *((volatile uint32_t*)(0x4271249CUL))
#define bFM_MFS9_CSIO_SACSR_TINT                  *((volatile uint32_t*)(0x427124A0UL))
#define bFM4_MFS9_CSIO_SACSR_TINT                 *((volatile uint32_t*)(0x427124A0UL))
#define bFM_MFS9_CSIO_SACSR_CSE                   *((volatile uint32_t*)(0x427124ACUL))
#define bFM4_MFS9_CSIO_SACSR_CSE                  *((volatile uint32_t*)(0x427124ACUL))
#define bFM_MFS9_CSIO_SACSR_CSEIE                 *((volatile uint32_t*)(0x427124B0UL))
#define bFM4_MFS9_CSIO_SACSR_CSEIE                *((volatile uint32_t*)(0x427124B0UL))
#define bFM_MFS9_CSIO_SACSR_TBEEN                 *((volatile uint32_t*)(0x427124B4UL))
#define bFM4_MFS9_CSIO_SACSR_TBEEN                *((volatile uint32_t*)(0x427124B4UL))

#define bFM_MFS9_CSIO_SCR_TXE                     *((volatile uint32_t*)(0x42712020UL))
#define bFM4_MFS9_CSIO_SCR_TXE                    *((volatile uint32_t*)(0x42712020UL))
#define bFM_MFS9_CSIO_SCR_RXE                     *((volatile uint32_t*)(0x42712024UL))
#define bFM4_MFS9_CSIO_SCR_RXE                    *((volatile uint32_t*)(0x42712024UL))
#define bFM_MFS9_CSIO_SCR_TBIE                    *((volatile uint32_t*)(0x42712028UL))
#define bFM4_MFS9_CSIO_SCR_TBIE                   *((volatile uint32_t*)(0x42712028UL))
#define bFM_MFS9_CSIO_SCR_TIE                     *((volatile uint32_t*)(0x4271202CUL))
#define bFM4_MFS9_CSIO_SCR_TIE                    *((volatile uint32_t*)(0x4271202CUL))
#define bFM_MFS9_CSIO_SCR_RIE                     *((volatile uint32_t*)(0x42712030UL))
#define bFM4_MFS9_CSIO_SCR_RIE                    *((volatile uint32_t*)(0x42712030UL))
#define bFM_MFS9_CSIO_SCR_SPI                     *((volatile uint32_t*)(0x42712034UL))
#define bFM4_MFS9_CSIO_SCR_SPI                    *((volatile uint32_t*)(0x42712034UL))
#define bFM_MFS9_CSIO_SCR_MS                      *((volatile uint32_t*)(0x42712038UL))
#define bFM4_MFS9_CSIO_SCR_MS                     *((volatile uint32_t*)(0x42712038UL))
#define bFM_MFS9_CSIO_SCR_UPCL                    *((volatile uint32_t*)(0x4271203CUL))
#define bFM4_MFS9_CSIO_SCR_UPCL                   *((volatile uint32_t*)(0x4271203CUL))

#define bFM_MFS9_CSIO_SCSCR_CSOE                  *((volatile uint32_t*)(0x42712600UL))
#define bFM4_MFS9_CSIO_SCSCR_CSOE                 *((volatile uint32_t*)(0x42712600UL))
#define bFM_MFS9_CSIO_SCSCR_CSEN0                 *((volatile uint32_t*)(0x42712604UL))
#define bFM4_MFS9_CSIO_SCSCR_CSEN0                *((volatile uint32_t*)(0x42712604UL))
#define bFM_MFS9_CSIO_SCSCR_CSEN1                 *((volatile uint32_t*)(0x42712608UL))
#define bFM4_MFS9_CSIO_SCSCR_CSEN1                *((volatile uint32_t*)(0x42712608UL))
#define bFM_MFS9_CSIO_SCSCR_CSEN2                 *((volatile uint32_t*)(0x4271260CUL))
#define bFM4_MFS9_CSIO_SCSCR_CSEN2                *((volatile uint32_t*)(0x4271260CUL))
#define bFM_MFS9_CSIO_SCSCR_CSEN3                 *((volatile uint32_t*)(0x42712610UL))
#define bFM4_MFS9_CSIO_SCSCR_CSEN3                *((volatile uint32_t*)(0x42712610UL))
#define bFM_MFS9_CSIO_SCSCR_CSLVL                 *((volatile uint32_t*)(0x42712614UL))
#define bFM4_MFS9_CSIO_SCSCR_CSLVL                *((volatile uint32_t*)(0x42712614UL))
#define bFM_MFS9_CSIO_SCSCR_SCAM                  *((volatile uint32_t*)(0x42712624UL))
#define bFM4_MFS9_CSIO_SCSCR_SCAM                 *((volatile uint32_t*)(0x42712624UL))

#define bFM_MFS9_CSIO_SCSFR0_CS1SPI               *((volatile uint32_t*)(0x42712694UL))
#define bFM4_MFS9_CSIO_SCSFR0_CS1SPI              *((volatile uint32_t*)(0x42712694UL))
#define bFM_MFS9_CSIO_SCSFR0_CS1SCINV             *((volatile uint32_t*)(0x42712698UL))
#define bFM4_MFS9_CSIO_SCSFR0_CS1SCINV            *((volatile uint32_t*)(0x42712698UL))
#define bFM_MFS9_CSIO_SCSFR0_CS1CSLVL             *((volatile uint32_t*)(0x4271269CUL))
#define bFM4_MFS9_CSIO_SCSFR0_CS1CSLVL            *((volatile uint32_t*)(0x4271269CUL))

#define bFM_MFS9_CSIO_SCSFR1_CS2SPI               *((volatile uint32_t*)(0x427126B4UL))
#define bFM4_MFS9_CSIO_SCSFR1_CS2SPI              *((volatile uint32_t*)(0x427126B4UL))
#define bFM_MFS9_CSIO_SCSFR1_CS2SCINV             *((volatile uint32_t*)(0x427126B8UL))
#define bFM4_MFS9_CSIO_SCSFR1_CS2SCINV            *((volatile uint32_t*)(0x427126B8UL))
#define bFM_MFS9_CSIO_SCSFR1_CS2CSLVL             *((volatile uint32_t*)(0x427126BCUL))
#define bFM4_MFS9_CSIO_SCSFR1_CS2CSLVL            *((volatile uint32_t*)(0x427126BCUL))

#define bFM_MFS9_CSIO_SCSFR2_CS3SPI               *((volatile uint32_t*)(0x42712714UL))
#define bFM4_MFS9_CSIO_SCSFR2_CS3SPI              *((volatile uint32_t*)(0x42712714UL))
#define bFM_MFS9_CSIO_SCSFR2_CS3SCINV             *((volatile uint32_t*)(0x42712718UL))
#define bFM4_MFS9_CSIO_SCSFR2_CS3SCINV            *((volatile uint32_t*)(0x42712718UL))
#define bFM_MFS9_CSIO_SCSFR2_CS3CSLVL             *((volatile uint32_t*)(0x4271271CUL))
#define bFM4_MFS9_CSIO_SCSFR2_CS3CSLVL            *((volatile uint32_t*)(0x4271271CUL))

