neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFS9_UART_FCR_FE1                     *((volatile uint32_t*)(0x42712280UL))
#define bFM4_MFS9_UART_FCR_FE1                    *((volatile uint32_t*)(0x42712280UL))
#define bFM_MFS9_UART_FCR_FE2                     *((volatile uint32_t*)(0x42712284UL))
#define bFM4_MFS9_UART_FCR_FE2                    *((volatile uint32_t*)(0x42712284UL))
#define bFM_MFS9_UART_FCR_FCL1                    *((volatile uint32_t*)(0x42712288UL))
#define bFM4_MFS9_UART_FCR_FCL1                   *((volatile uint32_t*)(0x42712288UL))
#define bFM_MFS9_UART_FCR_FCL2                    *((volatile uint32_t*)(0x4271228CUL))
#define bFM4_MFS9_UART_FCR_FCL2                   *((volatile uint32_t*)(0x4271228CUL))
#define bFM_MFS9_UART_FCR_FSET                    *((volatile uint32_t*)(0x42712290UL))
#define bFM4_MFS9_UART_FCR_FSET                   *((volatile uint32_t*)(0x42712290UL))
#define bFM_MFS9_UART_FCR_FLD                     *((volatile uint32_t*)(0x42712294UL))
#define bFM4_MFS9_UART_FCR_FLD                    *((volatile uint32_t*)(0x42712294UL))
#define bFM_MFS9_UART_FCR_FLST                    *((volatile uint32_t*)(0x42712298UL))
#define bFM4_MFS9_UART_FCR_FLST                   *((volatile uint32_t*)(0x42712298UL))
#define bFM_MFS9_UART_FCR_FSEL                    *((volatile uint32_t*)(0x427122A0UL))
#define bFM4_MFS9_UART_FCR_FSEL                   *((volatile uint32_t*)(0x427122A0UL))
#define bFM_MFS9_UART_FCR_FTIE                    *((volatile uint32_t*)(0x427122A4UL))
#define bFM4_MFS9_UART_FCR_FTIE                   *((volatile uint32_t*)(0x427122A4UL))
#define bFM_MFS9_UART_FCR_FDRQ                    *((volatile uint32_t*)(0x427122A8UL))
#define bFM4_MFS9_UART_FCR_FDRQ                   *((volatile uint32_t*)(0x427122A8UL))
#define bFM_MFS9_UART_FCR_FRIIE                   *((volatile uint32_t*)(0x427122ACUL))
#define bFM4_MFS9_UART_FCR_FRIIE                  *((volatile uint32_t*)(0x427122ACUL))
#define bFM_MFS9_UART_FCR_FLSTE                   *((volatile uint32_t*)(0x427122B0UL))
#define bFM4_MFS9_UART_FCR_FLSTE                  *((volatile uint32_t*)(0x427122B0UL))

#define bFM_MFS9_UART_SCR_TXE                     *((volatile uint32_t*)(0x42712020UL))
#define bFM4_MFS9_UART_SCR_TXE                    *((volatile uint32_t*)(0x42712020UL))
#define bFM_MFS9_UART_SCR_RXE                     *((volatile uint32_t*)(0x42712024UL))
#define bFM4_MFS9_UART_SCR_RXE                    *((volatile uint32_t*)(0x42712024UL))
#define bFM_MFS9_UART_SCR_TBIE                    *((volatile uint32_t*)(0x42712028UL))
#define bFM4_MFS9_UART_SCR_TBIE                   *((volatile uint32_t*)(0x42712028UL))
#define bFM_MFS9_UART_SCR_TIE                     *((volatile uint32_t*)(0x4271202CUL))
#define bFM4_MFS9_UART_SCR_TIE                    *((volatile uint32_t*)(0x4271202CUL))
#define bFM_MFS9_UART_SCR_RIE                     *((volatile uint32_t*)(0x42712030UL))
#define bFM4_MFS9_UART_SCR_RIE                    *((volatile uint32_t*)(0x42712030UL))
#define bFM_MFS9_UART_SCR_UPCL                    *((volatile uint32_t*)(0x4271203CUL))
#define bFM4_MFS9_UART_SCR_UPCL                   *((volatile uint32_t*)(0x4271203CUL))

#define bFM_MFS9_UART_SMR_SOE                     *((volatile uint32_t*)(0x42712000UL))
#define bFM4_MFS9_UART_SMR_SOE                    *((volatile uint32_t*)(0x42712000UL))
#define bFM_MFS9_UART_SMR_BDS                     *((volatile uint32_t*)(0x42712008UL))
#define bFM4_MFS9_UART_SMR_BDS                    *((volatile uint32_t*)(0x42712008UL))
#define bFM_MFS9_UART_SMR_SBL                     *((volatile uint32_t*)(0x4271200CUL))
#define bFM4_MFS9_UART_SMR_SBL                    *((volatile uint32_t*)(0x4271200CUL))

#define bFM_MFS9_UART_SSR_TBI                     *((volatile uint32_t*)(0x427120A0UL))
#define bFM4_MFS9_UART_SSR_TBI                    *((volatile uint32_t*)(0x427120A0UL))
#define bFM_MFS9_UART_SSR_TDRE                    *((volatile uint32_t*)(0x427120A4UL))
#define bFM4_MFS9_UART_SSR_TDRE                   *((volatile uint32_t*)(0x427120A4UL))
#define bFM_MFS9_UART_SSR_RDRF                    *((volatile uint32_t*)(0x427120A8UL))
#define bFM4_MFS9_UART_SSR_RDRF                   *((volatile uint32_t*)(0x427120A8UL))
#define bFM_MFS9_UART_SSR_ORE                     *((volatile uint32_t*)(0x427120ACUL))
#define bFM4_MFS9_UART_SSR_ORE                    *((volatile uint32_t*)(0x427120ACUL))
#define bFM_MFS9_UART_SSR_FRE                     *((volatile uint32_t*)(0x427120B0UL))
#define bFM4_MFS9_UART_SSR_FRE                    *((volatile uint32_t*)(0x427120B0UL))
#define bFM_MFS9_UART_SSR_PE                      *((volatile uint32_t*)(0x427120B4UL))
#define bFM4_MFS9_UART_SSR_PE                     *((volatile uint32_t*)(0x427120B4UL))
#define bFM_MFS9_UART_SSR_REC                     *((volatile uint32_t*)(0x427120BCUL))
#define bFM4_MFS9_UART_SSR_REC                    *((volatile uint32_t*)(0x427120BCUL))


/******************************************************************************
 ** MFT_PPG Registers MFT_PPG
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFT_PPG_GATEC0_EDGE0                  *((volatile uint32_t*)(0x42484300UL))
#define bFM4_MFT_PPG_GATEC0_EDGE0                 *((volatile uint32_t*)(0x42484300UL))
#define bFM_MFT_PPG_GATEC0_STRG0                  *((volatile uint32_t*)(0x42484304UL))
#define bFM4_MFT_PPG_GATEC0_STRG0                 *((volatile uint32_t*)(0x42484304UL))
#define bFM_MFT_PPG_GATEC0_EDGE2                  *((volatile uint32_t*)(0x42484310UL))
#define bFM4_MFT_PPG_GATEC0_EDGE2                 *((volatile uint32_t*)(0x42484310UL))
#define bFM_MFT_PPG_GATEC0_STRG2                  *((volatile uint32_t*)(0x42484314UL))
#define bFM4_MFT_PPG_GATEC0_STRG2                 *((volatile uint32_t*)(0x42484314UL))

#define bFM_MFT_PPG_GATEC12_EDGE12                *((volatile uint32_t*)(0x42485B00UL))
#define bFM4_MFT_PPG_GATEC12_EDGE12               *((volatile uint32_t*)(0x42485B00UL))
#define bFM_MFT_PPG_GATEC12_STRG12                *((volatile uint32_t*)(0x42485B04UL))
#define bFM4_MFT_PPG_GATEC12_STRG12               *((volatile uint32_t*)(0x42485B04UL))
#define bFM_MFT_PPG_GATEC12_EDGE14                *((volatile uint32_t*)(0x42485B10UL))
#define bFM4_MFT_PPG_GATEC12_EDGE14               *((volatile uint32_t*)(0x42485B10UL))
#define bFM_MFT_PPG_GATEC12_STRG14                *((volatile uint32_t*)(0x42485B14UL))
#define bFM4_MFT_PPG_GATEC12_STRG14               *((volatile uint32_t*)(0x42485B14UL))

#define bFM_MFT_PPG_GATEC16_EDGE16                *((volatile uint32_t*)(0x42486300UL))
#define bFM4_MFT_PPG_GATEC16_EDGE16               *((volatile uint32_t*)(0x42486300UL))
#define bFM_MFT_PPG_GATEC16_STRG16                *((volatile uint32_t*)(0x42486304UL))
#define bFM4_MFT_PPG_GATEC16_STRG16               *((volatile uint32_t*)(0x42486304UL))
#define bFM_MFT_PPG_GATEC16_EDGE18                *((volatile uint32_t*)(0x42486310UL))
#define bFM4_MFT_PPG_GATEC16_EDGE18               *((volatile uint32_t*)(0x42486310UL))
#define bFM_MFT_PPG_GATEC16_STRG18                *((volatile uint32_t*)(0x42486314UL))
#define bFM4_MFT_PPG_GATEC16_STRG18               *((volatile uint32_t*)(0x42486314UL))

