neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT_PPG_PPGC20_TTRG                   *((volatile uint32_t*)(0x42486820UL))
#define bFM4_MFT_PPG_PPGC20_TTRG                  *((volatile uint32_t*)(0x42486820UL))
#define bFM_MFT_PPG_PPGC20_INTM                   *((volatile uint32_t*)(0x42486834UL))
#define bFM4_MFT_PPG_PPGC20_INTM                  *((volatile uint32_t*)(0x42486834UL))
#define bFM_MFT_PPG_PPGC20_PUF                    *((volatile uint32_t*)(0x42486838UL))
#define bFM4_MFT_PPG_PPGC20_PUF                   *((volatile uint32_t*)(0x42486838UL))
#define bFM_MFT_PPG_PPGC20_PIE                    *((volatile uint32_t*)(0x4248683CUL))
#define bFM4_MFT_PPG_PPGC20_PIE                   *((volatile uint32_t*)(0x4248683CUL))

#define bFM_MFT_PPG_PPGC21_INTM                   *((volatile uint32_t*)(0x42486814UL))
#define bFM4_MFT_PPG_PPGC21_INTM                  *((volatile uint32_t*)(0x42486814UL))
#define bFM_MFT_PPG_PPGC21_PUF                    *((volatile uint32_t*)(0x42486818UL))
#define bFM4_MFT_PPG_PPGC21_PUF                   *((volatile uint32_t*)(0x42486818UL))
#define bFM_MFT_PPG_PPGC21_PIE                    *((volatile uint32_t*)(0x4248681CUL))
#define bFM4_MFT_PPG_PPGC21_PIE                   *((volatile uint32_t*)(0x4248681CUL))

#define bFM_MFT_PPG_PPGC22_TTRG                   *((volatile uint32_t*)(0x424868A0UL))
#define bFM4_MFT_PPG_PPGC22_TTRG                  *((volatile uint32_t*)(0x424868A0UL))
#define bFM_MFT_PPG_PPGC22_INTM                   *((volatile uint32_t*)(0x424868B4UL))
#define bFM4_MFT_PPG_PPGC22_INTM                  *((volatile uint32_t*)(0x424868B4UL))
#define bFM_MFT_PPG_PPGC22_PUF                    *((volatile uint32_t*)(0x424868B8UL))
#define bFM4_MFT_PPG_PPGC22_PUF                   *((volatile uint32_t*)(0x424868B8UL))
#define bFM_MFT_PPG_PPGC22_PIE                    *((volatile uint32_t*)(0x424868BCUL))
#define bFM4_MFT_PPG_PPGC22_PIE                   *((volatile uint32_t*)(0x424868BCUL))

#define bFM_MFT_PPG_PPGC23_INTM                   *((volatile uint32_t*)(0x42486894UL))
#define bFM4_MFT_PPG_PPGC23_INTM                  *((volatile uint32_t*)(0x42486894UL))
#define bFM_MFT_PPG_PPGC23_PUF                    *((volatile uint32_t*)(0x42486898UL))
#define bFM4_MFT_PPG_PPGC23_PUF                   *((volatile uint32_t*)(0x42486898UL))
#define bFM_MFT_PPG_PPGC23_PIE                    *((volatile uint32_t*)(0x4248689CUL))
#define bFM4_MFT_PPG_PPGC23_PIE                   *((volatile uint32_t*)(0x4248689CUL))

#define bFM_MFT_PPG_PPGC3_INTM                    *((volatile uint32_t*)(0x42484094UL))
#define bFM4_MFT_PPG_PPGC3_INTM                   *((volatile uint32_t*)(0x42484094UL))
#define bFM_MFT_PPG_PPGC3_PUF                     *((volatile uint32_t*)(0x42484098UL))
#define bFM4_MFT_PPG_PPGC3_PUF                    *((volatile uint32_t*)(0x42484098UL))
#define bFM_MFT_PPG_PPGC3_PIE                     *((volatile uint32_t*)(0x4248409CUL))
#define bFM4_MFT_PPG_PPGC3_PIE                    *((volatile uint32_t*)(0x4248409CUL))

#define bFM_MFT_PPG_PPGC4_TTRG                    *((volatile uint32_t*)(0x42484820UL))
#define bFM4_MFT_PPG_PPGC4_TTRG                   *((volatile uint32_t*)(0x42484820UL))
#define bFM_MFT_PPG_PPGC4_INTM                    *((volatile uint32_t*)(0x42484834UL))
#define bFM4_MFT_PPG_PPGC4_INTM                   *((volatile uint32_t*)(0x42484834UL))
#define bFM_MFT_PPG_PPGC4_PUF                     *((volatile uint32_t*)(0x42484838UL))
#define bFM4_MFT_PPG_PPGC4_PUF                    *((volatile uint32_t*)(0x42484838UL))
#define bFM_MFT_PPG_PPGC4_PIE                     *((volatile uint32_t*)(0x4248483CUL))
#define bFM4_MFT_PPG_PPGC4_PIE                    *((volatile uint32_t*)(0x4248483CUL))

#define bFM_MFT_PPG_PPGC5_INTM                    *((volatile uint32_t*)(0x42484814UL))
#define bFM4_MFT_PPG_PPGC5_INTM                   *((volatile uint32_t*)(0x42484814UL))
#define bFM_MFT_PPG_PPGC5_PUF                     *((volatile uint32_t*)(0x42484818UL))
#define bFM4_MFT_PPG_PPGC5_PUF                    *((volatile uint32_t*)(0x42484818UL))
#define bFM_MFT_PPG_PPGC5_PIE                     *((volatile uint32_t*)(0x4248481CUL))
#define bFM4_MFT_PPG_PPGC5_PIE                    *((volatile uint32_t*)(0x4248481CUL))

#define bFM_MFT_PPG_PPGC6_TTRG                    *((volatile uint32_t*)(0x424848A0UL))
#define bFM4_MFT_PPG_PPGC6_TTRG                   *((volatile uint32_t*)(0x424848A0UL))
#define bFM_MFT_PPG_PPGC6_INTM                    *((volatile uint32_t*)(0x424848B4UL))
#define bFM4_MFT_PPG_PPGC6_INTM                   *((volatile uint32_t*)(0x424848B4UL))
#define bFM_MFT_PPG_PPGC6_PUF                     *((volatile uint32_t*)(0x424848B8UL))
#define bFM4_MFT_PPG_PPGC6_PUF                    *((volatile uint32_t*)(0x424848B8UL))
#define bFM_MFT_PPG_PPGC6_PIE                     *((volatile uint32_t*)(0x424848BCUL))
#define bFM4_MFT_PPG_PPGC6_PIE                    *((volatile uint32_t*)(0x424848BCUL))

#define bFM_MFT_PPG_PPGC7_INTM                    *((volatile uint32_t*)(0x42484894UL))
#define bFM4_MFT_PPG_PPGC7_INTM                   *((volatile uint32_t*)(0x42484894UL))
#define bFM_MFT_PPG_PPGC7_PUF                     *((volatile uint32_t*)(0x42484898UL))
#define bFM4_MFT_PPG_PPGC7_PUF                    *((volatile uint32_t*)(0x42484898UL))
#define bFM_MFT_PPG_PPGC7_PIE                     *((volatile uint32_t*)(0x4248489CUL))
#define bFM4_MFT_PPG_PPGC7_PIE                    *((volatile uint32_t*)(0x4248489CUL))

#define bFM_MFT_PPG_PPGC8_TTRG                    *((volatile uint32_t*)(0x42485020UL))
#define bFM4_MFT_PPG_PPGC8_TTRG                   *((volatile uint32_t*)(0x42485020UL))
#define bFM_MFT_PPG_PPGC8_INTM                    *((volatile uint32_t*)(0x42485034UL))
#define bFM4_MFT_PPG_PPGC8_INTM                   *((volatile uint32_t*)(0x42485034UL))
#define bFM_MFT_PPG_PPGC8_PUF                     *((volatile uint32_t*)(0x42485038UL))
#define bFM4_MFT_PPG_PPGC8_PUF                    *((volatile uint32_t*)(0x42485038UL))
#define bFM_MFT_PPG_PPGC8_PIE                     *((volatile uint32_t*)(0x4248503CUL))
#define bFM4_MFT_PPG_PPGC8_PIE                    *((volatile uint32_t*)(0x4248503CUL))

