neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT_PPG_PPGC9_INTM                    *((volatile uint32_t*)(0x42485014UL))
#define bFM4_MFT_PPG_PPGC9_INTM                   *((volatile uint32_t*)(0x42485014UL))
#define bFM_MFT_PPG_PPGC9_PUF                     *((volatile uint32_t*)(0x42485018UL))
#define bFM4_MFT_PPG_PPGC9_PUF                    *((volatile uint32_t*)(0x42485018UL))
#define bFM_MFT_PPG_PPGC9_PIE                     *((volatile uint32_t*)(0x4248501CUL))
#define bFM4_MFT_PPG_PPGC9_PIE                    *((volatile uint32_t*)(0x4248501CUL))

#define bFM_MFT_PPG_REVC0_REV00                   *((volatile uint32_t*)(0x42482080UL))
#define bFM4_MFT_PPG_REVC0_REV00                  *((volatile uint32_t*)(0x42482080UL))
#define bFM_MFT_PPG_REVC0_REV01                   *((volatile uint32_t*)(0x42482084UL))
#define bFM4_MFT_PPG_REVC0_REV01                  *((volatile uint32_t*)(0x42482084UL))
#define bFM_MFT_PPG_REVC0_REV02                   *((volatile uint32_t*)(0x42482088UL))
#define bFM4_MFT_PPG_REVC0_REV02                  *((volatile uint32_t*)(0x42482088UL))
#define bFM_MFT_PPG_REVC0_REV03                   *((volatile uint32_t*)(0x4248208CUL))
#define bFM4_MFT_PPG_REVC0_REV03                  *((volatile uint32_t*)(0x4248208CUL))
#define bFM_MFT_PPG_REVC0_REV04                   *((volatile uint32_t*)(0x42482090UL))
#define bFM4_MFT_PPG_REVC0_REV04                  *((volatile uint32_t*)(0x42482090UL))
#define bFM_MFT_PPG_REVC0_REV05                   *((volatile uint32_t*)(0x42482094UL))
#define bFM4_MFT_PPG_REVC0_REV05                  *((volatile uint32_t*)(0x42482094UL))
#define bFM_MFT_PPG_REVC0_REV06                   *((volatile uint32_t*)(0x42482098UL))
#define bFM4_MFT_PPG_REVC0_REV06                  *((volatile uint32_t*)(0x42482098UL))
#define bFM_MFT_PPG_REVC0_REV07                   *((volatile uint32_t*)(0x4248209CUL))
#define bFM4_MFT_PPG_REVC0_REV07                  *((volatile uint32_t*)(0x4248209CUL))
#define bFM_MFT_PPG_REVC0_REV08                   *((volatile uint32_t*)(0x424820A0UL))
#define bFM4_MFT_PPG_REVC0_REV08                  *((volatile uint32_t*)(0x424820A0UL))
#define bFM_MFT_PPG_REVC0_REV09                   *((volatile uint32_t*)(0x424820A4UL))
#define bFM4_MFT_PPG_REVC0_REV09                  *((volatile uint32_t*)(0x424820A4UL))
#define bFM_MFT_PPG_REVC0_REV10                   *((volatile uint32_t*)(0x424820A8UL))
#define bFM4_MFT_PPG_REVC0_REV10                  *((volatile uint32_t*)(0x424820A8UL))
#define bFM_MFT_PPG_REVC0_REV11                   *((volatile uint32_t*)(0x424820ACUL))
#define bFM4_MFT_PPG_REVC0_REV11                  *((volatile uint32_t*)(0x424820ACUL))
#define bFM_MFT_PPG_REVC0_REV12                   *((volatile uint32_t*)(0x424820B0UL))
#define bFM4_MFT_PPG_REVC0_REV12                  *((volatile uint32_t*)(0x424820B0UL))
#define bFM_MFT_PPG_REVC0_REV13                   *((volatile uint32_t*)(0x424820B4UL))
#define bFM4_MFT_PPG_REVC0_REV13                  *((volatile uint32_t*)(0x424820B4UL))
#define bFM_MFT_PPG_REVC0_REV14                   *((volatile uint32_t*)(0x424820B8UL))
#define bFM4_MFT_PPG_REVC0_REV14                  *((volatile uint32_t*)(0x424820B8UL))
#define bFM_MFT_PPG_REVC0_REV15                   *((volatile uint32_t*)(0x424820BCUL))
#define bFM4_MFT_PPG_REVC0_REV15                  *((volatile uint32_t*)(0x424820BCUL))

#define bFM_MFT_PPG_REVC1_REV16                   *((volatile uint32_t*)(0x42482880UL))
#define bFM4_MFT_PPG_REVC1_REV16                  *((volatile uint32_t*)(0x42482880UL))
#define bFM_MFT_PPG_REVC1_REV17                   *((volatile uint32_t*)(0x42482884UL))
#define bFM4_MFT_PPG_REVC1_REV17                  *((volatile uint32_t*)(0x42482884UL))
#define bFM_MFT_PPG_REVC1_REV18                   *((volatile uint32_t*)(0x42482888UL))
#define bFM4_MFT_PPG_REVC1_REV18                  *((volatile uint32_t*)(0x42482888UL))
#define bFM_MFT_PPG_REVC1_REV19                   *((volatile uint32_t*)(0x4248288CUL))
#define bFM4_MFT_PPG_REVC1_REV19                  *((volatile uint32_t*)(0x4248288CUL))
#define bFM_MFT_PPG_REVC1_REV20                   *((volatile uint32_t*)(0x42482890UL))
#define bFM4_MFT_PPG_REVC1_REV20                  *((volatile uint32_t*)(0x42482890UL))
#define bFM_MFT_PPG_REVC1_REV21                   *((volatile uint32_t*)(0x42482894UL))
#define bFM4_MFT_PPG_REVC1_REV21                  *((volatile uint32_t*)(0x42482894UL))
#define bFM_MFT_PPG_REVC1_REV22                   *((volatile uint32_t*)(0x42482898UL))
#define bFM4_MFT_PPG_REVC1_REV22                  *((volatile uint32_t*)(0x42482898UL))
#define bFM_MFT_PPG_REVC1_REV23                   *((volatile uint32_t*)(0x4248289CUL))
#define bFM4_MFT_PPG_REVC1_REV23                  *((volatile uint32_t*)(0x4248289CUL))

#define bFM_MFT_PPG_TRG0_PEN00                    *((volatile uint32_t*)(0x42482000UL))
#define bFM4_MFT_PPG_TRG0_PEN00                   *((volatile uint32_t*)(0x42482000UL))
#define bFM_MFT_PPG_TRG0_PEN01                    *((volatile uint32_t*)(0x42482004UL))
#define bFM4_MFT_PPG_TRG0_PEN01                   *((volatile uint32_t*)(0x42482004UL))
#define bFM_MFT_PPG_TRG0_PEN02                    *((volatile uint32_t*)(0x42482008UL))
#define bFM4_MFT_PPG_TRG0_PEN02                   *((volatile uint32_t*)(0x42482008UL))
#define bFM_MFT_PPG_TRG0_PEN03                    *((volatile uint32_t*)(0x4248200CUL))
#define bFM4_MFT_PPG_TRG0_PEN03                   *((volatile uint32_t*)(0x4248200CUL))
#define bFM_MFT_PPG_TRG0_PEN04                    *((volatile uint32_t*)(0x42482010UL))
#define bFM4_MFT_PPG_TRG0_PEN04                   *((volatile uint32_t*)(0x42482010UL))
#define bFM_MFT_PPG_TRG0_PEN05                    *((volatile uint32_t*)(0x42482014UL))
#define bFM4_MFT_PPG_TRG0_PEN05                   *((volatile uint32_t*)(0x42482014UL))
#define bFM_MFT_PPG_TRG0_PEN06                    *((volatile uint32_t*)(0x42482018UL))
#define bFM4_MFT_PPG_TRG0_PEN06                   *((volatile uint32_t*)(0x42482018UL))
#define bFM_MFT_PPG_TRG0_PEN07                    *((volatile uint32_t*)(0x4248201CUL))
#define bFM4_MFT_PPG_TRG0_PEN07                   *((volatile uint32_t*)(0x4248201CUL))
#define bFM_MFT_PPG_TRG0_PEN08                    *((volatile uint32_t*)(0x42482020UL))
#define bFM4_MFT_PPG_TRG0_PEN08                   *((volatile uint32_t*)(0x42482020UL))
#define bFM_MFT_PPG_TRG0_PEN09                    *((volatile uint32_t*)(0x42482024UL))
#define bFM4_MFT_PPG_TRG0_PEN09                   *((volatile uint32_t*)(0x42482024UL))
#define bFM_MFT_PPG_TRG0_PEN10                    *((volatile uint32_t*)(0x42482028UL))
#define bFM4_MFT_PPG_TRG0_PEN10                   *((volatile uint32_t*)(0x42482028UL))
#define bFM_MFT_PPG_TRG0_PEN11                    *((volatile uint32_t*)(0x4248202CUL))
#define bFM4_MFT_PPG_TRG0_PEN11                   *((volatile uint32_t*)(0x4248202CUL))
#define bFM_MFT_PPG_TRG0_PEN12                    *((volatile uint32_t*)(0x42482030UL))
#define bFM4_MFT_PPG_TRG0_PEN12                   *((volatile uint32_t*)(0x42482030UL))
#define bFM_MFT_PPG_TRG0_PEN13                    *((volatile uint32_t*)(0x42482034UL))
#define bFM4_MFT_PPG_TRG0_PEN13                   *((volatile uint32_t*)(0x42482034UL))
#define bFM_MFT_PPG_TRG0_PEN14                    *((volatile uint32_t*)(0x42482038UL))
#define bFM4_MFT_PPG_TRG0_PEN14                   *((volatile uint32_t*)(0x42482038UL))
#define bFM_MFT_PPG_TRG0_PEN15                    *((volatile uint32_t*)(0x4248203CUL))
#define bFM4_MFT_PPG_TRG0_PEN15                   *((volatile uint32_t*)(0x4248203CUL))

#define bFM_MFT_PPG_TRG1_PEN16                    *((volatile uint32_t*)(0x42482800UL))
#define bFM4_MFT_PPG_TRG1_PEN16                   *((volatile uint32_t*)(0x42482800UL))
#define bFM_MFT_PPG_TRG1_PEN17                    *((volatile uint32_t*)(0x42482804UL))
#define bFM4_MFT_PPG_TRG1_PEN17                   *((volatile uint32_t*)(0x42482804UL))
#define bFM_MFT_PPG_TRG1_PEN18                    *((volatile uint32_t*)(0x42482808UL))
#define bFM4_MFT_PPG_TRG1_PEN18                   *((volatile uint32_t*)(0x42482808UL))
#define bFM_MFT_PPG_TRG1_PEN19                    *((volatile uint32_t*)(0x4248280CUL))
#define bFM4_MFT_PPG_TRG1_PEN19                   *((volatile uint32_t*)(0x4248280CUL))
#define bFM_MFT_PPG_TRG1_PEN20                    *((volatile uint32_t*)(0x42482810UL))
#define bFM4_MFT_PPG_TRG1_PEN20                   *((volatile uint32_t*)(0x42482810UL))
#define bFM_MFT_PPG_TRG1_PEN21                    *((volatile uint32_t*)(0x42482814UL))
#define bFM4_MFT_PPG_TRG1_PEN21                   *((volatile uint32_t*)(0x42482814UL))
#define bFM_MFT_PPG_TRG1_PEN22                    *((volatile uint32_t*)(0x42482818UL))
#define bFM4_MFT_PPG_TRG1_PEN22                   *((volatile uint32_t*)(0x42482818UL))
#define bFM_MFT_PPG_TRG1_PEN23                    *((volatile uint32_t*)(0x4248281CUL))
#define bFM4_MFT_PPG_TRG1_PEN23                   *((volatile uint32_t*)(0x4248281CUL))

