neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT_PPG_TTCR0_STR0                    *((volatile uint32_t*)(0x42480020UL))
#define bFM4_MFT_PPG_TTCR0_STR0                   *((volatile uint32_t*)(0x42480020UL))
#define bFM_MFT_PPG_TTCR0_MONI0                   *((volatile uint32_t*)(0x42480024UL))
#define bFM4_MFT_PPG_TTCR0_MONI0                  *((volatile uint32_t*)(0x42480024UL))
#define bFM_MFT_PPG_TTCR0_TRG0O                   *((volatile uint32_t*)(0x42480030UL))
#define bFM4_MFT_PPG_TTCR0_TRG0O                  *((volatile uint32_t*)(0x42480030UL))
#define bFM_MFT_PPG_TTCR0_TRG2O                   *((volatile uint32_t*)(0x42480034UL))
#define bFM4_MFT_PPG_TTCR0_TRG2O                  *((volatile uint32_t*)(0x42480034UL))
#define bFM_MFT_PPG_TTCR0_TRG4O                   *((volatile uint32_t*)(0x42480038UL))
#define bFM4_MFT_PPG_TTCR0_TRG4O                  *((volatile uint32_t*)(0x42480038UL))
#define bFM_MFT_PPG_TTCR0_TRG6O                   *((volatile uint32_t*)(0x4248003CUL))
#define bFM4_MFT_PPG_TTCR0_TRG6O                  *((volatile uint32_t*)(0x4248003CUL))

#define bFM_MFT_PPG_TTCR1_STR1                    *((volatile uint32_t*)(0x42480420UL))
#define bFM4_MFT_PPG_TTCR1_STR1                   *((volatile uint32_t*)(0x42480420UL))
#define bFM_MFT_PPG_TTCR1_MONI1                   *((volatile uint32_t*)(0x42480424UL))
#define bFM4_MFT_PPG_TTCR1_MONI1                  *((volatile uint32_t*)(0x42480424UL))
#define bFM_MFT_PPG_TTCR1_TRG1O                   *((volatile uint32_t*)(0x42480430UL))
#define bFM4_MFT_PPG_TTCR1_TRG1O                  *((volatile uint32_t*)(0x42480430UL))
#define bFM_MFT_PPG_TTCR1_TRG3O                   *((volatile uint32_t*)(0x42480434UL))
#define bFM4_MFT_PPG_TTCR1_TRG3O                  *((volatile uint32_t*)(0x42480434UL))
#define bFM_MFT_PPG_TTCR1_TRG5O                   *((volatile uint32_t*)(0x42480438UL))
#define bFM4_MFT_PPG_TTCR1_TRG5O                  *((volatile uint32_t*)(0x42480438UL))
#define bFM_MFT_PPG_TTCR1_TRG7O                   *((volatile uint32_t*)(0x4248043CUL))
#define bFM4_MFT_PPG_TTCR1_TRG7O                  *((volatile uint32_t*)(0x4248043CUL))

#define bFM_MFT_PPG_TTCR2_STR2                    *((volatile uint32_t*)(0x42480820UL))
#define bFM4_MFT_PPG_TTCR2_STR2                   *((volatile uint32_t*)(0x42480820UL))
#define bFM_MFT_PPG_TTCR2_MONI2                   *((volatile uint32_t*)(0x42480824UL))
#define bFM4_MFT_PPG_TTCR2_MONI2                  *((volatile uint32_t*)(0x42480824UL))
#define bFM_MFT_PPG_TTCR2_TRG16O                  *((volatile uint32_t*)(0x42480830UL))
#define bFM4_MFT_PPG_TTCR2_TRG16O                 *((volatile uint32_t*)(0x42480830UL))
#define bFM_MFT_PPG_TTCR2_TRG18O                  *((volatile uint32_t*)(0x42480834UL))
#define bFM4_MFT_PPG_TTCR2_TRG18O                 *((volatile uint32_t*)(0x42480834UL))
#define bFM_MFT_PPG_TTCR2_TRG20O                  *((volatile uint32_t*)(0x42480838UL))
#define bFM4_MFT_PPG_TTCR2_TRG20O                 *((volatile uint32_t*)(0x42480838UL))
#define bFM_MFT_PPG_TTCR2_TRG22O                  *((volatile uint32_t*)(0x4248083CUL))
#define bFM4_MFT_PPG_TTCR2_TRG22O                 *((volatile uint32_t*)(0x4248083CUL))


/******************************************************************************
 ** MFT Registers MFT0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFT0_ADCMP_ACMC0_MZCE                 *((volatile uint32_t*)(0x42403AD8UL))
#define bFM4_MFT0_ADCMP_ACMC0_MZCE                *((volatile uint32_t*)(0x42403AD8UL))
#define bFM_MFT0_ADCMP_ACMC0_MPCE                 *((volatile uint32_t*)(0x42403ADCUL))
#define bFM4_MFT0_ADCMP_ACMC0_MPCE                *((volatile uint32_t*)(0x42403ADCUL))

#define bFM_MFT0_ADCMP_ACMC1_MZCE                 *((volatile uint32_t*)(0x42403B58UL))
#define bFM4_MFT0_ADCMP_ACMC1_MZCE                *((volatile uint32_t*)(0x42403B58UL))
#define bFM_MFT0_ADCMP_ACMC1_MPCE                 *((volatile uint32_t*)(0x42403B5CUL))
#define bFM4_MFT0_ADCMP_ACMC1_MPCE                *((volatile uint32_t*)(0x42403B5CUL))

#define bFM_MFT0_ADCMP_ACMC2_MZCE                 *((volatile uint32_t*)(0x42403BD8UL))
#define bFM4_MFT0_ADCMP_ACMC2_MZCE                *((volatile uint32_t*)(0x42403BD8UL))
#define bFM_MFT0_ADCMP_ACMC2_MPCE                 *((volatile uint32_t*)(0x42403BDCUL))
#define bFM4_MFT0_ADCMP_ACMC2_MPCE                *((volatile uint32_t*)(0x42403BDCUL))

#define bFM_MFT0_ADCMP_ACMC3_MZCE                 *((volatile uint32_t*)(0x42403C58UL))
#define bFM4_MFT0_ADCMP_ACMC3_MZCE                *((volatile uint32_t*)(0x42403C58UL))
#define bFM_MFT0_ADCMP_ACMC3_MPCE                 *((volatile uint32_t*)(0x42403C5CUL))
#define bFM4_MFT0_ADCMP_ACMC3_MPCE                *((volatile uint32_t*)(0x42403C5CUL))

#define bFM_MFT0_ADCMP_ACMC4_MZCE                 *((volatile uint32_t*)(0x42403CD8UL))
#define bFM4_MFT0_ADCMP_ACMC4_MZCE                *((volatile uint32_t*)(0x42403CD8UL))
#define bFM_MFT0_ADCMP_ACMC4_MPCE                 *((volatile uint32_t*)(0x42403CDCUL))
#define bFM4_MFT0_ADCMP_ACMC4_MPCE                *((volatile uint32_t*)(0x42403CDCUL))

#define bFM_MFT0_ADCMP_ACMC5_MZCE                 *((volatile uint32_t*)(0x42403D58UL))
#define bFM4_MFT0_ADCMP_ACMC5_MZCE                *((volatile uint32_t*)(0x42403D58UL))
#define bFM_MFT0_ADCMP_ACMC5_MPCE                 *((volatile uint32_t*)(0x42403D5CUL))
#define bFM4_MFT0_ADCMP_ACMC5_MPCE                *((volatile uint32_t*)(0x42403D5CUL))

#define bFM_MFT0_ADCMP_ACSC0_APBM                 *((volatile uint32_t*)(0x42403A94UL))
#define bFM4_MFT0_ADCMP_ACSC0_APBM                *((volatile uint32_t*)(0x42403A94UL))

#define bFM_MFT0_ADCMP_ACSC1_APBM                 *((volatile uint32_t*)(0x42403B14UL))
#define bFM4_MFT0_ADCMP_ACSC1_APBM                *((volatile uint32_t*)(0x42403B14UL))

#define bFM_MFT0_ADCMP_ACSC2_APBM                 *((volatile uint32_t*)(0x42403B94UL))
#define bFM4_MFT0_ADCMP_ACSC2_APBM                *((volatile uint32_t*)(0x42403B94UL))

#define bFM_MFT0_ADCMP_ACSC3_APBM                 *((volatile uint32_t*)(0x42403C14UL))
#define bFM4_MFT0_ADCMP_ACSC3_APBM                *((volatile uint32_t*)(0x42403C14UL))

#define bFM_MFT0_ADCMP_ACSC4_APBM                 *((volatile uint32_t*)(0x42403C94UL))
#define bFM4_MFT0_ADCMP_ACSC4_APBM                *((volatile uint32_t*)(0x42403C94UL))

#define bFM_MFT0_ADCMP_ACSC5_APBM                 *((volatile uint32_t*)(0x42403D14UL))
#define bFM4_MFT0_ADCMP_ACSC5_APBM                *((volatile uint32_t*)(0x42403D14UL))

#define bFM_MFT0_ADCMP_ACSD0_AMOD                 *((volatile uint32_t*)(0x42403AA0UL))
#define bFM4_MFT0_ADCMP_ACSD0_AMOD                *((volatile uint32_t*)(0x42403AA0UL))
#define bFM_MFT0_ADCMP_ACSD0_OCUS                 *((volatile uint32_t*)(0x42403AA4UL))
#define bFM4_MFT0_ADCMP_ACSD0_OCUS                *((volatile uint32_t*)(0x42403AA4UL))
#define bFM_MFT0_ADCMP_ACSD0_DE                   *((volatile uint32_t*)(0x42403AB0UL))
#define bFM4_MFT0_ADCMP_ACSD0_DE                  *((volatile uint32_t*)(0x42403AB0UL))
#define bFM_MFT0_ADCMP_ACSD0_PE                   *((volatile uint32_t*)(0x42403AB4UL))
#define bFM4_MFT0_ADCMP_ACSD0_PE                  *((volatile uint32_t*)(0x42403AB4UL))
#define bFM_MFT0_ADCMP_ACSD0_UE                   *((volatile uint32_t*)(0x42403AB8UL))
#define bFM4_MFT0_ADCMP_ACSD0_UE                  *((volatile uint32_t*)(0x42403AB8UL))
#define bFM_MFT0_ADCMP_ACSD0_ZE                   *((volatile uint32_t*)(0x42403ABCUL))
#define bFM4_MFT0_ADCMP_ACSD0_ZE                  *((volatile uint32_t*)(0x42403ABCUL))

