neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT0_FRT_TCSA0_SCLR                   *((volatile uint32_t*)(0x42402910UL))
#define bFM4_MFT0_FRT_TCSA0_SCLR                  *((volatile uint32_t*)(0x42402910UL))
#define bFM_MFT0_FRT_TCSA0_MODE                   *((volatile uint32_t*)(0x42402914UL))
#define bFM4_MFT0_FRT_TCSA0_MODE                  *((volatile uint32_t*)(0x42402914UL))
#define bFM_MFT0_FRT_TCSA0_STOP                   *((volatile uint32_t*)(0x42402918UL))
#define bFM4_MFT0_FRT_TCSA0_STOP                  *((volatile uint32_t*)(0x42402918UL))
#define bFM_MFT0_FRT_TCSA0_BFE                    *((volatile uint32_t*)(0x4240291CUL))
#define bFM4_MFT0_FRT_TCSA0_BFE                   *((volatile uint32_t*)(0x4240291CUL))
#define bFM_MFT0_FRT_TCSA0_ICRE                   *((volatile uint32_t*)(0x42402920UL))
#define bFM4_MFT0_FRT_TCSA0_ICRE                  *((volatile uint32_t*)(0x42402920UL))
#define bFM_MFT0_FRT_TCSA0_ICLR                   *((volatile uint32_t*)(0x42402924UL))
#define bFM4_MFT0_FRT_TCSA0_ICLR                  *((volatile uint32_t*)(0x42402924UL))
#define bFM_MFT0_FRT_TCSA0_IRQZE                  *((volatile uint32_t*)(0x42402934UL))
#define bFM4_MFT0_FRT_TCSA0_IRQZE                 *((volatile uint32_t*)(0x42402934UL))
#define bFM_MFT0_FRT_TCSA0_IRQZF                  *((volatile uint32_t*)(0x42402938UL))
#define bFM4_MFT0_FRT_TCSA0_IRQZF                 *((volatile uint32_t*)(0x42402938UL))
#define bFM_MFT0_FRT_TCSA0_ECKE                   *((volatile uint32_t*)(0x4240293CUL))
#define bFM4_MFT0_FRT_TCSA0_ECKE                  *((volatile uint32_t*)(0x4240293CUL))

#define bFM_MFT0_FRT_TCSA1_SCLR                   *((volatile uint32_t*)(0x42402A90UL))
#define bFM4_MFT0_FRT_TCSA1_SCLR                  *((volatile uint32_t*)(0x42402A90UL))
#define bFM_MFT0_FRT_TCSA1_MODE                   *((volatile uint32_t*)(0x42402A94UL))
#define bFM4_MFT0_FRT_TCSA1_MODE                  *((volatile uint32_t*)(0x42402A94UL))
#define bFM_MFT0_FRT_TCSA1_STOP                   *((volatile uint32_t*)(0x42402A98UL))
#define bFM4_MFT0_FRT_TCSA1_STOP                  *((volatile uint32_t*)(0x42402A98UL))
#define bFM_MFT0_FRT_TCSA1_BFE                    *((volatile uint32_t*)(0x42402A9CUL))
#define bFM4_MFT0_FRT_TCSA1_BFE                   *((volatile uint32_t*)(0x42402A9CUL))
#define bFM_MFT0_FRT_TCSA1_ICRE                   *((volatile uint32_t*)(0x42402AA0UL))
#define bFM4_MFT0_FRT_TCSA1_ICRE                  *((volatile uint32_t*)(0x42402AA0UL))
#define bFM_MFT0_FRT_TCSA1_ICLR                   *((volatile uint32_t*)(0x42402AA4UL))
#define bFM4_MFT0_FRT_TCSA1_ICLR                  *((volatile uint32_t*)(0x42402AA4UL))
#define bFM_MFT0_FRT_TCSA1_IRQZE                  *((volatile uint32_t*)(0x42402AB4UL))
#define bFM4_MFT0_FRT_TCSA1_IRQZE                 *((volatile uint32_t*)(0x42402AB4UL))
#define bFM_MFT0_FRT_TCSA1_IRQZF                  *((volatile uint32_t*)(0x42402AB8UL))
#define bFM4_MFT0_FRT_TCSA1_IRQZF                 *((volatile uint32_t*)(0x42402AB8UL))
#define bFM_MFT0_FRT_TCSA1_ECKE                   *((volatile uint32_t*)(0x42402ABCUL))
#define bFM4_MFT0_FRT_TCSA1_ECKE                  *((volatile uint32_t*)(0x42402ABCUL))

#define bFM_MFT0_FRT_TCSA2_SCLR                   *((volatile uint32_t*)(0x42402C10UL))
#define bFM4_MFT0_FRT_TCSA2_SCLR                  *((volatile uint32_t*)(0x42402C10UL))
#define bFM_MFT0_FRT_TCSA2_MODE                   *((volatile uint32_t*)(0x42402C14UL))
#define bFM4_MFT0_FRT_TCSA2_MODE                  *((volatile uint32_t*)(0x42402C14UL))
#define bFM_MFT0_FRT_TCSA2_STOP                   *((volatile uint32_t*)(0x42402C18UL))
#define bFM4_MFT0_FRT_TCSA2_STOP                  *((volatile uint32_t*)(0x42402C18UL))
#define bFM_MFT0_FRT_TCSA2_BFE                    *((volatile uint32_t*)(0x42402C1CUL))
#define bFM4_MFT0_FRT_TCSA2_BFE                   *((volatile uint32_t*)(0x42402C1CUL))
#define bFM_MFT0_FRT_TCSA2_ICRE                   *((volatile uint32_t*)(0x42402C20UL))
#define bFM4_MFT0_FRT_TCSA2_ICRE                  *((volatile uint32_t*)(0x42402C20UL))
#define bFM_MFT0_FRT_TCSA2_ICLR                   *((volatile uint32_t*)(0x42402C24UL))
#define bFM4_MFT0_FRT_TCSA2_ICLR                  *((volatile uint32_t*)(0x42402C24UL))
#define bFM_MFT0_FRT_TCSA2_IRQZE                  *((volatile uint32_t*)(0x42402C34UL))
#define bFM4_MFT0_FRT_TCSA2_IRQZE                 *((volatile uint32_t*)(0x42402C34UL))
#define bFM_MFT0_FRT_TCSA2_IRQZF                  *((volatile uint32_t*)(0x42402C38UL))
#define bFM4_MFT0_FRT_TCSA2_IRQZF                 *((volatile uint32_t*)(0x42402C38UL))
#define bFM_MFT0_FRT_TCSA2_ECKE                   *((volatile uint32_t*)(0x42402C3CUL))
#define bFM4_MFT0_FRT_TCSA2_ECKE                  *((volatile uint32_t*)(0x42402C3CUL))

#define bFM_MFT0_FRT_TCSD_OFMD1                   *((volatile uint32_t*)(0x42403D80UL))
#define bFM4_MFT0_FRT_TCSD_OFMD1                  *((volatile uint32_t*)(0x42403D80UL))
#define bFM_MFT0_FRT_TCSD_OFMD2                   *((volatile uint32_t*)(0x42403D84UL))
#define bFM4_MFT0_FRT_TCSD_OFMD2                  *((volatile uint32_t*)(0x42403D84UL))

#define bFM_MFT0_ICU_ICSA10_ICE0                  *((volatile uint32_t*)(0x42403090UL))
#define bFM4_MFT0_ICU_ICSA10_ICE0                 *((volatile uint32_t*)(0x42403090UL))
#define bFM_MFT0_ICU_ICSA10_ICE1                  *((volatile uint32_t*)(0x42403094UL))
#define bFM4_MFT0_ICU_ICSA10_ICE1                 *((volatile uint32_t*)(0x42403094UL))
#define bFM_MFT0_ICU_ICSA10_ICP0                  *((volatile uint32_t*)(0x42403098UL))
#define bFM4_MFT0_ICU_ICSA10_ICP0                 *((volatile uint32_t*)(0x42403098UL))
#define bFM_MFT0_ICU_ICSA10_ICP1                  *((volatile uint32_t*)(0x4240309CUL))
#define bFM4_MFT0_ICU_ICSA10_ICP1                 *((volatile uint32_t*)(0x4240309CUL))

#define bFM_MFT0_ICU_ICSA32_ICE0                  *((volatile uint32_t*)(0x42403110UL))
#define bFM4_MFT0_ICU_ICSA32_ICE0                 *((volatile uint32_t*)(0x42403110UL))
#define bFM_MFT0_ICU_ICSA32_ICE1                  *((volatile uint32_t*)(0x42403114UL))
#define bFM4_MFT0_ICU_ICSA32_ICE1                 *((volatile uint32_t*)(0x42403114UL))
#define bFM_MFT0_ICU_ICSA32_ICP0                  *((volatile uint32_t*)(0x42403118UL))
#define bFM4_MFT0_ICU_ICSA32_ICP0                 *((volatile uint32_t*)(0x42403118UL))
#define bFM_MFT0_ICU_ICSA32_ICP1                  *((volatile uint32_t*)(0x4240311CUL))
#define bFM4_MFT0_ICU_ICSA32_ICP1                 *((volatile uint32_t*)(0x4240311CUL))

#define bFM_MFT0_ICU_ICSB10_IEI0                  *((volatile uint32_t*)(0x424030A0UL))
#define bFM4_MFT0_ICU_ICSB10_IEI0                 *((volatile uint32_t*)(0x424030A0UL))
#define bFM_MFT0_ICU_ICSB10_IEI1                  *((volatile uint32_t*)(0x424030A4UL))
#define bFM4_MFT0_ICU_ICSB10_IEI1                 *((volatile uint32_t*)(0x424030A4UL))

#define bFM_MFT0_ICU_ICSB32_IEI0                  *((volatile uint32_t*)(0x42403120UL))
#define bFM4_MFT0_ICU_ICSB32_IEI0                 *((volatile uint32_t*)(0x42403120UL))
#define bFM_MFT0_ICU_ICSB32_IEI1                  *((volatile uint32_t*)(0x42403124UL))
#define bFM4_MFT0_ICU_ICSB32_IEI1                 *((volatile uint32_t*)(0x42403124UL))

