neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT0_OCU_OCSA10_CST0                  *((volatile uint32_t*)(0x42402300UL))
#define bFM4_MFT0_OCU_OCSA10_CST0                 *((volatile uint32_t*)(0x42402300UL))
#define bFM_MFT0_OCU_OCSA10_CST1                  *((volatile uint32_t*)(0x42402304UL))
#define bFM4_MFT0_OCU_OCSA10_CST1                 *((volatile uint32_t*)(0x42402304UL))
#define bFM_MFT0_OCU_OCSA10_IOE0                  *((volatile uint32_t*)(0x42402310UL))
#define bFM4_MFT0_OCU_OCSA10_IOE0                 *((volatile uint32_t*)(0x42402310UL))
#define bFM_MFT0_OCU_OCSA10_IOE1                  *((volatile uint32_t*)(0x42402314UL))
#define bFM4_MFT0_OCU_OCSA10_IOE1                 *((volatile uint32_t*)(0x42402314UL))
#define bFM_MFT0_OCU_OCSA10_IOP0                  *((volatile uint32_t*)(0x42402318UL))
#define bFM4_MFT0_OCU_OCSA10_IOP0                 *((volatile uint32_t*)(0x42402318UL))
#define bFM_MFT0_OCU_OCSA10_IOP1                  *((volatile uint32_t*)(0x4240231CUL))
#define bFM4_MFT0_OCU_OCSA10_IOP1                 *((volatile uint32_t*)(0x4240231CUL))

#define bFM_MFT0_OCU_OCSA32_CST2                  *((volatile uint32_t*)(0x42402380UL))
#define bFM4_MFT0_OCU_OCSA32_CST2                 *((volatile uint32_t*)(0x42402380UL))
#define bFM_MFT0_OCU_OCSA32_CST3                  *((volatile uint32_t*)(0x42402384UL))
#define bFM4_MFT0_OCU_OCSA32_CST3                 *((volatile uint32_t*)(0x42402384UL))
#define bFM_MFT0_OCU_OCSA32_IOE2                  *((volatile uint32_t*)(0x42402390UL))
#define bFM4_MFT0_OCU_OCSA32_IOE2                 *((volatile uint32_t*)(0x42402390UL))
#define bFM_MFT0_OCU_OCSA32_IOE3                  *((volatile uint32_t*)(0x42402394UL))
#define bFM4_MFT0_OCU_OCSA32_IOE3                 *((volatile uint32_t*)(0x42402394UL))
#define bFM_MFT0_OCU_OCSA32_IOP2                  *((volatile uint32_t*)(0x42402398UL))
#define bFM4_MFT0_OCU_OCSA32_IOP2                 *((volatile uint32_t*)(0x42402398UL))
#define bFM_MFT0_OCU_OCSA32_IOP3                  *((volatile uint32_t*)(0x4240239CUL))
#define bFM4_MFT0_OCU_OCSA32_IOP3                 *((volatile uint32_t*)(0x4240239CUL))

#define bFM_MFT0_OCU_OCSA54_CST4                  *((volatile uint32_t*)(0x42402400UL))
#define bFM4_MFT0_OCU_OCSA54_CST4                 *((volatile uint32_t*)(0x42402400UL))
#define bFM_MFT0_OCU_OCSA54_CST5                  *((volatile uint32_t*)(0x42402404UL))
#define bFM4_MFT0_OCU_OCSA54_CST5                 *((volatile uint32_t*)(0x42402404UL))
#define bFM_MFT0_OCU_OCSA54_IOE4                  *((volatile uint32_t*)(0x42402410UL))
#define bFM4_MFT0_OCU_OCSA54_IOE4                 *((volatile uint32_t*)(0x42402410UL))
#define bFM_MFT0_OCU_OCSA54_IOE5                  *((volatile uint32_t*)(0x42402414UL))
#define bFM4_MFT0_OCU_OCSA54_IOE5                 *((volatile uint32_t*)(0x42402414UL))
#define bFM_MFT0_OCU_OCSA54_IOP4                  *((volatile uint32_t*)(0x42402418UL))
#define bFM4_MFT0_OCU_OCSA54_IOP4                 *((volatile uint32_t*)(0x42402418UL))
#define bFM_MFT0_OCU_OCSA54_IOP5                  *((volatile uint32_t*)(0x4240241CUL))
#define bFM4_MFT0_OCU_OCSA54_IOP5                 *((volatile uint32_t*)(0x4240241CUL))

#define bFM_MFT0_OCU_OCSB10_OTD0                  *((volatile uint32_t*)(0x42402320UL))
#define bFM4_MFT0_OCU_OCSB10_OTD0                 *((volatile uint32_t*)(0x42402320UL))
#define bFM_MFT0_OCU_OCSB10_OTD1                  *((volatile uint32_t*)(0x42402324UL))
#define bFM4_MFT0_OCU_OCSB10_OTD1                 *((volatile uint32_t*)(0x42402324UL))
#define bFM_MFT0_OCU_OCSB10_CMOD                  *((volatile uint32_t*)(0x42402330UL))
#define bFM4_MFT0_OCU_OCSB10_CMOD                 *((volatile uint32_t*)(0x42402330UL))
#define bFM_MFT0_OCU_OCSB10_FM4                   *((volatile uint32_t*)(0x4240233CUL))
#define bFM4_MFT0_OCU_OCSB10_FM4                  *((volatile uint32_t*)(0x4240233CUL))

#define bFM_MFT0_OCU_OCSB32_OTD2                  *((volatile uint32_t*)(0x424023A0UL))
#define bFM4_MFT0_OCU_OCSB32_OTD2                 *((volatile uint32_t*)(0x424023A0UL))
#define bFM_MFT0_OCU_OCSB32_OTD3                  *((volatile uint32_t*)(0x424023A4UL))
#define bFM4_MFT0_OCU_OCSB32_OTD3                 *((volatile uint32_t*)(0x424023A4UL))
#define bFM_MFT0_OCU_OCSB32_CMOD                  *((volatile uint32_t*)(0x424023B0UL))
#define bFM4_MFT0_OCU_OCSB32_CMOD                 *((volatile uint32_t*)(0x424023B0UL))
#define bFM_MFT0_OCU_OCSB32_FM4                   *((volatile uint32_t*)(0x424023BCUL))
#define bFM4_MFT0_OCU_OCSB32_FM4                  *((volatile uint32_t*)(0x424023BCUL))

#define bFM_MFT0_OCU_OCSB54_OTD4                  *((volatile uint32_t*)(0x42402420UL))
#define bFM4_MFT0_OCU_OCSB54_OTD4                 *((volatile uint32_t*)(0x42402420UL))
#define bFM_MFT0_OCU_OCSB54_OTD5                  *((volatile uint32_t*)(0x42402424UL))
#define bFM4_MFT0_OCU_OCSB54_OTD5                 *((volatile uint32_t*)(0x42402424UL))
#define bFM_MFT0_OCU_OCSB54_CMOD                  *((volatile uint32_t*)(0x42402430UL))
#define bFM4_MFT0_OCU_OCSB54_CMOD                 *((volatile uint32_t*)(0x42402430UL))
#define bFM_MFT0_OCU_OCSB54_FM4                   *((volatile uint32_t*)(0x4240243CUL))
#define bFM4_MFT0_OCU_OCSB54_FM4                  *((volatile uint32_t*)(0x4240243CUL))

#define bFM_MFT0_OCU_OCSC_MOD0                    *((volatile uint32_t*)(0x424024A0UL))
#define bFM4_MFT0_OCU_OCSC_MOD0                   *((volatile uint32_t*)(0x424024A0UL))
#define bFM_MFT0_OCU_OCSC_MOD1                    *((volatile uint32_t*)(0x424024A4UL))
#define bFM4_MFT0_OCU_OCSC_MOD1                   *((volatile uint32_t*)(0x424024A4UL))
#define bFM_MFT0_OCU_OCSC_MOD2                    *((volatile uint32_t*)(0x424024A8UL))
#define bFM4_MFT0_OCU_OCSC_MOD2                   *((volatile uint32_t*)(0x424024A8UL))
#define bFM_MFT0_OCU_OCSC_MOD3                    *((volatile uint32_t*)(0x424024ACUL))
#define bFM4_MFT0_OCU_OCSC_MOD3                   *((volatile uint32_t*)(0x424024ACUL))
#define bFM_MFT0_OCU_OCSC_MOD4                    *((volatile uint32_t*)(0x424024B0UL))
#define bFM4_MFT0_OCU_OCSC_MOD4                   *((volatile uint32_t*)(0x424024B0UL))
#define bFM_MFT0_OCU_OCSC_MOD5                    *((volatile uint32_t*)(0x424024B4UL))
#define bFM4_MFT0_OCU_OCSC_MOD5                   *((volatile uint32_t*)(0x424024B4UL))

