neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT0_OCU_OCSD10_OPBM0                 *((volatile uint32_t*)(0x42402360UL))
#define bFM4_MFT0_OCU_OCSD10_OPBM0                *((volatile uint32_t*)(0x42402360UL))
#define bFM_MFT0_OCU_OCSD10_OPBM1                 *((volatile uint32_t*)(0x42402364UL))
#define bFM4_MFT0_OCU_OCSD10_OPBM1                *((volatile uint32_t*)(0x42402364UL))
#define bFM_MFT0_OCU_OCSD10_OEBM0                 *((volatile uint32_t*)(0x42402368UL))
#define bFM4_MFT0_OCU_OCSD10_OEBM0                *((volatile uint32_t*)(0x42402368UL))
#define bFM_MFT0_OCU_OCSD10_OEBM1                 *((volatile uint32_t*)(0x4240236CUL))
#define bFM4_MFT0_OCU_OCSD10_OEBM1                *((volatile uint32_t*)(0x4240236CUL))
#define bFM_MFT0_OCU_OCSD10_OFEX0                 *((volatile uint32_t*)(0x42402370UL))
#define bFM4_MFT0_OCU_OCSD10_OFEX0                *((volatile uint32_t*)(0x42402370UL))
#define bFM_MFT0_OCU_OCSD10_OFEX1                 *((volatile uint32_t*)(0x42402374UL))
#define bFM4_MFT0_OCU_OCSD10_OFEX1                *((volatile uint32_t*)(0x42402374UL))

#define bFM_MFT0_OCU_OCSD32_OPBM2                 *((volatile uint32_t*)(0x424023E0UL))
#define bFM4_MFT0_OCU_OCSD32_OPBM2                *((volatile uint32_t*)(0x424023E0UL))
#define bFM_MFT0_OCU_OCSD32_OPBM3                 *((volatile uint32_t*)(0x424023E4UL))
#define bFM4_MFT0_OCU_OCSD32_OPBM3                *((volatile uint32_t*)(0x424023E4UL))
#define bFM_MFT0_OCU_OCSD32_OEBM2                 *((volatile uint32_t*)(0x424023E8UL))
#define bFM4_MFT0_OCU_OCSD32_OEBM2                *((volatile uint32_t*)(0x424023E8UL))
#define bFM_MFT0_OCU_OCSD32_OEBM3                 *((volatile uint32_t*)(0x424023ECUL))
#define bFM4_MFT0_OCU_OCSD32_OEBM3                *((volatile uint32_t*)(0x424023ECUL))
#define bFM_MFT0_OCU_OCSD32_OFEX2                 *((volatile uint32_t*)(0x424023F0UL))
#define bFM4_MFT0_OCU_OCSD32_OFEX2                *((volatile uint32_t*)(0x424023F0UL))
#define bFM_MFT0_OCU_OCSD32_OFEX3                 *((volatile uint32_t*)(0x424023F4UL))
#define bFM4_MFT0_OCU_OCSD32_OFEX3                *((volatile uint32_t*)(0x424023F4UL))

#define bFM_MFT0_OCU_OCSD54_OPBM4                 *((volatile uint32_t*)(0x42402460UL))
#define bFM4_MFT0_OCU_OCSD54_OPBM4                *((volatile uint32_t*)(0x42402460UL))
#define bFM_MFT0_OCU_OCSD54_OPBM5                 *((volatile uint32_t*)(0x42402464UL))
#define bFM4_MFT0_OCU_OCSD54_OPBM5                *((volatile uint32_t*)(0x42402464UL))
#define bFM_MFT0_OCU_OCSD54_OEBM4                 *((volatile uint32_t*)(0x42402468UL))
#define bFM4_MFT0_OCU_OCSD54_OEBM4                *((volatile uint32_t*)(0x42402468UL))
#define bFM_MFT0_OCU_OCSD54_OEBM5                 *((volatile uint32_t*)(0x4240246CUL))
#define bFM4_MFT0_OCU_OCSD54_OEBM5                *((volatile uint32_t*)(0x4240246CUL))
#define bFM_MFT0_OCU_OCSD54_OFEX4                 *((volatile uint32_t*)(0x42402470UL))
#define bFM4_MFT0_OCU_OCSD54_OFEX4                *((volatile uint32_t*)(0x42402470UL))
#define bFM_MFT0_OCU_OCSD54_OFEX5                 *((volatile uint32_t*)(0x42402474UL))
#define bFM4_MFT0_OCU_OCSD54_OFEX5                *((volatile uint32_t*)(0x42402474UL))

#define bFM_MFT0_WFG_NZCL_DTIEA                   *((volatile uint32_t*)(0x42403680UL))
#define bFM4_MFT0_WFG_NZCL_DTIEA                  *((volatile uint32_t*)(0x42403680UL))
#define bFM_MFT0_WFG_NZCL_SDTI                    *((volatile uint32_t*)(0x42403690UL))
#define bFM4_MFT0_WFG_NZCL_SDTI                   *((volatile uint32_t*)(0x42403690UL))
#define bFM_MFT0_WFG_NZCL_DTIEB                   *((volatile uint32_t*)(0x42403694UL))
#define bFM4_MFT0_WFG_NZCL_DTIEB                  *((volatile uint32_t*)(0x42403694UL))
#define bFM_MFT0_WFG_NZCL_DHOLD                   *((volatile uint32_t*)(0x4240369CUL))
#define bFM4_MFT0_WFG_NZCL_DHOLD                  *((volatile uint32_t*)(0x4240369CUL))
#define bFM_MFT0_WFG_NZCL_DIMA                    *((volatile uint32_t*)(0x424036A0UL))
#define bFM4_MFT0_WFG_NZCL_DIMA                   *((volatile uint32_t*)(0x424036A0UL))
#define bFM_MFT0_WFG_NZCL_DIMB                    *((volatile uint32_t*)(0x424036A4UL))
#define bFM4_MFT0_WFG_NZCL_DIMB                   *((volatile uint32_t*)(0x424036A4UL))
#define bFM_MFT0_WFG_NZCL_WIM10                   *((volatile uint32_t*)(0x424036B0UL))
#define bFM4_MFT0_WFG_NZCL_WIM10                  *((volatile uint32_t*)(0x424036B0UL))
#define bFM_MFT0_WFG_NZCL_WIM32                   *((volatile uint32_t*)(0x424036B4UL))
#define bFM4_MFT0_WFG_NZCL_WIM32                  *((volatile uint32_t*)(0x424036B4UL))
#define bFM_MFT0_WFG_NZCL_WIM54                   *((volatile uint32_t*)(0x424036B8UL))
#define bFM4_MFT0_WFG_NZCL_WIM54                  *((volatile uint32_t*)(0x424036B8UL))

#define bFM_MFT0_WFG_WFIR_DTIFA                   *((volatile uint32_t*)(0x42403600UL))
#define bFM4_MFT0_WFG_WFIR_DTIFA                  *((volatile uint32_t*)(0x42403600UL))
#define bFM_MFT0_WFG_WFIR_DTICA                   *((volatile uint32_t*)(0x42403604UL))
#define bFM4_MFT0_WFG_WFIR_DTICA                  *((volatile uint32_t*)(0x42403604UL))
#define bFM_MFT0_WFG_WFIR_DTIFB                   *((volatile uint32_t*)(0x42403608UL))
#define bFM4_MFT0_WFG_WFIR_DTIFB                  *((volatile uint32_t*)(0x42403608UL))
#define bFM_MFT0_WFG_WFIR_DTICB                   *((volatile uint32_t*)(0x4240360CUL))
#define bFM4_MFT0_WFG_WFIR_DTICB                  *((volatile uint32_t*)(0x4240360CUL))
#define bFM_MFT0_WFG_WFIR_TMIF10                  *((volatile uint32_t*)(0x42403610UL))
#define bFM4_MFT0_WFG_WFIR_TMIF10                 *((volatile uint32_t*)(0x42403610UL))
#define bFM_MFT0_WFG_WFIR_TMIC10                  *((volatile uint32_t*)(0x42403614UL))
#define bFM4_MFT0_WFG_WFIR_TMIC10                 *((volatile uint32_t*)(0x42403614UL))
#define bFM_MFT0_WFG_WFIR_TMIE10                  *((volatile uint32_t*)(0x42403618UL))
#define bFM4_MFT0_WFG_WFIR_TMIE10                 *((volatile uint32_t*)(0x42403618UL))
#define bFM_MFT0_WFG_WFIR_TMIS10                  *((volatile uint32_t*)(0x4240361CUL))
#define bFM4_MFT0_WFG_WFIR_TMIS10                 *((volatile uint32_t*)(0x4240361CUL))
#define bFM_MFT0_WFG_WFIR_TMIF32                  *((volatile uint32_t*)(0x42403620UL))
#define bFM4_MFT0_WFG_WFIR_TMIF32                 *((volatile uint32_t*)(0x42403620UL))
#define bFM_MFT0_WFG_WFIR_TMIC32                  *((volatile uint32_t*)(0x42403624UL))
#define bFM4_MFT0_WFG_WFIR_TMIC32                 *((volatile uint32_t*)(0x42403624UL))
#define bFM_MFT0_WFG_WFIR_TMIE32                  *((volatile uint32_t*)(0x42403628UL))
#define bFM4_MFT0_WFG_WFIR_TMIE32                 *((volatile uint32_t*)(0x42403628UL))
#define bFM_MFT0_WFG_WFIR_TMIS32                  *((volatile uint32_t*)(0x4240362CUL))
#define bFM4_MFT0_WFG_WFIR_TMIS32                 *((volatile uint32_t*)(0x4240362CUL))
#define bFM_MFT0_WFG_WFIR_TMIF54                  *((volatile uint32_t*)(0x42403630UL))
#define bFM4_MFT0_WFG_WFIR_TMIF54                 *((volatile uint32_t*)(0x42403630UL))
#define bFM_MFT0_WFG_WFIR_TMIC54                  *((volatile uint32_t*)(0x42403634UL))
#define bFM4_MFT0_WFG_WFIR_TMIC54                 *((volatile uint32_t*)(0x42403634UL))
#define bFM_MFT0_WFG_WFIR_TMIE54                  *((volatile uint32_t*)(0x42403638UL))
#define bFM4_MFT0_WFG_WFIR_TMIE54                 *((volatile uint32_t*)(0x42403638UL))
#define bFM_MFT0_WFG_WFIR_TMIS54                  *((volatile uint32_t*)(0x4240363CUL))
#define bFM4_MFT0_WFG_WFIR_TMIS54                 *((volatile uint32_t*)(0x4240363CUL))


