neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** MFT Registers MFT1
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFT1_ADCMP_ACMC0_MZCE                 *((volatile uint32_t*)(0x42423AD8UL))
#define bFM4_MFT1_ADCMP_ACMC0_MZCE                *((volatile uint32_t*)(0x42423AD8UL))
#define bFM_MFT1_ADCMP_ACMC0_MPCE                 *((volatile uint32_t*)(0x42423ADCUL))
#define bFM4_MFT1_ADCMP_ACMC0_MPCE                *((volatile uint32_t*)(0x42423ADCUL))

#define bFM_MFT1_ADCMP_ACMC1_MZCE                 *((volatile uint32_t*)(0x42423B58UL))
#define bFM4_MFT1_ADCMP_ACMC1_MZCE                *((volatile uint32_t*)(0x42423B58UL))
#define bFM_MFT1_ADCMP_ACMC1_MPCE                 *((volatile uint32_t*)(0x42423B5CUL))
#define bFM4_MFT1_ADCMP_ACMC1_MPCE                *((volatile uint32_t*)(0x42423B5CUL))

#define bFM_MFT1_ADCMP_ACMC2_MZCE                 *((volatile uint32_t*)(0x42423BD8UL))
#define bFM4_MFT1_ADCMP_ACMC2_MZCE                *((volatile uint32_t*)(0x42423BD8UL))
#define bFM_MFT1_ADCMP_ACMC2_MPCE                 *((volatile uint32_t*)(0x42423BDCUL))
#define bFM4_MFT1_ADCMP_ACMC2_MPCE                *((volatile uint32_t*)(0x42423BDCUL))

#define bFM_MFT1_ADCMP_ACMC3_MZCE                 *((volatile uint32_t*)(0x42423C58UL))
#define bFM4_MFT1_ADCMP_ACMC3_MZCE                *((volatile uint32_t*)(0x42423C58UL))
#define bFM_MFT1_ADCMP_ACMC3_MPCE                 *((volatile uint32_t*)(0x42423C5CUL))
#define bFM4_MFT1_ADCMP_ACMC3_MPCE                *((volatile uint32_t*)(0x42423C5CUL))

#define bFM_MFT1_ADCMP_ACMC4_MZCE                 *((volatile uint32_t*)(0x42423CD8UL))
#define bFM4_MFT1_ADCMP_ACMC4_MZCE                *((volatile uint32_t*)(0x42423CD8UL))
#define bFM_MFT1_ADCMP_ACMC4_MPCE                 *((volatile uint32_t*)(0x42423CDCUL))
#define bFM4_MFT1_ADCMP_ACMC4_MPCE                *((volatile uint32_t*)(0x42423CDCUL))

#define bFM_MFT1_ADCMP_ACMC5_MZCE                 *((volatile uint32_t*)(0x42423D58UL))
#define bFM4_MFT1_ADCMP_ACMC5_MZCE                *((volatile uint32_t*)(0x42423D58UL))
#define bFM_MFT1_ADCMP_ACMC5_MPCE                 *((volatile uint32_t*)(0x42423D5CUL))
#define bFM4_MFT1_ADCMP_ACMC5_MPCE                *((volatile uint32_t*)(0x42423D5CUL))

#define bFM_MFT1_ADCMP_ACSC0_APBM                 *((volatile uint32_t*)(0x42423A94UL))
#define bFM4_MFT1_ADCMP_ACSC0_APBM                *((volatile uint32_t*)(0x42423A94UL))

#define bFM_MFT1_ADCMP_ACSC1_APBM                 *((volatile uint32_t*)(0x42423B14UL))
#define bFM4_MFT1_ADCMP_ACSC1_APBM                *((volatile uint32_t*)(0x42423B14UL))

#define bFM_MFT1_ADCMP_ACSC2_APBM                 *((volatile uint32_t*)(0x42423B94UL))
#define bFM4_MFT1_ADCMP_ACSC2_APBM                *((volatile uint32_t*)(0x42423B94UL))

#define bFM_MFT1_ADCMP_ACSC3_APBM                 *((volatile uint32_t*)(0x42423C14UL))
#define bFM4_MFT1_ADCMP_ACSC3_APBM                *((volatile uint32_t*)(0x42423C14UL))

#define bFM_MFT1_ADCMP_ACSC4_APBM                 *((volatile uint32_t*)(0x42423C94UL))
#define bFM4_MFT1_ADCMP_ACSC4_APBM                *((volatile uint32_t*)(0x42423C94UL))

#define bFM_MFT1_ADCMP_ACSC5_APBM                 *((volatile uint32_t*)(0x42423D14UL))
#define bFM4_MFT1_ADCMP_ACSC5_APBM                *((volatile uint32_t*)(0x42423D14UL))

#define bFM_MFT1_ADCMP_ACSD0_AMOD                 *((volatile uint32_t*)(0x42423AA0UL))
#define bFM4_MFT1_ADCMP_ACSD0_AMOD                *((volatile uint32_t*)(0x42423AA0UL))
#define bFM_MFT1_ADCMP_ACSD0_OCUS                 *((volatile uint32_t*)(0x42423AA4UL))
#define bFM4_MFT1_ADCMP_ACSD0_OCUS                *((volatile uint32_t*)(0x42423AA4UL))
#define bFM_MFT1_ADCMP_ACSD0_DE                   *((volatile uint32_t*)(0x42423AB0UL))
#define bFM4_MFT1_ADCMP_ACSD0_DE                  *((volatile uint32_t*)(0x42423AB0UL))
#define bFM_MFT1_ADCMP_ACSD0_PE                   *((volatile uint32_t*)(0x42423AB4UL))
#define bFM4_MFT1_ADCMP_ACSD0_PE                  *((volatile uint32_t*)(0x42423AB4UL))
#define bFM_MFT1_ADCMP_ACSD0_UE                   *((volatile uint32_t*)(0x42423AB8UL))
#define bFM4_MFT1_ADCMP_ACSD0_UE                  *((volatile uint32_t*)(0x42423AB8UL))
#define bFM_MFT1_ADCMP_ACSD0_ZE                   *((volatile uint32_t*)(0x42423ABCUL))
#define bFM4_MFT1_ADCMP_ACSD0_ZE                  *((volatile uint32_t*)(0x42423ABCUL))

#define bFM_MFT1_ADCMP_ACSD1_AMOD                 *((volatile uint32_t*)(0x42423B20UL))
#define bFM4_MFT1_ADCMP_ACSD1_AMOD                *((volatile uint32_t*)(0x42423B20UL))
#define bFM_MFT1_ADCMP_ACSD1_OCUS                 *((volatile uint32_t*)(0x42423B24UL))
#define bFM4_MFT1_ADCMP_ACSD1_OCUS                *((volatile uint32_t*)(0x42423B24UL))
#define bFM_MFT1_ADCMP_ACSD1_DE                   *((volatile uint32_t*)(0x42423B30UL))
#define bFM4_MFT1_ADCMP_ACSD1_DE                  *((volatile uint32_t*)(0x42423B30UL))
#define bFM_MFT1_ADCMP_ACSD1_PE                   *((volatile uint32_t*)(0x42423B34UL))
#define bFM4_MFT1_ADCMP_ACSD1_PE                  *((volatile uint32_t*)(0x42423B34UL))
#define bFM_MFT1_ADCMP_ACSD1_UE                   *((volatile uint32_t*)(0x42423B38UL))
#define bFM4_MFT1_ADCMP_ACSD1_UE                  *((volatile uint32_t*)(0x42423B38UL))
#define bFM_MFT1_ADCMP_ACSD1_ZE                   *((volatile uint32_t*)(0x42423B3CUL))
#define bFM4_MFT1_ADCMP_ACSD1_ZE                  *((volatile uint32_t*)(0x42423B3CUL))

#define bFM_MFT1_ADCMP_ACSD2_AMOD                 *((volatile uint32_t*)(0x42423BA0UL))
#define bFM4_MFT1_ADCMP_ACSD2_AMOD                *((volatile uint32_t*)(0x42423BA0UL))
#define bFM_MFT1_ADCMP_ACSD2_OCUS                 *((volatile uint32_t*)(0x42423BA4UL))
#define bFM4_MFT1_ADCMP_ACSD2_OCUS                *((volatile uint32_t*)(0x42423BA4UL))
#define bFM_MFT1_ADCMP_ACSD2_DE                   *((volatile uint32_t*)(0x42423BB0UL))
#define bFM4_MFT1_ADCMP_ACSD2_DE                  *((volatile uint32_t*)(0x42423BB0UL))
#define bFM_MFT1_ADCMP_ACSD2_PE                   *((volatile uint32_t*)(0x42423BB4UL))
#define bFM4_MFT1_ADCMP_ACSD2_PE                  *((volatile uint32_t*)(0x42423BB4UL))
#define bFM_MFT1_ADCMP_ACSD2_UE                   *((volatile uint32_t*)(0x42423BB8UL))
#define bFM4_MFT1_ADCMP_ACSD2_UE                  *((volatile uint32_t*)(0x42423BB8UL))
#define bFM_MFT1_ADCMP_ACSD2_ZE                   *((volatile uint32_t*)(0x42423BBCUL))
#define bFM4_MFT1_ADCMP_ACSD2_ZE                  *((volatile uint32_t*)(0x42423BBCUL))

#define bFM_MFT1_ADCMP_ACSD3_AMOD                 *((volatile uint32_t*)(0x42423C20UL))
#define bFM4_MFT1_ADCMP_ACSD3_AMOD                *((volatile uint32_t*)(0x42423C20UL))
#define bFM_MFT1_ADCMP_ACSD3_OCUS                 *((volatile uint32_t*)(0x42423C24UL))
#define bFM4_MFT1_ADCMP_ACSD3_OCUS                *((volatile uint32_t*)(0x42423C24UL))
#define bFM_MFT1_ADCMP_ACSD3_DE                   *((volatile uint32_t*)(0x42423C30UL))
#define bFM4_MFT1_ADCMP_ACSD3_DE                  *((volatile uint32_t*)(0x42423C30UL))
#define bFM_MFT1_ADCMP_ACSD3_PE                   *((volatile uint32_t*)(0x42423C34UL))
#define bFM4_MFT1_ADCMP_ACSD3_PE                  *((volatile uint32_t*)(0x42423C34UL))
#define bFM_MFT1_ADCMP_ACSD3_UE                   *((volatile uint32_t*)(0x42423C38UL))
#define bFM4_MFT1_ADCMP_ACSD3_UE                  *((volatile uint32_t*)(0x42423C38UL))
#define bFM_MFT1_ADCMP_ACSD3_ZE                   *((volatile uint32_t*)(0x42423C3CUL))
#define bFM4_MFT1_ADCMP_ACSD3_ZE                  *((volatile uint32_t*)(0x42423C3CUL))

