neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT1_ADCMP_ACSD4_AMOD                 *((volatile uint32_t*)(0x42423CA0UL))
#define bFM4_MFT1_ADCMP_ACSD4_AMOD                *((volatile uint32_t*)(0x42423CA0UL))
#define bFM_MFT1_ADCMP_ACSD4_OCUS                 *((volatile uint32_t*)(0x42423CA4UL))
#define bFM4_MFT1_ADCMP_ACSD4_OCUS                *((volatile uint32_t*)(0x42423CA4UL))
#define bFM_MFT1_ADCMP_ACSD4_DE                   *((volatile uint32_t*)(0x42423CB0UL))
#define bFM4_MFT1_ADCMP_ACSD4_DE                  *((volatile uint32_t*)(0x42423CB0UL))
#define bFM_MFT1_ADCMP_ACSD4_PE                   *((volatile uint32_t*)(0x42423CB4UL))
#define bFM4_MFT1_ADCMP_ACSD4_PE                  *((volatile uint32_t*)(0x42423CB4UL))
#define bFM_MFT1_ADCMP_ACSD4_UE                   *((volatile uint32_t*)(0x42423CB8UL))
#define bFM4_MFT1_ADCMP_ACSD4_UE                  *((volatile uint32_t*)(0x42423CB8UL))
#define bFM_MFT1_ADCMP_ACSD4_ZE                   *((volatile uint32_t*)(0x42423CBCUL))
#define bFM4_MFT1_ADCMP_ACSD4_ZE                  *((volatile uint32_t*)(0x42423CBCUL))

#define bFM_MFT1_ADCMP_ACSD5_AMOD                 *((volatile uint32_t*)(0x42423D20UL))
#define bFM4_MFT1_ADCMP_ACSD5_AMOD                *((volatile uint32_t*)(0x42423D20UL))
#define bFM_MFT1_ADCMP_ACSD5_OCUS                 *((volatile uint32_t*)(0x42423D24UL))
#define bFM4_MFT1_ADCMP_ACSD5_OCUS                *((volatile uint32_t*)(0x42423D24UL))
#define bFM_MFT1_ADCMP_ACSD5_DE                   *((volatile uint32_t*)(0x42423D30UL))
#define bFM4_MFT1_ADCMP_ACSD5_DE                  *((volatile uint32_t*)(0x42423D30UL))
#define bFM_MFT1_ADCMP_ACSD5_PE                   *((volatile uint32_t*)(0x42423D34UL))
#define bFM4_MFT1_ADCMP_ACSD5_PE                  *((volatile uint32_t*)(0x42423D34UL))
#define bFM_MFT1_ADCMP_ACSD5_UE                   *((volatile uint32_t*)(0x42423D38UL))
#define bFM4_MFT1_ADCMP_ACSD5_UE                  *((volatile uint32_t*)(0x42423D38UL))
#define bFM_MFT1_ADCMP_ACSD5_ZE                   *((volatile uint32_t*)(0x42423D3CUL))
#define bFM4_MFT1_ADCMP_ACSD5_ZE                  *((volatile uint32_t*)(0x42423D3CUL))

#define bFM_MFT1_FRT_TCAL_STOP00                  *((volatile uint32_t*)(0x42422C80UL))
#define bFM4_MFT1_FRT_TCAL_STOP00                 *((volatile uint32_t*)(0x42422C80UL))
#define bFM_MFT1_FRT_TCAL_STOP01                  *((volatile uint32_t*)(0x42422C84UL))
#define bFM4_MFT1_FRT_TCAL_STOP01                 *((volatile uint32_t*)(0x42422C84UL))
#define bFM_MFT1_FRT_TCAL_STOP02                  *((volatile uint32_t*)(0x42422C88UL))
#define bFM4_MFT1_FRT_TCAL_STOP02                 *((volatile uint32_t*)(0x42422C88UL))
#define bFM_MFT1_FRT_TCAL_STOP10                  *((volatile uint32_t*)(0x42422C8CUL))
#define bFM4_MFT1_FRT_TCAL_STOP10                 *((volatile uint32_t*)(0x42422C8CUL))
#define bFM_MFT1_FRT_TCAL_STOP11                  *((volatile uint32_t*)(0x42422C90UL))
#define bFM4_MFT1_FRT_TCAL_STOP11                 *((volatile uint32_t*)(0x42422C90UL))
#define bFM_MFT1_FRT_TCAL_STOP12                  *((volatile uint32_t*)(0x42422C94UL))
#define bFM4_MFT1_FRT_TCAL_STOP12                 *((volatile uint32_t*)(0x42422C94UL))
#define bFM_MFT1_FRT_TCAL_STOP20                  *((volatile uint32_t*)(0x42422C98UL))
#define bFM4_MFT1_FRT_TCAL_STOP20                 *((volatile uint32_t*)(0x42422C98UL))
#define bFM_MFT1_FRT_TCAL_STOP21                  *((volatile uint32_t*)(0x42422C9CUL))
#define bFM4_MFT1_FRT_TCAL_STOP21                 *((volatile uint32_t*)(0x42422C9CUL))
#define bFM_MFT1_FRT_TCAL_STOP22                  *((volatile uint32_t*)(0x42422CA0UL))
#define bFM4_MFT1_FRT_TCAL_STOP22                 *((volatile uint32_t*)(0x42422CA0UL))
#define bFM_MFT1_FRT_TCAL_SCLR00                  *((volatile uint32_t*)(0x42422CC0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR00                 *((volatile uint32_t*)(0x42422CC0UL))
#define bFM_MFT1_FRT_TCAL_SCLR01                  *((volatile uint32_t*)(0x42422CC4UL))
#define bFM4_MFT1_FRT_TCAL_SCLR01                 *((volatile uint32_t*)(0x42422CC4UL))
#define bFM_MFT1_FRT_TCAL_SCLR02                  *((volatile uint32_t*)(0x42422CC8UL))
#define bFM4_MFT1_FRT_TCAL_SCLR02                 *((volatile uint32_t*)(0x42422CC8UL))
#define bFM_MFT1_FRT_TCAL_SCLR10                  *((volatile uint32_t*)(0x42422CCCUL))
#define bFM4_MFT1_FRT_TCAL_SCLR10                 *((volatile uint32_t*)(0x42422CCCUL))
#define bFM_MFT1_FRT_TCAL_SCLR11                  *((volatile uint32_t*)(0x42422CD0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR11                 *((volatile uint32_t*)(0x42422CD0UL))
#define bFM_MFT1_FRT_TCAL_SCLR12                  *((volatile uint32_t*)(0x42422CD4UL))
#define bFM4_MFT1_FRT_TCAL_SCLR12                 *((volatile uint32_t*)(0x42422CD4UL))
#define bFM_MFT1_FRT_TCAL_SCLR20                  *((volatile uint32_t*)(0x42422CD8UL))
#define bFM4_MFT1_FRT_TCAL_SCLR20                 *((volatile uint32_t*)(0x42422CD8UL))
#define bFM_MFT1_FRT_TCAL_SCLR21                  *((volatile uint32_t*)(0x42422CDCUL))
#define bFM4_MFT1_FRT_TCAL_SCLR21                 *((volatile uint32_t*)(0x42422CDCUL))
#define bFM_MFT1_FRT_TCAL_SCLR22                  *((volatile uint32_t*)(0x42422CE0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR22                 *((volatile uint32_t*)(0x42422CE0UL))

#define bFM_MFT1_FRT_TCSA0_SCLR                   *((volatile uint32_t*)(0x42422910UL))
#define bFM4_MFT1_FRT_TCSA0_SCLR                  *((volatile uint32_t*)(0x42422910UL))
#define bFM_MFT1_FRT_TCSA0_MODE                   *((volatile uint32_t*)(0x42422914UL))
#define bFM4_MFT1_FRT_TCSA0_MODE                  *((volatile uint32_t*)(0x42422914UL))
#define bFM_MFT1_FRT_TCSA0_STOP                   *((volatile uint32_t*)(0x42422918UL))
#define bFM4_MFT1_FRT_TCSA0_STOP                  *((volatile uint32_t*)(0x42422918UL))
#define bFM_MFT1_FRT_TCSA0_BFE                    *((volatile uint32_t*)(0x4242291CUL))
#define bFM4_MFT1_FRT_TCSA0_BFE                   *((volatile uint32_t*)(0x4242291CUL))
#define bFM_MFT1_FRT_TCSA0_ICRE                   *((volatile uint32_t*)(0x42422920UL))
#define bFM4_MFT1_FRT_TCSA0_ICRE                  *((volatile uint32_t*)(0x42422920UL))
#define bFM_MFT1_FRT_TCSA0_ICLR                   *((volatile uint32_t*)(0x42422924UL))
#define bFM4_MFT1_FRT_TCSA0_ICLR                  *((volatile uint32_t*)(0x42422924UL))
#define bFM_MFT1_FRT_TCSA0_IRQZE                  *((volatile uint32_t*)(0x42422934UL))
#define bFM4_MFT1_FRT_TCSA0_IRQZE                 *((volatile uint32_t*)(0x42422934UL))
#define bFM_MFT1_FRT_TCSA0_IRQZF                  *((volatile uint32_t*)(0x42422938UL))
#define bFM4_MFT1_FRT_TCSA0_IRQZF                 *((volatile uint32_t*)(0x42422938UL))
#define bFM_MFT1_FRT_TCSA0_ECKE                   *((volatile uint32_t*)(0x4242293CUL))
#define bFM4_MFT1_FRT_TCSA0_ECKE                  *((volatile uint32_t*)(0x4242293CUL))

#define bFM_MFT1_FRT_TCSA1_SCLR                   *((volatile uint32_t*)(0x42422A90UL))
#define bFM4_MFT1_FRT_TCSA1_SCLR                  *((volatile uint32_t*)(0x42422A90UL))
#define bFM_MFT1_FRT_TCSA1_MODE                   *((volatile uint32_t*)(0x42422A94UL))
#define bFM4_MFT1_FRT_TCSA1_MODE                  *((volatile uint32_t*)(0x42422A94UL))
#define bFM_MFT1_FRT_TCSA1_STOP                   *((volatile uint32_t*)(0x42422A98UL))
#define bFM4_MFT1_FRT_TCSA1_STOP                  *((volatile uint32_t*)(0x42422A98UL))
#define bFM_MFT1_FRT_TCSA1_BFE                    *((volatile uint32_t*)(0x42422A9CUL))
#define bFM4_MFT1_FRT_TCSA1_BFE                   *((volatile uint32_t*)(0x42422A9CUL))
#define bFM_MFT1_FRT_TCSA1_ICRE                   *((volatile uint32_t*)(0x42422AA0UL))
#define bFM4_MFT1_FRT_TCSA1_ICRE                  *((volatile uint32_t*)(0x42422AA0UL))
#define bFM_MFT1_FRT_TCSA1_ICLR                   *((volatile uint32_t*)(0x42422AA4UL))
#define bFM4_MFT1_FRT_TCSA1_ICLR                  *((volatile uint32_t*)(0x42422AA4UL))
#define bFM_MFT1_FRT_TCSA1_IRQZE                  *((volatile uint32_t*)(0x42422AB4UL))
#define bFM4_MFT1_FRT_TCSA1_IRQZE                 *((volatile uint32_t*)(0x42422AB4UL))
#define bFM_MFT1_FRT_TCSA1_IRQZF                  *((volatile uint32_t*)(0x42422AB8UL))
#define bFM4_MFT1_FRT_TCSA1_IRQZF                 *((volatile uint32_t*)(0x42422AB8UL))
#define bFM_MFT1_FRT_TCSA1_ECKE                   *((volatile uint32_t*)(0x42422ABCUL))
#define bFM4_MFT1_FRT_TCSA1_ECKE                  *((volatile uint32_t*)(0x42422ABCUL))

#define bFM_MFT1_FRT_TCSA2_SCLR                   *((volatile uint32_t*)(0x42422C10UL))
#define bFM4_MFT1_FRT_TCSA2_SCLR                  *((volatile uint32_t*)(0x42422C10UL))
#define bFM_MFT1_FRT_TCSA2_MODE                   *((volatile uint32_t*)(0x42422C14UL))
#define bFM4_MFT1_FRT_TCSA2_MODE                  *((volatile uint32_t*)(0x42422C14UL))
#define bFM_MFT1_FRT_TCSA2_STOP                   *((volatile uint32_t*)(0x42422C18UL))
#define bFM4_MFT1_FRT_TCSA2_STOP                  *((volatile uint32_t*)(0x42422C18UL))
#define bFM_MFT1_FRT_TCSA2_BFE                    *((volatile uint32_t*)(0x42422C1CUL))
#define bFM4_MFT1_FRT_TCSA2_BFE                   *((volatile uint32_t*)(0x42422C1CUL))
#define bFM_MFT1_FRT_TCSA2_ICRE                   *((volatile uint32_t*)(0x42422C20UL))
#define bFM4_MFT1_FRT_TCSA2_ICRE                  *((volatile uint32_t*)(0x42422C20UL))
#define bFM_MFT1_FRT_TCSA2_ICLR                   *((volatile uint32_t*)(0x42422C24UL))
#define bFM4_MFT1_FRT_TCSA2_ICLR                  *((volatile uint32_t*)(0x42422C24UL))
#define bFM_MFT1_FRT_TCSA2_IRQZE                  *((volatile uint32_t*)(0x42422C34UL))
#define bFM4_MFT1_FRT_TCSA2_IRQZE                 *((volatile uint32_t*)(0x42422C34UL))
#define bFM_MFT1_FRT_TCSA2_IRQZF                  *((volatile uint32_t*)(0x42422C38UL))
#define bFM4_MFT1_FRT_TCSA2_IRQZF                 *((volatile uint32_t*)(0x42422C38UL))
#define bFM_MFT1_FRT_TCSA2_ECKE                   *((volatile uint32_t*)(0x42422C3CUL))
#define bFM4_MFT1_FRT_TCSA2_ECKE                  *((volatile uint32_t*)(0x42422C3CUL))

