neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT1_FRT_TCSD_OFMD1                   *((volatile uint32_t*)(0x42423D80UL))
#define bFM4_MFT1_FRT_TCSD_OFMD1                  *((volatile uint32_t*)(0x42423D80UL))
#define bFM_MFT1_FRT_TCSD_OFMD2                   *((volatile uint32_t*)(0x42423D84UL))
#define bFM4_MFT1_FRT_TCSD_OFMD2                  *((volatile uint32_t*)(0x42423D84UL))

#define bFM_MFT1_ICU_ICSA10_ICE0                  *((volatile uint32_t*)(0x42423090UL))
#define bFM4_MFT1_ICU_ICSA10_ICE0                 *((volatile uint32_t*)(0x42423090UL))
#define bFM_MFT1_ICU_ICSA10_ICE1                  *((volatile uint32_t*)(0x42423094UL))
#define bFM4_MFT1_ICU_ICSA10_ICE1                 *((volatile uint32_t*)(0x42423094UL))
#define bFM_MFT1_ICU_ICSA10_ICP0                  *((volatile uint32_t*)(0x42423098UL))
#define bFM4_MFT1_ICU_ICSA10_ICP0                 *((volatile uint32_t*)(0x42423098UL))
#define bFM_MFT1_ICU_ICSA10_ICP1                  *((volatile uint32_t*)(0x4242309CUL))
#define bFM4_MFT1_ICU_ICSA10_ICP1                 *((volatile uint32_t*)(0x4242309CUL))

#define bFM_MFT1_ICU_ICSA32_ICE0                  *((volatile uint32_t*)(0x42423110UL))
#define bFM4_MFT1_ICU_ICSA32_ICE0                 *((volatile uint32_t*)(0x42423110UL))
#define bFM_MFT1_ICU_ICSA32_ICE1                  *((volatile uint32_t*)(0x42423114UL))
#define bFM4_MFT1_ICU_ICSA32_ICE1                 *((volatile uint32_t*)(0x42423114UL))
#define bFM_MFT1_ICU_ICSA32_ICP0                  *((volatile uint32_t*)(0x42423118UL))
#define bFM4_MFT1_ICU_ICSA32_ICP0                 *((volatile uint32_t*)(0x42423118UL))
#define bFM_MFT1_ICU_ICSA32_ICP1                  *((volatile uint32_t*)(0x4242311CUL))
#define bFM4_MFT1_ICU_ICSA32_ICP1                 *((volatile uint32_t*)(0x4242311CUL))

#define bFM_MFT1_ICU_ICSB10_IEI0                  *((volatile uint32_t*)(0x424230A0UL))
#define bFM4_MFT1_ICU_ICSB10_IEI0                 *((volatile uint32_t*)(0x424230A0UL))
#define bFM_MFT1_ICU_ICSB10_IEI1                  *((volatile uint32_t*)(0x424230A4UL))
#define bFM4_MFT1_ICU_ICSB10_IEI1                 *((volatile uint32_t*)(0x424230A4UL))

#define bFM_MFT1_ICU_ICSB32_IEI0                  *((volatile uint32_t*)(0x42423120UL))
#define bFM4_MFT1_ICU_ICSB32_IEI0                 *((volatile uint32_t*)(0x42423120UL))
#define bFM_MFT1_ICU_ICSB32_IEI1                  *((volatile uint32_t*)(0x42423124UL))
#define bFM4_MFT1_ICU_ICSB32_IEI1                 *((volatile uint32_t*)(0x42423124UL))

#define bFM_MFT1_OCU_OCSA10_CST0                  *((volatile uint32_t*)(0x42422300UL))
#define bFM4_MFT1_OCU_OCSA10_CST0                 *((volatile uint32_t*)(0x42422300UL))
#define bFM_MFT1_OCU_OCSA10_CST1                  *((volatile uint32_t*)(0x42422304UL))
#define bFM4_MFT1_OCU_OCSA10_CST1                 *((volatile uint32_t*)(0x42422304UL))
#define bFM_MFT1_OCU_OCSA10_IOE0                  *((volatile uint32_t*)(0x42422310UL))
#define bFM4_MFT1_OCU_OCSA10_IOE0                 *((volatile uint32_t*)(0x42422310UL))
#define bFM_MFT1_OCU_OCSA10_IOE1                  *((volatile uint32_t*)(0x42422314UL))
#define bFM4_MFT1_OCU_OCSA10_IOE1                 *((volatile uint32_t*)(0x42422314UL))
#define bFM_MFT1_OCU_OCSA10_IOP0                  *((volatile uint32_t*)(0x42422318UL))
#define bFM4_MFT1_OCU_OCSA10_IOP0                 *((volatile uint32_t*)(0x42422318UL))
#define bFM_MFT1_OCU_OCSA10_IOP1                  *((volatile uint32_t*)(0x4242231CUL))
#define bFM4_MFT1_OCU_OCSA10_IOP1                 *((volatile uint32_t*)(0x4242231CUL))

#define bFM_MFT1_OCU_OCSA32_CST2                  *((volatile uint32_t*)(0x42422380UL))
#define bFM4_MFT1_OCU_OCSA32_CST2                 *((volatile uint32_t*)(0x42422380UL))
#define bFM_MFT1_OCU_OCSA32_CST3                  *((volatile uint32_t*)(0x42422384UL))
#define bFM4_MFT1_OCU_OCSA32_CST3                 *((volatile uint32_t*)(0x42422384UL))
#define bFM_MFT1_OCU_OCSA32_IOE2                  *((volatile uint32_t*)(0x42422390UL))
#define bFM4_MFT1_OCU_OCSA32_IOE2                 *((volatile uint32_t*)(0x42422390UL))
#define bFM_MFT1_OCU_OCSA32_IOE3                  *((volatile uint32_t*)(0x42422394UL))
#define bFM4_MFT1_OCU_OCSA32_IOE3                 *((volatile uint32_t*)(0x42422394UL))
#define bFM_MFT1_OCU_OCSA32_IOP2                  *((volatile uint32_t*)(0x42422398UL))
#define bFM4_MFT1_OCU_OCSA32_IOP2                 *((volatile uint32_t*)(0x42422398UL))
#define bFM_MFT1_OCU_OCSA32_IOP3                  *((volatile uint32_t*)(0x4242239CUL))
#define bFM4_MFT1_OCU_OCSA32_IOP3                 *((volatile uint32_t*)(0x4242239CUL))

#define bFM_MFT1_OCU_OCSA54_CST4                  *((volatile uint32_t*)(0x42422400UL))
#define bFM4_MFT1_OCU_OCSA54_CST4                 *((volatile uint32_t*)(0x42422400UL))
#define bFM_MFT1_OCU_OCSA54_CST5                  *((volatile uint32_t*)(0x42422404UL))
#define bFM4_MFT1_OCU_OCSA54_CST5                 *((volatile uint32_t*)(0x42422404UL))
#define bFM_MFT1_OCU_OCSA54_IOE4                  *((volatile uint32_t*)(0x42422410UL))
#define bFM4_MFT1_OCU_OCSA54_IOE4                 *((volatile uint32_t*)(0x42422410UL))
#define bFM_MFT1_OCU_OCSA54_IOE5                  *((volatile uint32_t*)(0x42422414UL))
#define bFM4_MFT1_OCU_OCSA54_IOE5                 *((volatile uint32_t*)(0x42422414UL))
#define bFM_MFT1_OCU_OCSA54_IOP4                  *((volatile uint32_t*)(0x42422418UL))
#define bFM4_MFT1_OCU_OCSA54_IOP4                 *((volatile uint32_t*)(0x42422418UL))
#define bFM_MFT1_OCU_OCSA54_IOP5                  *((volatile uint32_t*)(0x4242241CUL))
#define bFM4_MFT1_OCU_OCSA54_IOP5                 *((volatile uint32_t*)(0x4242241CUL))

#define bFM_MFT1_OCU_OCSB10_OTD0                  *((volatile uint32_t*)(0x42422320UL))
#define bFM4_MFT1_OCU_OCSB10_OTD0                 *((volatile uint32_t*)(0x42422320UL))
#define bFM_MFT1_OCU_OCSB10_OTD1                  *((volatile uint32_t*)(0x42422324UL))
#define bFM4_MFT1_OCU_OCSB10_OTD1                 *((volatile uint32_t*)(0x42422324UL))
#define bFM_MFT1_OCU_OCSB10_CMOD                  *((volatile uint32_t*)(0x42422330UL))
#define bFM4_MFT1_OCU_OCSB10_CMOD                 *((volatile uint32_t*)(0x42422330UL))
#define bFM_MFT1_OCU_OCSB10_FM4                   *((volatile uint32_t*)(0x4242233CUL))
#define bFM4_MFT1_OCU_OCSB10_FM4                  *((volatile uint32_t*)(0x4242233CUL))

#define bFM_MFT1_OCU_OCSB32_OTD2                  *((volatile uint32_t*)(0x424223A0UL))
#define bFM4_MFT1_OCU_OCSB32_OTD2                 *((volatile uint32_t*)(0x424223A0UL))
#define bFM_MFT1_OCU_OCSB32_OTD3                  *((volatile uint32_t*)(0x424223A4UL))
#define bFM4_MFT1_OCU_OCSB32_OTD3                 *((volatile uint32_t*)(0x424223A4UL))
#define bFM_MFT1_OCU_OCSB32_CMOD                  *((volatile uint32_t*)(0x424223B0UL))
#define bFM4_MFT1_OCU_OCSB32_CMOD                 *((volatile uint32_t*)(0x424223B0UL))
#define bFM_MFT1_OCU_OCSB32_FM4                   *((volatile uint32_t*)(0x424223BCUL))
#define bFM4_MFT1_OCU_OCSB32_FM4                  *((volatile uint32_t*)(0x424223BCUL))

#define bFM_MFT1_OCU_OCSB54_OTD4                  *((volatile uint32_t*)(0x42422420UL))
#define bFM4_MFT1_OCU_OCSB54_OTD4                 *((volatile uint32_t*)(0x42422420UL))
#define bFM_MFT1_OCU_OCSB54_OTD5                  *((volatile uint32_t*)(0x42422424UL))
#define bFM4_MFT1_OCU_OCSB54_OTD5                 *((volatile uint32_t*)(0x42422424UL))
#define bFM_MFT1_OCU_OCSB54_CMOD                  *((volatile uint32_t*)(0x42422430UL))
#define bFM4_MFT1_OCU_OCSB54_CMOD                 *((volatile uint32_t*)(0x42422430UL))
#define bFM_MFT1_OCU_OCSB54_FM4                   *((volatile uint32_t*)(0x4242243CUL))
#define bFM4_MFT1_OCU_OCSB54_FM4                  *((volatile uint32_t*)(0x4242243CUL))

#define bFM_MFT1_OCU_OCSC_MOD0                    *((volatile uint32_t*)(0x424224A0UL))
#define bFM4_MFT1_OCU_OCSC_MOD0                   *((volatile uint32_t*)(0x424224A0UL))
#define bFM_MFT1_OCU_OCSC_MOD1                    *((volatile uint32_t*)(0x424224A4UL))
#define bFM4_MFT1_OCU_OCSC_MOD1                   *((volatile uint32_t*)(0x424224A4UL))
#define bFM_MFT1_OCU_OCSC_MOD2                    *((volatile uint32_t*)(0x424224A8UL))
#define bFM4_MFT1_OCU_OCSC_MOD2                   *((volatile uint32_t*)(0x424224A8UL))
#define bFM_MFT1_OCU_OCSC_MOD3                    *((volatile uint32_t*)(0x424224ACUL))
#define bFM4_MFT1_OCU_OCSC_MOD3                   *((volatile uint32_t*)(0x424224ACUL))
#define bFM_MFT1_OCU_OCSC_MOD4                    *((volatile uint32_t*)(0x424224B0UL))
#define bFM4_MFT1_OCU_OCSC_MOD4                   *((volatile uint32_t*)(0x424224B0UL))
#define bFM_MFT1_OCU_OCSC_MOD5                    *((volatile uint32_t*)(0x424224B4UL))
#define bFM4_MFT1_OCU_OCSC_MOD5                   *((volatile uint32_t*)(0x424224B4UL))

#define bFM_MFT1_OCU_OCSD10_OPBM0                 *((volatile uint32_t*)(0x42422360UL))
#define bFM4_MFT1_OCU_OCSD10_OPBM0                *((volatile uint32_t*)(0x42422360UL))
#define bFM_MFT1_OCU_OCSD10_OPBM1                 *((volatile uint32_t*)(0x42422364UL))
#define bFM4_MFT1_OCU_OCSD10_OPBM1                *((volatile uint32_t*)(0x42422364UL))
#define bFM_MFT1_OCU_OCSD10_OEBM0                 *((volatile uint32_t*)(0x42422368UL))
#define bFM4_MFT1_OCU_OCSD10_OEBM0                *((volatile uint32_t*)(0x42422368UL))
#define bFM_MFT1_OCU_OCSD10_OEBM1                 *((volatile uint32_t*)(0x4242236CUL))
#define bFM4_MFT1_OCU_OCSD10_OEBM1                *((volatile uint32_t*)(0x4242236CUL))
#define bFM_MFT1_OCU_OCSD10_OFEX0                 *((volatile uint32_t*)(0x42422370UL))
#define bFM4_MFT1_OCU_OCSD10_OFEX0                *((volatile uint32_t*)(0x42422370UL))
#define bFM_MFT1_OCU_OCSD10_OFEX1                 *((volatile uint32_t*)(0x42422374UL))
#define bFM4_MFT1_OCU_OCSD10_OFEX1                *((volatile uint32_t*)(0x42422374UL))

#define bFM_MFT1_OCU_OCSD32_OPBM2                 *((volatile uint32_t*)(0x424223E0UL))
#define bFM4_MFT1_OCU_OCSD32_OPBM2                *((volatile uint32_t*)(0x424223E0UL))
#define bFM_MFT1_OCU_OCSD32_OPBM3                 *((volatile uint32_t*)(0x424223E4UL))
#define bFM4_MFT1_OCU_OCSD32_OPBM3                *((volatile uint32_t*)(0x424223E4UL))
#define bFM_MFT1_OCU_OCSD32_OEBM2                 *((volatile uint32_t*)(0x424223E8UL))
#define bFM4_MFT1_OCU_OCSD32_OEBM2                *((volatile uint32_t*)(0x424223E8UL))
#define bFM_MFT1_OCU_OCSD32_OEBM3                 *((volatile uint32_t*)(0x424223ECUL))
#define bFM4_MFT1_OCU_OCSD32_OEBM3                *((volatile uint32_t*)(0x424223ECUL))
#define bFM_MFT1_OCU_OCSD32_OFEX2                 *((volatile uint32_t*)(0x424223F0UL))
#define bFM4_MFT1_OCU_OCSD32_OFEX2                *((volatile uint32_t*)(0x424223F0UL))
#define bFM_MFT1_OCU_OCSD32_OFEX3                 *((volatile uint32_t*)(0x424223F4UL))
#define bFM4_MFT1_OCU_OCSD32_OFEX3                *((volatile uint32_t*)(0x424223F4UL))

#define bFM_MFT1_OCU_OCSD54_OPBM4                 *((volatile uint32_t*)(0x42422460UL))
#define bFM4_MFT1_OCU_OCSD54_OPBM4                *((volatile uint32_t*)(0x42422460UL))
#define bFM_MFT1_OCU_OCSD54_OPBM5                 *((volatile uint32_t*)(0x42422464UL))
#define bFM4_MFT1_OCU_OCSD54_OPBM5                *((volatile uint32_t*)(0x42422464UL))
#define bFM_MFT1_OCU_OCSD54_OEBM4                 *((volatile uint32_t*)(0x42422468UL))
#define bFM4_MFT1_OCU_OCSD54_OEBM4                *((volatile uint32_t*)(0x42422468UL))
#define bFM_MFT1_OCU_OCSD54_OEBM5                 *((volatile uint32_t*)(0x4242246CUL))
#define bFM4_MFT1_OCU_OCSD54_OEBM5                *((volatile uint32_t*)(0x4242246CUL))
#define bFM_MFT1_OCU_OCSD54_OFEX4                 *((volatile uint32_t*)(0x42422470UL))
#define bFM4_MFT1_OCU_OCSD54_OFEX4                *((volatile uint32_t*)(0x42422470UL))
#define bFM_MFT1_OCU_OCSD54_OFEX5                 *((volatile uint32_t*)(0x42422474UL))
#define bFM4_MFT1_OCU_OCSD54_OFEX5                *((volatile uint32_t*)(0x42422474UL))

#define bFM_MFT1_WFG_NZCL_DTIEA                   *((volatile uint32_t*)(0x42423680UL))
#define bFM4_MFT1_WFG_NZCL_DTIEA                  *((volatile uint32_t*)(0x42423680UL))
#define bFM_MFT1_WFG_NZCL_SDTI                    *((volatile uint32_t*)(0x42423690UL))
#define bFM4_MFT1_WFG_NZCL_SDTI                   *((volatile uint32_t*)(0x42423690UL))
#define bFM_MFT1_WFG_NZCL_DTIEB                   *((volatile uint32_t*)(0x42423694UL))
#define bFM4_MFT1_WFG_NZCL_DTIEB                  *((volatile uint32_t*)(0x42423694UL))
#define bFM_MFT1_WFG_NZCL_DHOLD                   *((volatile uint32_t*)(0x4242369CUL))
#define bFM4_MFT1_WFG_NZCL_DHOLD                  *((volatile uint32_t*)(0x4242369CUL))
#define bFM_MFT1_WFG_NZCL_DIMA                    *((volatile uint32_t*)(0x424236A0UL))
#define bFM4_MFT1_WFG_NZCL_DIMA                   *((volatile uint32_t*)(0x424236A0UL))
#define bFM_MFT1_WFG_NZCL_DIMB                    *((volatile uint32_t*)(0x424236A4UL))
#define bFM4_MFT1_WFG_NZCL_DIMB                   *((volatile uint32_t*)(0x424236A4UL))
#define bFM_MFT1_WFG_NZCL_WIM10                   *((volatile uint32_t*)(0x424236B0UL))
#define bFM4_MFT1_WFG_NZCL_WIM10                  *((volatile uint32_t*)(0x424236B0UL))
#define bFM_MFT1_WFG_NZCL_WIM32                   *((volatile uint32_t*)(0x424236B4UL))
#define bFM4_MFT1_WFG_NZCL_WIM32                  *((volatile uint32_t*)(0x424236B4UL))
#define bFM_MFT1_WFG_NZCL_WIM54                   *((volatile uint32_t*)(0x424236B8UL))
#define bFM4_MFT1_WFG_NZCL_WIM54                  *((volatile uint32_t*)(0x424236B8UL))

