neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT1_WFG_WFIR_DTIFA                   *((volatile uint32_t*)(0x42423600UL))
#define bFM4_MFT1_WFG_WFIR_DTIFA                  *((volatile uint32_t*)(0x42423600UL))
#define bFM_MFT1_WFG_WFIR_DTICA                   *((volatile uint32_t*)(0x42423604UL))
#define bFM4_MFT1_WFG_WFIR_DTICA                  *((volatile uint32_t*)(0x42423604UL))
#define bFM_MFT1_WFG_WFIR_DTIFB                   *((volatile uint32_t*)(0x42423608UL))
#define bFM4_MFT1_WFG_WFIR_DTIFB                  *((volatile uint32_t*)(0x42423608UL))
#define bFM_MFT1_WFG_WFIR_DTICB                   *((volatile uint32_t*)(0x4242360CUL))
#define bFM4_MFT1_WFG_WFIR_DTICB                  *((volatile uint32_t*)(0x4242360CUL))
#define bFM_MFT1_WFG_WFIR_TMIF10                  *((volatile uint32_t*)(0x42423610UL))
#define bFM4_MFT1_WFG_WFIR_TMIF10                 *((volatile uint32_t*)(0x42423610UL))
#define bFM_MFT1_WFG_WFIR_TMIC10                  *((volatile uint32_t*)(0x42423614UL))
#define bFM4_MFT1_WFG_WFIR_TMIC10                 *((volatile uint32_t*)(0x42423614UL))
#define bFM_MFT1_WFG_WFIR_TMIE10                  *((volatile uint32_t*)(0x42423618UL))
#define bFM4_MFT1_WFG_WFIR_TMIE10                 *((volatile uint32_t*)(0x42423618UL))
#define bFM_MFT1_WFG_WFIR_TMIS10                  *((volatile uint32_t*)(0x4242361CUL))
#define bFM4_MFT1_WFG_WFIR_TMIS10                 *((volatile uint32_t*)(0x4242361CUL))
#define bFM_MFT1_WFG_WFIR_TMIF32                  *((volatile uint32_t*)(0x42423620UL))
#define bFM4_MFT1_WFG_WFIR_TMIF32                 *((volatile uint32_t*)(0x42423620UL))
#define bFM_MFT1_WFG_WFIR_TMIC32                  *((volatile uint32_t*)(0x42423624UL))
#define bFM4_MFT1_WFG_WFIR_TMIC32                 *((volatile uint32_t*)(0x42423624UL))
#define bFM_MFT1_WFG_WFIR_TMIE32                  *((volatile uint32_t*)(0x42423628UL))
#define bFM4_MFT1_WFG_WFIR_TMIE32                 *((volatile uint32_t*)(0x42423628UL))
#define bFM_MFT1_WFG_WFIR_TMIS32                  *((volatile uint32_t*)(0x4242362CUL))
#define bFM4_MFT1_WFG_WFIR_TMIS32                 *((volatile uint32_t*)(0x4242362CUL))
#define bFM_MFT1_WFG_WFIR_TMIF54                  *((volatile uint32_t*)(0x42423630UL))
#define bFM4_MFT1_WFG_WFIR_TMIF54                 *((volatile uint32_t*)(0x42423630UL))
#define bFM_MFT1_WFG_WFIR_TMIC54                  *((volatile uint32_t*)(0x42423634UL))
#define bFM4_MFT1_WFG_WFIR_TMIC54                 *((volatile uint32_t*)(0x42423634UL))
#define bFM_MFT1_WFG_WFIR_TMIE54                  *((volatile uint32_t*)(0x42423638UL))
#define bFM4_MFT1_WFG_WFIR_TMIE54                 *((volatile uint32_t*)(0x42423638UL))
#define bFM_MFT1_WFG_WFIR_TMIS54                  *((volatile uint32_t*)(0x4242363CUL))
#define bFM4_MFT1_WFG_WFIR_TMIS54                 *((volatile uint32_t*)(0x4242363CUL))


/******************************************************************************
 ** MFT Registers MFT2
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_MFT2_ADCMP_ACMC0_MZCE                 *((volatile uint32_t*)(0x42443AD8UL))
#define bFM4_MFT2_ADCMP_ACMC0_MZCE                *((volatile uint32_t*)(0x42443AD8UL))
#define bFM_MFT2_ADCMP_ACMC0_MPCE                 *((volatile uint32_t*)(0x42443ADCUL))
#define bFM4_MFT2_ADCMP_ACMC0_MPCE                *((volatile uint32_t*)(0x42443ADCUL))

#define bFM_MFT2_ADCMP_ACMC1_MZCE                 *((volatile uint32_t*)(0x42443B58UL))
#define bFM4_MFT2_ADCMP_ACMC1_MZCE                *((volatile uint32_t*)(0x42443B58UL))
#define bFM_MFT2_ADCMP_ACMC1_MPCE                 *((volatile uint32_t*)(0x42443B5CUL))
#define bFM4_MFT2_ADCMP_ACMC1_MPCE                *((volatile uint32_t*)(0x42443B5CUL))

#define bFM_MFT2_ADCMP_ACMC2_MZCE                 *((volatile uint32_t*)(0x42443BD8UL))
#define bFM4_MFT2_ADCMP_ACMC2_MZCE                *((volatile uint32_t*)(0x42443BD8UL))
#define bFM_MFT2_ADCMP_ACMC2_MPCE                 *((volatile uint32_t*)(0x42443BDCUL))
#define bFM4_MFT2_ADCMP_ACMC2_MPCE                *((volatile uint32_t*)(0x42443BDCUL))

#define bFM_MFT2_ADCMP_ACMC3_MZCE                 *((volatile uint32_t*)(0x42443C58UL))
#define bFM4_MFT2_ADCMP_ACMC3_MZCE                *((volatile uint32_t*)(0x42443C58UL))
#define bFM_MFT2_ADCMP_ACMC3_MPCE                 *((volatile uint32_t*)(0x42443C5CUL))
#define bFM4_MFT2_ADCMP_ACMC3_MPCE                *((volatile uint32_t*)(0x42443C5CUL))

#define bFM_MFT2_ADCMP_ACMC4_MZCE                 *((volatile uint32_t*)(0x42443CD8UL))
#define bFM4_MFT2_ADCMP_ACMC4_MZCE                *((volatile uint32_t*)(0x42443CD8UL))
#define bFM_MFT2_ADCMP_ACMC4_MPCE                 *((volatile uint32_t*)(0x42443CDCUL))
#define bFM4_MFT2_ADCMP_ACMC4_MPCE                *((volatile uint32_t*)(0x42443CDCUL))

#define bFM_MFT2_ADCMP_ACMC5_MZCE                 *((volatile uint32_t*)(0x42443D58UL))
#define bFM4_MFT2_ADCMP_ACMC5_MZCE                *((volatile uint32_t*)(0x42443D58UL))
#define bFM_MFT2_ADCMP_ACMC5_MPCE                 *((volatile uint32_t*)(0x42443D5CUL))
#define bFM4_MFT2_ADCMP_ACMC5_MPCE                *((volatile uint32_t*)(0x42443D5CUL))

#define bFM_MFT2_ADCMP_ACSC0_APBM                 *((volatile uint32_t*)(0x42443A94UL))
#define bFM4_MFT2_ADCMP_ACSC0_APBM                *((volatile uint32_t*)(0x42443A94UL))

#define bFM_MFT2_ADCMP_ACSC1_APBM                 *((volatile uint32_t*)(0x42443B14UL))
#define bFM4_MFT2_ADCMP_ACSC1_APBM                *((volatile uint32_t*)(0x42443B14UL))

#define bFM_MFT2_ADCMP_ACSC2_APBM                 *((volatile uint32_t*)(0x42443B94UL))
#define bFM4_MFT2_ADCMP_ACSC2_APBM                *((volatile uint32_t*)(0x42443B94UL))

#define bFM_MFT2_ADCMP_ACSC3_APBM                 *((volatile uint32_t*)(0x42443C14UL))
#define bFM4_MFT2_ADCMP_ACSC3_APBM                *((volatile uint32_t*)(0x42443C14UL))

#define bFM_MFT2_ADCMP_ACSC4_APBM                 *((volatile uint32_t*)(0x42443C94UL))
#define bFM4_MFT2_ADCMP_ACSC4_APBM                *((volatile uint32_t*)(0x42443C94UL))

