neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT2_ADCMP_ACSC5_APBM                 *((volatile uint32_t*)(0x42443D14UL))
#define bFM4_MFT2_ADCMP_ACSC5_APBM                *((volatile uint32_t*)(0x42443D14UL))

#define bFM_MFT2_ADCMP_ACSD0_AMOD                 *((volatile uint32_t*)(0x42443AA0UL))
#define bFM4_MFT2_ADCMP_ACSD0_AMOD                *((volatile uint32_t*)(0x42443AA0UL))
#define bFM_MFT2_ADCMP_ACSD0_OCUS                 *((volatile uint32_t*)(0x42443AA4UL))
#define bFM4_MFT2_ADCMP_ACSD0_OCUS                *((volatile uint32_t*)(0x42443AA4UL))
#define bFM_MFT2_ADCMP_ACSD0_DE                   *((volatile uint32_t*)(0x42443AB0UL))
#define bFM4_MFT2_ADCMP_ACSD0_DE                  *((volatile uint32_t*)(0x42443AB0UL))
#define bFM_MFT2_ADCMP_ACSD0_PE                   *((volatile uint32_t*)(0x42443AB4UL))
#define bFM4_MFT2_ADCMP_ACSD0_PE                  *((volatile uint32_t*)(0x42443AB4UL))
#define bFM_MFT2_ADCMP_ACSD0_UE                   *((volatile uint32_t*)(0x42443AB8UL))
#define bFM4_MFT2_ADCMP_ACSD0_UE                  *((volatile uint32_t*)(0x42443AB8UL))
#define bFM_MFT2_ADCMP_ACSD0_ZE                   *((volatile uint32_t*)(0x42443ABCUL))
#define bFM4_MFT2_ADCMP_ACSD0_ZE                  *((volatile uint32_t*)(0x42443ABCUL))

#define bFM_MFT2_ADCMP_ACSD1_AMOD                 *((volatile uint32_t*)(0x42443B20UL))
#define bFM4_MFT2_ADCMP_ACSD1_AMOD                *((volatile uint32_t*)(0x42443B20UL))
#define bFM_MFT2_ADCMP_ACSD1_OCUS                 *((volatile uint32_t*)(0x42443B24UL))
#define bFM4_MFT2_ADCMP_ACSD1_OCUS                *((volatile uint32_t*)(0x42443B24UL))
#define bFM_MFT2_ADCMP_ACSD1_DE                   *((volatile uint32_t*)(0x42443B30UL))
#define bFM4_MFT2_ADCMP_ACSD1_DE                  *((volatile uint32_t*)(0x42443B30UL))
#define bFM_MFT2_ADCMP_ACSD1_PE                   *((volatile uint32_t*)(0x42443B34UL))
#define bFM4_MFT2_ADCMP_ACSD1_PE                  *((volatile uint32_t*)(0x42443B34UL))
#define bFM_MFT2_ADCMP_ACSD1_UE                   *((volatile uint32_t*)(0x42443B38UL))
#define bFM4_MFT2_ADCMP_ACSD1_UE                  *((volatile uint32_t*)(0x42443B38UL))
#define bFM_MFT2_ADCMP_ACSD1_ZE                   *((volatile uint32_t*)(0x42443B3CUL))
#define bFM4_MFT2_ADCMP_ACSD1_ZE                  *((volatile uint32_t*)(0x42443B3CUL))

#define bFM_MFT2_ADCMP_ACSD2_AMOD                 *((volatile uint32_t*)(0x42443BA0UL))
#define bFM4_MFT2_ADCMP_ACSD2_AMOD                *((volatile uint32_t*)(0x42443BA0UL))
#define bFM_MFT2_ADCMP_ACSD2_OCUS                 *((volatile uint32_t*)(0x42443BA4UL))
#define bFM4_MFT2_ADCMP_ACSD2_OCUS                *((volatile uint32_t*)(0x42443BA4UL))
#define bFM_MFT2_ADCMP_ACSD2_DE                   *((volatile uint32_t*)(0x42443BB0UL))
#define bFM4_MFT2_ADCMP_ACSD2_DE                  *((volatile uint32_t*)(0x42443BB0UL))
#define bFM_MFT2_ADCMP_ACSD2_PE                   *((volatile uint32_t*)(0x42443BB4UL))
#define bFM4_MFT2_ADCMP_ACSD2_PE                  *((volatile uint32_t*)(0x42443BB4UL))
#define bFM_MFT2_ADCMP_ACSD2_UE                   *((volatile uint32_t*)(0x42443BB8UL))
#define bFM4_MFT2_ADCMP_ACSD2_UE                  *((volatile uint32_t*)(0x42443BB8UL))
#define bFM_MFT2_ADCMP_ACSD2_ZE                   *((volatile uint32_t*)(0x42443BBCUL))
#define bFM4_MFT2_ADCMP_ACSD2_ZE                  *((volatile uint32_t*)(0x42443BBCUL))

#define bFM_MFT2_ADCMP_ACSD3_AMOD                 *((volatile uint32_t*)(0x42443C20UL))
#define bFM4_MFT2_ADCMP_ACSD3_AMOD                *((volatile uint32_t*)(0x42443C20UL))
#define bFM_MFT2_ADCMP_ACSD3_OCUS                 *((volatile uint32_t*)(0x42443C24UL))
#define bFM4_MFT2_ADCMP_ACSD3_OCUS                *((volatile uint32_t*)(0x42443C24UL))
#define bFM_MFT2_ADCMP_ACSD3_DE                   *((volatile uint32_t*)(0x42443C30UL))
#define bFM4_MFT2_ADCMP_ACSD3_DE                  *((volatile uint32_t*)(0x42443C30UL))
#define bFM_MFT2_ADCMP_ACSD3_PE                   *((volatile uint32_t*)(0x42443C34UL))
#define bFM4_MFT2_ADCMP_ACSD3_PE                  *((volatile uint32_t*)(0x42443C34UL))
#define bFM_MFT2_ADCMP_ACSD3_UE                   *((volatile uint32_t*)(0x42443C38UL))
#define bFM4_MFT2_ADCMP_ACSD3_UE                  *((volatile uint32_t*)(0x42443C38UL))
#define bFM_MFT2_ADCMP_ACSD3_ZE                   *((volatile uint32_t*)(0x42443C3CUL))
#define bFM4_MFT2_ADCMP_ACSD3_ZE                  *((volatile uint32_t*)(0x42443C3CUL))

#define bFM_MFT2_ADCMP_ACSD4_AMOD                 *((volatile uint32_t*)(0x42443CA0UL))
#define bFM4_MFT2_ADCMP_ACSD4_AMOD                *((volatile uint32_t*)(0x42443CA0UL))
#define bFM_MFT2_ADCMP_ACSD4_OCUS                 *((volatile uint32_t*)(0x42443CA4UL))
#define bFM4_MFT2_ADCMP_ACSD4_OCUS                *((volatile uint32_t*)(0x42443CA4UL))
#define bFM_MFT2_ADCMP_ACSD4_DE                   *((volatile uint32_t*)(0x42443CB0UL))
#define bFM4_MFT2_ADCMP_ACSD4_DE                  *((volatile uint32_t*)(0x42443CB0UL))
#define bFM_MFT2_ADCMP_ACSD4_PE                   *((volatile uint32_t*)(0x42443CB4UL))
#define bFM4_MFT2_ADCMP_ACSD4_PE                  *((volatile uint32_t*)(0x42443CB4UL))
#define bFM_MFT2_ADCMP_ACSD4_UE                   *((volatile uint32_t*)(0x42443CB8UL))
#define bFM4_MFT2_ADCMP_ACSD4_UE                  *((volatile uint32_t*)(0x42443CB8UL))
#define bFM_MFT2_ADCMP_ACSD4_ZE                   *((volatile uint32_t*)(0x42443CBCUL))
#define bFM4_MFT2_ADCMP_ACSD4_ZE                  *((volatile uint32_t*)(0x42443CBCUL))

#define bFM_MFT2_ADCMP_ACSD5_AMOD                 *((volatile uint32_t*)(0x42443D20UL))
#define bFM4_MFT2_ADCMP_ACSD5_AMOD                *((volatile uint32_t*)(0x42443D20UL))
#define bFM_MFT2_ADCMP_ACSD5_OCUS                 *((volatile uint32_t*)(0x42443D24UL))
#define bFM4_MFT2_ADCMP_ACSD5_OCUS                *((volatile uint32_t*)(0x42443D24UL))
#define bFM_MFT2_ADCMP_ACSD5_DE                   *((volatile uint32_t*)(0x42443D30UL))
#define bFM4_MFT2_ADCMP_ACSD5_DE                  *((volatile uint32_t*)(0x42443D30UL))
#define bFM_MFT2_ADCMP_ACSD5_PE                   *((volatile uint32_t*)(0x42443D34UL))
#define bFM4_MFT2_ADCMP_ACSD5_PE                  *((volatile uint32_t*)(0x42443D34UL))
#define bFM_MFT2_ADCMP_ACSD5_UE                   *((volatile uint32_t*)(0x42443D38UL))
#define bFM4_MFT2_ADCMP_ACSD5_UE                  *((volatile uint32_t*)(0x42443D38UL))
#define bFM_MFT2_ADCMP_ACSD5_ZE                   *((volatile uint32_t*)(0x42443D3CUL))
#define bFM4_MFT2_ADCMP_ACSD5_ZE                  *((volatile uint32_t*)(0x42443D3CUL))

#define bFM_MFT2_FRT_TCAL_STOP00                  *((volatile uint32_t*)(0x42442C80UL))
#define bFM4_MFT2_FRT_TCAL_STOP00                 *((volatile uint32_t*)(0x42442C80UL))
#define bFM_MFT2_FRT_TCAL_STOP01                  *((volatile uint32_t*)(0x42442C84UL))
#define bFM4_MFT2_FRT_TCAL_STOP01                 *((volatile uint32_t*)(0x42442C84UL))
#define bFM_MFT2_FRT_TCAL_STOP02                  *((volatile uint32_t*)(0x42442C88UL))
#define bFM4_MFT2_FRT_TCAL_STOP02                 *((volatile uint32_t*)(0x42442C88UL))
#define bFM_MFT2_FRT_TCAL_STOP10                  *((volatile uint32_t*)(0x42442C8CUL))
#define bFM4_MFT2_FRT_TCAL_STOP10                 *((volatile uint32_t*)(0x42442C8CUL))
#define bFM_MFT2_FRT_TCAL_STOP11                  *((volatile uint32_t*)(0x42442C90UL))
#define bFM4_MFT2_FRT_TCAL_STOP11                 *((volatile uint32_t*)(0x42442C90UL))
#define bFM_MFT2_FRT_TCAL_STOP12                  *((volatile uint32_t*)(0x42442C94UL))
#define bFM4_MFT2_FRT_TCAL_STOP12                 *((volatile uint32_t*)(0x42442C94UL))
#define bFM_MFT2_FRT_TCAL_STOP20                  *((volatile uint32_t*)(0x42442C98UL))
#define bFM4_MFT2_FRT_TCAL_STOP20                 *((volatile uint32_t*)(0x42442C98UL))
#define bFM_MFT2_FRT_TCAL_STOP21                  *((volatile uint32_t*)(0x42442C9CUL))
#define bFM4_MFT2_FRT_TCAL_STOP21                 *((volatile uint32_t*)(0x42442C9CUL))
#define bFM_MFT2_FRT_TCAL_STOP22                  *((volatile uint32_t*)(0x42442CA0UL))
#define bFM4_MFT2_FRT_TCAL_STOP22                 *((volatile uint32_t*)(0x42442CA0UL))
#define bFM_MFT2_FRT_TCAL_SCLR00                  *((volatile uint32_t*)(0x42442CC0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR00                 *((volatile uint32_t*)(0x42442CC0UL))
#define bFM_MFT2_FRT_TCAL_SCLR01                  *((volatile uint32_t*)(0x42442CC4UL))
#define bFM4_MFT2_FRT_TCAL_SCLR01                 *((volatile uint32_t*)(0x42442CC4UL))
#define bFM_MFT2_FRT_TCAL_SCLR02                  *((volatile uint32_t*)(0x42442CC8UL))
#define bFM4_MFT2_FRT_TCAL_SCLR02                 *((volatile uint32_t*)(0x42442CC8UL))
#define bFM_MFT2_FRT_TCAL_SCLR10                  *((volatile uint32_t*)(0x42442CCCUL))
#define bFM4_MFT2_FRT_TCAL_SCLR10                 *((volatile uint32_t*)(0x42442CCCUL))
#define bFM_MFT2_FRT_TCAL_SCLR11                  *((volatile uint32_t*)(0x42442CD0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR11                 *((volatile uint32_t*)(0x42442CD0UL))
#define bFM_MFT2_FRT_TCAL_SCLR12                  *((volatile uint32_t*)(0x42442CD4UL))
#define bFM4_MFT2_FRT_TCAL_SCLR12                 *((volatile uint32_t*)(0x42442CD4UL))
#define bFM_MFT2_FRT_TCAL_SCLR20                  *((volatile uint32_t*)(0x42442CD8UL))
#define bFM4_MFT2_FRT_TCAL_SCLR20                 *((volatile uint32_t*)(0x42442CD8UL))
#define bFM_MFT2_FRT_TCAL_SCLR21                  *((volatile uint32_t*)(0x42442CDCUL))
#define bFM4_MFT2_FRT_TCAL_SCLR21                 *((volatile uint32_t*)(0x42442CDCUL))
#define bFM_MFT2_FRT_TCAL_SCLR22                  *((volatile uint32_t*)(0x42442CE0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR22                 *((volatile uint32_t*)(0x42442CE0UL))

#define bFM_MFT2_FRT_TCSA0_SCLR                   *((volatile uint32_t*)(0x42442910UL))
#define bFM4_MFT2_FRT_TCSA0_SCLR                  *((volatile uint32_t*)(0x42442910UL))
#define bFM_MFT2_FRT_TCSA0_MODE                   *((volatile uint32_t*)(0x42442914UL))
#define bFM4_MFT2_FRT_TCSA0_MODE                  *((volatile uint32_t*)(0x42442914UL))
#define bFM_MFT2_FRT_TCSA0_STOP                   *((volatile uint32_t*)(0x42442918UL))
#define bFM4_MFT2_FRT_TCSA0_STOP                  *((volatile uint32_t*)(0x42442918UL))
#define bFM_MFT2_FRT_TCSA0_BFE                    *((volatile uint32_t*)(0x4244291CUL))
#define bFM4_MFT2_FRT_TCSA0_BFE                   *((volatile uint32_t*)(0x4244291CUL))
#define bFM_MFT2_FRT_TCSA0_ICRE                   *((volatile uint32_t*)(0x42442920UL))
#define bFM4_MFT2_FRT_TCSA0_ICRE                  *((volatile uint32_t*)(0x42442920UL))
#define bFM_MFT2_FRT_TCSA0_ICLR                   *((volatile uint32_t*)(0x42442924UL))
#define bFM4_MFT2_FRT_TCSA0_ICLR                  *((volatile uint32_t*)(0x42442924UL))
#define bFM_MFT2_FRT_TCSA0_IRQZE                  *((volatile uint32_t*)(0x42442934UL))
#define bFM4_MFT2_FRT_TCSA0_IRQZE                 *((volatile uint32_t*)(0x42442934UL))
#define bFM_MFT2_FRT_TCSA0_IRQZF                  *((volatile uint32_t*)(0x42442938UL))
#define bFM4_MFT2_FRT_TCSA0_IRQZF                 *((volatile uint32_t*)(0x42442938UL))
#define bFM_MFT2_FRT_TCSA0_ECKE                   *((volatile uint32_t*)(0x4244293CUL))
#define bFM4_MFT2_FRT_TCSA0_ECKE                  *((volatile uint32_t*)(0x4244293CUL))

