neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_MFT2_FRT_TCSA1_SCLR                   *((volatile uint32_t*)(0x42442A90UL))
#define bFM4_MFT2_FRT_TCSA1_SCLR                  *((volatile uint32_t*)(0x42442A90UL))
#define bFM_MFT2_FRT_TCSA1_MODE                   *((volatile uint32_t*)(0x42442A94UL))
#define bFM4_MFT2_FRT_TCSA1_MODE                  *((volatile uint32_t*)(0x42442A94UL))
#define bFM_MFT2_FRT_TCSA1_STOP                   *((volatile uint32_t*)(0x42442A98UL))
#define bFM4_MFT2_FRT_TCSA1_STOP                  *((volatile uint32_t*)(0x42442A98UL))
#define bFM_MFT2_FRT_TCSA1_BFE                    *((volatile uint32_t*)(0x42442A9CUL))
#define bFM4_MFT2_FRT_TCSA1_BFE                   *((volatile uint32_t*)(0x42442A9CUL))
#define bFM_MFT2_FRT_TCSA1_ICRE                   *((volatile uint32_t*)(0x42442AA0UL))
#define bFM4_MFT2_FRT_TCSA1_ICRE                  *((volatile uint32_t*)(0x42442AA0UL))
#define bFM_MFT2_FRT_TCSA1_ICLR                   *((volatile uint32_t*)(0x42442AA4UL))
#define bFM4_MFT2_FRT_TCSA1_ICLR                  *((volatile uint32_t*)(0x42442AA4UL))
#define bFM_MFT2_FRT_TCSA1_IRQZE                  *((volatile uint32_t*)(0x42442AB4UL))
#define bFM4_MFT2_FRT_TCSA1_IRQZE                 *((volatile uint32_t*)(0x42442AB4UL))
#define bFM_MFT2_FRT_TCSA1_IRQZF                  *((volatile uint32_t*)(0x42442AB8UL))
#define bFM4_MFT2_FRT_TCSA1_IRQZF                 *((volatile uint32_t*)(0x42442AB8UL))
#define bFM_MFT2_FRT_TCSA1_ECKE                   *((volatile uint32_t*)(0x42442ABCUL))
#define bFM4_MFT2_FRT_TCSA1_ECKE                  *((volatile uint32_t*)(0x42442ABCUL))

#define bFM_MFT2_FRT_TCSA2_SCLR                   *((volatile uint32_t*)(0x42442C10UL))
#define bFM4_MFT2_FRT_TCSA2_SCLR                  *((volatile uint32_t*)(0x42442C10UL))
#define bFM_MFT2_FRT_TCSA2_MODE                   *((volatile uint32_t*)(0x42442C14UL))
#define bFM4_MFT2_FRT_TCSA2_MODE                  *((volatile uint32_t*)(0x42442C14UL))
#define bFM_MFT2_FRT_TCSA2_STOP                   *((volatile uint32_t*)(0x42442C18UL))
#define bFM4_MFT2_FRT_TCSA2_STOP                  *((volatile uint32_t*)(0x42442C18UL))
#define bFM_MFT2_FRT_TCSA2_BFE                    *((volatile uint32_t*)(0x42442C1CUL))
#define bFM4_MFT2_FRT_TCSA2_BFE                   *((volatile uint32_t*)(0x42442C1CUL))
#define bFM_MFT2_FRT_TCSA2_ICRE                   *((volatile uint32_t*)(0x42442C20UL))
#define bFM4_MFT2_FRT_TCSA2_ICRE                  *((volatile uint32_t*)(0x42442C20UL))
#define bFM_MFT2_FRT_TCSA2_ICLR                   *((volatile uint32_t*)(0x42442C24UL))
#define bFM4_MFT2_FRT_TCSA2_ICLR                  *((volatile uint32_t*)(0x42442C24UL))
#define bFM_MFT2_FRT_TCSA2_IRQZE                  *((volatile uint32_t*)(0x42442C34UL))
#define bFM4_MFT2_FRT_TCSA2_IRQZE                 *((volatile uint32_t*)(0x42442C34UL))
#define bFM_MFT2_FRT_TCSA2_IRQZF                  *((volatile uint32_t*)(0x42442C38UL))
#define bFM4_MFT2_FRT_TCSA2_IRQZF                 *((volatile uint32_t*)(0x42442C38UL))
#define bFM_MFT2_FRT_TCSA2_ECKE                   *((volatile uint32_t*)(0x42442C3CUL))
#define bFM4_MFT2_FRT_TCSA2_ECKE                  *((volatile uint32_t*)(0x42442C3CUL))

#define bFM_MFT2_FRT_TCSD_OFMD1                   *((volatile uint32_t*)(0x42443D80UL))
#define bFM4_MFT2_FRT_TCSD_OFMD1                  *((volatile uint32_t*)(0x42443D80UL))
#define bFM_MFT2_FRT_TCSD_OFMD2                   *((volatile uint32_t*)(0x42443D84UL))
#define bFM4_MFT2_FRT_TCSD_OFMD2                  *((volatile uint32_t*)(0x42443D84UL))

#define bFM_MFT2_ICU_ICSA10_ICE0                  *((volatile uint32_t*)(0x42443090UL))
#define bFM4_MFT2_ICU_ICSA10_ICE0                 *((volatile uint32_t*)(0x42443090UL))
#define bFM_MFT2_ICU_ICSA10_ICE1                  *((volatile uint32_t*)(0x42443094UL))
#define bFM4_MFT2_ICU_ICSA10_ICE1                 *((volatile uint32_t*)(0x42443094UL))
#define bFM_MFT2_ICU_ICSA10_ICP0                  *((volatile uint32_t*)(0x42443098UL))
#define bFM4_MFT2_ICU_ICSA10_ICP0                 *((volatile uint32_t*)(0x42443098UL))
#define bFM_MFT2_ICU_ICSA10_ICP1                  *((volatile uint32_t*)(0x4244309CUL))
#define bFM4_MFT2_ICU_ICSA10_ICP1                 *((volatile uint32_t*)(0x4244309CUL))

#define bFM_MFT2_ICU_ICSA32_ICE0                  *((volatile uint32_t*)(0x42443110UL))
#define bFM4_MFT2_ICU_ICSA32_ICE0                 *((volatile uint32_t*)(0x42443110UL))
#define bFM_MFT2_ICU_ICSA32_ICE1                  *((volatile uint32_t*)(0x42443114UL))
#define bFM4_MFT2_ICU_ICSA32_ICE1                 *((volatile uint32_t*)(0x42443114UL))
#define bFM_MFT2_ICU_ICSA32_ICP0                  *((volatile uint32_t*)(0x42443118UL))
#define bFM4_MFT2_ICU_ICSA32_ICP0                 *((volatile uint32_t*)(0x42443118UL))
#define bFM_MFT2_ICU_ICSA32_ICP1                  *((volatile uint32_t*)(0x4244311CUL))
#define bFM4_MFT2_ICU_ICSA32_ICP1                 *((volatile uint32_t*)(0x4244311CUL))

#define bFM_MFT2_ICU_ICSB10_IEI0                  *((volatile uint32_t*)(0x424430A0UL))
#define bFM4_MFT2_ICU_ICSB10_IEI0                 *((volatile uint32_t*)(0x424430A0UL))
#define bFM_MFT2_ICU_ICSB10_IEI1                  *((volatile uint32_t*)(0x424430A4UL))
#define bFM4_MFT2_ICU_ICSB10_IEI1                 *((volatile uint32_t*)(0x424430A4UL))

#define bFM_MFT2_ICU_ICSB32_IEI0                  *((volatile uint32_t*)(0x42443120UL))
#define bFM4_MFT2_ICU_ICSB32_IEI0                 *((volatile uint32_t*)(0x42443120UL))
#define bFM_MFT2_ICU_ICSB32_IEI1                  *((volatile uint32_t*)(0x42443124UL))
#define bFM4_MFT2_ICU_ICSB32_IEI1                 *((volatile uint32_t*)(0x42443124UL))

#define bFM_MFT2_OCU_OCSA10_CST0                  *((volatile uint32_t*)(0x42442300UL))
#define bFM4_MFT2_OCU_OCSA10_CST0                 *((volatile uint32_t*)(0x42442300UL))
#define bFM_MFT2_OCU_OCSA10_CST1                  *((volatile uint32_t*)(0x42442304UL))
#define bFM4_MFT2_OCU_OCSA10_CST1                 *((volatile uint32_t*)(0x42442304UL))
#define bFM_MFT2_OCU_OCSA10_IOE0                  *((volatile uint32_t*)(0x42442310UL))
#define bFM4_MFT2_OCU_OCSA10_IOE0                 *((volatile uint32_t*)(0x42442310UL))
#define bFM_MFT2_OCU_OCSA10_IOE1                  *((volatile uint32_t*)(0x42442314UL))
#define bFM4_MFT2_OCU_OCSA10_IOE1                 *((volatile uint32_t*)(0x42442314UL))
#define bFM_MFT2_OCU_OCSA10_IOP0                  *((volatile uint32_t*)(0x42442318UL))
#define bFM4_MFT2_OCU_OCSA10_IOP0                 *((volatile uint32_t*)(0x42442318UL))
#define bFM_MFT2_OCU_OCSA10_IOP1                  *((volatile uint32_t*)(0x4244231CUL))
#define bFM4_MFT2_OCU_OCSA10_IOP1                 *((volatile uint32_t*)(0x4244231CUL))

#define bFM_MFT2_OCU_OCSA32_CST2                  *((volatile uint32_t*)(0x42442380UL))
#define bFM4_MFT2_OCU_OCSA32_CST2                 *((volatile uint32_t*)(0x42442380UL))
#define bFM_MFT2_OCU_OCSA32_CST3                  *((volatile uint32_t*)(0x42442384UL))
#define bFM4_MFT2_OCU_OCSA32_CST3                 *((volatile uint32_t*)(0x42442384UL))
#define bFM_MFT2_OCU_OCSA32_IOE2                  *((volatile uint32_t*)(0x42442390UL))
#define bFM4_MFT2_OCU_OCSA32_IOE2                 *((volatile uint32_t*)(0x42442390UL))
#define bFM_MFT2_OCU_OCSA32_IOE3                  *((volatile uint32_t*)(0x42442394UL))
#define bFM4_MFT2_OCU_OCSA32_IOE3                 *((volatile uint32_t*)(0x42442394UL))
#define bFM_MFT2_OCU_OCSA32_IOP2                  *((volatile uint32_t*)(0x42442398UL))
#define bFM4_MFT2_OCU_OCSA32_IOP2                 *((volatile uint32_t*)(0x42442398UL))
#define bFM_MFT2_OCU_OCSA32_IOP3                  *((volatile uint32_t*)(0x4244239CUL))
#define bFM4_MFT2_OCU_OCSA32_IOP3                 *((volatile uint32_t*)(0x4244239CUL))

#define bFM_MFT2_OCU_OCSA54_CST4                  *((volatile uint32_t*)(0x42442400UL))
#define bFM4_MFT2_OCU_OCSA54_CST4                 *((volatile uint32_t*)(0x42442400UL))
#define bFM_MFT2_OCU_OCSA54_CST5                  *((volatile uint32_t*)(0x42442404UL))
#define bFM4_MFT2_OCU_OCSA54_CST5                 *((volatile uint32_t*)(0x42442404UL))
#define bFM_MFT2_OCU_OCSA54_IOE4                  *((volatile uint32_t*)(0x42442410UL))
#define bFM4_MFT2_OCU_OCSA54_IOE4                 *((volatile uint32_t*)(0x42442410UL))
#define bFM_MFT2_OCU_OCSA54_IOE5                  *((volatile uint32_t*)(0x42442414UL))
#define bFM4_MFT2_OCU_OCSA54_IOE5                 *((volatile uint32_t*)(0x42442414UL))
#define bFM_MFT2_OCU_OCSA54_IOP4                  *((volatile uint32_t*)(0x42442418UL))
#define bFM4_MFT2_OCU_OCSA54_IOP4                 *((volatile uint32_t*)(0x42442418UL))
#define bFM_MFT2_OCU_OCSA54_IOP5                  *((volatile uint32_t*)(0x4244241CUL))
#define bFM4_MFT2_OCU_OCSA54_IOP5                 *((volatile uint32_t*)(0x4244241CUL))

