neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** PCRC Registers PCRC
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_PCRC_PCRC_CFG_CIRQCLR                 *((volatile uint32_t*)(0x43000180UL))
#define bFM4_PCRC_PCRC_CFG_CIRQCLR                *((volatile uint32_t*)(0x43000180UL))
#define bFM_PCRC_PCRC_CFG_CIRQ                    *((volatile uint32_t*)(0x430001E0UL))
#define bFM4_PCRC_PCRC_CFG_CIRQ                   *((volatile uint32_t*)(0x430001E0UL))
#define bFM_PCRC_PCRC_CFG_CIEN                    *((volatile uint32_t*)(0x430001E4UL))
#define bFM4_PCRC_PCRC_CFG_CIEN                   *((volatile uint32_t*)(0x430001E4UL))
#define bFM_PCRC_PCRC_CFG_CDEN                    *((volatile uint32_t*)(0x430001E8UL))
#define bFM4_PCRC_PCRC_CFG_CDEN                   *((volatile uint32_t*)(0x430001E8UL))
#define bFM_PCRC_PCRC_CFG_LOCK                    *((volatile uint32_t*)(0x430001F0UL))
#define bFM4_PCRC_PCRC_CFG_LOCK                   *((volatile uint32_t*)(0x430001F0UL))


/******************************************************************************
 ** QPRC Registers QPRC0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_QPRC0_QCR_PSTP                        *((volatile uint32_t*)(0x424C0310UL))
#define bFM4_QPRC0_QCR_PSTP                       *((volatile uint32_t*)(0x424C0310UL))
#define bFM_QPRC0_QCR_CGSC                        *((volatile uint32_t*)(0x424C0314UL))
#define bFM4_QPRC0_QCR_CGSC                       *((volatile uint32_t*)(0x424C0314UL))
#define bFM_QPRC0_QCR_RSEL                        *((volatile uint32_t*)(0x424C0318UL))
#define bFM4_QPRC0_QCR_RSEL                       *((volatile uint32_t*)(0x424C0318UL))
#define bFM_QPRC0_QCR_SWAP                        *((volatile uint32_t*)(0x424C031CUL))
#define bFM4_QPRC0_QCR_SWAP                       *((volatile uint32_t*)(0x424C031CUL))

#define bFM_QPRC0_QECR_ORNGMD                     *((volatile uint32_t*)(0x424C0380UL))
#define bFM4_QPRC0_QECR_ORNGMD                    *((volatile uint32_t*)(0x424C0380UL))
#define bFM_QPRC0_QECR_ORNGF                      *((volatile uint32_t*)(0x424C0384UL))
#define bFM4_QPRC0_QECR_ORNGF                     *((volatile uint32_t*)(0x424C0384UL))
#define bFM_QPRC0_QECR_ORNGIE                     *((volatile uint32_t*)(0x424C0388UL))
#define bFM4_QPRC0_QECR_ORNGIE                    *((volatile uint32_t*)(0x424C0388UL))
#define bFM_QPRC0_QECR_PEC                        *((volatile uint32_t*)(0x424C038CUL))
#define bFM4_QPRC0_QECR_PEC                       *((volatile uint32_t*)(0x424C038CUL))

#define bFM_QPRC0_QICRH_CDCIE                     *((volatile uint32_t*)(0x424C02A0UL))
#define bFM4_QPRC0_QICRH_CDCIE                    *((volatile uint32_t*)(0x424C02A0UL))
#define bFM_QPRC0_QICRH_CDCF                      *((volatile uint32_t*)(0x424C02A4UL))
#define bFM4_QPRC0_QICRH_CDCF                     *((volatile uint32_t*)(0x424C02A4UL))
#define bFM_QPRC0_QICRH_DIRPC                     *((volatile uint32_t*)(0x424C02A8UL))
#define bFM4_QPRC0_QICRH_DIRPC                    *((volatile uint32_t*)(0x424C02A8UL))
#define bFM_QPRC0_QICRH_DIROU                     *((volatile uint32_t*)(0x424C02ACUL))
#define bFM4_QPRC0_QICRH_DIROU                    *((volatile uint32_t*)(0x424C02ACUL))
#define bFM_QPRC0_QICRH_QPCNRCMIE                 *((volatile uint32_t*)(0x424C02B0UL))
#define bFM4_QPRC0_QICRH_QPCNRCMIE                *((volatile uint32_t*)(0x424C02B0UL))
#define bFM_QPRC0_QICRH_QPCNRCMF                  *((volatile uint32_t*)(0x424C02B4UL))
#define bFM4_QPRC0_QICRH_QPCNRCMF                 *((volatile uint32_t*)(0x424C02B4UL))

#define bFM_QPRC0_QICRL_QPCMIE                    *((volatile uint32_t*)(0x424C0280UL))
#define bFM4_QPRC0_QICRL_QPCMIE                   *((volatile uint32_t*)(0x424C0280UL))
#define bFM_QPRC0_QICRL_QPCMF                     *((volatile uint32_t*)(0x424C0284UL))
#define bFM4_QPRC0_QICRL_QPCMF                    *((volatile uint32_t*)(0x424C0284UL))
#define bFM_QPRC0_QICRL_QPRCMIE                   *((volatile uint32_t*)(0x424C0288UL))
#define bFM4_QPRC0_QICRL_QPRCMIE                  *((volatile uint32_t*)(0x424C0288UL))
#define bFM_QPRC0_QICRL_QPRCMF                    *((volatile uint32_t*)(0x424C028CUL))
#define bFM4_QPRC0_QICRL_QPRCMF                   *((volatile uint32_t*)(0x424C028CUL))
#define bFM_QPRC0_QICRL_OUZIE                     *((volatile uint32_t*)(0x424C0290UL))
#define bFM4_QPRC0_QICRL_OUZIE                    *((volatile uint32_t*)(0x424C0290UL))
#define bFM_QPRC0_QICRL_UFDF                      *((volatile uint32_t*)(0x424C0294UL))
#define bFM4_QPRC0_QICRL_UFDF                     *((volatile uint32_t*)(0x424C0294UL))
#define bFM_QPRC0_QICRL_OFDF                      *((volatile uint32_t*)(0x424C0298UL))
#define bFM4_QPRC0_QICRL_OFDF                     *((volatile uint32_t*)(0x424C0298UL))
#define bFM_QPRC0_QICRL_ZIIF                      *((volatile uint32_t*)(0x424C029CUL))
#define bFM4_QPRC0_QICRL_ZIIF                     *((volatile uint32_t*)(0x424C029CUL))


/******************************************************************************
 ** QPRC_NF Registers QPRC0_NF
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_QPRC0_NF_NFCTLA_AINLV                 *((volatile uint32_t*)(0x424C2010UL))
#define bFM4_QPRC0_NF_NFCTLA_AINLV                *((volatile uint32_t*)(0x424C2010UL))
#define bFM_QPRC0_NF_NFCTLA_AINMD                 *((volatile uint32_t*)(0x424C2014UL))
#define bFM4_QPRC0_NF_NFCTLA_AINMD                *((volatile uint32_t*)(0x424C2014UL))

#define bFM_QPRC0_NF_NFCTLB_BINLV                 *((volatile uint32_t*)(0x424C2090UL))
#define bFM4_QPRC0_NF_NFCTLB_BINLV                *((volatile uint32_t*)(0x424C2090UL))
#define bFM_QPRC0_NF_NFCTLB_BINMD                 *((volatile uint32_t*)(0x424C2094UL))
#define bFM4_QPRC0_NF_NFCTLB_BINMD                *((volatile uint32_t*)(0x424C2094UL))

