neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_QPRC0_NF_NFCTLZ_ZINLV                 *((volatile uint32_t*)(0x424C2110UL))
#define bFM4_QPRC0_NF_NFCTLZ_ZINLV                *((volatile uint32_t*)(0x424C2110UL))
#define bFM_QPRC0_NF_NFCTLZ_ZINMD                 *((volatile uint32_t*)(0x424C2114UL))
#define bFM4_QPRC0_NF_NFCTLZ_ZINMD                *((volatile uint32_t*)(0x424C2114UL))


/******************************************************************************
 ** QPRC Registers QPRC1
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_QPRC1_QCR_PSTP                        *((volatile uint32_t*)(0x424C0B10UL))
#define bFM4_QPRC1_QCR_PSTP                       *((volatile uint32_t*)(0x424C0B10UL))
#define bFM_QPRC1_QCR_CGSC                        *((volatile uint32_t*)(0x424C0B14UL))
#define bFM4_QPRC1_QCR_CGSC                       *((volatile uint32_t*)(0x424C0B14UL))
#define bFM_QPRC1_QCR_RSEL                        *((volatile uint32_t*)(0x424C0B18UL))
#define bFM4_QPRC1_QCR_RSEL                       *((volatile uint32_t*)(0x424C0B18UL))
#define bFM_QPRC1_QCR_SWAP                        *((volatile uint32_t*)(0x424C0B1CUL))
#define bFM4_QPRC1_QCR_SWAP                       *((volatile uint32_t*)(0x424C0B1CUL))

#define bFM_QPRC1_QECR_ORNGMD                     *((volatile uint32_t*)(0x424C0B80UL))
#define bFM4_QPRC1_QECR_ORNGMD                    *((volatile uint32_t*)(0x424C0B80UL))
#define bFM_QPRC1_QECR_ORNGF                      *((volatile uint32_t*)(0x424C0B84UL))
#define bFM4_QPRC1_QECR_ORNGF                     *((volatile uint32_t*)(0x424C0B84UL))
#define bFM_QPRC1_QECR_ORNGIE                     *((volatile uint32_t*)(0x424C0B88UL))
#define bFM4_QPRC1_QECR_ORNGIE                    *((volatile uint32_t*)(0x424C0B88UL))
#define bFM_QPRC1_QECR_PEC                        *((volatile uint32_t*)(0x424C0B8CUL))
#define bFM4_QPRC1_QECR_PEC                       *((volatile uint32_t*)(0x424C0B8CUL))

#define bFM_QPRC1_QICRH_CDCIE                     *((volatile uint32_t*)(0x424C0AA0UL))
#define bFM4_QPRC1_QICRH_CDCIE                    *((volatile uint32_t*)(0x424C0AA0UL))
#define bFM_QPRC1_QICRH_CDCF                      *((volatile uint32_t*)(0x424C0AA4UL))
#define bFM4_QPRC1_QICRH_CDCF                     *((volatile uint32_t*)(0x424C0AA4UL))
#define bFM_QPRC1_QICRH_DIRPC                     *((volatile uint32_t*)(0x424C0AA8UL))
#define bFM4_QPRC1_QICRH_DIRPC                    *((volatile uint32_t*)(0x424C0AA8UL))
#define bFM_QPRC1_QICRH_DIROU                     *((volatile uint32_t*)(0x424C0AACUL))
#define bFM4_QPRC1_QICRH_DIROU                    *((volatile uint32_t*)(0x424C0AACUL))
#define bFM_QPRC1_QICRH_QPCNRCMIE                 *((volatile uint32_t*)(0x424C0AB0UL))
#define bFM4_QPRC1_QICRH_QPCNRCMIE                *((volatile uint32_t*)(0x424C0AB0UL))
#define bFM_QPRC1_QICRH_QPCNRCMF                  *((volatile uint32_t*)(0x424C0AB4UL))
#define bFM4_QPRC1_QICRH_QPCNRCMF                 *((volatile uint32_t*)(0x424C0AB4UL))

#define bFM_QPRC1_QICRL_QPCMIE                    *((volatile uint32_t*)(0x424C0A80UL))
#define bFM4_QPRC1_QICRL_QPCMIE                   *((volatile uint32_t*)(0x424C0A80UL))
#define bFM_QPRC1_QICRL_QPCMF                     *((volatile uint32_t*)(0x424C0A84UL))
#define bFM4_QPRC1_QICRL_QPCMF                    *((volatile uint32_t*)(0x424C0A84UL))
#define bFM_QPRC1_QICRL_QPRCMIE                   *((volatile uint32_t*)(0x424C0A88UL))
#define bFM4_QPRC1_QICRL_QPRCMIE                  *((volatile uint32_t*)(0x424C0A88UL))
#define bFM_QPRC1_QICRL_QPRCMF                    *((volatile uint32_t*)(0x424C0A8CUL))
#define bFM4_QPRC1_QICRL_QPRCMF                   *((volatile uint32_t*)(0x424C0A8CUL))
#define bFM_QPRC1_QICRL_OUZIE                     *((volatile uint32_t*)(0x424C0A90UL))
#define bFM4_QPRC1_QICRL_OUZIE                    *((volatile uint32_t*)(0x424C0A90UL))
#define bFM_QPRC1_QICRL_UFDF                      *((volatile uint32_t*)(0x424C0A94UL))
#define bFM4_QPRC1_QICRL_UFDF                     *((volatile uint32_t*)(0x424C0A94UL))
#define bFM_QPRC1_QICRL_OFDF                      *((volatile uint32_t*)(0x424C0A98UL))
#define bFM4_QPRC1_QICRL_OFDF                     *((volatile uint32_t*)(0x424C0A98UL))
#define bFM_QPRC1_QICRL_ZIIF                      *((volatile uint32_t*)(0x424C0A9CUL))
#define bFM4_QPRC1_QICRL_ZIIF                     *((volatile uint32_t*)(0x424C0A9CUL))


/******************************************************************************
 ** QPRC_NF Registers QPRC1_NF
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_QPRC1_NF_NFCTLA_AINLV                 *((volatile uint32_t*)(0x424C2210UL))
#define bFM4_QPRC1_NF_NFCTLA_AINLV                *((volatile uint32_t*)(0x424C2210UL))
#define bFM_QPRC1_NF_NFCTLA_AINMD                 *((volatile uint32_t*)(0x424C2214UL))
#define bFM4_QPRC1_NF_NFCTLA_AINMD                *((volatile uint32_t*)(0x424C2214UL))

#define bFM_QPRC1_NF_NFCTLB_BINLV                 *((volatile uint32_t*)(0x424C2290UL))
#define bFM4_QPRC1_NF_NFCTLB_BINLV                *((volatile uint32_t*)(0x424C2290UL))
#define bFM_QPRC1_NF_NFCTLB_BINMD                 *((volatile uint32_t*)(0x424C2294UL))
#define bFM4_QPRC1_NF_NFCTLB_BINMD                *((volatile uint32_t*)(0x424C2294UL))

#define bFM_QPRC1_NF_NFCTLZ_ZINLV                 *((volatile uint32_t*)(0x424C2310UL))
#define bFM4_QPRC1_NF_NFCTLZ_ZINLV                *((volatile uint32_t*)(0x424C2310UL))
#define bFM_QPRC1_NF_NFCTLZ_ZINMD                 *((volatile uint32_t*)(0x424C2314UL))
#define bFM4_QPRC1_NF_NFCTLZ_ZINMD                *((volatile uint32_t*)(0x424C2314UL))


/******************************************************************************
 ** QPRC Registers QPRC2
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_QPRC2_QCR_PSTP                        *((volatile uint32_t*)(0x424C1310UL))
#define bFM4_QPRC2_QCR_PSTP                       *((volatile uint32_t*)(0x424C1310UL))
#define bFM_QPRC2_QCR_CGSC                        *((volatile uint32_t*)(0x424C1314UL))
#define bFM4_QPRC2_QCR_CGSC                       *((volatile uint32_t*)(0x424C1314UL))
#define bFM_QPRC2_QCR_RSEL                        *((volatile uint32_t*)(0x424C1318UL))
#define bFM4_QPRC2_QCR_RSEL                       *((volatile uint32_t*)(0x424C1318UL))
#define bFM_QPRC2_QCR_SWAP                        *((volatile uint32_t*)(0x424C131CUL))
#define bFM4_QPRC2_QCR_SWAP                       *((volatile uint32_t*)(0x424C131CUL))

#define bFM_QPRC2_QECR_ORNGMD                     *((volatile uint32_t*)(0x424C1380UL))
#define bFM4_QPRC2_QECR_ORNGMD                    *((volatile uint32_t*)(0x424C1380UL))
#define bFM_QPRC2_QECR_ORNGF                      *((volatile uint32_t*)(0x424C1384UL))
#define bFM4_QPRC2_QECR_ORNGF                     *((volatile uint32_t*)(0x424C1384UL))
#define bFM_QPRC2_QECR_ORNGIE                     *((volatile uint32_t*)(0x424C1388UL))
#define bFM4_QPRC2_QECR_ORNGIE                    *((volatile uint32_t*)(0x424C1388UL))
#define bFM_QPRC2_QECR_PEC                        *((volatile uint32_t*)(0x424C138CUL))
#define bFM4_QPRC2_QECR_PEC                       *((volatile uint32_t*)(0x424C138CUL))

