neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_QPRC2_QICRH_CDCIE                     *((volatile uint32_t*)(0x424C12A0UL))
#define bFM4_QPRC2_QICRH_CDCIE                    *((volatile uint32_t*)(0x424C12A0UL))
#define bFM_QPRC2_QICRH_CDCF                      *((volatile uint32_t*)(0x424C12A4UL))
#define bFM4_QPRC2_QICRH_CDCF                     *((volatile uint32_t*)(0x424C12A4UL))
#define bFM_QPRC2_QICRH_DIRPC                     *((volatile uint32_t*)(0x424C12A8UL))
#define bFM4_QPRC2_QICRH_DIRPC                    *((volatile uint32_t*)(0x424C12A8UL))
#define bFM_QPRC2_QICRH_DIROU                     *((volatile uint32_t*)(0x424C12ACUL))
#define bFM4_QPRC2_QICRH_DIROU                    *((volatile uint32_t*)(0x424C12ACUL))
#define bFM_QPRC2_QICRH_QPCNRCMIE                 *((volatile uint32_t*)(0x424C12B0UL))
#define bFM4_QPRC2_QICRH_QPCNRCMIE                *((volatile uint32_t*)(0x424C12B0UL))
#define bFM_QPRC2_QICRH_QPCNRCMF                  *((volatile uint32_t*)(0x424C12B4UL))
#define bFM4_QPRC2_QICRH_QPCNRCMF                 *((volatile uint32_t*)(0x424C12B4UL))

#define bFM_QPRC2_QICRL_QPCMIE                    *((volatile uint32_t*)(0x424C1280UL))
#define bFM4_QPRC2_QICRL_QPCMIE                   *((volatile uint32_t*)(0x424C1280UL))
#define bFM_QPRC2_QICRL_QPCMF                     *((volatile uint32_t*)(0x424C1284UL))
#define bFM4_QPRC2_QICRL_QPCMF                    *((volatile uint32_t*)(0x424C1284UL))
#define bFM_QPRC2_QICRL_QPRCMIE                   *((volatile uint32_t*)(0x424C1288UL))
#define bFM4_QPRC2_QICRL_QPRCMIE                  *((volatile uint32_t*)(0x424C1288UL))
#define bFM_QPRC2_QICRL_QPRCMF                    *((volatile uint32_t*)(0x424C128CUL))
#define bFM4_QPRC2_QICRL_QPRCMF                   *((volatile uint32_t*)(0x424C128CUL))
#define bFM_QPRC2_QICRL_OUZIE                     *((volatile uint32_t*)(0x424C1290UL))
#define bFM4_QPRC2_QICRL_OUZIE                    *((volatile uint32_t*)(0x424C1290UL))
#define bFM_QPRC2_QICRL_UFDF                      *((volatile uint32_t*)(0x424C1294UL))
#define bFM4_QPRC2_QICRL_UFDF                     *((volatile uint32_t*)(0x424C1294UL))
#define bFM_QPRC2_QICRL_OFDF                      *((volatile uint32_t*)(0x424C1298UL))
#define bFM4_QPRC2_QICRL_OFDF                     *((volatile uint32_t*)(0x424C1298UL))
#define bFM_QPRC2_QICRL_ZIIF                      *((volatile uint32_t*)(0x424C129CUL))
#define bFM4_QPRC2_QICRL_ZIIF                     *((volatile uint32_t*)(0x424C129CUL))


/******************************************************************************
 ** QPRC_NF Registers QPRC2_NF
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_QPRC2_NF_NFCTLA_AINLV                 *((volatile uint32_t*)(0x424C2410UL))
#define bFM4_QPRC2_NF_NFCTLA_AINLV                *((volatile uint32_t*)(0x424C2410UL))
#define bFM_QPRC2_NF_NFCTLA_AINMD                 *((volatile uint32_t*)(0x424C2414UL))
#define bFM4_QPRC2_NF_NFCTLA_AINMD                *((volatile uint32_t*)(0x424C2414UL))

#define bFM_QPRC2_NF_NFCTLB_BINLV                 *((volatile uint32_t*)(0x424C2490UL))
#define bFM4_QPRC2_NF_NFCTLB_BINLV                *((volatile uint32_t*)(0x424C2490UL))
#define bFM_QPRC2_NF_NFCTLB_BINMD                 *((volatile uint32_t*)(0x424C2494UL))
#define bFM4_QPRC2_NF_NFCTLB_BINMD                *((volatile uint32_t*)(0x424C2494UL))

#define bFM_QPRC2_NF_NFCTLZ_ZINLV                 *((volatile uint32_t*)(0x424C2510UL))
#define bFM4_QPRC2_NF_NFCTLZ_ZINLV                *((volatile uint32_t*)(0x424C2510UL))
#define bFM_QPRC2_NF_NFCTLZ_ZINMD                 *((volatile uint32_t*)(0x424C2514UL))
#define bFM4_QPRC2_NF_NFCTLZ_ZINMD                *((volatile uint32_t*)(0x424C2514UL))


/******************************************************************************
 ** QPRC Registers QPRC3
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_QPRC3_QCR_PSTP                        *((volatile uint32_t*)(0x424C1B10UL))
#define bFM4_QPRC3_QCR_PSTP                       *((volatile uint32_t*)(0x424C1B10UL))
#define bFM_QPRC3_QCR_CGSC                        *((volatile uint32_t*)(0x424C1B14UL))
#define bFM4_QPRC3_QCR_CGSC                       *((volatile uint32_t*)(0x424C1B14UL))
#define bFM_QPRC3_QCR_RSEL                        *((volatile uint32_t*)(0x424C1B18UL))
#define bFM4_QPRC3_QCR_RSEL                       *((volatile uint32_t*)(0x424C1B18UL))
#define bFM_QPRC3_QCR_SWAP                        *((volatile uint32_t*)(0x424C1B1CUL))
#define bFM4_QPRC3_QCR_SWAP                       *((volatile uint32_t*)(0x424C1B1CUL))

#define bFM_QPRC3_QECR_ORNGMD                     *((volatile uint32_t*)(0x424C1B80UL))
#define bFM4_QPRC3_QECR_ORNGMD                    *((volatile uint32_t*)(0x424C1B80UL))
#define bFM_QPRC3_QECR_ORNGF                      *((volatile uint32_t*)(0x424C1B84UL))
#define bFM4_QPRC3_QECR_ORNGF                     *((volatile uint32_t*)(0x424C1B84UL))
#define bFM_QPRC3_QECR_ORNGIE                     *((volatile uint32_t*)(0x424C1B88UL))
#define bFM4_QPRC3_QECR_ORNGIE                    *((volatile uint32_t*)(0x424C1B88UL))
#define bFM_QPRC3_QECR_PEC                        *((volatile uint32_t*)(0x424C1B8CUL))
#define bFM4_QPRC3_QECR_PEC                       *((volatile uint32_t*)(0x424C1B8CUL))

#define bFM_QPRC3_QICRH_CDCIE                     *((volatile uint32_t*)(0x424C1AA0UL))
#define bFM4_QPRC3_QICRH_CDCIE                    *((volatile uint32_t*)(0x424C1AA0UL))
#define bFM_QPRC3_QICRH_CDCF                      *((volatile uint32_t*)(0x424C1AA4UL))
#define bFM4_QPRC3_QICRH_CDCF                     *((volatile uint32_t*)(0x424C1AA4UL))
#define bFM_QPRC3_QICRH_DIRPC                     *((volatile uint32_t*)(0x424C1AA8UL))
#define bFM4_QPRC3_QICRH_DIRPC                    *((volatile uint32_t*)(0x424C1AA8UL))
#define bFM_QPRC3_QICRH_DIROU                     *((volatile uint32_t*)(0x424C1AACUL))
#define bFM4_QPRC3_QICRH_DIROU                    *((volatile uint32_t*)(0x424C1AACUL))
#define bFM_QPRC3_QICRH_QPCNRCMIE                 *((volatile uint32_t*)(0x424C1AB0UL))
#define bFM4_QPRC3_QICRH_QPCNRCMIE                *((volatile uint32_t*)(0x424C1AB0UL))
#define bFM_QPRC3_QICRH_QPCNRCMF                  *((volatile uint32_t*)(0x424C1AB4UL))
#define bFM4_QPRC3_QICRH_QPCNRCMF                 *((volatile uint32_t*)(0x424C1AB4UL))

#define bFM_QPRC3_QICRL_QPCMIE                    *((volatile uint32_t*)(0x424C1A80UL))
#define bFM4_QPRC3_QICRL_QPCMIE                   *((volatile uint32_t*)(0x424C1A80UL))
#define bFM_QPRC3_QICRL_QPCMF                     *((volatile uint32_t*)(0x424C1A84UL))
#define bFM4_QPRC3_QICRL_QPCMF                    *((volatile uint32_t*)(0x424C1A84UL))
#define bFM_QPRC3_QICRL_QPRCMIE                   *((volatile uint32_t*)(0x424C1A88UL))
#define bFM4_QPRC3_QICRL_QPRCMIE                  *((volatile uint32_t*)(0x424C1A88UL))
#define bFM_QPRC3_QICRL_QPRCMF                    *((volatile uint32_t*)(0x424C1A8CUL))
#define bFM4_QPRC3_QICRL_QPRCMF                   *((volatile uint32_t*)(0x424C1A8CUL))
#define bFM_QPRC3_QICRL_OUZIE                     *((volatile uint32_t*)(0x424C1A90UL))
#define bFM4_QPRC3_QICRL_OUZIE                    *((volatile uint32_t*)(0x424C1A90UL))
#define bFM_QPRC3_QICRL_UFDF                      *((volatile uint32_t*)(0x424C1A94UL))
#define bFM4_QPRC3_QICRL_UFDF                     *((volatile uint32_t*)(0x424C1A94UL))
#define bFM_QPRC3_QICRL_OFDF                      *((volatile uint32_t*)(0x424C1A98UL))
#define bFM4_QPRC3_QICRL_OFDF                     *((volatile uint32_t*)(0x424C1A98UL))
#define bFM_QPRC3_QICRL_ZIIF                      *((volatile uint32_t*)(0x424C1A9CUL))
#define bFM4_QPRC3_QICRL_ZIIF                     *((volatile uint32_t*)(0x424C1A9CUL))


