neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
/******************************************************************************
 ** QPRC_NF Registers QPRC3_NF
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_QPRC3_NF_NFCTLA_AINLV                 *((volatile uint32_t*)(0x424C2610UL))
#define bFM4_QPRC3_NF_NFCTLA_AINLV                *((volatile uint32_t*)(0x424C2610UL))
#define bFM_QPRC3_NF_NFCTLA_AINMD                 *((volatile uint32_t*)(0x424C2614UL))
#define bFM4_QPRC3_NF_NFCTLA_AINMD                *((volatile uint32_t*)(0x424C2614UL))

#define bFM_QPRC3_NF_NFCTLB_BINLV                 *((volatile uint32_t*)(0x424C2690UL))
#define bFM4_QPRC3_NF_NFCTLB_BINLV                *((volatile uint32_t*)(0x424C2690UL))
#define bFM_QPRC3_NF_NFCTLB_BINMD                 *((volatile uint32_t*)(0x424C2694UL))
#define bFM4_QPRC3_NF_NFCTLB_BINMD                *((volatile uint32_t*)(0x424C2694UL))

#define bFM_QPRC3_NF_NFCTLZ_ZINLV                 *((volatile uint32_t*)(0x424C2710UL))
#define bFM4_QPRC3_NF_NFCTLZ_ZINLV                *((volatile uint32_t*)(0x424C2710UL))
#define bFM_QPRC3_NF_NFCTLZ_ZINMD                 *((volatile uint32_t*)(0x424C2714UL))
#define bFM4_QPRC3_NF_NFCTLZ_ZINMD                *((volatile uint32_t*)(0x424C2714UL))


/******************************************************************************
 ** RTC Registers RTC
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_RTC_ALMOR_TAMO                        *((volatile uint32_t*)(0x42762890UL))
#define bFM4_RTC_ALMOR_TAMO                       *((volatile uint32_t*)(0x42762890UL))

#define bFM_RTC_EWKUP_WUP0                        *((volatile uint32_t*)(0x42763180UL))
#define bFM4_RTC_EWKUP_WUP0                       *((volatile uint32_t*)(0x42763180UL))

#define bFM_RTC_HIBRST_HIBRST                     *((volatile uint32_t*)(0x42763300UL))
#define bFM4_RTC_HIBRST_HIBRST                    *((volatile uint32_t*)(0x42763300UL))

#define bFM_RTC_VBDDR_VDDR0                       *((volatile uint32_t*)(0x42763480UL))
#define bFM4_RTC_VBDDR_VDDR0                      *((volatile uint32_t*)(0x42763480UL))
#define bFM_RTC_VBDDR_VDDR1                       *((volatile uint32_t*)(0x42763484UL))
#define bFM4_RTC_VBDDR_VDDR1                      *((volatile uint32_t*)(0x42763484UL))
#define bFM_RTC_VBDDR_VDDR2                       *((volatile uint32_t*)(0x42763488UL))
#define bFM4_RTC_VBDDR_VDDR2                      *((volatile uint32_t*)(0x42763488UL))
#define bFM_RTC_VBDDR_VDDR3                       *((volatile uint32_t*)(0x4276348CUL))
#define bFM4_RTC_VBDDR_VDDR3                      *((volatile uint32_t*)(0x4276348CUL))

#define bFM_RTC_VBDIR_VDIR0                       *((volatile uint32_t*)(0x42763500UL))
#define bFM4_RTC_VBDIR_VDIR0                      *((volatile uint32_t*)(0x42763500UL))
#define bFM_RTC_VBDIR_VDIR1                       *((volatile uint32_t*)(0x42763504UL))
#define bFM4_RTC_VBDIR_VDIR1                      *((volatile uint32_t*)(0x42763504UL))
#define bFM_RTC_VBDIR_VDIR2                       *((volatile uint32_t*)(0x42763508UL))
#define bFM4_RTC_VBDIR_VDIR2                      *((volatile uint32_t*)(0x42763508UL))
#define bFM_RTC_VBDIR_VDIR3                       *((volatile uint32_t*)(0x4276350CUL))
#define bFM4_RTC_VBDIR_VDIR3                      *((volatile uint32_t*)(0x4276350CUL))

#define bFM_RTC_VBDOR_VDOR0                       *((volatile uint32_t*)(0x42763580UL))
#define bFM4_RTC_VBDOR_VDOR0                      *((volatile uint32_t*)(0x42763580UL))
#define bFM_RTC_VBDOR_VDOR1                       *((volatile uint32_t*)(0x42763584UL))
#define bFM4_RTC_VBDOR_VDOR1                      *((volatile uint32_t*)(0x42763584UL))
#define bFM_RTC_VBDOR_VDOR2                       *((volatile uint32_t*)(0x42763588UL))
#define bFM4_RTC_VBDOR_VDOR2                      *((volatile uint32_t*)(0x42763588UL))
#define bFM_RTC_VBDOR_VDOR3                       *((volatile uint32_t*)(0x4276358CUL))
#define bFM4_RTC_VBDOR_VDOR3                      *((volatile uint32_t*)(0x4276358CUL))

#define bFM_RTC_VBPCR_VPCR0                       *((volatile uint32_t*)(0x42763400UL))
#define bFM4_RTC_VBPCR_VPCR0                      *((volatile uint32_t*)(0x42763400UL))
#define bFM_RTC_VBPCR_VPCR1                       *((volatile uint32_t*)(0x42763404UL))
#define bFM4_RTC_VBPCR_VPCR1                      *((volatile uint32_t*)(0x42763404UL))
#define bFM_RTC_VBPCR_VPCR2                       *((volatile uint32_t*)(0x42763408UL))
#define bFM4_RTC_VBPCR_VPCR2                      *((volatile uint32_t*)(0x42763408UL))
#define bFM_RTC_VBPCR_VPCR3                       *((volatile uint32_t*)(0x4276340CUL))
#define bFM4_RTC_VBPCR_VPCR3                      *((volatile uint32_t*)(0x4276340CUL))

#define bFM_RTC_VBPFR_VPFR0                       *((volatile uint32_t*)(0x42763380UL))
#define bFM4_RTC_VBPFR_VPFR0                      *((volatile uint32_t*)(0x42763380UL))
#define bFM_RTC_VBPFR_VPFR1                       *((volatile uint32_t*)(0x42763384UL))
#define bFM4_RTC_VBPFR_VPFR1                      *((volatile uint32_t*)(0x42763384UL))
#define bFM_RTC_VBPFR_VPFR2                       *((volatile uint32_t*)(0x42763388UL))
#define bFM4_RTC_VBPFR_VPFR2                      *((volatile uint32_t*)(0x42763388UL))
#define bFM_RTC_VBPFR_VPFR3                       *((volatile uint32_t*)(0x4276338CUL))
#define bFM4_RTC_VBPFR_VPFR3                      *((volatile uint32_t*)(0x4276338CUL))

#define bFM_RTC_VBPZR_VPZR0                       *((volatile uint32_t*)(0x42763600UL))
#define bFM4_RTC_VBPZR_VPZR0                      *((volatile uint32_t*)(0x42763600UL))
#define bFM_RTC_VBPZR_VPZR1                       *((volatile uint32_t*)(0x42763604UL))
#define bFM4_RTC_VBPZR_VPZR1                      *((volatile uint32_t*)(0x42763604UL))

#define bFM_RTC_VDET_PON                          *((volatile uint32_t*)(0x4276321CUL))
#define bFM4_RTC_VDET_PON                         *((volatile uint32_t*)(0x4276321CUL))

#define bFM_RTC_WTCALEN_WTCALEN                   *((volatile uint32_t*)(0x42762C00UL))
#define bFM4_RTC_WTCALEN_WTCALEN                  *((volatile uint32_t*)(0x42762C00UL))

#define bFM_RTC_WTCOSEL_WTCOSEL                   *((volatile uint32_t*)(0x42762E00UL))
#define bFM4_RTC_WTCOSEL_WTCOSEL                  *((volatile uint32_t*)(0x42762E00UL))

