neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_RTC_WTCR10_ST                         *((volatile uint32_t*)(0x42762000UL))
#define bFM4_RTC_WTCR10_ST                        *((volatile uint32_t*)(0x42762000UL))
#define bFM_RTC_WTCR10_RUN                        *((volatile uint32_t*)(0x42762008UL))
#define bFM4_RTC_WTCR10_RUN                       *((volatile uint32_t*)(0x42762008UL))
#define bFM_RTC_WTCR10_SRST                       *((volatile uint32_t*)(0x4276200CUL))
#define bFM4_RTC_WTCR10_SRST                      *((volatile uint32_t*)(0x4276200CUL))
#define bFM_RTC_WTCR10_SCST                       *((volatile uint32_t*)(0x42762010UL))
#define bFM4_RTC_WTCR10_SCST                      *((volatile uint32_t*)(0x42762010UL))
#define bFM_RTC_WTCR10_SCRST                      *((volatile uint32_t*)(0x42762014UL))
#define bFM4_RTC_WTCR10_SCRST                     *((volatile uint32_t*)(0x42762014UL))
#define bFM_RTC_WTCR10_BUSY                       *((volatile uint32_t*)(0x42762018UL))
#define bFM4_RTC_WTCR10_BUSY                      *((volatile uint32_t*)(0x42762018UL))
#define bFM_RTC_WTCR10_TRANS                      *((volatile uint32_t*)(0x4276201CUL))
#define bFM4_RTC_WTCR10_TRANS                     *((volatile uint32_t*)(0x4276201CUL))

#define bFM_RTC_WTCR11_MIEN                       *((volatile uint32_t*)(0x42762080UL))
#define bFM4_RTC_WTCR11_MIEN                      *((volatile uint32_t*)(0x42762080UL))
#define bFM_RTC_WTCR11_HEN                        *((volatile uint32_t*)(0x42762084UL))
#define bFM4_RTC_WTCR11_HEN                       *((volatile uint32_t*)(0x42762084UL))
#define bFM_RTC_WTCR11_DEN                        *((volatile uint32_t*)(0x42762088UL))
#define bFM4_RTC_WTCR11_DEN                       *((volatile uint32_t*)(0x42762088UL))
#define bFM_RTC_WTCR11_MOEN                       *((volatile uint32_t*)(0x4276208CUL))
#define bFM4_RTC_WTCR11_MOEN                      *((volatile uint32_t*)(0x4276208CUL))
#define bFM_RTC_WTCR11_YEN                        *((volatile uint32_t*)(0x42762090UL))
#define bFM4_RTC_WTCR11_YEN                       *((volatile uint32_t*)(0x42762090UL))

#define bFM_RTC_WTCR12_INTSSI                     *((volatile uint32_t*)(0x42762100UL))
#define bFM4_RTC_WTCR12_INTSSI                    *((volatile uint32_t*)(0x42762100UL))
#define bFM_RTC_WTCR12_INTSI                      *((volatile uint32_t*)(0x42762104UL))
#define bFM4_RTC_WTCR12_INTSI                     *((volatile uint32_t*)(0x42762104UL))
#define bFM_RTC_WTCR12_INTMI                      *((volatile uint32_t*)(0x42762108UL))
#define bFM4_RTC_WTCR12_INTMI                     *((volatile uint32_t*)(0x42762108UL))
#define bFM_RTC_WTCR12_INTHI                      *((volatile uint32_t*)(0x4276210CUL))
#define bFM4_RTC_WTCR12_INTHI                     *((volatile uint32_t*)(0x4276210CUL))
#define bFM_RTC_WTCR12_INTTMI                     *((volatile uint32_t*)(0x42762110UL))
#define bFM4_RTC_WTCR12_INTTMI                    *((volatile uint32_t*)(0x42762110UL))
#define bFM_RTC_WTCR12_INTALI                     *((volatile uint32_t*)(0x42762114UL))
#define bFM4_RTC_WTCR12_INTALI                    *((volatile uint32_t*)(0x42762114UL))
#define bFM_RTC_WTCR12_INTERI                     *((volatile uint32_t*)(0x42762118UL))
#define bFM4_RTC_WTCR12_INTERI                    *((volatile uint32_t*)(0x42762118UL))
#define bFM_RTC_WTCR12_INTCRI                     *((volatile uint32_t*)(0x4276211CUL))
#define bFM4_RTC_WTCR12_INTCRI                    *((volatile uint32_t*)(0x4276211CUL))

#define bFM_RTC_WTCR13_INTSSIE                    *((volatile uint32_t*)(0x42762180UL))
#define bFM4_RTC_WTCR13_INTSSIE                   *((volatile uint32_t*)(0x42762180UL))
#define bFM_RTC_WTCR13_INTSIE                     *((volatile uint32_t*)(0x42762184UL))
#define bFM4_RTC_WTCR13_INTSIE                    *((volatile uint32_t*)(0x42762184UL))
#define bFM_RTC_WTCR13_INTMIE                     *((volatile uint32_t*)(0x42762188UL))
#define bFM4_RTC_WTCR13_INTMIE                    *((volatile uint32_t*)(0x42762188UL))
#define bFM_RTC_WTCR13_INTHIE                     *((volatile uint32_t*)(0x4276218CUL))
#define bFM4_RTC_WTCR13_INTHIE                    *((volatile uint32_t*)(0x4276218CUL))
#define bFM_RTC_WTCR13_INTTMIE                    *((volatile uint32_t*)(0x42762190UL))
#define bFM4_RTC_WTCR13_INTTMIE                   *((volatile uint32_t*)(0x42762190UL))
#define bFM_RTC_WTCR13_INTALIE                    *((volatile uint32_t*)(0x42762194UL))
#define bFM4_RTC_WTCR13_INTALIE                   *((volatile uint32_t*)(0x42762194UL))
#define bFM_RTC_WTCR13_INTERIE                    *((volatile uint32_t*)(0x42762198UL))
#define bFM4_RTC_WTCR13_INTERIE                   *((volatile uint32_t*)(0x42762198UL))
#define bFM_RTC_WTCR13_INTCRIE                    *((volatile uint32_t*)(0x4276219CUL))
#define bFM4_RTC_WTCR13_INTCRIE                   *((volatile uint32_t*)(0x4276219CUL))

#define bFM_RTC_WTCR20_CREAD                      *((volatile uint32_t*)(0x42762200UL))
#define bFM4_RTC_WTCR20_CREAD                     *((volatile uint32_t*)(0x42762200UL))
#define bFM_RTC_WTCR20_CWRITE                     *((volatile uint32_t*)(0x42762204UL))
#define bFM4_RTC_WTCR20_CWRITE                    *((volatile uint32_t*)(0x42762204UL))
#define bFM_RTC_WTCR20_BREAD                      *((volatile uint32_t*)(0x42762208UL))
#define bFM4_RTC_WTCR20_BREAD                     *((volatile uint32_t*)(0x42762208UL))
#define bFM_RTC_WTCR20_BWRITE                     *((volatile uint32_t*)(0x4276220CUL))
#define bFM4_RTC_WTCR20_BWRITE                    *((volatile uint32_t*)(0x4276220CUL))
#define bFM_RTC_WTCR20_PREAD                      *((volatile uint32_t*)(0x42762210UL))
#define bFM4_RTC_WTCR20_PREAD                     *((volatile uint32_t*)(0x42762210UL))
#define bFM_RTC_WTCR20_PWRITE                     *((volatile uint32_t*)(0x42762214UL))
#define bFM4_RTC_WTCR20_PWRITE                    *((volatile uint32_t*)(0x42762214UL))

#define bFM_RTC_WTCR21_TMST                       *((volatile uint32_t*)(0x42762280UL))
#define bFM4_RTC_WTCR21_TMST                      *((volatile uint32_t*)(0x42762280UL))
#define bFM_RTC_WTCR21_TMEN                       *((volatile uint32_t*)(0x42762284UL))
#define bFM4_RTC_WTCR21_TMEN                      *((volatile uint32_t*)(0x42762284UL))
#define bFM_RTC_WTCR21_TMRUN                      *((volatile uint32_t*)(0x42762288UL))
#define bFM4_RTC_WTCR21_TMRUN                     *((volatile uint32_t*)(0x42762288UL))

