neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_RTC_WTDIVEN_WTDIVEN                   *((volatile uint32_t*)(0x42762D00UL))
#define bFM4_RTC_WTDIVEN_WTDIVEN                  *((volatile uint32_t*)(0x42762D00UL))
#define bFM_RTC_WTDIVEN_WTDIVRDY                  *((volatile uint32_t*)(0x42762D04UL))
#define bFM4_RTC_WTDIVEN_WTDIVRDY                 *((volatile uint32_t*)(0x42762D04UL))

#define bFM_RTC_WTMOR_TMO                         *((volatile uint32_t*)(0x42762610UL))
#define bFM4_RTC_WTMOR_TMO                        *((volatile uint32_t*)(0x42762610UL))

#define bFM_RTC_WTOSCCNT_SOSCEX                   *((volatile uint32_t*)(0x42762F00UL))
#define bFM4_RTC_WTOSCCNT_SOSCEX                  *((volatile uint32_t*)(0x42762F00UL))
#define bFM_RTC_WTOSCCNT_SOSCNTL                  *((volatile uint32_t*)(0x42762F04UL))
#define bFM4_RTC_WTOSCCNT_SOSCNTL                 *((volatile uint32_t*)(0x42762F04UL))


/******************************************************************************
 ** SBSSR Registers SBSSR
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_SBSSR_BTSSSR_SSSR0                    *((volatile uint32_t*)(0x424BFF80UL))
#define bFM4_SBSSR_BTSSSR_SSSR0                   *((volatile uint32_t*)(0x424BFF80UL))
#define bFM_SBSSR_BTSSSR_SSSR1                    *((volatile uint32_t*)(0x424BFF84UL))
#define bFM4_SBSSR_BTSSSR_SSSR1                   *((volatile uint32_t*)(0x424BFF84UL))
#define bFM_SBSSR_BTSSSR_SSSR2                    *((volatile uint32_t*)(0x424BFF88UL))
#define bFM4_SBSSR_BTSSSR_SSSR2                   *((volatile uint32_t*)(0x424BFF88UL))
#define bFM_SBSSR_BTSSSR_SSSR3                    *((volatile uint32_t*)(0x424BFF8CUL))
#define bFM4_SBSSR_BTSSSR_SSSR3                   *((volatile uint32_t*)(0x424BFF8CUL))
#define bFM_SBSSR_BTSSSR_SSSR4                    *((volatile uint32_t*)(0x424BFF90UL))
#define bFM4_SBSSR_BTSSSR_SSSR4                   *((volatile uint32_t*)(0x424BFF90UL))
#define bFM_SBSSR_BTSSSR_SSSR5                    *((volatile uint32_t*)(0x424BFF94UL))
#define bFM4_SBSSR_BTSSSR_SSSR5                   *((volatile uint32_t*)(0x424BFF94UL))
#define bFM_SBSSR_BTSSSR_SSSR6                    *((volatile uint32_t*)(0x424BFF98UL))
#define bFM4_SBSSR_BTSSSR_SSSR6                   *((volatile uint32_t*)(0x424BFF98UL))
#define bFM_SBSSR_BTSSSR_SSSR7                    *((volatile uint32_t*)(0x424BFF9CUL))
#define bFM4_SBSSR_BTSSSR_SSSR7                   *((volatile uint32_t*)(0x424BFF9CUL))
#define bFM_SBSSR_BTSSSR_SSSR8                    *((volatile uint32_t*)(0x424BFFA0UL))
#define bFM4_SBSSR_BTSSSR_SSSR8                   *((volatile uint32_t*)(0x424BFFA0UL))
#define bFM_SBSSR_BTSSSR_SSSR9                    *((volatile uint32_t*)(0x424BFFA4UL))
#define bFM4_SBSSR_BTSSSR_SSSR9                   *((volatile uint32_t*)(0x424BFFA4UL))
#define bFM_SBSSR_BTSSSR_SSSR10                   *((volatile uint32_t*)(0x424BFFA8UL))
#define bFM4_SBSSR_BTSSSR_SSSR10                  *((volatile uint32_t*)(0x424BFFA8UL))
#define bFM_SBSSR_BTSSSR_SSSR11                   *((volatile uint32_t*)(0x424BFFACUL))
#define bFM4_SBSSR_BTSSSR_SSSR11                  *((volatile uint32_t*)(0x424BFFACUL))
#define bFM_SBSSR_BTSSSR_SSSR12                   *((volatile uint32_t*)(0x424BFFB0UL))
#define bFM4_SBSSR_BTSSSR_SSSR12                  *((volatile uint32_t*)(0x424BFFB0UL))
#define bFM_SBSSR_BTSSSR_SSSR13                   *((volatile uint32_t*)(0x424BFFB4UL))
#define bFM4_SBSSR_BTSSSR_SSSR13                  *((volatile uint32_t*)(0x424BFFB4UL))
#define bFM_SBSSR_BTSSSR_SSSR14                   *((volatile uint32_t*)(0x424BFFB8UL))
#define bFM4_SBSSR_BTSSSR_SSSR14                  *((volatile uint32_t*)(0x424BFFB8UL))
#define bFM_SBSSR_BTSSSR_SSSR15                   *((volatile uint32_t*)(0x424BFFBCUL))
#define bFM4_SBSSR_BTSSSR_SSSR15                  *((volatile uint32_t*)(0x424BFFBCUL))


/******************************************************************************
 ** SDIF Registers SDIF
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_SDIF_ADMAEST_ADMALENME                *((volatile uint32_t*)(0x42DC0A88UL))
#define bFM4_SDIF_ADMAEST_ADMALENME               *((volatile uint32_t*)(0x42DC0A88UL))

#define bFM_SDIF_AHBCFGL_SINEN                    *((volatile uint32_t*)(0x42DC200CUL))
#define bFM4_SDIF_AHBCFGL_SINEN                   *((volatile uint32_t*)(0x42DC200CUL))
#define bFM_SDIF_AHBCFGL_BSLOCK                   *((volatile uint32_t*)(0x42DC2010UL))
#define bFM4_SDIF_AHBCFGL_BSLOCK                  *((volatile uint32_t*)(0x42DC2010UL))
#define bFM_SDIF_AHBCFGL_BSLOCKSEL                *((volatile uint32_t*)(0x42DC2014UL))
#define bFM4_SDIF_AHBCFGL_BSLOCKSEL               *((volatile uint32_t*)(0x42DC2014UL))
#define bFM_SDIF_AHBCFGL_ENDIANSEL                *((volatile uint32_t*)(0x42DC2018UL))
#define bFM4_SDIF_AHBCFGL_ENDIANSEL               *((volatile uint32_t*)(0x42DC2018UL))

#define bFM_SDIF_CAPBLTY0_TOCLKUNIT               *((volatile uint32_t*)(0x42DC081CUL))
#define bFM4_SDIF_CAPBLTY0_TOCLKUNIT              *((volatile uint32_t*)(0x42DC081CUL))

#define bFM_SDIF_CAPBLTY1_EMBD8BIT                *((volatile uint32_t*)(0x42DC0848UL))
#define bFM4_SDIF_CAPBLTY1_EMBD8BIT               *((volatile uint32_t*)(0x42DC0848UL))
#define bFM_SDIF_CAPBLTY1_ADMA2SPT                *((volatile uint32_t*)(0x42DC084CUL))
#define bFM4_SDIF_CAPBLTY1_ADMA2SPT               *((volatile uint32_t*)(0x42DC084CUL))
#define bFM_SDIF_CAPBLTY1_HGHSPDSPT               *((volatile uint32_t*)(0x42DC0854UL))
#define bFM4_SDIF_CAPBLTY1_HGHSPDSPT              *((volatile uint32_t*)(0x42DC0854UL))
#define bFM_SDIF_CAPBLTY1_SDMASPT                 *((volatile uint32_t*)(0x42DC0858UL))
#define bFM4_SDIF_CAPBLTY1_SDMASPT                *((volatile uint32_t*)(0x42DC0858UL))
#define bFM_SDIF_CAPBLTY1_LWPWRSPT                *((volatile uint32_t*)(0x42DC085CUL))
#define bFM4_SDIF_CAPBLTY1_LWPWRSPT               *((volatile uint32_t*)(0x42DC085CUL))
#define bFM_SDIF_CAPBLTY1_V33SPT                  *((volatile uint32_t*)(0x42DC0860UL))
#define bFM4_SDIF_CAPBLTY1_V33SPT                 *((volatile uint32_t*)(0x42DC0860UL))
#define bFM_SDIF_CAPBLTY1_V30SPT                  *((volatile uint32_t*)(0x42DC0864UL))
#define bFM4_SDIF_CAPBLTY1_V30SPT                 *((volatile uint32_t*)(0x42DC0864UL))
#define bFM_SDIF_CAPBLTY1_V18SPT                  *((volatile uint32_t*)(0x42DC0868UL))
#define bFM4_SDIF_CAPBLTY1_V18SPT                 *((volatile uint32_t*)(0x42DC0868UL))
#define bFM_SDIF_CAPBLTY1_BUS64SPT                *((volatile uint32_t*)(0x42DC0870UL))
#define bFM4_SDIF_CAPBLTY1_BUS64SPT               *((volatile uint32_t*)(0x42DC0870UL))
#define bFM_SDIF_CAPBLTY1_ASYINTSPT               *((volatile uint32_t*)(0x42DC0874UL))
#define bFM4_SDIF_CAPBLTY1_ASYINTSPT              *((volatile uint32_t*)(0x42DC0874UL))

#define bFM_SDIF_CAPBLTY2_SDR50SPT                *((volatile uint32_t*)(0x42DC0880UL))
#define bFM4_SDIF_CAPBLTY2_SDR50SPT               *((volatile uint32_t*)(0x42DC0880UL))
#define bFM_SDIF_CAPBLTY2_SDR104SPT               *((volatile uint32_t*)(0x42DC0884UL))
#define bFM4_SDIF_CAPBLTY2_SDR104SPT              *((volatile uint32_t*)(0x42DC0884UL))
#define bFM_SDIF_CAPBLTY2_DDR50SPT                *((volatile uint32_t*)(0x42DC0888UL))
#define bFM4_SDIF_CAPBLTY2_DDR50SPT               *((volatile uint32_t*)(0x42DC0888UL))
#define bFM_SDIF_CAPBLTY2_DRVTPASPT               *((volatile uint32_t*)(0x42DC0890UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPASPT              *((volatile uint32_t*)(0x42DC0890UL))
#define bFM_SDIF_CAPBLTY2_DRVTPCSPT               *((volatile uint32_t*)(0x42DC0894UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPCSPT              *((volatile uint32_t*)(0x42DC0894UL))
#define bFM_SDIF_CAPBLTY2_DRVTPDSPT               *((volatile uint32_t*)(0x42DC0898UL))
#define bFM4_SDIF_CAPBLTY2_DRVTPDSPT              *((volatile uint32_t*)(0x42DC0898UL))
#define bFM_SDIF_CAPBLTY2_USETNSDR50              *((volatile uint32_t*)(0x42DC08B4UL))
#define bFM4_SDIF_CAPBLTY2_USETNSDR50             *((volatile uint32_t*)(0x42DC08B4UL))

#define bFM_SDIF_FEACEST_FEVNT12ND                *((volatile uint32_t*)(0x42DC0A00UL))
#define bFM4_SDIF_FEACEST_FEVNT12ND               *((volatile uint32_t*)(0x42DC0A00UL))
#define bFM_SDIF_FEACEST_FEVNTTO                  *((volatile uint32_t*)(0x42DC0A04UL))
#define bFM4_SDIF_FEACEST_FEVNTTO                 *((volatile uint32_t*)(0x42DC0A04UL))
#define bFM_SDIF_FEACEST_FEVNTCRC                 *((volatile uint32_t*)(0x42DC0A08UL))
#define bFM4_SDIF_FEACEST_FEVNTCRC                *((volatile uint32_t*)(0x42DC0A08UL))
#define bFM_SDIF_FEACEST_FEVNTEB                  *((volatile uint32_t*)(0x42DC0A0CUL))
#define bFM4_SDIF_FEACEST_FEVNTEB                 *((volatile uint32_t*)(0x42DC0A0CUL))
#define bFM_SDIF_FEACEST_FEVNTIDX                 *((volatile uint32_t*)(0x42DC0A10UL))
#define bFM4_SDIF_FEACEST_FEVNTIDX                *((volatile uint32_t*)(0x42DC0A10UL))
#define bFM_SDIF_FEACEST_FEVNTCMD12               *((volatile uint32_t*)(0x42DC0A1CUL))
#define bFM4_SDIF_FEACEST_FEVNTCMD12              *((volatile uint32_t*)(0x42DC0A1CUL))

#define bFM_SDIF_MCWIRQC0_WTIRQEN                 *((volatile uint32_t*)(0x42DC2500UL))
#define bFM4_SDIF_MCWIRQC0_WTIRQEN                *((volatile uint32_t*)(0x42DC2500UL))
#define bFM_SDIF_MCWIRQC0_WTIRQST                 *((volatile uint32_t*)(0x42DC2504UL))
#define bFM4_SDIF_MCWIRQC0_WTIRQST                *((volatile uint32_t*)(0x42DC2504UL))

#define bFM_SDIF_MMCSDCH_BTACKENMMC               *((volatile uint32_t*)(0x42DC24C0UL))
#define bFM4_SDIF_MMCSDCH_BTACKENMMC              *((volatile uint32_t*)(0x42DC24C0UL))
#define bFM_SDIF_MMCSDCH_BTABTENMMC               *((volatile uint32_t*)(0x42DC24C4UL))
#define bFM4_SDIF_MMCSDCH_BTABTENMMC              *((volatile uint32_t*)(0x42DC24C4UL))
#define bFM_SDIF_MMCSDCH_BTMDENMMC                *((volatile uint32_t*)(0x42DC24C8UL))
#define bFM4_SDIF_MMCSDCH_BTMDENMMC               *((volatile uint32_t*)(0x42DC24C8UL))

#define bFM_SDIF_MMCSDCL_LCKRSTESD                *((volatile uint32_t*)(0x42DC2480UL))
#define bFM4_SDIF_MMCSDCL_LCKRSTESD               *((volatile uint32_t*)(0x42DC2480UL))
#define bFM_SDIF_MMCSDCL_RSTMMC                   *((volatile uint32_t*)(0x42DC2484UL))
#define bFM4_SDIF_MMCSDCL_RSTMMC                  *((volatile uint32_t*)(0x42DC2484UL))
#define bFM_SDIF_MMCSDCL_VCCCTLMMC                *((volatile uint32_t*)(0x42DC2488UL))
#define bFM4_SDIF_MMCSDCL_VCCCTLMMC               *((volatile uint32_t*)(0x42DC2488UL))
#define bFM_SDIF_MMCSDCL_VCCQCTLMMC               *((volatile uint32_t*)(0x42DC248CUL))
#define bFM4_SDIF_MMCSDCL_VCCQCTLMMC              *((volatile uint32_t*)(0x42DC248CUL))
#define bFM_SDIF_MMCSDCL_MMCDDRSEL                *((volatile uint32_t*)(0x42DC24A0UL))
#define bFM4_SDIF_MMCSDCL_MMCDDRSEL               *((volatile uint32_t*)(0x42DC24A0UL))
#define bFM_SDIF_MMCSDCL_CMDDATDLY                *((volatile uint32_t*)(0x42DC24A4UL))
#define bFM4_SDIF_MMCSDCL_CMDDATDLY               *((volatile uint32_t*)(0x42DC24A4UL))

