neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_SDIF_PSWISGEL_INT5MSSGEN              *((volatile uint32_t*)(0x42DC2400UL))
#define bFM4_SDIF_PSWISGEL_INT5MSSGEN             *((volatile uint32_t*)(0x42DC2400UL))
#define bFM_SDIF_PSWISGEL_INT1MSSGEN              *((volatile uint32_t*)(0x42DC2404UL))
#define bFM4_SDIF_PSWISGEL_INT1MSSGEN             *((volatile uint32_t*)(0x42DC2404UL))

#define bFM_SDIF_PSWISTEL_INT5MSSTS               *((volatile uint32_t*)(0x42DC2380UL))
#define bFM4_SDIF_PSWISTEL_INT5MSSTS              *((volatile uint32_t*)(0x42DC2380UL))
#define bFM_SDIF_PSWISTEL_INT1MSSTS               *((volatile uint32_t*)(0x42DC2384UL))
#define bFM4_SDIF_PSWISTEL_INT1MSSTS              *((volatile uint32_t*)(0x42DC2384UL))

#define bFM_SDIF_PSWISTL_INT5MS                   *((volatile uint32_t*)(0x42DC2300UL))
#define bFM4_SDIF_PSWISTL_INT5MS                  *((volatile uint32_t*)(0x42DC2300UL))
#define bFM_SDIF_PSWISTL_INT1MS                   *((volatile uint32_t*)(0x42DC2304UL))
#define bFM4_SDIF_PSWISTL_INT1MS                  *((volatile uint32_t*)(0x42DC2304UL))

#define bFM_SDIF_SACMDEST_ACMD12NOEX              *((volatile uint32_t*)(0x42DC0780UL))
#define bFM4_SDIF_SACMDEST_ACMD12NOEX             *((volatile uint32_t*)(0x42DC0780UL))
#define bFM_SDIF_SACMDEST_ACMDTOERR               *((volatile uint32_t*)(0x42DC0784UL))
#define bFM4_SDIF_SACMDEST_ACMDTOERR              *((volatile uint32_t*)(0x42DC0784UL))
#define bFM_SDIF_SACMDEST_ACMDCRCERR              *((volatile uint32_t*)(0x42DC0788UL))
#define bFM4_SDIF_SACMDEST_ACMDCRCERR             *((volatile uint32_t*)(0x42DC0788UL))
#define bFM_SDIF_SACMDEST_ACMDEBERR               *((volatile uint32_t*)(0x42DC078CUL))
#define bFM4_SDIF_SACMDEST_ACMDEBERR              *((volatile uint32_t*)(0x42DC078CUL))
#define bFM_SDIF_SACMDEST_ACMDIDXERR              *((volatile uint32_t*)(0x42DC0790UL))
#define bFM4_SDIF_SACMDEST_ACMDIDXERR             *((volatile uint32_t*)(0x42DC0790UL))
#define bFM_SDIF_SACMDEST_CMDND12ERR              *((volatile uint32_t*)(0x42DC079CUL))
#define bFM4_SDIF_SACMDEST_CMDND12ERR             *((volatile uint32_t*)(0x42DC079CUL))

#define bFM_SDIF_SBLKGPCTL_BLCKGSTPREQ            *((volatile uint32_t*)(0x42DC0540UL))
#define bFM4_SDIF_SBLKGPCTL_BLCKGSTPREQ           *((volatile uint32_t*)(0x42DC0540UL))
#define bFM_SDIF_SBLKGPCTL_CONTREQ                *((volatile uint32_t*)(0x42DC0544UL))
#define bFM4_SDIF_SBLKGPCTL_CONTREQ               *((volatile uint32_t*)(0x42DC0544UL))
#define bFM_SDIF_SBLKGPCTL_RDWAITCTL              *((volatile uint32_t*)(0x42DC0548UL))
#define bFM4_SDIF_SBLKGPCTL_RDWAITCTL             *((volatile uint32_t*)(0x42DC0548UL))
#define bFM_SDIF_SBLKGPCTL_BLCKGAPINT             *((volatile uint32_t*)(0x42DC054CUL))
#define bFM4_SDIF_SBLKGPCTL_BLCKGAPINT            *((volatile uint32_t*)(0x42DC054CUL))

#define bFM_SDIF_SCLKCTL_INTLCLCKEN               *((volatile uint32_t*)(0x42DC0580UL))
#define bFM4_SDIF_SCLKCTL_INTLCLCKEN              *((volatile uint32_t*)(0x42DC0580UL))
#define bFM_SDIF_SCLKCTL_INTLCLCKST               *((volatile uint32_t*)(0x42DC0584UL))
#define bFM4_SDIF_SCLKCTL_INTLCLCKST              *((volatile uint32_t*)(0x42DC0584UL))
#define bFM_SDIF_SCLKCTL_SDCLCKEN                 *((volatile uint32_t*)(0x42DC0588UL))
#define bFM4_SDIF_SCLKCTL_SDCLCKEN                *((volatile uint32_t*)(0x42DC0588UL))
#define bFM_SDIF_SCLKCTL_CLCKGENSEL               *((volatile uint32_t*)(0x42DC0594UL))
#define bFM4_SDIF_SCLKCTL_CLCKGENSEL              *((volatile uint32_t*)(0x42DC0594UL))

#define bFM_SDIF_SCMMD_CMDCRCCHKE                 *((volatile uint32_t*)(0x42DC01CCUL))
#define bFM4_SDIF_SCMMD_CMDCRCCHKE                *((volatile uint32_t*)(0x42DC01CCUL))
#define bFM_SDIF_SCMMD_CMDIDXCHKE                 *((volatile uint32_t*)(0x42DC01D0UL))
#define bFM4_SDIF_SCMMD_CMDIDXCHKE                *((volatile uint32_t*)(0x42DC01D0UL))
#define bFM_SDIF_SCMMD_DATPRESSEL                 *((volatile uint32_t*)(0x42DC01D4UL))
#define bFM4_SDIF_SCMMD_DATPRESSEL                *((volatile uint32_t*)(0x42DC01D4UL))

#define bFM_SDIF_SEINTSGE_CMDTOERRG               *((volatile uint32_t*)(0x42DC0740UL))
#define bFM4_SDIF_SEINTSGE_CMDTOERRG              *((volatile uint32_t*)(0x42DC0740UL))
#define bFM_SDIF_SEINTSGE_CMDCRCERRG              *((volatile uint32_t*)(0x42DC0744UL))
#define bFM4_SDIF_SEINTSGE_CMDCRCERRG             *((volatile uint32_t*)(0x42DC0744UL))
#define bFM_SDIF_SEINTSGE_CMDEBERRG               *((volatile uint32_t*)(0x42DC0748UL))
#define bFM4_SDIF_SEINTSGE_CMDEBERRG              *((volatile uint32_t*)(0x42DC0748UL))
#define bFM_SDIF_SEINTSGE_CMDIDXERRG              *((volatile uint32_t*)(0x42DC074CUL))
#define bFM4_SDIF_SEINTSGE_CMDIDXERRG             *((volatile uint32_t*)(0x42DC074CUL))
#define bFM_SDIF_SEINTSGE_DTTOERRG                *((volatile uint32_t*)(0x42DC0750UL))
#define bFM4_SDIF_SEINTSGE_DTTOERRG               *((volatile uint32_t*)(0x42DC0750UL))
#define bFM_SDIF_SEINTSGE_DTCRCERRG               *((volatile uint32_t*)(0x42DC0754UL))
#define bFM4_SDIF_SEINTSGE_DTCRCERRG              *((volatile uint32_t*)(0x42DC0754UL))
#define bFM_SDIF_SEINTSGE_DTEBERRG                *((volatile uint32_t*)(0x42DC0758UL))
#define bFM4_SDIF_SEINTSGE_DTEBERRG               *((volatile uint32_t*)(0x42DC0758UL))
#define bFM_SDIF_SEINTSGE_CRTLMTERRG              *((volatile uint32_t*)(0x42DC075CUL))
#define bFM4_SDIF_SEINTSGE_CRTLMTERRG             *((volatile uint32_t*)(0x42DC075CUL))
#define bFM_SDIF_SEINTSGE_ACMD12ERRG              *((volatile uint32_t*)(0x42DC0760UL))
#define bFM4_SDIF_SEINTSGE_ACMD12ERRG             *((volatile uint32_t*)(0x42DC0760UL))
#define bFM_SDIF_SEINTSGE_ADMAERRG                *((volatile uint32_t*)(0x42DC0764UL))
#define bFM4_SDIF_SEINTSGE_ADMAERRG               *((volatile uint32_t*)(0x42DC0764UL))
#define bFM_SDIF_SEINTSGE_TUNINGERRG              *((volatile uint32_t*)(0x42DC0768UL))
#define bFM4_SDIF_SEINTSGE_TUNINGERRG             *((volatile uint32_t*)(0x42DC0768UL))
#define bFM_SDIF_SEINTSGE_BTACKERRG               *((volatile uint32_t*)(0x42DC0770UL))
#define bFM4_SDIF_SEINTSGE_BTACKERRG              *((volatile uint32_t*)(0x42DC0770UL))
#define bFM_SDIF_SEINTSGE_ACMD19ERRG              *((volatile uint32_t*)(0x42DC0774UL))
#define bFM4_SDIF_SEINTSGE_ACMD19ERRG             *((volatile uint32_t*)(0x42DC0774UL))
#define bFM_SDIF_SEINTSGE_AHBMSTERRG              *((volatile uint32_t*)(0x42DC0778UL))
#define bFM4_SDIF_SEINTSGE_AHBMSTERRG             *((volatile uint32_t*)(0x42DC0778UL))

#define bFM_SDIF_SEINTST_CMDTOERR                 *((volatile uint32_t*)(0x42DC0640UL))
#define bFM4_SDIF_SEINTST_CMDTOERR                *((volatile uint32_t*)(0x42DC0640UL))
#define bFM_SDIF_SEINTST_CMDCRCERR                *((volatile uint32_t*)(0x42DC0644UL))
#define bFM4_SDIF_SEINTST_CMDCRCERR               *((volatile uint32_t*)(0x42DC0644UL))
#define bFM_SDIF_SEINTST_CMDEBERR                 *((volatile uint32_t*)(0x42DC0648UL))
#define bFM4_SDIF_SEINTST_CMDEBERR                *((volatile uint32_t*)(0x42DC0648UL))
#define bFM_SDIF_SEINTST_CMDIDXERR                *((volatile uint32_t*)(0x42DC064CUL))
#define bFM4_SDIF_SEINTST_CMDIDXERR               *((volatile uint32_t*)(0x42DC064CUL))
#define bFM_SDIF_SEINTST_DTTOERR                  *((volatile uint32_t*)(0x42DC0650UL))
#define bFM4_SDIF_SEINTST_DTTOERR                 *((volatile uint32_t*)(0x42DC0650UL))
#define bFM_SDIF_SEINTST_DTCRCERR                 *((volatile uint32_t*)(0x42DC0654UL))
#define bFM4_SDIF_SEINTST_DTCRCERR                *((volatile uint32_t*)(0x42DC0654UL))
#define bFM_SDIF_SEINTST_DTEBERR                  *((volatile uint32_t*)(0x42DC0658UL))
#define bFM4_SDIF_SEINTST_DTEBERR                 *((volatile uint32_t*)(0x42DC0658UL))
#define bFM_SDIF_SEINTST_CRTLMTERR                *((volatile uint32_t*)(0x42DC065CUL))
#define bFM4_SDIF_SEINTST_CRTLMTERR               *((volatile uint32_t*)(0x42DC065CUL))
#define bFM_SDIF_SEINTST_ACMD12ERR                *((volatile uint32_t*)(0x42DC0660UL))
#define bFM4_SDIF_SEINTST_ACMD12ERR               *((volatile uint32_t*)(0x42DC0660UL))
#define bFM_SDIF_SEINTST_ADMAERR                  *((volatile uint32_t*)(0x42DC0664UL))
#define bFM4_SDIF_SEINTST_ADMAERR                 *((volatile uint32_t*)(0x42DC0664UL))
#define bFM_SDIF_SEINTST_TUNINGERR                *((volatile uint32_t*)(0x42DC0668UL))
#define bFM4_SDIF_SEINTST_TUNINGERR               *((volatile uint32_t*)(0x42DC0668UL))
#define bFM_SDIF_SEINTST_BTACKERR                 *((volatile uint32_t*)(0x42DC0670UL))
#define bFM4_SDIF_SEINTST_BTACKERR                *((volatile uint32_t*)(0x42DC0670UL))
#define bFM_SDIF_SEINTST_ACMD19ERR                *((volatile uint32_t*)(0x42DC0674UL))
#define bFM4_SDIF_SEINTST_ACMD19ERR               *((volatile uint32_t*)(0x42DC0674UL))
#define bFM_SDIF_SEINTST_AHBMSTERR                *((volatile uint32_t*)(0x42DC0678UL))
#define bFM4_SDIF_SEINTST_AHBMSTERR               *((volatile uint32_t*)(0x42DC0678UL))

