neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_SDIF_SEINTSTE_CMDTOERRS               *((volatile uint32_t*)(0x42DC06C0UL))
#define bFM4_SDIF_SEINTSTE_CMDTOERRS              *((volatile uint32_t*)(0x42DC06C0UL))
#define bFM_SDIF_SEINTSTE_CMDCRCERRS              *((volatile uint32_t*)(0x42DC06C4UL))
#define bFM4_SDIF_SEINTSTE_CMDCRCERRS             *((volatile uint32_t*)(0x42DC06C4UL))
#define bFM_SDIF_SEINTSTE_CMDEBERRS               *((volatile uint32_t*)(0x42DC06C8UL))
#define bFM4_SDIF_SEINTSTE_CMDEBERRS              *((volatile uint32_t*)(0x42DC06C8UL))
#define bFM_SDIF_SEINTSTE_CMDIDXERRS              *((volatile uint32_t*)(0x42DC06CCUL))
#define bFM4_SDIF_SEINTSTE_CMDIDXERRS             *((volatile uint32_t*)(0x42DC06CCUL))
#define bFM_SDIF_SEINTSTE_DTTOERRS                *((volatile uint32_t*)(0x42DC06D0UL))
#define bFM4_SDIF_SEINTSTE_DTTOERRS               *((volatile uint32_t*)(0x42DC06D0UL))
#define bFM_SDIF_SEINTSTE_DTCRCERRS               *((volatile uint32_t*)(0x42DC06D4UL))
#define bFM4_SDIF_SEINTSTE_DTCRCERRS              *((volatile uint32_t*)(0x42DC06D4UL))
#define bFM_SDIF_SEINTSTE_DTEBERRS                *((volatile uint32_t*)(0x42DC06D8UL))
#define bFM4_SDIF_SEINTSTE_DTEBERRS               *((volatile uint32_t*)(0x42DC06D8UL))
#define bFM_SDIF_SEINTSTE_CRTLMTERRS              *((volatile uint32_t*)(0x42DC06DCUL))
#define bFM4_SDIF_SEINTSTE_CRTLMTERRS             *((volatile uint32_t*)(0x42DC06DCUL))
#define bFM_SDIF_SEINTSTE_ACMD12ERRS              *((volatile uint32_t*)(0x42DC06E0UL))
#define bFM4_SDIF_SEINTSTE_ACMD12ERRS             *((volatile uint32_t*)(0x42DC06E0UL))
#define bFM_SDIF_SEINTSTE_ADMAERRS                *((volatile uint32_t*)(0x42DC06E4UL))
#define bFM4_SDIF_SEINTSTE_ADMAERRS               *((volatile uint32_t*)(0x42DC06E4UL))
#define bFM_SDIF_SEINTSTE_TUNINGERRS              *((volatile uint32_t*)(0x42DC06E8UL))
#define bFM4_SDIF_SEINTSTE_TUNINGERRS             *((volatile uint32_t*)(0x42DC06E8UL))
#define bFM_SDIF_SEINTSTE_BTACKERRS               *((volatile uint32_t*)(0x42DC06F0UL))
#define bFM4_SDIF_SEINTSTE_BTACKERRS              *((volatile uint32_t*)(0x42DC06F0UL))
#define bFM_SDIF_SEINTSTE_ACMD19ERRS              *((volatile uint32_t*)(0x42DC06F4UL))
#define bFM4_SDIF_SEINTSTE_ACMD19ERRS             *((volatile uint32_t*)(0x42DC06F4UL))
#define bFM_SDIF_SEINTSTE_AHBMSTERRS              *((volatile uint32_t*)(0x42DC06F8UL))
#define bFM4_SDIF_SEINTSTE_AHBMSTERRS             *((volatile uint32_t*)(0x42DC06F8UL))

#define bFM_SDIF_SFEEIST_FETOERR                  *((volatile uint32_t*)(0x42DC0A40UL))
#define bFM4_SDIF_SFEEIST_FETOERR                 *((volatile uint32_t*)(0x42DC0A40UL))
#define bFM_SDIF_SFEEIST_FECRCERR                 *((volatile uint32_t*)(0x42DC0A44UL))
#define bFM4_SDIF_SFEEIST_FECRCERR                *((volatile uint32_t*)(0x42DC0A44UL))
#define bFM_SDIF_SFEEIST_FEEBERR                  *((volatile uint32_t*)(0x42DC0A48UL))
#define bFM4_SDIF_SFEEIST_FEEBERR                 *((volatile uint32_t*)(0x42DC0A48UL))
#define bFM_SDIF_SFEEIST_FEIDXERR                 *((volatile uint32_t*)(0x42DC0A4CUL))
#define bFM4_SDIF_SFEEIST_FEIDXERR                *((volatile uint32_t*)(0x42DC0A4CUL))
#define bFM_SDIF_SFEEIST_FEDTOTERR                *((volatile uint32_t*)(0x42DC0A50UL))
#define bFM4_SDIF_SFEEIST_FEDTOTERR               *((volatile uint32_t*)(0x42DC0A50UL))
#define bFM_SDIF_SFEEIST_FEDTCRCERR               *((volatile uint32_t*)(0x42DC0A54UL))
#define bFM4_SDIF_SFEEIST_FEDTCRCERR              *((volatile uint32_t*)(0x42DC0A54UL))
#define bFM_SDIF_SFEEIST_FEDTEBERR                *((volatile uint32_t*)(0x42DC0A58UL))
#define bFM4_SDIF_SFEEIST_FEDTEBERR               *((volatile uint32_t*)(0x42DC0A58UL))
#define bFM_SDIF_SFEEIST_FECRLTERR                *((volatile uint32_t*)(0x42DC0A5CUL))
#define bFM4_SDIF_SFEEIST_FECRLTERR               *((volatile uint32_t*)(0x42DC0A5CUL))
#define bFM_SDIF_SFEEIST_FEA12ERR                 *((volatile uint32_t*)(0x42DC0A60UL))
#define bFM4_SDIF_SFEEIST_FEA12ERR                *((volatile uint32_t*)(0x42DC0A60UL))
#define bFM_SDIF_SFEEIST_FEADMAERR                *((volatile uint32_t*)(0x42DC0A64UL))
#define bFM4_SDIF_SFEEIST_FEADMAERR               *((volatile uint32_t*)(0x42DC0A64UL))
#define bFM_SDIF_SFEEIST_FETUNEERR                *((volatile uint32_t*)(0x42DC0A68UL))
#define bFM4_SDIF_SFEEIST_FETUNEERR               *((volatile uint32_t*)(0x42DC0A68UL))
#define bFM_SDIF_SFEEIST_FEACKERR                 *((volatile uint32_t*)(0x42DC0A70UL))
#define bFM4_SDIF_SFEEIST_FEACKERR                *((volatile uint32_t*)(0x42DC0A70UL))
#define bFM_SDIF_SFEEIST_FEA19ERR                 *((volatile uint32_t*)(0x42DC0A74UL))
#define bFM4_SDIF_SFEEIST_FEA19ERR                *((volatile uint32_t*)(0x42DC0A74UL))
#define bFM_SDIF_SFEEIST_FEAHBMSERR               *((volatile uint32_t*)(0x42DC0A78UL))
#define bFM4_SDIF_SFEEIST_FEAHBMSERR              *((volatile uint32_t*)(0x42DC0A78UL))

#define bFM_SDIF_SHCTL1_LEDCTRL                   *((volatile uint32_t*)(0x42DC0500UL))
#define bFM4_SDIF_SHCTL1_LEDCTRL                  *((volatile uint32_t*)(0x42DC0500UL))
#define bFM_SDIF_SHCTL1_DATAWIDTH                 *((volatile uint32_t*)(0x42DC0504UL))
#define bFM4_SDIF_SHCTL1_DATAWIDTH                *((volatile uint32_t*)(0x42DC0504UL))
#define bFM_SDIF_SHCTL1_HIGHSPDEN                 *((volatile uint32_t*)(0x42DC0508UL))
#define bFM4_SDIF_SHCTL1_HIGHSPDEN                *((volatile uint32_t*)(0x42DC0508UL))
#define bFM_SDIF_SHCTL1_EXTDTWIDTH                *((volatile uint32_t*)(0x42DC0514UL))
#define bFM4_SDIF_SHCTL1_EXTDTWIDTH               *((volatile uint32_t*)(0x42DC0514UL))
#define bFM_SDIF_SHCTL1_CDTSTLVL                  *((volatile uint32_t*)(0x42DC0518UL))
#define bFM4_SDIF_SHCTL1_CDTSTLVL                 *((volatile uint32_t*)(0x42DC0518UL))
#define bFM_SDIF_SHCTL1_CDSGNSEL                  *((volatile uint32_t*)(0x42DC051CUL))
#define bFM4_SDIF_SHCTL1_CDSGNSEL                 *((volatile uint32_t*)(0x42DC051CUL))

#define bFM_SDIF_SHCTL2_V18SGNEN                  *((volatile uint32_t*)(0x42DC07CCUL))
#define bFM4_SDIF_SHCTL2_V18SGNEN                 *((volatile uint32_t*)(0x42DC07CCUL))
#define bFM_SDIF_SHCTL2_DOTUING                   *((volatile uint32_t*)(0x42DC07D8UL))
#define bFM4_SDIF_SHCTL2_DOTUING                  *((volatile uint32_t*)(0x42DC07D8UL))
#define bFM_SDIF_SHCTL2_SMPCLKSEL                 *((volatile uint32_t*)(0x42DC07DCUL))
#define bFM4_SDIF_SHCTL2_SMPCLKSEL                *((volatile uint32_t*)(0x42DC07DCUL))
#define bFM_SDIF_SHCTL2_ASYINTEN                  *((volatile uint32_t*)(0x42DC07F8UL))
#define bFM4_SDIF_SHCTL2_ASYINTEN                 *((volatile uint32_t*)(0x42DC07F8UL))
#define bFM_SDIF_SHCTL2_PREVALEN                  *((volatile uint32_t*)(0x42DC07FCUL))
#define bFM4_SDIF_SHCTL2_PREVALEN                 *((volatile uint32_t*)(0x42DC07FCUL))

#define bFM_SDIF_SNINTSGE_CMDCMPLTG               *((volatile uint32_t*)(0x42DC0700UL))
#define bFM4_SDIF_SNINTSGE_CMDCMPLTG              *((volatile uint32_t*)(0x42DC0700UL))
#define bFM_SDIF_SNINTSGE_TRSFCMPLTG              *((volatile uint32_t*)(0x42DC0704UL))
#define bFM4_SDIF_SNINTSGE_TRSFCMPLTG             *((volatile uint32_t*)(0x42DC0704UL))
#define bFM_SDIF_SNINTSGE_BLCKGEVNTG              *((volatile uint32_t*)(0x42DC0708UL))
#define bFM4_SDIF_SNINTSGE_BLCKGEVNTG             *((volatile uint32_t*)(0x42DC0708UL))
#define bFM_SDIF_SNINTSGE_DMAINTG                 *((volatile uint32_t*)(0x42DC070CUL))
#define bFM4_SDIF_SNINTSGE_DMAINTG                *((volatile uint32_t*)(0x42DC070CUL))
#define bFM_SDIF_SNINTSGE_BUFWRRDYG               *((volatile uint32_t*)(0x42DC0710UL))
#define bFM4_SDIF_SNINTSGE_BUFWRRDYG              *((volatile uint32_t*)(0x42DC0710UL))
#define bFM_SDIF_SNINTSGE_BUFRDRDYG               *((volatile uint32_t*)(0x42DC0714UL))
#define bFM4_SDIF_SNINTSGE_BUFRDRDYG              *((volatile uint32_t*)(0x42DC0714UL))
#define bFM_SDIF_SNINTSGE_CARDINSG                *((volatile uint32_t*)(0x42DC0718UL))
#define bFM4_SDIF_SNINTSGE_CARDINSG               *((volatile uint32_t*)(0x42DC0718UL))
#define bFM_SDIF_SNINTSGE_CARDRMVG                *((volatile uint32_t*)(0x42DC071CUL))
#define bFM4_SDIF_SNINTSGE_CARDRMVG               *((volatile uint32_t*)(0x42DC071CUL))
#define bFM_SDIF_SNINTSGE_CARDINTG                *((volatile uint32_t*)(0x42DC0720UL))
#define bFM4_SDIF_SNINTSGE_CARDINTG               *((volatile uint32_t*)(0x42DC0720UL))
#define bFM_SDIF_SNINTSGE_INT_AG                  *((volatile uint32_t*)(0x42DC0724UL))
#define bFM4_SDIF_SNINTSGE_INT_AG                 *((volatile uint32_t*)(0x42DC0724UL))
#define bFM_SDIF_SNINTSGE_INT_BG                  *((volatile uint32_t*)(0x42DC0728UL))
#define bFM4_SDIF_SNINTSGE_INT_BG                 *((volatile uint32_t*)(0x42DC0728UL))
#define bFM_SDIF_SNINTSGE_INT_CG                  *((volatile uint32_t*)(0x42DC072CUL))
#define bFM4_SDIF_SNINTSGE_INT_CG                 *((volatile uint32_t*)(0x42DC072CUL))
#define bFM_SDIF_SNINTSGE_RETUNEEVTG              *((volatile uint32_t*)(0x42DC0730UL))
#define bFM4_SDIF_SNINTSGE_RETUNEEVTG             *((volatile uint32_t*)(0x42DC0730UL))

