neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_USB0_EP0OS_SPK                        *((volatile uint32_t*)(0x42842924UL))
#define bFM4_USB0_EP0OS_SPK                       *((volatile uint32_t*)(0x42842924UL))
#define bFM_USB0_EP0OS_DRQO                       *((volatile uint32_t*)(0x42842928UL))
#define bFM4_USB0_EP0OS_DRQO                      *((volatile uint32_t*)(0x42842928UL))
#define bFM_USB0_EP0OS_SPKIE                      *((volatile uint32_t*)(0x42842934UL))
#define bFM4_USB0_EP0OS_SPKIE                     *((volatile uint32_t*)(0x42842934UL))
#define bFM_USB0_EP0OS_DRQOIE                     *((volatile uint32_t*)(0x42842938UL))
#define bFM4_USB0_EP0OS_DRQOIE                    *((volatile uint32_t*)(0x42842938UL))
#define bFM_USB0_EP0OS_BFINI                      *((volatile uint32_t*)(0x4284293CUL))
#define bFM4_USB0_EP0OS_BFINI                     *((volatile uint32_t*)(0x4284293CUL))

#define bFM_USB0_EP1C_STAL                        *((volatile uint32_t*)(0x42842524UL))
#define bFM4_USB0_EP1C_STAL                       *((volatile uint32_t*)(0x42842524UL))
#define bFM_USB0_EP1C_NULE                        *((volatile uint32_t*)(0x42842528UL))
#define bFM4_USB0_EP1C_NULE                       *((volatile uint32_t*)(0x42842528UL))
#define bFM_USB0_EP1C_DMAE                        *((volatile uint32_t*)(0x4284252CUL))
#define bFM4_USB0_EP1C_DMAE                       *((volatile uint32_t*)(0x4284252CUL))
#define bFM_USB0_EP1C_DIR                         *((volatile uint32_t*)(0x42842530UL))
#define bFM4_USB0_EP1C_DIR                        *((volatile uint32_t*)(0x42842530UL))
#define bFM_USB0_EP1C_EPEN                        *((volatile uint32_t*)(0x4284253CUL))
#define bFM4_USB0_EP1C_EPEN                       *((volatile uint32_t*)(0x4284253CUL))

#define bFM_USB0_EP1S_SPK                         *((volatile uint32_t*)(0x428429A4UL))
#define bFM4_USB0_EP1S_SPK                        *((volatile uint32_t*)(0x428429A4UL))
#define bFM_USB0_EP1S_DRQ                         *((volatile uint32_t*)(0x428429A8UL))
#define bFM4_USB0_EP1S_DRQ                        *((volatile uint32_t*)(0x428429A8UL))
#define bFM_USB0_EP1S_BUSY                        *((volatile uint32_t*)(0x428429ACUL))
#define bFM4_USB0_EP1S_BUSY                       *((volatile uint32_t*)(0x428429ACUL))
#define bFM_USB0_EP1S_SPKIE                       *((volatile uint32_t*)(0x428429B4UL))
#define bFM4_USB0_EP1S_SPKIE                      *((volatile uint32_t*)(0x428429B4UL))
#define bFM_USB0_EP1S_DRQIE                       *((volatile uint32_t*)(0x428429B8UL))
#define bFM4_USB0_EP1S_DRQIE                      *((volatile uint32_t*)(0x428429B8UL))
#define bFM_USB0_EP1S_BFINI                       *((volatile uint32_t*)(0x428429BCUL))
#define bFM4_USB0_EP1S_BFINI                      *((volatile uint32_t*)(0x428429BCUL))

#define bFM_USB0_EP2C_STAL                        *((volatile uint32_t*)(0x428425A4UL))
#define bFM4_USB0_EP2C_STAL                       *((volatile uint32_t*)(0x428425A4UL))
#define bFM_USB0_EP2C_NULE                        *((volatile uint32_t*)(0x428425A8UL))
#define bFM4_USB0_EP2C_NULE                       *((volatile uint32_t*)(0x428425A8UL))
#define bFM_USB0_EP2C_DMAE                        *((volatile uint32_t*)(0x428425ACUL))
#define bFM4_USB0_EP2C_DMAE                       *((volatile uint32_t*)(0x428425ACUL))
#define bFM_USB0_EP2C_DIR                         *((volatile uint32_t*)(0x428425B0UL))
#define bFM4_USB0_EP2C_DIR                        *((volatile uint32_t*)(0x428425B0UL))
#define bFM_USB0_EP2C_EPEN                        *((volatile uint32_t*)(0x428425BCUL))
#define bFM4_USB0_EP2C_EPEN                       *((volatile uint32_t*)(0x428425BCUL))

#define bFM_USB0_EP2S_SPK                         *((volatile uint32_t*)(0x42842A24UL))
#define bFM4_USB0_EP2S_SPK                        *((volatile uint32_t*)(0x42842A24UL))
#define bFM_USB0_EP2S_DRQ                         *((volatile uint32_t*)(0x42842A28UL))
#define bFM4_USB0_EP2S_DRQ                        *((volatile uint32_t*)(0x42842A28UL))
#define bFM_USB0_EP2S_BUSY                        *((volatile uint32_t*)(0x42842A2CUL))
#define bFM4_USB0_EP2S_BUSY                       *((volatile uint32_t*)(0x42842A2CUL))
#define bFM_USB0_EP2S_SPKIE                       *((volatile uint32_t*)(0x42842A34UL))
#define bFM4_USB0_EP2S_SPKIE                      *((volatile uint32_t*)(0x42842A34UL))
#define bFM_USB0_EP2S_DRQIE                       *((volatile uint32_t*)(0x42842A38UL))
#define bFM4_USB0_EP2S_DRQIE                      *((volatile uint32_t*)(0x42842A38UL))
#define bFM_USB0_EP2S_BFINI                       *((volatile uint32_t*)(0x42842A3CUL))
#define bFM4_USB0_EP2S_BFINI                      *((volatile uint32_t*)(0x42842A3CUL))

#define bFM_USB0_EP3C_STAL                        *((volatile uint32_t*)(0x42842624UL))
#define bFM4_USB0_EP3C_STAL                       *((volatile uint32_t*)(0x42842624UL))
#define bFM_USB0_EP3C_NULE                        *((volatile uint32_t*)(0x42842628UL))
#define bFM4_USB0_EP3C_NULE                       *((volatile uint32_t*)(0x42842628UL))
#define bFM_USB0_EP3C_DMAE                        *((volatile uint32_t*)(0x4284262CUL))
#define bFM4_USB0_EP3C_DMAE                       *((volatile uint32_t*)(0x4284262CUL))
#define bFM_USB0_EP3C_DIR                         *((volatile uint32_t*)(0x42842630UL))
#define bFM4_USB0_EP3C_DIR                        *((volatile uint32_t*)(0x42842630UL))
#define bFM_USB0_EP3C_EPEN                        *((volatile uint32_t*)(0x4284263CUL))
#define bFM4_USB0_EP3C_EPEN                       *((volatile uint32_t*)(0x4284263CUL))

#define bFM_USB0_EP3S_SPK                         *((volatile uint32_t*)(0x42842AA4UL))
#define bFM4_USB0_EP3S_SPK                        *((volatile uint32_t*)(0x42842AA4UL))
#define bFM_USB0_EP3S_DRQ                         *((volatile uint32_t*)(0x42842AA8UL))
#define bFM4_USB0_EP3S_DRQ                        *((volatile uint32_t*)(0x42842AA8UL))
#define bFM_USB0_EP3S_BUSY                        *((volatile uint32_t*)(0x42842AACUL))
#define bFM4_USB0_EP3S_BUSY                       *((volatile uint32_t*)(0x42842AACUL))
#define bFM_USB0_EP3S_SPKIE                       *((volatile uint32_t*)(0x42842AB4UL))
#define bFM4_USB0_EP3S_SPKIE                      *((volatile uint32_t*)(0x42842AB4UL))
#define bFM_USB0_EP3S_DRQIE                       *((volatile uint32_t*)(0x42842AB8UL))
#define bFM4_USB0_EP3S_DRQIE                      *((volatile uint32_t*)(0x42842AB8UL))
#define bFM_USB0_EP3S_BFINI                       *((volatile uint32_t*)(0x42842ABCUL))
#define bFM4_USB0_EP3S_BFINI                      *((volatile uint32_t*)(0x42842ABCUL))

#define bFM_USB0_EP4C_STAL                        *((volatile uint32_t*)(0x428426A4UL))
#define bFM4_USB0_EP4C_STAL                       *((volatile uint32_t*)(0x428426A4UL))
#define bFM_USB0_EP4C_NULE                        *((volatile uint32_t*)(0x428426A8UL))
#define bFM4_USB0_EP4C_NULE                       *((volatile uint32_t*)(0x428426A8UL))
#define bFM_USB0_EP4C_DMAE                        *((volatile uint32_t*)(0x428426ACUL))
#define bFM4_USB0_EP4C_DMAE                       *((volatile uint32_t*)(0x428426ACUL))
#define bFM_USB0_EP4C_DIR                         *((volatile uint32_t*)(0x428426B0UL))
#define bFM4_USB0_EP4C_DIR                        *((volatile uint32_t*)(0x428426B0UL))
#define bFM_USB0_EP4C_EPEN                        *((volatile uint32_t*)(0x428426BCUL))
#define bFM4_USB0_EP4C_EPEN                       *((volatile uint32_t*)(0x428426BCUL))

#define bFM_USB0_EP4S_SPK                         *((volatile uint32_t*)(0x42842B24UL))
#define bFM4_USB0_EP4S_SPK                        *((volatile uint32_t*)(0x42842B24UL))
#define bFM_USB0_EP4S_DRQ                         *((volatile uint32_t*)(0x42842B28UL))
#define bFM4_USB0_EP4S_DRQ                        *((volatile uint32_t*)(0x42842B28UL))
#define bFM_USB0_EP4S_BUSY                        *((volatile uint32_t*)(0x42842B2CUL))
#define bFM4_USB0_EP4S_BUSY                       *((volatile uint32_t*)(0x42842B2CUL))
#define bFM_USB0_EP4S_SPKIE                       *((volatile uint32_t*)(0x42842B34UL))
#define bFM4_USB0_EP4S_SPKIE                      *((volatile uint32_t*)(0x42842B34UL))
#define bFM_USB0_EP4S_DRQIE                       *((volatile uint32_t*)(0x42842B38UL))
#define bFM4_USB0_EP4S_DRQIE                      *((volatile uint32_t*)(0x42842B38UL))
#define bFM_USB0_EP4S_BFINI                       *((volatile uint32_t*)(0x42842B3CUL))
#define bFM4_USB0_EP4S_BFINI                      *((volatile uint32_t*)(0x42842B3CUL))

