neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_USB0_HSTATE_CSTAT                     *((volatile uint32_t*)(0x42842100UL))
#define bFM4_USB0_HSTATE_CSTAT                    *((volatile uint32_t*)(0x42842100UL))
#define bFM_USB0_HSTATE_TMODE                     *((volatile uint32_t*)(0x42842104UL))
#define bFM4_USB0_HSTATE_TMODE                    *((volatile uint32_t*)(0x42842104UL))
#define bFM_USB0_HSTATE_SUSP                      *((volatile uint32_t*)(0x42842108UL))
#define bFM4_USB0_HSTATE_SUSP                     *((volatile uint32_t*)(0x42842108UL))
#define bFM_USB0_HSTATE_SOFBUSY                   *((volatile uint32_t*)(0x4284210CUL))
#define bFM4_USB0_HSTATE_SOFBUSY                  *((volatile uint32_t*)(0x4284210CUL))
#define bFM_USB0_HSTATE_CLKSEL                    *((volatile uint32_t*)(0x42842110UL))
#define bFM4_USB0_HSTATE_CLKSEL                   *((volatile uint32_t*)(0x42842110UL))
#define bFM_USB0_HSTATE_ALIVE                     *((volatile uint32_t*)(0x42842114UL))
#define bFM4_USB0_HSTATE_ALIVE                    *((volatile uint32_t*)(0x42842114UL))

#define bFM_USB0_HTOKEN_TGGL                      *((volatile uint32_t*)(0x4284239CUL))
#define bFM4_USB0_HTOKEN_TGGL                     *((volatile uint32_t*)(0x4284239CUL))

#define bFM_USB0_UDCC_PWC                         *((volatile uint32_t*)(0x42842400UL))
#define bFM4_USB0_UDCC_PWC                        *((volatile uint32_t*)(0x42842400UL))
#define bFM_USB0_UDCC_RFBK                        *((volatile uint32_t*)(0x42842404UL))
#define bFM4_USB0_UDCC_RFBK                       *((volatile uint32_t*)(0x42842404UL))
#define bFM_USB0_UDCC_STALCLREN                   *((volatile uint32_t*)(0x4284240CUL))
#define bFM4_USB0_UDCC_STALCLREN                  *((volatile uint32_t*)(0x4284240CUL))
#define bFM_USB0_UDCC_USTP                        *((volatile uint32_t*)(0x42842410UL))
#define bFM4_USB0_UDCC_USTP                       *((volatile uint32_t*)(0x42842410UL))
#define bFM_USB0_UDCC_HCONX                       *((volatile uint32_t*)(0x42842414UL))
#define bFM4_USB0_UDCC_HCONX                      *((volatile uint32_t*)(0x42842414UL))
#define bFM_USB0_UDCC_RESUM                       *((volatile uint32_t*)(0x42842418UL))
#define bFM4_USB0_UDCC_RESUM                      *((volatile uint32_t*)(0x42842418UL))
#define bFM_USB0_UDCC_RST                         *((volatile uint32_t*)(0x4284241CUL))
#define bFM4_USB0_UDCC_RST                        *((volatile uint32_t*)(0x4284241CUL))

#define bFM_USB0_UDCIE_CONFIE                     *((volatile uint32_t*)(0x42842820UL))
#define bFM4_USB0_UDCIE_CONFIE                    *((volatile uint32_t*)(0x42842820UL))
#define bFM_USB0_UDCIE_CONFN                      *((volatile uint32_t*)(0x42842824UL))
#define bFM4_USB0_UDCIE_CONFN                     *((volatile uint32_t*)(0x42842824UL))
#define bFM_USB0_UDCIE_WKUPIE                     *((volatile uint32_t*)(0x42842828UL))
#define bFM4_USB0_UDCIE_WKUPIE                    *((volatile uint32_t*)(0x42842828UL))
#define bFM_USB0_UDCIE_BRSTIE                     *((volatile uint32_t*)(0x4284282CUL))
#define bFM4_USB0_UDCIE_BRSTIE                    *((volatile uint32_t*)(0x4284282CUL))
#define bFM_USB0_UDCIE_SOFIE                      *((volatile uint32_t*)(0x42842830UL))
#define bFM4_USB0_UDCIE_SOFIE                     *((volatile uint32_t*)(0x42842830UL))
#define bFM_USB0_UDCIE_SUSPIE                     *((volatile uint32_t*)(0x42842834UL))
#define bFM4_USB0_UDCIE_SUSPIE                    *((volatile uint32_t*)(0x42842834UL))

#define bFM_USB0_UDCS_CONF                        *((volatile uint32_t*)(0x42842800UL))
#define bFM4_USB0_UDCS_CONF                       *((volatile uint32_t*)(0x42842800UL))
#define bFM_USB0_UDCS_SETP                        *((volatile uint32_t*)(0x42842804UL))
#define bFM4_USB0_UDCS_SETP                       *((volatile uint32_t*)(0x42842804UL))
#define bFM_USB0_UDCS_WKUP                        *((volatile uint32_t*)(0x42842808UL))
#define bFM4_USB0_UDCS_WKUP                       *((volatile uint32_t*)(0x42842808UL))
#define bFM_USB0_UDCS_BRST                        *((volatile uint32_t*)(0x4284280CUL))
#define bFM4_USB0_UDCS_BRST                       *((volatile uint32_t*)(0x4284280CUL))
#define bFM_USB0_UDCS_SOF                         *((volatile uint32_t*)(0x42842810UL))
#define bFM4_USB0_UDCS_SOF                        *((volatile uint32_t*)(0x42842810UL))
#define bFM_USB0_UDCS_SUSP                        *((volatile uint32_t*)(0x42842814UL))
#define bFM4_USB0_UDCS_SUSP                       *((volatile uint32_t*)(0x42842814UL))


/******************************************************************************
 ** USB Registers USB1
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_USB1_EP0C_STAL                        *((volatile uint32_t*)(0x42A424A4UL))
#define bFM4_USB1_EP0C_STAL                       *((volatile uint32_t*)(0x42A424A4UL))

#define bFM_USB1_EP0IS_DRQI                       *((volatile uint32_t*)(0x42A428A8UL))
#define bFM4_USB1_EP0IS_DRQI                      *((volatile uint32_t*)(0x42A428A8UL))
#define bFM_USB1_EP0IS_DRQIIE                     *((volatile uint32_t*)(0x42A428B8UL))
#define bFM4_USB1_EP0IS_DRQIIE                    *((volatile uint32_t*)(0x42A428B8UL))
#define bFM_USB1_EP0IS_BFINI                      *((volatile uint32_t*)(0x42A428BCUL))
#define bFM4_USB1_EP0IS_BFINI                     *((volatile uint32_t*)(0x42A428BCUL))

#define bFM_USB1_EP0OS_SPK                        *((volatile uint32_t*)(0x42A42924UL))
#define bFM4_USB1_EP0OS_SPK                       *((volatile uint32_t*)(0x42A42924UL))
#define bFM_USB1_EP0OS_DRQO                       *((volatile uint32_t*)(0x42A42928UL))
#define bFM4_USB1_EP0OS_DRQO                      *((volatile uint32_t*)(0x42A42928UL))
#define bFM_USB1_EP0OS_SPKIE                      *((volatile uint32_t*)(0x42A42934UL))
#define bFM4_USB1_EP0OS_SPKIE                     *((volatile uint32_t*)(0x42A42934UL))
#define bFM_USB1_EP0OS_DRQOIE                     *((volatile uint32_t*)(0x42A42938UL))
#define bFM4_USB1_EP0OS_DRQOIE                    *((volatile uint32_t*)(0x42A42938UL))
#define bFM_USB1_EP0OS_BFINI                      *((volatile uint32_t*)(0x42A4293CUL))
#define bFM4_USB1_EP0OS_BFINI                     *((volatile uint32_t*)(0x42A4293CUL))

#define bFM_USB1_EP1C_STAL                        *((volatile uint32_t*)(0x42A42524UL))
#define bFM4_USB1_EP1C_STAL                       *((volatile uint32_t*)(0x42A42524UL))
#define bFM_USB1_EP1C_NULE                        *((volatile uint32_t*)(0x42A42528UL))
#define bFM4_USB1_EP1C_NULE                       *((volatile uint32_t*)(0x42A42528UL))
#define bFM_USB1_EP1C_DMAE                        *((volatile uint32_t*)(0x42A4252CUL))
#define bFM4_USB1_EP1C_DMAE                       *((volatile uint32_t*)(0x42A4252CUL))
#define bFM_USB1_EP1C_DIR                         *((volatile uint32_t*)(0x42A42530UL))
#define bFM4_USB1_EP1C_DIR                        *((volatile uint32_t*)(0x42A42530UL))
#define bFM_USB1_EP1C_EPEN                        *((volatile uint32_t*)(0x42A4253CUL))
#define bFM4_USB1_EP1C_EPEN                       *((volatile uint32_t*)(0x42A4253CUL))

