neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_USB1_EP1S_SPK                         *((volatile uint32_t*)(0x42A429A4UL))
#define bFM4_USB1_EP1S_SPK                        *((volatile uint32_t*)(0x42A429A4UL))
#define bFM_USB1_EP1S_DRQ                         *((volatile uint32_t*)(0x42A429A8UL))
#define bFM4_USB1_EP1S_DRQ                        *((volatile uint32_t*)(0x42A429A8UL))
#define bFM_USB1_EP1S_BUSY                        *((volatile uint32_t*)(0x42A429ACUL))
#define bFM4_USB1_EP1S_BUSY                       *((volatile uint32_t*)(0x42A429ACUL))
#define bFM_USB1_EP1S_SPKIE                       *((volatile uint32_t*)(0x42A429B4UL))
#define bFM4_USB1_EP1S_SPKIE                      *((volatile uint32_t*)(0x42A429B4UL))
#define bFM_USB1_EP1S_DRQIE                       *((volatile uint32_t*)(0x42A429B8UL))
#define bFM4_USB1_EP1S_DRQIE                      *((volatile uint32_t*)(0x42A429B8UL))
#define bFM_USB1_EP1S_BFINI                       *((volatile uint32_t*)(0x42A429BCUL))
#define bFM4_USB1_EP1S_BFINI                      *((volatile uint32_t*)(0x42A429BCUL))

#define bFM_USB1_EP2C_STAL                        *((volatile uint32_t*)(0x42A425A4UL))
#define bFM4_USB1_EP2C_STAL                       *((volatile uint32_t*)(0x42A425A4UL))
#define bFM_USB1_EP2C_NULE                        *((volatile uint32_t*)(0x42A425A8UL))
#define bFM4_USB1_EP2C_NULE                       *((volatile uint32_t*)(0x42A425A8UL))
#define bFM_USB1_EP2C_DMAE                        *((volatile uint32_t*)(0x42A425ACUL))
#define bFM4_USB1_EP2C_DMAE                       *((volatile uint32_t*)(0x42A425ACUL))
#define bFM_USB1_EP2C_DIR                         *((volatile uint32_t*)(0x42A425B0UL))
#define bFM4_USB1_EP2C_DIR                        *((volatile uint32_t*)(0x42A425B0UL))
#define bFM_USB1_EP2C_EPEN                        *((volatile uint32_t*)(0x42A425BCUL))
#define bFM4_USB1_EP2C_EPEN                       *((volatile uint32_t*)(0x42A425BCUL))

#define bFM_USB1_EP2S_SPK                         *((volatile uint32_t*)(0x42A42A24UL))
#define bFM4_USB1_EP2S_SPK                        *((volatile uint32_t*)(0x42A42A24UL))
#define bFM_USB1_EP2S_DRQ                         *((volatile uint32_t*)(0x42A42A28UL))
#define bFM4_USB1_EP2S_DRQ                        *((volatile uint32_t*)(0x42A42A28UL))
#define bFM_USB1_EP2S_BUSY                        *((volatile uint32_t*)(0x42A42A2CUL))
#define bFM4_USB1_EP2S_BUSY                       *((volatile uint32_t*)(0x42A42A2CUL))
#define bFM_USB1_EP2S_SPKIE                       *((volatile uint32_t*)(0x42A42A34UL))
#define bFM4_USB1_EP2S_SPKIE                      *((volatile uint32_t*)(0x42A42A34UL))
#define bFM_USB1_EP2S_DRQIE                       *((volatile uint32_t*)(0x42A42A38UL))
#define bFM4_USB1_EP2S_DRQIE                      *((volatile uint32_t*)(0x42A42A38UL))
#define bFM_USB1_EP2S_BFINI                       *((volatile uint32_t*)(0x42A42A3CUL))
#define bFM4_USB1_EP2S_BFINI                      *((volatile uint32_t*)(0x42A42A3CUL))

#define bFM_USB1_EP3C_STAL                        *((volatile uint32_t*)(0x42A42624UL))
#define bFM4_USB1_EP3C_STAL                       *((volatile uint32_t*)(0x42A42624UL))
#define bFM_USB1_EP3C_NULE                        *((volatile uint32_t*)(0x42A42628UL))
#define bFM4_USB1_EP3C_NULE                       *((volatile uint32_t*)(0x42A42628UL))
#define bFM_USB1_EP3C_DMAE                        *((volatile uint32_t*)(0x42A4262CUL))
#define bFM4_USB1_EP3C_DMAE                       *((volatile uint32_t*)(0x42A4262CUL))
#define bFM_USB1_EP3C_DIR                         *((volatile uint32_t*)(0x42A42630UL))
#define bFM4_USB1_EP3C_DIR                        *((volatile uint32_t*)(0x42A42630UL))
#define bFM_USB1_EP3C_EPEN                        *((volatile uint32_t*)(0x42A4263CUL))
#define bFM4_USB1_EP3C_EPEN                       *((volatile uint32_t*)(0x42A4263CUL))

#define bFM_USB1_EP3S_SPK                         *((volatile uint32_t*)(0x42A42AA4UL))
#define bFM4_USB1_EP3S_SPK                        *((volatile uint32_t*)(0x42A42AA4UL))
#define bFM_USB1_EP3S_DRQ                         *((volatile uint32_t*)(0x42A42AA8UL))
#define bFM4_USB1_EP3S_DRQ                        *((volatile uint32_t*)(0x42A42AA8UL))
#define bFM_USB1_EP3S_BUSY                        *((volatile uint32_t*)(0x42A42AACUL))
#define bFM4_USB1_EP3S_BUSY                       *((volatile uint32_t*)(0x42A42AACUL))
#define bFM_USB1_EP3S_SPKIE                       *((volatile uint32_t*)(0x42A42AB4UL))
#define bFM4_USB1_EP3S_SPKIE                      *((volatile uint32_t*)(0x42A42AB4UL))
#define bFM_USB1_EP3S_DRQIE                       *((volatile uint32_t*)(0x42A42AB8UL))
#define bFM4_USB1_EP3S_DRQIE                      *((volatile uint32_t*)(0x42A42AB8UL))
#define bFM_USB1_EP3S_BFINI                       *((volatile uint32_t*)(0x42A42ABCUL))
#define bFM4_USB1_EP3S_BFINI                      *((volatile uint32_t*)(0x42A42ABCUL))

#define bFM_USB1_EP4C_STAL                        *((volatile uint32_t*)(0x42A426A4UL))
#define bFM4_USB1_EP4C_STAL                       *((volatile uint32_t*)(0x42A426A4UL))
#define bFM_USB1_EP4C_NULE                        *((volatile uint32_t*)(0x42A426A8UL))
#define bFM4_USB1_EP4C_NULE                       *((volatile uint32_t*)(0x42A426A8UL))
#define bFM_USB1_EP4C_DMAE                        *((volatile uint32_t*)(0x42A426ACUL))
#define bFM4_USB1_EP4C_DMAE                       *((volatile uint32_t*)(0x42A426ACUL))
#define bFM_USB1_EP4C_DIR                         *((volatile uint32_t*)(0x42A426B0UL))
#define bFM4_USB1_EP4C_DIR                        *((volatile uint32_t*)(0x42A426B0UL))
#define bFM_USB1_EP4C_EPEN                        *((volatile uint32_t*)(0x42A426BCUL))
#define bFM4_USB1_EP4C_EPEN                       *((volatile uint32_t*)(0x42A426BCUL))

#define bFM_USB1_EP4S_SPK                         *((volatile uint32_t*)(0x42A42B24UL))
#define bFM4_USB1_EP4S_SPK                        *((volatile uint32_t*)(0x42A42B24UL))
#define bFM_USB1_EP4S_DRQ                         *((volatile uint32_t*)(0x42A42B28UL))
#define bFM4_USB1_EP4S_DRQ                        *((volatile uint32_t*)(0x42A42B28UL))
#define bFM_USB1_EP4S_BUSY                        *((volatile uint32_t*)(0x42A42B2CUL))
#define bFM4_USB1_EP4S_BUSY                       *((volatile uint32_t*)(0x42A42B2CUL))
#define bFM_USB1_EP4S_SPKIE                       *((volatile uint32_t*)(0x42A42B34UL))
#define bFM4_USB1_EP4S_SPKIE                      *((volatile uint32_t*)(0x42A42B34UL))
#define bFM_USB1_EP4S_DRQIE                       *((volatile uint32_t*)(0x42A42B38UL))
#define bFM4_USB1_EP4S_DRQIE                      *((volatile uint32_t*)(0x42A42B38UL))
#define bFM_USB1_EP4S_BFINI                       *((volatile uint32_t*)(0x42A42B3CUL))
#define bFM4_USB1_EP4S_BFINI                      *((volatile uint32_t*)(0x42A42B3CUL))

#define bFM_USB1_EP5C_STAL                        *((volatile uint32_t*)(0x42A42724UL))
#define bFM4_USB1_EP5C_STAL                       *((volatile uint32_t*)(0x42A42724UL))
#define bFM_USB1_EP5C_NULE                        *((volatile uint32_t*)(0x42A42728UL))
#define bFM4_USB1_EP5C_NULE                       *((volatile uint32_t*)(0x42A42728UL))
#define bFM_USB1_EP5C_DMAE                        *((volatile uint32_t*)(0x42A4272CUL))
#define bFM4_USB1_EP5C_DMAE                       *((volatile uint32_t*)(0x42A4272CUL))
#define bFM_USB1_EP5C_DIR                         *((volatile uint32_t*)(0x42A42730UL))
#define bFM4_USB1_EP5C_DIR                        *((volatile uint32_t*)(0x42A42730UL))
#define bFM_USB1_EP5C_EPEN                        *((volatile uint32_t*)(0x42A4273CUL))
#define bFM4_USB1_EP5C_EPEN                       *((volatile uint32_t*)(0x42A4273CUL))

