neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_USB1_EP5S_SPK                         *((volatile uint32_t*)(0x42A42BA4UL))
#define bFM4_USB1_EP5S_SPK                        *((volatile uint32_t*)(0x42A42BA4UL))
#define bFM_USB1_EP5S_DRQ                         *((volatile uint32_t*)(0x42A42BA8UL))
#define bFM4_USB1_EP5S_DRQ                        *((volatile uint32_t*)(0x42A42BA8UL))
#define bFM_USB1_EP5S_BUSY                        *((volatile uint32_t*)(0x42A42BACUL))
#define bFM4_USB1_EP5S_BUSY                       *((volatile uint32_t*)(0x42A42BACUL))
#define bFM_USB1_EP5S_SPKIE                       *((volatile uint32_t*)(0x42A42BB4UL))
#define bFM4_USB1_EP5S_SPKIE                      *((volatile uint32_t*)(0x42A42BB4UL))
#define bFM_USB1_EP5S_DRQIE                       *((volatile uint32_t*)(0x42A42BB8UL))
#define bFM4_USB1_EP5S_DRQIE                      *((volatile uint32_t*)(0x42A42BB8UL))
#define bFM_USB1_EP5S_BFINI                       *((volatile uint32_t*)(0x42A42BBCUL))
#define bFM4_USB1_EP5S_BFINI                      *((volatile uint32_t*)(0x42A42BBCUL))

#define bFM_USB1_HCNT_HOST                        *((volatile uint32_t*)(0x42A42000UL))
#define bFM4_USB1_HCNT_HOST                       *((volatile uint32_t*)(0x42A42000UL))
#define bFM_USB1_HCNT_URST                        *((volatile uint32_t*)(0x42A42004UL))
#define bFM4_USB1_HCNT_URST                       *((volatile uint32_t*)(0x42A42004UL))
#define bFM_USB1_HCNT_SOFIRE                      *((volatile uint32_t*)(0x42A42008UL))
#define bFM4_USB1_HCNT_SOFIRE                     *((volatile uint32_t*)(0x42A42008UL))
#define bFM_USB1_HCNT_DIRE                        *((volatile uint32_t*)(0x42A4200CUL))
#define bFM4_USB1_HCNT_DIRE                       *((volatile uint32_t*)(0x42A4200CUL))
#define bFM_USB1_HCNT_CNNIRE                      *((volatile uint32_t*)(0x42A42010UL))
#define bFM4_USB1_HCNT_CNNIRE                     *((volatile uint32_t*)(0x42A42010UL))
#define bFM_USB1_HCNT_CMPIRE                      *((volatile uint32_t*)(0x42A42014UL))
#define bFM4_USB1_HCNT_CMPIRE                     *((volatile uint32_t*)(0x42A42014UL))
#define bFM_USB1_HCNT_URIRE                       *((volatile uint32_t*)(0x42A42018UL))
#define bFM4_USB1_HCNT_URIRE                      *((volatile uint32_t*)(0x42A42018UL))
#define bFM_USB1_HCNT_RWKIRE                      *((volatile uint32_t*)(0x42A4201CUL))
#define bFM4_USB1_HCNT_RWKIRE                     *((volatile uint32_t*)(0x42A4201CUL))
#define bFM_USB1_HCNT_RETRY                       *((volatile uint32_t*)(0x42A42020UL))
#define bFM4_USB1_HCNT_RETRY                      *((volatile uint32_t*)(0x42A42020UL))
#define bFM_USB1_HCNT_CANCEL                      *((volatile uint32_t*)(0x42A42024UL))
#define bFM4_USB1_HCNT_CANCEL                     *((volatile uint32_t*)(0x42A42024UL))
#define bFM_USB1_HCNT_SOFSTEP                     *((volatile uint32_t*)(0x42A42028UL))
#define bFM4_USB1_HCNT_SOFSTEP                    *((volatile uint32_t*)(0x42A42028UL))

#define bFM_USB1_HERR_STUFF                       *((volatile uint32_t*)(0x42A420A8UL))
#define bFM4_USB1_HERR_STUFF                      *((volatile uint32_t*)(0x42A420A8UL))
#define bFM_USB1_HERR_TGERR                       *((volatile uint32_t*)(0x42A420ACUL))
#define bFM4_USB1_HERR_TGERR                      *((volatile uint32_t*)(0x42A420ACUL))
#define bFM_USB1_HERR_CRC                         *((volatile uint32_t*)(0x42A420B0UL))
#define bFM4_USB1_HERR_CRC                        *((volatile uint32_t*)(0x42A420B0UL))
#define bFM_USB1_HERR_TOUT                        *((volatile uint32_t*)(0x42A420B4UL))
#define bFM4_USB1_HERR_TOUT                       *((volatile uint32_t*)(0x42A420B4UL))
#define bFM_USB1_HERR_RERR                        *((volatile uint32_t*)(0x42A420B8UL))
#define bFM4_USB1_HERR_RERR                       *((volatile uint32_t*)(0x42A420B8UL))
#define bFM_USB1_HERR_LSTSOF                      *((volatile uint32_t*)(0x42A420BCUL))
#define bFM4_USB1_HERR_LSTSOF                     *((volatile uint32_t*)(0x42A420BCUL))

#define bFM_USB1_HIRQ_SOFIRQ                      *((volatile uint32_t*)(0x42A42080UL))
#define bFM4_USB1_HIRQ_SOFIRQ                     *((volatile uint32_t*)(0x42A42080UL))
#define bFM_USB1_HIRQ_DIRQ                        *((volatile uint32_t*)(0x42A42084UL))
#define bFM4_USB1_HIRQ_DIRQ                       *((volatile uint32_t*)(0x42A42084UL))
#define bFM_USB1_HIRQ_CNNIRQ                      *((volatile uint32_t*)(0x42A42088UL))
#define bFM4_USB1_HIRQ_CNNIRQ                     *((volatile uint32_t*)(0x42A42088UL))
#define bFM_USB1_HIRQ_CMPIRQ                      *((volatile uint32_t*)(0x42A4208CUL))
#define bFM4_USB1_HIRQ_CMPIRQ                     *((volatile uint32_t*)(0x42A4208CUL))
#define bFM_USB1_HIRQ_URIRQ                       *((volatile uint32_t*)(0x42A42090UL))
#define bFM4_USB1_HIRQ_URIRQ                      *((volatile uint32_t*)(0x42A42090UL))
#define bFM_USB1_HIRQ_RWKIRQ                      *((volatile uint32_t*)(0x42A42094UL))
#define bFM4_USB1_HIRQ_RWKIRQ                     *((volatile uint32_t*)(0x42A42094UL))
#define bFM_USB1_HIRQ_TCAN                        *((volatile uint32_t*)(0x42A4209CUL))
#define bFM4_USB1_HIRQ_TCAN                       *((volatile uint32_t*)(0x42A4209CUL))

#define bFM_USB1_HSTATE_CSTAT                     *((volatile uint32_t*)(0x42A42100UL))
#define bFM4_USB1_HSTATE_CSTAT                    *((volatile uint32_t*)(0x42A42100UL))
#define bFM_USB1_HSTATE_TMODE                     *((volatile uint32_t*)(0x42A42104UL))
#define bFM4_USB1_HSTATE_TMODE                    *((volatile uint32_t*)(0x42A42104UL))
#define bFM_USB1_HSTATE_SUSP                      *((volatile uint32_t*)(0x42A42108UL))
#define bFM4_USB1_HSTATE_SUSP                     *((volatile uint32_t*)(0x42A42108UL))
#define bFM_USB1_HSTATE_SOFBUSY                   *((volatile uint32_t*)(0x42A4210CUL))
#define bFM4_USB1_HSTATE_SOFBUSY                  *((volatile uint32_t*)(0x42A4210CUL))
#define bFM_USB1_HSTATE_CLKSEL                    *((volatile uint32_t*)(0x42A42110UL))
#define bFM4_USB1_HSTATE_CLKSEL                   *((volatile uint32_t*)(0x42A42110UL))
#define bFM_USB1_HSTATE_ALIVE                     *((volatile uint32_t*)(0x42A42114UL))
#define bFM4_USB1_HSTATE_ALIVE                    *((volatile uint32_t*)(0x42A42114UL))

