neohung/neo_sk-fm4-176l-s6e2cc-voi/common/s6e2ccxl.h
#define bFM_USB1_HTOKEN_TGGL                      *((volatile uint32_t*)(0x42A4239CUL))
#define bFM4_USB1_HTOKEN_TGGL                     *((volatile uint32_t*)(0x42A4239CUL))

#define bFM_USB1_UDCC_PWC                         *((volatile uint32_t*)(0x42A42400UL))
#define bFM4_USB1_UDCC_PWC                        *((volatile uint32_t*)(0x42A42400UL))
#define bFM_USB1_UDCC_RFBK                        *((volatile uint32_t*)(0x42A42404UL))
#define bFM4_USB1_UDCC_RFBK                       *((volatile uint32_t*)(0x42A42404UL))
#define bFM_USB1_UDCC_STALCLREN                   *((volatile uint32_t*)(0x42A4240CUL))
#define bFM4_USB1_UDCC_STALCLREN                  *((volatile uint32_t*)(0x42A4240CUL))
#define bFM_USB1_UDCC_USTP                        *((volatile uint32_t*)(0x42A42410UL))
#define bFM4_USB1_UDCC_USTP                       *((volatile uint32_t*)(0x42A42410UL))
#define bFM_USB1_UDCC_HCONX                       *((volatile uint32_t*)(0x42A42414UL))
#define bFM4_USB1_UDCC_HCONX                      *((volatile uint32_t*)(0x42A42414UL))
#define bFM_USB1_UDCC_RESUM                       *((volatile uint32_t*)(0x42A42418UL))
#define bFM4_USB1_UDCC_RESUM                      *((volatile uint32_t*)(0x42A42418UL))
#define bFM_USB1_UDCC_RST                         *((volatile uint32_t*)(0x42A4241CUL))
#define bFM4_USB1_UDCC_RST                        *((volatile uint32_t*)(0x42A4241CUL))

#define bFM_USB1_UDCIE_CONFIE                     *((volatile uint32_t*)(0x42A42820UL))
#define bFM4_USB1_UDCIE_CONFIE                    *((volatile uint32_t*)(0x42A42820UL))
#define bFM_USB1_UDCIE_CONFN                      *((volatile uint32_t*)(0x42A42824UL))
#define bFM4_USB1_UDCIE_CONFN                     *((volatile uint32_t*)(0x42A42824UL))
#define bFM_USB1_UDCIE_WKUPIE                     *((volatile uint32_t*)(0x42A42828UL))
#define bFM4_USB1_UDCIE_WKUPIE                    *((volatile uint32_t*)(0x42A42828UL))
#define bFM_USB1_UDCIE_BRSTIE                     *((volatile uint32_t*)(0x42A4282CUL))
#define bFM4_USB1_UDCIE_BRSTIE                    *((volatile uint32_t*)(0x42A4282CUL))
#define bFM_USB1_UDCIE_SOFIE                      *((volatile uint32_t*)(0x42A42830UL))
#define bFM4_USB1_UDCIE_SOFIE                     *((volatile uint32_t*)(0x42A42830UL))
#define bFM_USB1_UDCIE_SUSPIE                     *((volatile uint32_t*)(0x42A42834UL))
#define bFM4_USB1_UDCIE_SUSPIE                    *((volatile uint32_t*)(0x42A42834UL))

#define bFM_USB1_UDCS_CONF                        *((volatile uint32_t*)(0x42A42800UL))
#define bFM4_USB1_UDCS_CONF                       *((volatile uint32_t*)(0x42A42800UL))
#define bFM_USB1_UDCS_SETP                        *((volatile uint32_t*)(0x42A42804UL))
#define bFM4_USB1_UDCS_SETP                       *((volatile uint32_t*)(0x42A42804UL))
#define bFM_USB1_UDCS_WKUP                        *((volatile uint32_t*)(0x42A42808UL))
#define bFM4_USB1_UDCS_WKUP                       *((volatile uint32_t*)(0x42A42808UL))
#define bFM_USB1_UDCS_BRST                        *((volatile uint32_t*)(0x42A4280CUL))
#define bFM4_USB1_UDCS_BRST                       *((volatile uint32_t*)(0x42A4280CUL))
#define bFM_USB1_UDCS_SOF                         *((volatile uint32_t*)(0x42A42810UL))
#define bFM4_USB1_UDCS_SOF                        *((volatile uint32_t*)(0x42A42810UL))
#define bFM_USB1_UDCS_SUSP                        *((volatile uint32_t*)(0x42A42814UL))
#define bFM4_USB1_UDCS_SUSP                       *((volatile uint32_t*)(0x42A42814UL))


/******************************************************************************
 ** USBETHERCLK Registers USBETHERCLK
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_USBETHERCLK_UCCR_UCEN0                *((volatile uint32_t*)(0x426C0000UL))
#define bFM4_USBETHERCLK_UCCR_UCEN0               *((volatile uint32_t*)(0x426C0000UL))
#define bFM_USBETHERCLK_UCCR_UCEN1                *((volatile uint32_t*)(0x426C000CUL))
#define bFM4_USBETHERCLK_UCCR_UCEN1               *((volatile uint32_t*)(0x426C000CUL))
#define bFM_USBETHERCLK_UCCR_ECEN                 *((volatile uint32_t*)(0x426C0010UL))
#define bFM4_USBETHERCLK_UCCR_ECEN                *((volatile uint32_t*)(0x426C0010UL))

#define bFM_USBETHERCLK_UP_STR_UPRDY              *((volatile uint32_t*)(0x426C0280UL))
#define bFM4_USBETHERCLK_UP_STR_UPRDY             *((volatile uint32_t*)(0x426C0280UL))

#define bFM_USBETHERCLK_UPCR1_UPLLEN              *((volatile uint32_t*)(0x426C0080UL))
#define bFM4_USBETHERCLK_UPCR1_UPLLEN             *((volatile uint32_t*)(0x426C0080UL))
#define bFM_USBETHERCLK_UPCR1_UPINC               *((volatile uint32_t*)(0x426C0084UL))
#define bFM4_USBETHERCLK_UPCR1_UPINC              *((volatile uint32_t*)(0x426C0084UL))

#define bFM_USBETHERCLK_UPCR7_EPLLEN              *((volatile uint32_t*)(0x426C0580UL))
#define bFM4_USBETHERCLK_UPCR7_EPLLEN             *((volatile uint32_t*)(0x426C0580UL))

#define bFM_USBETHERCLK_UPINT_CLR_UPCSC           *((volatile uint32_t*)(0x426C0380UL))
#define bFM4_USBETHERCLK_UPINT_CLR_UPCSC          *((volatile uint32_t*)(0x426C0380UL))

#define bFM_USBETHERCLK_UPINT_ENR_UPCSE           *((volatile uint32_t*)(0x426C0300UL))
#define bFM4_USBETHERCLK_UPINT_ENR_UPCSE          *((volatile uint32_t*)(0x426C0300UL))

#define bFM_USBETHERCLK_UPINT_STR_UPCSI           *((volatile uint32_t*)(0x426C0400UL))
#define bFM4_USBETHERCLK_UPINT_STR_UPCSI          *((volatile uint32_t*)(0x426C0400UL))

#define bFM_USBETHERCLK_USBEN0_USBEN0             *((volatile uint32_t*)(0x426C0600UL))
#define bFM4_USBETHERCLK_USBEN0_USBEN0            *((volatile uint32_t*)(0x426C0600UL))

#define bFM_USBETHERCLK_USBEN1_USBEN1             *((volatile uint32_t*)(0x426C0680UL))
#define bFM4_USBETHERCLK_USBEN1_USBEN1            *((volatile uint32_t*)(0x426C0680UL))


/******************************************************************************
 ** WC Registers WC
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_WC_CLK_EN_CLK_EN                      *((volatile uint32_t*)(0x42740280UL))
#define bFM4_WC_CLK_EN_CLK_EN                     *((volatile uint32_t*)(0x42740280UL))
#define bFM_WC_CLK_EN_CLK_EN_R                    *((volatile uint32_t*)(0x42740284UL))
#define bFM4_WC_CLK_EN_CLK_EN_R                   *((volatile uint32_t*)(0x42740284UL))

#define bFM_WC_WCCR_WCIF                          *((volatile uint32_t*)(0x42740040UL))
#define bFM4_WC_WCCR_WCIF                         *((volatile uint32_t*)(0x42740040UL))
#define bFM_WC_WCCR_WCIE                          *((volatile uint32_t*)(0x42740044UL))
#define bFM4_WC_WCCR_WCIE                         *((volatile uint32_t*)(0x42740044UL))
#define bFM_WC_WCCR_WCOP                          *((volatile uint32_t*)(0x42740058UL))
#define bFM4_WC_WCCR_WCOP                         *((volatile uint32_t*)(0x42740058UL))
#define bFM_WC_WCCR_WCEN                          *((volatile uint32_t*)(0x4274005CUL))
#define bFM4_WC_WCCR_WCEN                         *((volatile uint32_t*)(0x4274005CUL))


#if defined __cplusplus
}
#endif

#endif /* _S6E2CCXL_H_ */
